#pragma once

#include "SDK.hpp"

class CEntityInstance /* "entity2" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlSymbolLarge m_iszPrivateVScripts; // 0x8 - 0x10
   CEntityIdentity* m_pEntity; // 0x10 - 0x18
   unsigned char pad_18[0x10]; // 0x18 - 0x28
   CScriptComponent* m_CScriptComponent; // 0x28 - 0x30
}; // size - 0x30


class CBaseEntity /* "server" */ : public CEntityInstance /* "server" */
{
public:
   CBodyComponent* m_CBodyComponent; // 0x30 - 0x38
   CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x38 - 0x1E8
   unsigned char pad_1E8[0x40]; // 0x1E8 - 0x228
   CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x228 - 0x240
   int32_t m_iCurrentThinkContext; // 0x240 - 0x244
   GameTick_t m_nLastThinkTick; // 0x244 - 0x248
   unsigned char pad_248[0x8]; // 0x248 - 0x250
   CBitVec< 64 > m_isSteadyState; // 0x250 - 0x258
   float m_lastNetworkChange; // 0x258 - 0x25C
   unsigned char pad_25C[0xC]; // 0x25C - 0x268
   CUtlVector< ResponseContext_t > m_ResponseContexts; // 0x268 - 0x280
   CUtlSymbolLarge m_iszResponseContext; // 0x280 - 0x288
   unsigned char pad_288[0x20]; // 0x288 - 0x2A8
   int32_t m_iHealth; // 0x2A8 - 0x2AC
   int32_t m_iMaxHealth; // 0x2AC - 0x2B0
   uint8_t m_lifeState; // 0x2B0 - 0x2B1
   unsigned char pad_2B1[0x3]; // 0x2B1 - 0x2B4
   float m_flDamageAccumulator; // 0x2B4 - 0x2B8
   bool m_bTakesDamage; // 0x2B8 - 0x2B9
   unsigned char pad_2B9[0x3]; // 0x2B9 - 0x2BC
   TakeDamageFlags_t m_nTakeDamageFlags; // 0x2BC - 0x2C0
   unsigned char pad_2C0[0x1]; // 0x2C0 - 0x2C1
   MoveCollide_t m_MoveCollide; // 0x2C1 - 0x2C2
   MoveType_t m_MoveType; // 0x2C2 - 0x2C3
   uint8_t m_nWaterTouch; // 0x2C3 - 0x2C4
   uint8_t m_nSlimeTouch; // 0x2C4 - 0x2C5
   bool m_bRestoreInHierarchy; // 0x2C5 - 0x2C6
   unsigned char pad_2C6[0x2]; // 0x2C6 - 0x2C8
   CUtlSymbolLarge m_target; // 0x2C8 - 0x2D0
   float m_flMoveDoneTime; // 0x2D0 - 0x2D4
   CHandle< CBaseFilter > m_hDamageFilter; // 0x2D4 - 0x2D8
   CUtlSymbolLarge m_iszDamageFilterName; // 0x2D8 - 0x2E0
   CUtlStringToken m_nSubclassID; // 0x2E0 - 0x2E4
   unsigned char pad_2E4[0xC]; // 0x2E4 - 0x2F0
   float m_flAnimTime; // 0x2F0 - 0x2F4
   float m_flSimulationTime; // 0x2F4 - 0x2F8
   GameTime_t m_flCreateTime; // 0x2F8 - 0x2FC
   bool m_bClientSideRagdoll; // 0x2FC - 0x2FD
   uint8_t m_ubInterpolationFrame; // 0x2FD - 0x2FE
   unsigned char pad_2FE[0x2]; // 0x2FE - 0x300
   Vector m_vPrevVPhysicsUpdatePos; // 0x300 - 0x30C
   uint8_t m_iTeamNum; // 0x30C - 0x30D
   unsigned char pad_30D[0x3]; // 0x30D - 0x310
   CUtlSymbolLarge m_iGlobalname; // 0x310 - 0x318
   int32_t m_iSentToClients; // 0x318 - 0x31C
   float m_flSpeed; // 0x31C - 0x320
   CUtlString m_sUniqueHammerID; // 0x320 - 0x328
   uint32_t m_spawnflags; // 0x328 - 0x32C
   GameTick_t m_nNextThinkTick; // 0x32C - 0x330
   int32_t m_nSimulationTick; // 0x330 - 0x334
   unsigned char pad_334[0x4]; // 0x334 - 0x338
   CEntityIOOutput m_OnKilled; // 0x338 - 0x360
   uint32_t m_fFlags; // 0x360 - 0x364
   Vector m_vecAbsVelocity; // 0x364 - 0x370
   CNetworkVelocityVector m_vecVelocity; // 0x370 - 0x398
   unsigned char pad_398[0x8]; // 0x398 - 0x3A0
   Vector m_vecBaseVelocity; // 0x3A0 - 0x3AC
   int32_t m_nPushEnumCount; // 0x3AC - 0x3B0
   CCollisionProperty* m_pCollision; // 0x3B0 - 0x3B8
   CHandle< CBaseEntity > m_hEffectEntity; // 0x3B8 - 0x3BC
   CHandle< CBaseEntity > m_hOwnerEntity; // 0x3BC - 0x3C0
   uint32_t m_fEffects; // 0x3C0 - 0x3C4
   CHandle< CBaseEntity > m_hGroundEntity; // 0x3C4 - 0x3C8
   float m_flFriction; // 0x3C8 - 0x3CC
   float m_flElasticity; // 0x3CC - 0x3D0
   float m_flGravityScale; // 0x3D0 - 0x3D4
   float m_flTimeScale; // 0x3D4 - 0x3D8
   float m_flWaterLevel; // 0x3D8 - 0x3DC
   bool m_bSimulatedEveryTick; // 0x3DC - 0x3DD
   bool m_bAnimatedEveryTick; // 0x3DD - 0x3DE
   bool m_bDisableLowViolence; // 0x3DE - 0x3DF
   uint8_t m_nWaterType; // 0x3DF - 0x3E0
   int32_t m_iEFlags; // 0x3E0 - 0x3E4
   unsigned char pad_3E4[0x4]; // 0x3E4 - 0x3E8
   CEntityIOOutput m_OnUser1; // 0x3E8 - 0x410
   CEntityIOOutput m_OnUser2; // 0x410 - 0x438
   CEntityIOOutput m_OnUser3; // 0x438 - 0x460
   CEntityIOOutput m_OnUser4; // 0x460 - 0x488
   int32_t m_iInitialTeamNum; // 0x488 - 0x48C
   GameTime_t m_flNavIgnoreUntilTime; // 0x48C - 0x490
   QAngle m_vecAngVelocity; // 0x490 - 0x49C
   bool m_bNetworkQuantizeOriginAndAngles; // 0x49C - 0x49D
   bool m_bLagCompensate; // 0x49D - 0x49E
   unsigned char pad_49E[0x2]; // 0x49E - 0x4A0
   float m_flOverriddenFriction; // 0x4A0 - 0x4A4
   CHandle< CBaseEntity > m_pBlocker; // 0x4A4 - 0x4A8
   float m_flLocalTime; // 0x4A8 - 0x4AC
   float m_flVPhysicsUpdateLocalTime; // 0x4AC - 0x4B0
}; // size - 0x4B0


class CEntityInstance /* "entity2" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlSymbolLarge m_iszPrivateVScripts; // 0x8 - 0x10
   CEntityIdentity* m_pEntity; // 0x10 - 0x18
   unsigned char pad_18[0x10]; // 0x18 - 0x28
   CScriptComponent* m_CScriptComponent; // 0x28 - 0x30
}; // size - 0x30


class C_BaseEntity /* "client" */ : public CEntityInstance /* "client" */
{
public:
   CBodyComponent* m_CBodyComponent; // 0x30 - 0x38
   CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x38 - 0x1E8
   unsigned char pad_1E8[0x120]; // 0x1E8 - 0x308
   GameTick_t m_nLastThinkTick; // 0x308 - 0x30C
   unsigned char pad_30C[0x4]; // 0x30C - 0x310
   CGameSceneNode* m_pGameSceneNode; // 0x310 - 0x318
   CRenderComponent* m_pRenderComponent; // 0x318 - 0x320
   CCollisionProperty* m_pCollision; // 0x320 - 0x328
   int32_t m_iMaxHealth; // 0x328 - 0x32C
   int32_t m_iHealth; // 0x32C - 0x330
   uint8_t m_lifeState; // 0x330 - 0x331
   bool m_bTakesDamage; // 0x331 - 0x332
   unsigned char pad_332[0x2]; // 0x332 - 0x334
   TakeDamageFlags_t m_nTakeDamageFlags; // 0x334 - 0x338
   uint8_t m_ubInterpolationFrame; // 0x338 - 0x339
   unsigned char pad_339[0x3]; // 0x339 - 0x33C
   CHandle< C_BaseEntity > m_hSceneObjectController; // 0x33C - 0x340
   int32_t m_nNoInterpolationTick; // 0x340 - 0x344
   int32_t m_nVisibilityNoInterpolationTick; // 0x344 - 0x348
   float m_flProxyRandomValue; // 0x348 - 0x34C
   int32_t m_iEFlags; // 0x34C - 0x350
   uint8_t m_nWaterType; // 0x350 - 0x351
   bool m_bInterpolateEvenWithNoModel; // 0x351 - 0x352
   bool m_bPredictionEligible; // 0x352 - 0x353
   bool m_bApplyLayerMatchIDToModel; // 0x353 - 0x354
   CUtlStringToken m_tokLayerMatchID; // 0x354 - 0x358
   CUtlStringToken m_nSubclassID; // 0x358 - 0x35C
   unsigned char pad_35C[0xC]; // 0x35C - 0x368
   int32_t m_nSimulationTick; // 0x368 - 0x36C
   int32_t m_iCurrentThinkContext; // 0x36C - 0x370
   CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x370 - 0x388
   float m_flAnimTime; // 0x388 - 0x38C
   float m_flSimulationTime; // 0x38C - 0x390
   uint8_t m_nSceneObjectOverrideFlags; // 0x390 - 0x391
   bool m_bHasSuccessfullyInterpolated; // 0x391 - 0x392
   bool m_bHasAddedVarsToInterpolation; // 0x392 - 0x393
   bool m_bRenderEvenWhenNotSuccessfullyInterpolated; // 0x393 - 0x394
   int32 m_nInterpolationLatchDirtyFlags[2]; // 0x394 - 0x39C
   uint16 m_ListEntry[11]; // 0x39C - 0x3B2
   unsigned char pad_3B2[0x2]; // 0x3B2 - 0x3B4
   GameTime_t m_flCreateTime; // 0x3B4 - 0x3B8
   float m_flSpeed; // 0x3B8 - 0x3BC
   uint16_t m_EntClientFlags; // 0x3BC - 0x3BE
   bool m_bClientSideRagdoll; // 0x3BE - 0x3BF
   uint8_t m_iTeamNum; // 0x3BF - 0x3C0
   uint32_t m_spawnflags; // 0x3C0 - 0x3C4
   GameTick_t m_nNextThinkTick; // 0x3C4 - 0x3C8
   uint32_t m_fFlags; // 0x3C8 - 0x3CC
   Vector m_vecAbsVelocity; // 0x3CC - 0x3D8
   CNetworkVelocityVector m_vecVelocity; // 0x3D8 - 0x400
   unsigned char pad_400[0x8]; // 0x400 - 0x408
   Vector m_vecBaseVelocity; // 0x408 - 0x414
   CHandle< C_BaseEntity > m_hEffectEntity; // 0x414 - 0x418
   CHandle< C_BaseEntity > m_hOwnerEntity; // 0x418 - 0x41C
   MoveCollide_t m_MoveCollide; // 0x41C - 0x41D
   MoveType_t m_MoveType; // 0x41D - 0x41E
   unsigned char pad_41E[0x2]; // 0x41E - 0x420
   float m_flWaterLevel; // 0x420 - 0x424
   uint32_t m_fEffects; // 0x424 - 0x428
   CHandle< C_BaseEntity > m_hGroundEntity; // 0x428 - 0x42C
   float m_flFriction; // 0x42C - 0x430
   float m_flElasticity; // 0x430 - 0x434
   float m_flGravityScale; // 0x434 - 0x438
   float m_flTimeScale; // 0x438 - 0x43C
   bool m_bSimulatedEveryTick; // 0x43C - 0x43D
   bool m_bAnimatedEveryTick; // 0x43D - 0x43E
   unsigned char pad_43E[0x2]; // 0x43E - 0x440
   GameTime_t m_flNavIgnoreUntilTime; // 0x440 - 0x444
   uint16_t m_hThink; // 0x444 - 0x446
   unsigned char pad_446[0xA]; // 0x446 - 0x450
   uint8_t m_fBBoxVisFlags; // 0x450 - 0x451
   bool m_bPredictable; // 0x451 - 0x452
   bool m_bRenderWithViewModels; // 0x452 - 0x453
   unsigned char pad_453[0x1]; // 0x453 - 0x454
   CSplitScreenSlot m_nSplitUserPlayerPredictionSlot; // 0x454 - 0x458
   int32_t m_nFirstPredictableCommand; // 0x458 - 0x45C
   int32_t m_nLastPredictableCommand; // 0x45C - 0x460
   CHandle< C_BaseEntity > m_hOldMoveParent; // 0x460 - 0x464
   unsigned char pad_464[0x4]; // 0x464 - 0x468
   CParticleProperty m_Particles; // 0x468 - 0x490
   CUtlVector< float32 > m_vecPredictedScriptFloats; // 0x490 - 0x4A8
   CUtlVector< int32 > m_vecPredictedScriptFloatIDs; // 0x4A8 - 0x4C0
   unsigned char pad_4C0[0x18]; // 0x4C0 - 0x4D8
   int32_t m_nNextScriptVarRecordID; // 0x4D8 - 0x4DC
   unsigned char pad_4DC[0xC]; // 0x4DC - 0x4E8
   QAngle m_vecAngVelocity; // 0x4E8 - 0x4F4
   int32_t m_DataChangeEventRef; // 0x4F4 - 0x4F8
   CUtlVector< CEntityHandle > m_dependencies; // 0x4F8 - 0x510
   int32_t m_nCreationTick; // 0x510 - 0x514
   unsigned char pad_514[0x15]; // 0x514 - 0x529
   bool m_bAnimTimeChanged; // 0x529 - 0x52A
   bool m_bSimulationTimeChanged; // 0x52A - 0x52B
   unsigned char pad_52B[0xD]; // 0x52B - 0x538
   CUtlString m_sUniqueHammerID; // 0x538 - 0x540
}; // size - 0x540


class CParticleFunction /* "particles" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CParticleCollectionFloatInput m_flOpStrength; // 0x8 - 0x160
   ParticleEndcapMode_t m_nOpEndCapState; // 0x160 - 0x164
   float m_flOpStartFadeInTime; // 0x164 - 0x168
   float m_flOpEndFadeInTime; // 0x168 - 0x16C
   float m_flOpStartFadeOutTime; // 0x16C - 0x170
   float m_flOpEndFadeOutTime; // 0x170 - 0x174
   float m_flOpFadeOscillatePeriod; // 0x174 - 0x178
   bool m_bNormalizeToStopTime; // 0x178 - 0x179
   unsigned char pad_179[0x3]; // 0x179 - 0x17C
   float m_flOpTimeOffsetMin; // 0x17C - 0x180
   float m_flOpTimeOffsetMax; // 0x180 - 0x184
   int32_t m_nOpTimeOffsetSeed; // 0x184 - 0x188
   int32_t m_nOpTimeScaleSeed; // 0x188 - 0x18C
   float m_flOpTimeScaleMin; // 0x18C - 0x190
   float m_flOpTimeScaleMax; // 0x190 - 0x194
   unsigned char pad_194[0x2]; // 0x194 - 0x196
   bool m_bDisableOperator; // 0x196 - 0x197
   unsigned char pad_197[0x1]; // 0x197 - 0x198
   CUtlString m_Notes; // 0x198 - 0x1A0
   unsigned char pad_1A0[0x20]; // 0x1A0 - 0x1C0
}; // size - 0x1C0


class CBaseModelEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   CRenderComponent* m_CRenderComponent; // 0x4B0 - 0x4B8
   CHitboxComponent m_CHitboxComponent; // 0x4B8 - 0x4E0
   GameTime_t m_flDissolveStartTime; // 0x4E0 - 0x4E4
   unsigned char pad_4E4[0x4]; // 0x4E4 - 0x4E8
   CEntityIOOutput m_OnIgnite; // 0x4E8 - 0x510
   RenderMode_t m_nRenderMode; // 0x510 - 0x511
   RenderFx_t m_nRenderFX; // 0x511 - 0x512
   bool m_bAllowFadeInView; // 0x512 - 0x513
   Color m_clrRender; // 0x513 - 0x517
   unsigned char pad_517[0x1]; // 0x517 - 0x518
   CUtlVectorEmbeddedNetworkVar< EntityRenderAttribute_t > m_vecRenderAttributes; // 0x518 - 0x568
   CUtlStringToken m_LightGroup; // 0x568 - 0x56C
   bool m_bRenderToCubemaps; // 0x56C - 0x56D
   unsigned char pad_56D[0x3]; // 0x56D - 0x570
   CCollisionProperty m_Collision; // 0x570 - 0x620
   CGlowProperty m_Glow; // 0x620 - 0x678
   float m_flGlowBackfaceMult; // 0x678 - 0x67C
   float m_fadeMinDist; // 0x67C - 0x680
   float m_fadeMaxDist; // 0x680 - 0x684
   float m_flFadeScale; // 0x684 - 0x688
   float m_flShadowStrength; // 0x688 - 0x68C
   uint8_t m_nObjectCulling; // 0x68C - 0x68D
   unsigned char pad_68D[0x3]; // 0x68D - 0x690
   int32_t m_nAddDecal; // 0x690 - 0x694
   Vector m_vDecalPosition; // 0x694 - 0x6A0
   Vector m_vDecalForwardAxis; // 0x6A0 - 0x6AC
   float m_flDecalHealBloodRate; // 0x6AC - 0x6B0
   float m_flDecalHealHeightRate; // 0x6B0 - 0x6B4
   unsigned char pad_6B4[0x4]; // 0x6B4 - 0x6B8
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_ConfigEntitiesToPropagateMaterialDecalsTo; // 0x6B8 - 0x6D0
   CNetworkViewOffsetVector m_vecViewOffset; // 0x6D0 - 0x6F8
   unsigned char pad_6F8[0x8]; // 0x6F8 - 0x700
}; // size - 0x700


class C_BaseModelEntity /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_540[0x4D0]; // 0x540 - 0xA10
   CRenderComponent* m_CRenderComponent; // 0xA10 - 0xA18
   CHitboxComponent m_CHitboxComponent; // 0xA18 - 0xA40
   unsigned char pad_A40[0x20]; // 0xA40 - 0xA60
   bool m_bInitModelEffects; // 0xA60 - 0xA61
   bool m_bIsStaticProp; // 0xA61 - 0xA62
   unsigned char pad_A62[0x2]; // 0xA62 - 0xA64
   int32_t m_nLastAddDecal; // 0xA64 - 0xA68
   int32_t m_nDecalsAdded; // 0xA68 - 0xA6C
   int32_t m_iOldHealth; // 0xA6C - 0xA70
   RenderMode_t m_nRenderMode; // 0xA70 - 0xA71
   RenderFx_t m_nRenderFX; // 0xA71 - 0xA72
   bool m_bAllowFadeInView; // 0xA72 - 0xA73
   Color m_clrRender; // 0xA73 - 0xA77
   unsigned char pad_A77[0x1]; // 0xA77 - 0xA78
   C_UtlVectorEmbeddedNetworkVar< EntityRenderAttribute_t > m_vecRenderAttributes; // 0xA78 - 0xAC8
   unsigned char pad_AC8[0x18]; // 0xAC8 - 0xAE0
   CUtlStringToken m_LightGroup; // 0xAE0 - 0xAE4
   bool m_bRenderToCubemaps; // 0xAE4 - 0xAE5
   unsigned char pad_AE5[0x3]; // 0xAE5 - 0xAE8
   CCollisionProperty m_Collision; // 0xAE8 - 0xB98
   CGlowProperty m_Glow; // 0xB98 - 0xBF0
   float m_flGlowBackfaceMult; // 0xBF0 - 0xBF4
   float m_fadeMinDist; // 0xBF4 - 0xBF8
   float m_fadeMaxDist; // 0xBF8 - 0xBFC
   float m_flFadeScale; // 0xBFC - 0xC00
   float m_flShadowStrength; // 0xC00 - 0xC04
   uint8_t m_nObjectCulling; // 0xC04 - 0xC05
   unsigned char pad_C05[0x3]; // 0xC05 - 0xC08
   int32_t m_nAddDecal; // 0xC08 - 0xC0C
   Vector m_vDecalPosition; // 0xC0C - 0xC18
   Vector m_vDecalForwardAxis; // 0xC18 - 0xC24
   float m_flDecalHealBloodRate; // 0xC24 - 0xC28
   float m_flDecalHealHeightRate; // 0xC28 - 0xC2C
   unsigned char pad_C2C[0x4]; // 0xC2C - 0xC30
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_ConfigEntitiesToPropagateMaterialDecalsTo; // 0xC30 - 0xC48
   CNetworkViewOffsetVector m_vecViewOffset; // 0xC48 - 0xC70
   unsigned char pad_C70[0x8]; // 0xC70 - 0xC78
   CClientAlphaProperty* m_pClientAlphaProperty; // 0xC78 - 0xC80
   Color m_ClientOverrideTint; // 0xC80 - 0xC84
   bool m_bUseClientOverrideTint; // 0xC84 - 0xC85
   unsigned char pad_C85[0x3B]; // 0xC85 - 0xCC0
}; // size - 0xCC0


class CBaseAnimGraph /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bInitiallyPopulateInterpHistory; // 0x700 - 0x701
   bool m_bShouldAnimateDuringGameplayPause; // 0x701 - 0x702
   unsigned char pad_702[0x6]; // 0x702 - 0x708
   IChoreoServices* m_pChoreoServices; // 0x708 - 0x710
   bool m_bAnimGraphUpdateEnabled; // 0x710 - 0x711
   unsigned char pad_711[0x3]; // 0x711 - 0x714
   float m_flMaxSlopeDistance; // 0x714 - 0x718
   Vector m_vLastSlopeCheckPos; // 0x718 - 0x724
   bool m_bAnimGraphDirty; // 0x724 - 0x725
   unsigned char pad_725[0x3]; // 0x725 - 0x728
   Vector m_vecForce; // 0x728 - 0x734
   int32_t m_nForceBone; // 0x734 - 0x738
   unsigned char pad_738[0x10]; // 0x738 - 0x748
   PhysicsRagdollPose_t* m_pRagdollPose; // 0x748 - 0x750
   bool m_bClientRagdoll; // 0x750 - 0x751
   unsigned char pad_751[0x13F]; // 0x751 - 0x890
}; // size - 0x890


class CBaseAnimGraph /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   bool m_bInitiallyPopulateInterpHistory; // 0xCC0 - 0xCC1
   bool m_bShouldAnimateDuringGameplayPause; // 0xCC1 - 0xCC2
   unsigned char pad_CC2[0x1]; // 0xCC2 - 0xCC3
   bool m_bSuppressAnimEventSounds; // 0xCC3 - 0xCC4
   unsigned char pad_CC4[0xC]; // 0xCC4 - 0xCD0
   bool m_bAnimGraphUpdateEnabled; // 0xCD0 - 0xCD1
   unsigned char pad_CD1[0x3]; // 0xCD1 - 0xCD4
   float m_flMaxSlopeDistance; // 0xCD4 - 0xCD8
   Vector m_vLastSlopeCheckPos; // 0xCD8 - 0xCE4
   unsigned char pad_CE4[0x4]; // 0xCE4 - 0xCE8
   Vector m_vecForce; // 0xCE8 - 0xCF4
   int32_t m_nForceBone; // 0xCF4 - 0xCF8
   CBaseAnimGraph* m_pClientsideRagdoll; // 0xCF8 - 0xD00
   bool m_bBuiltRagdoll; // 0xD00 - 0xD01
   unsigned char pad_D01[0x17]; // 0xD01 - 0xD18
   PhysicsRagdollPose_t* m_pRagdollPose; // 0xD18 - 0xD20
   bool m_bClientRagdoll; // 0xD20 - 0xD21
   unsigned char pad_D21[0xF]; // 0xD21 - 0xD30
   bool m_bHasAnimatedMaterialAttributes; // 0xD30 - 0xD31
   unsigned char pad_D31[0x14F]; // 0xD31 - 0xE80
}; // size - 0xE80


class CParticleFunctionOperator /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   unsigned char pad_0[0x1C0]; // 0x0 - 0x1C0
}; // size - 0x1C0


class C_BaseFlex /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   class Emphasized_Phoneme /* "client" */
   {
   public:
      CUtlString m_sClassName; // 0x0 - 0x8
      unsigned char pad_8[0x10]; // 0x8 - 0x18
      float m_flAmount; // 0x18 - 0x1C
      bool m_bRequired; // 0x1C - 0x1D
      bool m_bBasechecked; // 0x1D - 0x1E
      bool m_bValid; // 0x1E - 0x1F
      unsigned char pad_1F[0x1]; // 0x1F - 0x20
   }; // size - 0x20

   unsigned char pad_E80[0x10]; // 0xE80 - 0xE90
   C_NetworkUtlVectorBase< float32 > m_flexWeight; // 0xE90 - 0xEA8
   Vector m_vLookTargetPosition; // 0xEA8 - 0xEB4
   unsigned char pad_EB4[0xC]; // 0xEB4 - 0xEC0
   bool m_blinktoggle; // 0xEC0 - 0xEC1
   unsigned char pad_EC1[0x5F]; // 0xEC1 - 0xF20
   int32_t m_nLastFlexUpdateFrameCount; // 0xF20 - 0xF24
   Vector m_CachedViewTarget; // 0xF24 - 0xF30
   uint32_t m_nNextSceneEventId; // 0xF30 - 0xF34
   int32_t m_iBlink; // 0xF34 - 0xF38
   float m_blinktime; // 0xF38 - 0xF3C
   bool m_prevblinktoggle; // 0xF3C - 0xF3D
   unsigned char pad_F3D[0x3]; // 0xF3D - 0xF40
   int32_t m_iJawOpen; // 0xF40 - 0xF44
   float m_flJawOpenAmount; // 0xF44 - 0xF48
   float m_flBlinkAmount; // 0xF48 - 0xF4C
   AttachmentHandle_t m_iMouthAttachment; // 0xF4C - 0xF4D
   AttachmentHandle_t m_iEyeAttachment; // 0xF4D - 0xF4E
   bool m_bResetFlexWeightsOnModelChange; // 0xF4E - 0xF4F
   unsigned char pad_F4F[0x19]; // 0xF4F - 0xF68
   int32_t m_nEyeOcclusionRendererBone; // 0xF68 - 0xF6C
   matrix3x4_t m_mEyeOcclusionRendererCameraToBoneTransform; // 0xF6C - 0xF9C
   Vector m_vEyeOcclusionRendererHalfExtent; // 0xF9C - 0xFA8
   unsigned char pad_FA8[0x10]; // 0xFA8 - 0xFB8
   C_BaseFlex::Emphasized_Phoneme m_PhonemeClasses[3]; // 0xFB8 - 0x1018
}; // size - 0x1018


class CBaseFlex /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   CNetworkUtlVectorBase< float32 > m_flexWeight; // 0x890 - 0x8A8
   Vector m_vLookTargetPosition; // 0x8A8 - 0x8B4
   bool m_blinktoggle; // 0x8B4 - 0x8B5
   unsigned char pad_8B5[0x53]; // 0x8B5 - 0x908
   GameTime_t m_flAllowResponsesEndTime; // 0x908 - 0x90C
   GameTime_t m_flLastFlexAnimationTime; // 0x90C - 0x910
   uint32_t m_nNextSceneEventId; // 0x910 - 0x914
   bool m_bUpdateLayerPriorities; // 0x914 - 0x915
   unsigned char pad_915[0xB]; // 0x915 - 0x920
}; // size - 0x920


class CServerOnlyEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_0[0x4B0]; // 0x0 - 0x4B0
}; // size - 0x4B0


class C_EconEntity /* "client" */ : public C_BaseFlex /* "client" */
{
public:
   class AttachedModelData_t /* "client" */
   {
   public:
      int32_t m_iModelDisplayFlags; // 0x0 - 0x4
   }; // size - 0x4

   unsigned char pad_1018[0x10]; // 0x1018 - 0x1028
   float m_flFlexDelayTime; // 0x1028 - 0x102C
   unsigned char pad_102C[0x4]; // 0x102C - 0x1030
   float32* m_flFlexDelayedWeight; // 0x1030 - 0x1038
   bool m_bAttributesInitialized; // 0x1038 - 0x1039
   unsigned char pad_1039[0x7]; // 0x1039 - 0x1040
   C_AttributeContainer m_AttributeManager; // 0x1040 - 0x14E8
   uint32_t m_OriginalOwnerXuidLow; // 0x14E8 - 0x14EC
   uint32_t m_OriginalOwnerXuidHigh; // 0x14EC - 0x14F0
   int32_t m_nFallbackPaintKit; // 0x14F0 - 0x14F4
   int32_t m_nFallbackSeed; // 0x14F4 - 0x14F8
   float m_flFallbackWear; // 0x14F8 - 0x14FC
   int32_t m_nFallbackStatTrak; // 0x14FC - 0x1500
   bool m_bClientside; // 0x1500 - 0x1501
   bool m_bParticleSystemsCreated; // 0x1501 - 0x1502
   unsigned char pad_1502[0x6]; // 0x1502 - 0x1508
   CUtlVector< int32 > m_vecAttachedParticles; // 0x1508 - 0x1520
   CHandle< CBaseAnimGraph > m_hViewmodelAttachment; // 0x1520 - 0x1524
   int32_t m_iOldTeam; // 0x1524 - 0x1528
   bool m_bAttachmentDirty; // 0x1528 - 0x1529
   unsigned char pad_1529[0x3]; // 0x1529 - 0x152C
   int32_t m_nUnloadedModelIndex; // 0x152C - 0x1530
   int32_t m_iNumOwnerValidationRetries; // 0x1530 - 0x1534
   unsigned char pad_1534[0xC]; // 0x1534 - 0x1540
   CHandle< C_BaseEntity > m_hOldProvidee; // 0x1540 - 0x1544
   unsigned char pad_1544[0x4]; // 0x1544 - 0x1548
   CUtlVector< C_EconEntity::AttachedModelData_t > m_vecAttachedModels; // 0x1548 - 0x1560
}; // size - 0x1560


class CEconEntity /* "server" */ : public CBaseFlex /* "server" */
{
public:
   unsigned char pad_920[0x10]; // 0x920 - 0x930
   CAttributeContainer m_AttributeManager; // 0x930 - 0xBF8
   uint32_t m_OriginalOwnerXuidLow; // 0xBF8 - 0xBFC
   uint32_t m_OriginalOwnerXuidHigh; // 0xBFC - 0xC00
   int32_t m_nFallbackPaintKit; // 0xC00 - 0xC04
   int32_t m_nFallbackSeed; // 0xC04 - 0xC08
   float m_flFallbackWear; // 0xC08 - 0xC0C
   int32_t m_nFallbackStatTrak; // 0xC0C - 0xC10
   CHandle< CBaseEntity > m_hOldProvidee; // 0xC10 - 0xC14
   int32_t m_iOldOwnerClass; // 0xC14 - 0xC18
}; // size - 0xC18


class CParticleFunctionInitializer /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   int32_t m_nAssociatedEmitterIndex; // 0x1B8 - 0x1BC
   unsigned char pad_1BC[0x4]; // 0x1BC - 0x1C0
}; // size - 0x1C0


class CBasePlayerWeapon /* "server" */ : public CEconEntity /* "server" */
{
public:
   GameTick_t m_nNextPrimaryAttackTick; // 0xC18 - 0xC1C
   float m_flNextPrimaryAttackTickRatio; // 0xC1C - 0xC20
   GameTick_t m_nNextSecondaryAttackTick; // 0xC20 - 0xC24
   float m_flNextSecondaryAttackTickRatio; // 0xC24 - 0xC28
   int32_t m_iClip1; // 0xC28 - 0xC2C
   int32_t m_iClip2; // 0xC2C - 0xC30
   int32 m_pReserveAmmo[2]; // 0xC30 - 0xC38
   CEntityIOOutput m_OnPlayerUse; // 0xC38 - 0xC60
}; // size - 0xC60


class C_BasePlayerWeapon /* "client" */ : public C_EconEntity /* "client" */
{
public:
   GameTick_t m_nNextPrimaryAttackTick; // 0x1560 - 0x1564
   float m_flNextPrimaryAttackTickRatio; // 0x1564 - 0x1568
   GameTick_t m_nNextSecondaryAttackTick; // 0x1568 - 0x156C
   float m_flNextSecondaryAttackTickRatio; // 0x156C - 0x1570
   int32_t m_iClip1; // 0x1570 - 0x1574
   int32_t m_iClip2; // 0x1574 - 0x1578
   int32 m_pReserveAmmo[2]; // 0x1578 - 0x1580
   unsigned char pad_1580[0x18]; // 0x1580 - 0x1598
}; // size - 0x1598


class CBaseToggle /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   TOGGLE_STATE m_toggle_state; // 0x700 - 0x704
   float m_flMoveDistance; // 0x704 - 0x708
   float m_flWait; // 0x708 - 0x70C
   float m_flLip; // 0x70C - 0x710
   bool m_bAlwaysFireBlockedOutputs; // 0x710 - 0x711
   unsigned char pad_711[0x3]; // 0x711 - 0x714
   Vector m_vecPosition1; // 0x714 - 0x720
   Vector m_vecPosition2; // 0x720 - 0x72C
   QAngle m_vecMoveAng; // 0x72C - 0x738
   QAngle m_vecAngle1; // 0x738 - 0x744
   QAngle m_vecAngle2; // 0x744 - 0x750
   float m_flHeight; // 0x750 - 0x754
   CHandle< CBaseEntity > m_hActivator; // 0x754 - 0x758
   Vector m_vecFinalDest; // 0x758 - 0x764
   QAngle m_vecFinalAngle; // 0x764 - 0x770
   int32_t m_movementType; // 0x770 - 0x774
   unsigned char pad_774[0x4]; // 0x774 - 0x778
   CUtlSymbolLarge m_sMaster; // 0x778 - 0x780
}; // size - 0x780


class CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30
   unsigned char pad_30[0x10]; // 0x30 - 0x40
}; // size - 0x40


class CLogicalEntity /* "server" */ : public CServerOnlyEntity /* "server" */
{
public:
   unsigned char pad_0[0x4B0]; // 0x0 - 0x4B0
}; // size - 0x4B0


class CPointEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_0[0x4B0]; // 0x0 - 0x4B0
}; // size - 0x4B0


class CAnimUpdateNodeBase /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CAnimNodePath m_nodePath; // 0x18 - 0x48
   AnimNodeNetworkMode m_networkMode; // 0x48 - 0x4C
   unsigned char pad_4C[0x4]; // 0x4C - 0x50
   CUtlString m_name; // 0x50 - 0x58
}; // size - 0x58


class CCSWeaponBase /* "server" */ : public CBasePlayerWeapon /* "server" */
{
public:
   unsigned char pad_C60[0x28]; // 0xC60 - 0xC88
   bool m_bRemoveable; // 0xC88 - 0xC89
   unsigned char pad_C89[0x3]; // 0xC89 - 0xC8C
   float m_flFireSequenceStartTime; // 0xC8C - 0xC90
   int32_t m_nFireSequenceStartTimeChange; // 0xC90 - 0xC94
   int32_t m_nFireSequenceStartTimeAck; // 0xC94 - 0xC98
   bool m_bPlayerFireEventIsPrimary; // 0xC98 - 0xC99
   unsigned char pad_C99[0x3]; // 0xC99 - 0xC9C
   HSequence m_seqIdle; // 0xC9C - 0xCA0
   HSequence m_seqFirePrimary; // 0xCA0 - 0xCA4
   HSequence m_seqFireSecondary; // 0xCA4 - 0xCA8
   unsigned char pad_CA8[0x8]; // 0xCA8 - 0xCB0
   bool m_bPlayerAmmoStockOnPickup; // 0xCB0 - 0xCB1
   bool m_bRequireUseToTouch; // 0xCB1 - 0xCB2
   unsigned char pad_CB2[0x2]; // 0xCB2 - 0xCB4
   CSWeaponState_t m_iState; // 0xCB4 - 0xCB8
   GameTime_t m_flLastTimeInAir; // 0xCB8 - 0xCBC
   GameTime_t m_flLastDeployTime; // 0xCBC - 0xCC0
   uint32_t m_nViewModelIndex; // 0xCC0 - 0xCC4
   bool m_bReloadsWithClips; // 0xCC4 - 0xCC5
   unsigned char pad_CC5[0x1B]; // 0xCC5 - 0xCE0
   GameTime_t m_flTimeWeaponIdle; // 0xCE0 - 0xCE4
   bool m_bFireOnEmpty; // 0xCE4 - 0xCE5
   unsigned char pad_CE5[0x3]; // 0xCE5 - 0xCE8
   CEntityIOOutput m_OnPlayerPickup; // 0xCE8 - 0xD10
   CSWeaponMode m_weaponMode; // 0xD10 - 0xD14
   float m_flTurningInaccuracyDelta; // 0xD14 - 0xD18
   Vector m_vecTurningInaccuracyEyeDirLast; // 0xD18 - 0xD24
   float m_flTurningInaccuracy; // 0xD24 - 0xD28
   float m_fAccuracyPenalty; // 0xD28 - 0xD2C
   GameTime_t m_flLastAccuracyUpdateTime; // 0xD2C - 0xD30
   float m_fAccuracySmoothedForZoom; // 0xD30 - 0xD34
   GameTime_t m_fScopeZoomEndTime; // 0xD34 - 0xD38
   int32_t m_iRecoilIndex; // 0xD38 - 0xD3C
   float m_flRecoilIndex; // 0xD3C - 0xD40
   bool m_bBurstMode; // 0xD40 - 0xD41
   unsigned char pad_D41[0x3]; // 0xD41 - 0xD44
   GameTime_t m_flPostponeFireReadyTime; // 0xD44 - 0xD48
   bool m_bInReload; // 0xD48 - 0xD49
   bool m_bReloadVisuallyComplete; // 0xD49 - 0xD4A
   unsigned char pad_D4A[0x2]; // 0xD4A - 0xD4C
   GameTime_t m_flDroppedAtTime; // 0xD4C - 0xD50
   bool m_bIsHauledBack; // 0xD50 - 0xD51
   bool m_bSilencerOn; // 0xD51 - 0xD52
   unsigned char pad_D52[0x2]; // 0xD52 - 0xD54
   GameTime_t m_flTimeSilencerSwitchComplete; // 0xD54 - 0xD58
   int32_t m_iOriginalTeamNumber; // 0xD58 - 0xD5C
   float m_flNextAttackRenderTimeOffset; // 0xD5C - 0xD60
   unsigned char pad_D60[0x8]; // 0xD60 - 0xD68
   bool m_bCanBePickedUp; // 0xD68 - 0xD69
   bool m_bUseCanOverrideNextOwnerTouchTime; // 0xD69 - 0xD6A
   unsigned char pad_D6A[0x2]; // 0xD6A - 0xD6C
   GameTime_t m_nextOwnerTouchTime; // 0xD6C - 0xD70
   GameTime_t m_nextPrevOwnerTouchTime; // 0xD70 - 0xD74
   CHandle< CCSPlayerPawn > m_hPrevOwner; // 0xD74 - 0xD78
   GameTick_t m_nDropTick; // 0xD78 - 0xD7C
   unsigned char pad_D7C[0x20]; // 0xD7C - 0xD9C
   bool m_donated; // 0xD9C - 0xD9D
   unsigned char pad_D9D[0x3]; // 0xD9D - 0xDA0
   GameTime_t m_fLastShotTime; // 0xDA0 - 0xDA4
   bool m_bWasOwnedByCT; // 0xDA4 - 0xDA5
   bool m_bWasOwnedByTerrorist; // 0xDA5 - 0xDA6
   bool m_bFiredOutOfAmmoEvent; // 0xDA6 - 0xDA7
   unsigned char pad_DA7[0x1]; // 0xDA7 - 0xDA8
   int32_t m_numRemoveUnownedWeaponThink; // 0xDA8 - 0xDAC
   unsigned char pad_DAC[0x4]; // 0xDAC - 0xDB0
   CIronSightController m_IronSightController; // 0xDB0 - 0xDC8
   int32_t m_iIronSightMode; // 0xDC8 - 0xDCC
   GameTime_t m_flLastLOSTraceFailureTime; // 0xDCC - 0xDD0
   int32_t m_iNumEmptyAttacks; // 0xDD0 - 0xDD4
   unsigned char pad_DD4[0x4]; // 0xDD4 - 0xDD8
}; // size - 0xDD8


class C_CSWeaponBase /* "client" */ : public C_BasePlayerWeapon /* "client" */
{
public:
   unsigned char pad_1598[0x38]; // 0x1598 - 0x15D0
   float m_flFireSequenceStartTime; // 0x15D0 - 0x15D4
   int32_t m_nFireSequenceStartTimeChange; // 0x15D4 - 0x15D8
   int32_t m_nFireSequenceStartTimeAck; // 0x15D8 - 0x15DC
   bool m_bPlayerFireEventIsPrimary; // 0x15DC - 0x15DD
   unsigned char pad_15DD[0x3]; // 0x15DD - 0x15E0
   HSequence m_seqIdle; // 0x15E0 - 0x15E4
   HSequence m_seqFirePrimary; // 0x15E4 - 0x15E8
   HSequence m_seqFireSecondary; // 0x15E8 - 0x15EC
   unsigned char pad_15EC[0x14]; // 0x15EC - 0x1600
   CSWeaponState_t m_ClientPreviousWeaponState; // 0x1600 - 0x1604
   CSWeaponState_t m_iState; // 0x1604 - 0x1608
   float m_flCrosshairDistance; // 0x1608 - 0x160C
   int32_t m_iAmmoLastCheck; // 0x160C - 0x1610
   int32_t m_iAlpha; // 0x1610 - 0x1614
   int32_t m_iScopeTextureID; // 0x1614 - 0x1618
   int32_t m_iCrosshairTextureID; // 0x1618 - 0x161C
   float m_flGunAccuracyPosition; // 0x161C - 0x1620
   uint32_t m_nViewModelIndex; // 0x1620 - 0x1624
   bool m_bReloadsWithClips; // 0x1624 - 0x1625
   unsigned char pad_1625[0x3]; // 0x1625 - 0x1628
   GameTime_t m_flTimeWeaponIdle; // 0x1628 - 0x162C
   bool m_bFireOnEmpty; // 0x162C - 0x162D
   unsigned char pad_162D[0x3]; // 0x162D - 0x1630
   CEntityIOOutput m_OnPlayerPickup; // 0x1630 - 0x1658
   CSWeaponMode m_weaponMode; // 0x1658 - 0x165C
   float m_flTurningInaccuracyDelta; // 0x165C - 0x1660
   Vector m_vecTurningInaccuracyEyeDirLast; // 0x1660 - 0x166C
   float m_flTurningInaccuracy; // 0x166C - 0x1670
   float m_fAccuracyPenalty; // 0x1670 - 0x1674
   GameTime_t m_flLastAccuracyUpdateTime; // 0x1674 - 0x1678
   float m_fAccuracySmoothedForZoom; // 0x1678 - 0x167C
   GameTime_t m_fScopeZoomEndTime; // 0x167C - 0x1680
   int32_t m_iRecoilIndex; // 0x1680 - 0x1684
   float m_flRecoilIndex; // 0x1684 - 0x1688
   bool m_bBurstMode; // 0x1688 - 0x1689
   unsigned char pad_1689[0x3]; // 0x1689 - 0x168C
   GameTime_t m_flPostponeFireReadyTime; // 0x168C - 0x1690
   bool m_bInReload; // 0x1690 - 0x1691
   bool m_bReloadVisuallyComplete; // 0x1691 - 0x1692
   unsigned char pad_1692[0x2]; // 0x1692 - 0x1694
   GameTime_t m_flDroppedAtTime; // 0x1694 - 0x1698
   bool m_bIsHauledBack; // 0x1698 - 0x1699
   bool m_bSilencerOn; // 0x1699 - 0x169A
   unsigned char pad_169A[0x2]; // 0x169A - 0x169C
   GameTime_t m_flTimeSilencerSwitchComplete; // 0x169C - 0x16A0
   int32_t m_iOriginalTeamNumber; // 0x16A0 - 0x16A4
   float m_flNextAttackRenderTimeOffset; // 0x16A4 - 0x16A8
   unsigned char pad_16A8[0x78]; // 0x16A8 - 0x1720
   bool m_bVisualsDataSet; // 0x1720 - 0x1721
   bool m_bOldFirstPersonSpectatedState; // 0x1721 - 0x1722
   unsigned char pad_1722[0x2]; // 0x1722 - 0x1724
   CHandle< C_BaseEntity > m_hOurPing; // 0x1724 - 0x1728
   CEntityIndex m_nOurPingIndex; // 0x1728 - 0x172C
   Vector m_vecOurPingPos; // 0x172C - 0x1738
   bool m_bGlowForPing; // 0x1738 - 0x1739
   bool m_bUIWeapon; // 0x1739 - 0x173A
   unsigned char pad_173A[0xE]; // 0x173A - 0x1748
   CHandle< C_CSPlayerPawn > m_hPrevOwner; // 0x1748 - 0x174C
   GameTick_t m_nDropTick; // 0x174C - 0x1750
   unsigned char pad_1750[0x1C]; // 0x1750 - 0x176C
   bool m_donated; // 0x176C - 0x176D
   unsigned char pad_176D[0x3]; // 0x176D - 0x1770
   GameTime_t m_fLastShotTime; // 0x1770 - 0x1774
   bool m_bWasOwnedByCT; // 0x1774 - 0x1775
   bool m_bWasOwnedByTerrorist; // 0x1775 - 0x1776
   unsigned char pad_1776[0x2]; // 0x1776 - 0x1778
   float m_gunHeat; // 0x1778 - 0x177C
   uint32_t m_smokeAttachments; // 0x177C - 0x1780
   GameTime_t m_lastSmokeTime; // 0x1780 - 0x1784
   float m_flLastClientFireBulletTime; // 0x1784 - 0x1788
   unsigned char pad_1788[0xB8]; // 0x1788 - 0x1840
   C_IronSightController m_IronSightController; // 0x1840 - 0x18F0
   int32_t m_iIronSightMode; // 0x18F0 - 0x18F4
   unsigned char pad_18F4[0xC]; // 0x18F4 - 0x1900
   GameTime_t m_flLastLOSTraceFailureTime; // 0x1900 - 0x1904
   int32_t m_iNumEmptyAttacks; // 0x1904 - 0x1908
   unsigned char pad_1908[0x38]; // 0x1908 - 0x1940
}; // size - 0x1940


class CPulseCell_Base /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   PulseDocNodeID_t m_nEditorNodeID; // 0x8 - 0xC
   unsigned char pad_C[0x3C]; // 0xC - 0x48
}; // size - 0x48


class CBaseTrigger /* "server" */ : public CBaseToggle /* "server" */
{
public:
   bool m_bDisabled; // 0x780 - 0x781
   unsigned char pad_781[0x7]; // 0x781 - 0x788
   CUtlSymbolLarge m_iFilterName; // 0x788 - 0x790
   CHandle< CBaseFilter > m_hFilter; // 0x790 - 0x794
   unsigned char pad_794[0x4]; // 0x794 - 0x798
   CEntityIOOutput m_OnStartTouch; // 0x798 - 0x7C0
   CEntityIOOutput m_OnStartTouchAll; // 0x7C0 - 0x7E8
   CEntityIOOutput m_OnEndTouch; // 0x7E8 - 0x810
   CEntityIOOutput m_OnEndTouchAll; // 0x810 - 0x838
   CEntityIOOutput m_OnTouching; // 0x838 - 0x860
   CEntityIOOutput m_OnNotTouching; // 0x860 - 0x888
   CUtlVector< CHandle< CBaseEntity > > m_hTouchingEntities; // 0x888 - 0x8A0
   bool m_bClientSidePredicted; // 0x8A0 - 0x8A1
   unsigned char pad_8A1[0x7]; // 0x8A1 - 0x8A8
}; // size - 0x8A8


class CParticleFunctionPreEmission /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   bool m_bRunOnce; // 0x1C0 - 0x1C1
   unsigned char pad_1C1[0xF]; // 0x1C1 - 0x1D0
}; // size - 0x1D0


class CPulseCell_BaseFlow /* "pulse_runtime_lib" */ : public CPulseCell_Base /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x48]; // 0x0 - 0x48
}; // size - 0x48


class CParticleFunctionRenderer /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   CParticleVisibilityInputs VisibilityInputs; // 0x1B8 - 0x1FC
   bool m_bCannotBeRefracted; // 0x1FC - 0x1FD
   bool m_bSkipRenderingOnMobile; // 0x1FD - 0x1FE
   unsigned char pad_1FE[0x2]; // 0x1FE - 0x200
}; // size - 0x200


class CBaseProp /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   bool m_bModelOverrodeBlockLOS; // 0x890 - 0x891
   unsigned char pad_891[0x3]; // 0x891 - 0x894
   int32_t m_iShapeType; // 0x894 - 0x898
   bool m_bConformToCollisionBounds; // 0x898 - 0x899
   unsigned char pad_899[0x3]; // 0x899 - 0x89C
   matrix3x4_t m_mPreferredCatchTransform; // 0x89C - 0x8CC
   unsigned char pad_8CC[0x4]; // 0x8CC - 0x8D0
}; // size - 0x8D0


class CCSWeaponBaseGun /* "server" */ : public CCSWeaponBase /* "server" */
{
public:
   int32_t m_zoomLevel; // 0xDD8 - 0xDDC
   int32_t m_iBurstShotsRemaining; // 0xDDC - 0xDE0
   unsigned char pad_DE0[0x8]; // 0xDE0 - 0xDE8
   int32_t m_silencedModelIndex; // 0xDE8 - 0xDEC
   bool m_inPrecache; // 0xDEC - 0xDED
   bool m_bNeedsBoltAction; // 0xDED - 0xDEE
   bool m_bSkillReloadAvailable; // 0xDEE - 0xDEF
   bool m_bSkillReloadLiftedReloadKey; // 0xDEF - 0xDF0
   bool m_bSkillBoltInterruptAvailable; // 0xDF0 - 0xDF1
   bool m_bSkillBoltLiftedFireKey; // 0xDF1 - 0xDF2
   unsigned char pad_DF2[0x6]; // 0xDF2 - 0xDF8
}; // size - 0xDF8


class C_CSWeaponBaseGun /* "client" */ : public C_CSWeaponBase /* "client" */
{
public:
   int32_t m_zoomLevel; // 0x1940 - 0x1944
   int32_t m_iBurstShotsRemaining; // 0x1944 - 0x1948
   int32_t m_iSilencerBodygroup; // 0x1948 - 0x194C
   unsigned char pad_194C[0xC]; // 0x194C - 0x1958
   int32_t m_silencedModelIndex; // 0x1958 - 0x195C
   bool m_inPrecache; // 0x195C - 0x195D
   bool m_bNeedsBoltAction; // 0x195D - 0x195E
   unsigned char pad_195E[0x2]; // 0x195E - 0x1960
}; // size - 0x1960


class CUnaryUpdateNode /* "animgraphlib" */ : public CAnimUpdateNodeBase /* "animgraphlib" */
{
public:
   CAnimUpdateNodeRef m_pChildNode; // 0x58 - 0x68
}; // size - 0x68


class CBreakableProp /* "server" */ : public CBaseProp /* "server" */
{
public:
   unsigned char pad_8D0[0x10]; // 0x8D0 - 0x8E0
   CEntityIOOutput m_OnBreak; // 0x8E0 - 0x908
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0x908 - 0x930
   CEntityIOOutput m_OnTakeDamage; // 0x930 - 0x958
   float m_impactEnergyScale; // 0x958 - 0x95C
   int32_t m_iMinHealthDmg; // 0x95C - 0x960
   QAngle m_preferredCarryAngles; // 0x960 - 0x96C
   float m_flPressureDelay; // 0x96C - 0x970
   CHandle< CBaseEntity > m_hBreaker; // 0x970 - 0x974
   PerformanceMode_t m_PerformanceMode; // 0x974 - 0x978
   float m_flDmgModBullet; // 0x978 - 0x97C
   float m_flDmgModClub; // 0x97C - 0x980
   float m_flDmgModExplosive; // 0x980 - 0x984
   float m_flDmgModFire; // 0x984 - 0x988
   CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0x988 - 0x990
   CUtlSymbolLarge m_iszBasePropData; // 0x990 - 0x998
   int32_t m_iInteractions; // 0x998 - 0x99C
   GameTime_t m_flPreventDamageBeforeTime; // 0x99C - 0x9A0
   bool m_bHasBreakPiecesOrCommands; // 0x9A0 - 0x9A1
   unsigned char pad_9A1[0x3]; // 0x9A1 - 0x9A4
   float m_explodeDamage; // 0x9A4 - 0x9A8
   float m_explodeRadius; // 0x9A8 - 0x9AC
   unsigned char pad_9AC[0x4]; // 0x9AC - 0x9B0
   float m_explosionDelay; // 0x9B0 - 0x9B4
   unsigned char pad_9B4[0x4]; // 0x9B4 - 0x9B8
   CUtlSymbolLarge m_explosionBuildupSound; // 0x9B8 - 0x9C0
   CUtlSymbolLarge m_explosionCustomEffect; // 0x9C0 - 0x9C8
   CUtlSymbolLarge m_explosionCustomSound; // 0x9C8 - 0x9D0
   CUtlSymbolLarge m_explosionModifier; // 0x9D0 - 0x9D8
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x9D8 - 0x9DC
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x9DC - 0x9E0
   bool m_bOriginalBlockLOS; // 0x9E0 - 0x9E1
   unsigned char pad_9E1[0x3]; // 0x9E1 - 0x9E4
   float m_flDefaultFadeScale; // 0x9E4 - 0x9E8
   CHandle< CBaseEntity > m_hLastAttacker; // 0x9E8 - 0x9EC
   CHandle< CBaseEntity > m_hFlareEnt; // 0x9EC - 0x9F0
   bool m_bUsePuntSound; // 0x9F0 - 0x9F1
   unsigned char pad_9F1[0x7]; // 0x9F1 - 0x9F8
   CUtlSymbolLarge m_iszPuntSound; // 0x9F8 - 0xA00
   bool m_noGhostCollision; // 0xA00 - 0xA01
   unsigned char pad_A01[0x7]; // 0xA01 - 0xA08
}; // size - 0xA08


class CBaseProp /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   bool m_bModelOverrodeBlockLOS; // 0xE80 - 0xE81
   unsigned char pad_E81[0x3]; // 0xE81 - 0xE84
   int32_t m_iShapeType; // 0xE84 - 0xE88
   bool m_bConformToCollisionBounds; // 0xE88 - 0xE89
   unsigned char pad_E89[0x3]; // 0xE89 - 0xE8C
   matrix3x4_t m_mPreferredCatchTransform; // 0xE8C - 0xEBC
   unsigned char pad_EBC[0x4]; // 0xEBC - 0xEC0
}; // size - 0xEC0


class C_BaseToggle /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_0[0xCC0]; // 0x0 - 0xCC0
}; // size - 0xCC0


class C_BaseCombatCharacter /* "client" */ : public C_BaseFlex /* "client" */
{
public:

   enum class WaterWakeMode_t : std::uint32_t
   {
      WATER_WAKE_NONE = 0,
      WATER_WAKE_IDLE = 1,
      WATER_WAKE_WALKING = 2,
      WATER_WAKE_RUNNING = 3,
      WATER_WAKE_WATER_OVERHEAD = 4
   };
   C_NetworkUtlVectorBase< CHandle< C_EconWearable > > m_hMyWearables; // 0x1018 - 0x1030
   int32_t m_bloodColor; // 0x1030 - 0x1034
   AttachmentHandle_t m_leftFootAttachment; // 0x1034 - 0x1035
   AttachmentHandle_t m_rightFootAttachment; // 0x1035 - 0x1036
   unsigned char pad_1036[0x2]; // 0x1036 - 0x1038
   C_BaseCombatCharacter::WaterWakeMode_t m_nWaterWakeMode; // 0x1038 - 0x103C
   float m_flWaterWorldZ; // 0x103C - 0x1040
   float m_flWaterNextTraceTime; // 0x1040 - 0x1044
   float m_flFieldOfView; // 0x1044 - 0x1048
   unsigned char pad_1048[0x60]; // 0x1048 - 0x10A8
}; // size - 0x10A8


class CParticleFunctionForce /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   unsigned char pad_0[0x1D0]; // 0x0 - 0x1D0
}; // size - 0x1D0


class EventSimulate_t /* "engine2" */
{
public:
   EngineLoopState_t m_LoopState; // 0x0 - 0x28
   bool m_bFirstTick; // 0x28 - 0x29
   bool m_bLastTick; // 0x29 - 0x2A
   unsigned char pad_2A[0x6]; // 0x2A - 0x30
}; // size - 0x30


class CParticleInput /* "particleslib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
}; // size - 0x10


class CBoneConstraintBase /* "modellib" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
}; // size - 0x28


class C_CSGO_TeamPreviewCharacterPosition /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   int32_t m_nVariant; // 0x540 - 0x544
   int32_t m_nRandom; // 0x544 - 0x548
   int32_t m_nOrdinal; // 0x548 - 0x54C
   unsigned char pad_54C[0x4]; // 0x54C - 0x550
   CUtlString m_sWeaponName; // 0x550 - 0x558
   uint64_t m_xuid; // 0x558 - 0x560
   C_EconItemView m_agentItem; // 0x560 - 0x9A8
   C_EconItemView m_glovesItem; // 0x9A8 - 0xDF0
   C_EconItemView m_weaponItem; // 0xDF0 - 0x1238
   unsigned char pad_1238[0x38]; // 0x1238 - 0x1270
}; // size - 0x1270


class CParticleFunctionConstraint /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   unsigned char pad_0[0x1C0]; // 0x0 - 0x1C0
}; // size - 0x1C0


class CCSGO_TeamPreviewCharacterPosition /* "server" */ : public CBaseEntity /* "server" */
{
public:
   int32_t m_nVariant; // 0x4B0 - 0x4B4
   int32_t m_nRandom; // 0x4B4 - 0x4B8
   int32_t m_nOrdinal; // 0x4B8 - 0x4BC
   unsigned char pad_4BC[0x4]; // 0x4BC - 0x4C0
   CUtlString m_sWeaponName; // 0x4C0 - 0x4C8
   uint64_t m_xuid; // 0x4C8 - 0x4D0
   CEconItemView m_agentItem; // 0x4D0 - 0x748
   CEconItemView m_glovesItem; // 0x748 - 0x9C0
   CEconItemView m_weaponItem; // 0x9C0 - 0xC38
}; // size - 0xC38


class C_BreakableProp /* "client" */ : public CBaseProp /* "client" */
{
public:
   unsigned char pad_EC0[0x8]; // 0xEC0 - 0xEC8
   CEntityIOOutput m_OnBreak; // 0xEC8 - 0xEF0
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0xEF0 - 0xF18
   CEntityIOOutput m_OnTakeDamage; // 0xF18 - 0xF40
   float m_impactEnergyScale; // 0xF40 - 0xF44
   int32_t m_iMinHealthDmg; // 0xF44 - 0xF48
   float m_flPressureDelay; // 0xF48 - 0xF4C
   CHandle< C_BaseEntity > m_hBreaker; // 0xF4C - 0xF50
   PerformanceMode_t m_PerformanceMode; // 0xF50 - 0xF54
   float m_flDmgModBullet; // 0xF54 - 0xF58
   float m_flDmgModClub; // 0xF58 - 0xF5C
   float m_flDmgModExplosive; // 0xF5C - 0xF60
   float m_flDmgModFire; // 0xF60 - 0xF64
   unsigned char pad_F64[0x4]; // 0xF64 - 0xF68
   CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0xF68 - 0xF70
   CUtlSymbolLarge m_iszBasePropData; // 0xF70 - 0xF78
   int32_t m_iInteractions; // 0xF78 - 0xF7C
   GameTime_t m_flPreventDamageBeforeTime; // 0xF7C - 0xF80
   bool m_bHasBreakPiecesOrCommands; // 0xF80 - 0xF81
   unsigned char pad_F81[0x3]; // 0xF81 - 0xF84
   float m_explodeDamage; // 0xF84 - 0xF88
   float m_explodeRadius; // 0xF88 - 0xF8C
   unsigned char pad_F8C[0x4]; // 0xF8C - 0xF90
   float m_explosionDelay; // 0xF90 - 0xF94
   unsigned char pad_F94[0x4]; // 0xF94 - 0xF98
   CUtlSymbolLarge m_explosionBuildupSound; // 0xF98 - 0xFA0
   CUtlSymbolLarge m_explosionCustomEffect; // 0xFA0 - 0xFA8
   CUtlSymbolLarge m_explosionCustomSound; // 0xFA8 - 0xFB0
   CUtlSymbolLarge m_explosionModifier; // 0xFB0 - 0xFB8
   CHandle< C_BasePlayerPawn > m_hPhysicsAttacker; // 0xFB8 - 0xFBC
   GameTime_t m_flLastPhysicsInfluenceTime; // 0xFBC - 0xFC0
   float m_flDefaultFadeScale; // 0xFC0 - 0xFC4
   CHandle< C_BaseEntity > m_hLastAttacker; // 0xFC4 - 0xFC8
   CHandle< C_BaseEntity > m_hFlareEnt; // 0xFC8 - 0xFCC
   bool m_noGhostCollision; // 0xFCC - 0xFCD
   unsigned char pad_FCD[0x3]; // 0xFCD - 0xFD0
}; // size - 0xFD0


class CBaseFilter /* "server" */ : public CLogicalEntity /* "server" */
{
public:
   bool m_bNegated; // 0x4B0 - 0x4B1
   unsigned char pad_4B1[0x7]; // 0x4B1 - 0x4B8
   CEntityIOOutput m_OnPass; // 0x4B8 - 0x4E0
   CEntityIOOutput m_OnFail; // 0x4E0 - 0x508
}; // size - 0x508


class CBaseGrenade /* "server" */ : public CBaseFlex /* "server" */
{
public:
   unsigned char pad_920[0x8]; // 0x920 - 0x928
   CEntityIOOutput m_OnPlayerPickup; // 0x928 - 0x950
   CEntityIOOutput m_OnExplode; // 0x950 - 0x978
   bool m_bHasWarnedAI; // 0x978 - 0x979
   bool m_bIsSmokeGrenade; // 0x979 - 0x97A
   bool m_bIsLive; // 0x97A - 0x97B
   unsigned char pad_97B[0x1]; // 0x97B - 0x97C
   float m_DmgRadius; // 0x97C - 0x980
   GameTime_t m_flDetonateTime; // 0x980 - 0x984
   float m_flWarnAITime; // 0x984 - 0x988
   float m_flDamage; // 0x988 - 0x98C
   unsigned char pad_98C[0x4]; // 0x98C - 0x990
   CUtlSymbolLarge m_iszBounceSound; // 0x990 - 0x998
   CUtlString m_ExplosionSound; // 0x998 - 0x9A0
   unsigned char pad_9A0[0x4]; // 0x9A0 - 0x9A4
   CHandle< CCSPlayerPawn > m_hThrower; // 0x9A4 - 0x9A8
   unsigned char pad_9A8[0x14]; // 0x9A8 - 0x9BC
   GameTime_t m_flNextAttack; // 0x9BC - 0x9C0
   CHandle< CCSPlayerPawn > m_hOriginalThrower; // 0x9C0 - 0x9C4
   unsigned char pad_9C4[0x4]; // 0x9C4 - 0x9C8
}; // size - 0x9C8


class CEntityComponent /* "entity2" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class CMotionMetricEvaluator /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< float32 > m_means; // 0x18 - 0x30
   CUtlVector< float32 > m_standardDeviations; // 0x30 - 0x48
   float m_flWeight; // 0x48 - 0x4C
   int32_t m_nDimensionStartIndex; // 0x4C - 0x50
}; // size - 0x50


class CLeafUpdateNode /* "animgraphlib" */ : public CAnimUpdateNodeBase /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x58]; // 0x0 - 0x58
}; // size - 0x58


class CAnimComponentUpdater /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlString m_name; // 0x18 - 0x20
   AnimComponentID m_id; // 0x20 - 0x24
   AnimNodeNetworkMode m_networkMode; // 0x24 - 0x28
   bool m_bStartEnabled; // 0x28 - 0x29
   unsigned char pad_29[0x7]; // 0x29 - 0x30
}; // size - 0x30


class CEntityComponent /* "entity2" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class CServerOnlyPointEntity /* "server" */ : public CServerOnlyEntity /* "server" */
{
public:
   unsigned char pad_0[0x4B0]; // 0x0 - 0x4B0
}; // size - 0x4B0


class CPhysConstraint /* "server" */ : public CLogicalEntity /* "server" */
{
public:
   unsigned char pad_4B0[0x8]; // 0x4B0 - 0x4B8
   CUtlSymbolLarge m_nameAttach1; // 0x4B8 - 0x4C0
   CUtlSymbolLarge m_nameAttach2; // 0x4C0 - 0x4C8
   CUtlSymbolLarge m_breakSound; // 0x4C8 - 0x4D0
   float m_forceLimit; // 0x4D0 - 0x4D4
   float m_torqueLimit; // 0x4D4 - 0x4D8
   uint32_t m_teleportTick; // 0x4D8 - 0x4DC
   float m_minTeleportDistance; // 0x4DC - 0x4E0
   CEntityIOOutput m_OnBreak; // 0x4E0 - 0x508
}; // size - 0x508


class CAnimParameterBase /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CGlobalSymbol m_name; // 0x18 - 0x20
   CUtlString m_group; // 0x20 - 0x28
   AnimParamID m_id; // 0x28 - 0x2C
   unsigned char pad_2C[0x14]; // 0x2C - 0x40
   CUtlString m_componentName; // 0x40 - 0x48
   unsigned char pad_48[0x4]; // 0x48 - 0x4C
   bool m_bNetworkingRequested; // 0x4C - 0x4D
   bool m_bIsReferenced; // 0x4D - 0x4E
   unsigned char pad_4E[0x2]; // 0x4E - 0x50
}; // size - 0x50


class CAnimTagBase /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CGlobalSymbol m_name; // 0x18 - 0x20
   CGlobalSymbol m_group; // 0x20 - 0x28
   AnimTagID m_tagID; // 0x28 - 0x2C
   bool m_bIsReferenced; // 0x2C - 0x2D
   unsigned char pad_2D[0x3]; // 0x2D - 0x30
}; // size - 0x30


class CBaseCombatCharacter /* "server" */ : public CBaseFlex /* "server" */
{
public:
   bool m_bForceServerRagdoll; // 0x920 - 0x921
   unsigned char pad_921[0x7]; // 0x921 - 0x928
   CNetworkUtlVectorBase< CHandle< CEconWearable > > m_hMyWearables; // 0x928 - 0x940
   float m_flFieldOfView; // 0x940 - 0x944
   float m_impactEnergyScale; // 0x944 - 0x948
   HitGroup_t m_LastHitGroup; // 0x948 - 0x94C
   bool m_bApplyStressDamage; // 0x94C - 0x94D
   unsigned char pad_94D[0x3]; // 0x94D - 0x950
   int32_t m_bloodColor; // 0x950 - 0x954
   unsigned char pad_954[0x5C]; // 0x954 - 0x9B0
   int32_t m_navMeshID; // 0x9B0 - 0x9B4
   int32_t m_iDamageCount; // 0x9B4 - 0x9B8
   CUtlVector< RelationshipOverride_t >* m_pVecRelationships; // 0x9B8 - 0x9C0
   CUtlSymbolLarge m_strRelationships; // 0x9C0 - 0x9C8
   Hull_t m_eHull; // 0x9C8 - 0x9CC
   uint32_t m_nNavHullIdx; // 0x9CC - 0x9D0
}; // size - 0x9D0


class C_BasePlayerPawn /* "client" */ : public C_BaseCombatCharacter /* "client" */
{
public:
   CPlayer_WeaponServices* m_pWeaponServices; // 0x10A8 - 0x10B0
   CPlayer_ItemServices* m_pItemServices; // 0x10B0 - 0x10B8
   CPlayer_AutoaimServices* m_pAutoaimServices; // 0x10B8 - 0x10C0
   CPlayer_ObserverServices* m_pObserverServices; // 0x10C0 - 0x10C8
   CPlayer_WaterServices* m_pWaterServices; // 0x10C8 - 0x10D0
   CPlayer_UseServices* m_pUseServices; // 0x10D0 - 0x10D8
   CPlayer_FlashlightServices* m_pFlashlightServices; // 0x10D8 - 0x10E0
   CPlayer_CameraServices* m_pCameraServices; // 0x10E0 - 0x10E8
   CPlayer_MovementServices* m_pMovementServices; // 0x10E8 - 0x10F0
   unsigned char pad_10F0[0x8]; // 0x10F0 - 0x10F8
   C_UtlVectorEmbeddedNetworkVar< ViewAngleServerChange_t > m_ServerViewAngleChanges; // 0x10F8 - 0x1148
   uint32_t m_nHighestConsumedServerViewAngleChangeIndex; // 0x1148 - 0x114C
   QAngle v_angle; // 0x114C - 0x1158
   QAngle v_anglePrevious; // 0x1158 - 0x1164
   uint32_t m_iHideHUD; // 0x1164 - 0x1168
   sky3dparams_t m_skybox3d; // 0x1168 - 0x11F8
   GameTime_t m_flDeathTime; // 0x11F8 - 0x11FC
   Vector m_vecPredictionError; // 0x11FC - 0x1208
   GameTime_t m_flPredictionErrorTime; // 0x1208 - 0x120C
   float m_flFOVSensitivityAdjust; // 0x120C - 0x1210
   float m_flMouseSensitivity; // 0x1210 - 0x1214
   Vector m_vOldOrigin; // 0x1214 - 0x1220
   float m_flOldSimulationTime; // 0x1220 - 0x1224
   int32_t m_nLastExecutedCommandNumber; // 0x1224 - 0x1228
   int32_t m_nLastExecutedCommandTick; // 0x1228 - 0x122C
   CHandle< CBasePlayerController > m_hController; // 0x122C - 0x1230
   bool m_bIsSwappingToPredictableController; // 0x1230 - 0x1231
   unsigned char pad_1231[0x7]; // 0x1231 - 0x1238
}; // size - 0x1238


class CDynamicProp /* "server" */ : public CBreakableProp /* "server" */
{
public:
   unsigned char pad_A08[0x8]; // 0xA08 - 0xA10
   bool m_bCreateNavObstacle; // 0xA10 - 0xA11
   bool m_bUseHitboxesForRenderBox; // 0xA11 - 0xA12
   bool m_bUseAnimGraph; // 0xA12 - 0xA13
   unsigned char pad_A13[0x5]; // 0xA13 - 0xA18
   CEntityIOOutput m_pOutputAnimBegun; // 0xA18 - 0xA40
   CEntityIOOutput m_pOutputAnimOver; // 0xA40 - 0xA68
   CEntityIOOutput m_pOutputAnimLoopCycleOver; // 0xA68 - 0xA90
   CEntityIOOutput m_OnAnimReachedStart; // 0xA90 - 0xAB8
   CEntityIOOutput m_OnAnimReachedEnd; // 0xAB8 - 0xAE0
   CUtlSymbolLarge m_iszDefaultAnim; // 0xAE0 - 0xAE8
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0xAE8 - 0xAEC
   bool m_bAnimateOnServer; // 0xAEC - 0xAED
   bool m_bRandomizeCycle; // 0xAED - 0xAEE
   bool m_bStartDisabled; // 0xAEE - 0xAEF
   bool m_bScriptedMovement; // 0xAEF - 0xAF0
   bool m_bFiredStartEndOutput; // 0xAF0 - 0xAF1
   bool m_bForceNpcExclude; // 0xAF1 - 0xAF2
   bool m_bCreateNonSolid; // 0xAF2 - 0xAF3
   bool m_bIsOverrideProp; // 0xAF3 - 0xAF4
   int32_t m_iInitialGlowState; // 0xAF4 - 0xAF8
   int32_t m_nGlowRange; // 0xAF8 - 0xAFC
   int32_t m_nGlowRangeMin; // 0xAFC - 0xB00
   Color m_glowColor; // 0xB00 - 0xB04
   int32_t m_nGlowTeam; // 0xB04 - 0xB08
}; // size - 0xB08


class C_BaseTrigger /* "client" */ : public C_BaseToggle /* "client" */
{
public:
   bool m_bDisabled; // 0xCC0 - 0xCC1
   bool m_bClientSidePredicted; // 0xCC1 - 0xCC2
   unsigned char pad_CC2[0x6]; // 0xCC2 - 0xCC8
}; // size - 0xCC8


class CModelConfigElement /* "modellib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlString m_ElementName; // 0x8 - 0x10
   CUtlVector< CModelConfigElement* > m_NestedElements; // 0x10 - 0x28
   unsigned char pad_28[0x20]; // 0x28 - 0x48
}; // size - 0x48


class C_BaseGrenade /* "client" */ : public C_BaseFlex /* "client" */
{
public:
   bool m_bHasWarnedAI; // 0x1018 - 0x1019
   bool m_bIsSmokeGrenade; // 0x1019 - 0x101A
   bool m_bIsLive; // 0x101A - 0x101B
   unsigned char pad_101B[0x1]; // 0x101B - 0x101C
   float m_DmgRadius; // 0x101C - 0x1020
   GameTime_t m_flDetonateTime; // 0x1020 - 0x1024
   float m_flWarnAITime; // 0x1024 - 0x1028
   float m_flDamage; // 0x1028 - 0x102C
   unsigned char pad_102C[0x4]; // 0x102C - 0x1030
   CUtlSymbolLarge m_iszBounceSound; // 0x1030 - 0x1038
   CUtlString m_ExplosionSound; // 0x1038 - 0x1040
   unsigned char pad_1040[0x4]; // 0x1040 - 0x1044
   CHandle< C_CSPlayerPawn > m_hThrower; // 0x1044 - 0x1048
   unsigned char pad_1048[0x14]; // 0x1048 - 0x105C
   GameTime_t m_flNextAttack; // 0x105C - 0x1060
   CHandle< C_CSPlayerPawn > m_hOriginalThrower; // 0x1060 - 0x1064
   unsigned char pad_1064[0x4]; // 0x1064 - 0x1068
}; // size - 0x1068


class C_CSGO_MapPreviewCameraPath /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   float m_flZFar; // 0x540 - 0x544
   float m_flZNear; // 0x544 - 0x548
   bool m_bLoop; // 0x548 - 0x549
   bool m_bVerticalFOV; // 0x549 - 0x54A
   bool m_bConstantSpeed; // 0x54A - 0x54B
   unsigned char pad_54B[0x1]; // 0x54B - 0x54C
   float m_flDuration; // 0x54C - 0x550
   unsigned char pad_550[0x40]; // 0x550 - 0x590
   float m_flPathLength; // 0x590 - 0x594
   float m_flPathDuration; // 0x594 - 0x598
   unsigned char pad_598[0x8]; // 0x598 - 0x5A0
}; // size - 0x5A0


class CBtNode /* "server" */
{
public:
   unsigned char pad_0[0x58]; // 0x0 - 0x58
}; // size - 0x58


class CBasePulseGraphInstance /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0xD0]; // 0x0 - 0xD0
}; // size - 0xD0


class CEntitySubclassVDataBase /* "server" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
}; // size - 0x28


class CItem /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   unsigned char pad_890[0x8]; // 0x890 - 0x898
   CEntityIOOutput m_OnPlayerTouch; // 0x898 - 0x8C0
   bool m_bActivateWhenAtRest; // 0x8C0 - 0x8C1
   unsigned char pad_8C1[0x7]; // 0x8C1 - 0x8C8
   CEntityIOOutput m_OnCacheInteraction; // 0x8C8 - 0x8F0
   CEntityIOOutput m_OnPlayerPickup; // 0x8F0 - 0x918
   CEntityIOOutput m_OnGlovePulled; // 0x918 - 0x940
   Vector m_vOriginalSpawnOrigin; // 0x940 - 0x94C
   QAngle m_vOriginalSpawnAngles; // 0x94C - 0x958
   bool m_bPhysStartAsleep; // 0x958 - 0x959
   unsigned char pad_959[0xF]; // 0x959 - 0x968
}; // size - 0x968


class CBaseCSGrenade /* "server" */ : public CCSWeaponBase /* "server" */
{
public:
   unsigned char pad_DD8[0x20]; // 0xDD8 - 0xDF8
   bool m_bRedraw; // 0xDF8 - 0xDF9
   bool m_bIsHeldByPlayer; // 0xDF9 - 0xDFA
   bool m_bPinPulled; // 0xDFA - 0xDFB
   bool m_bJumpThrow; // 0xDFB - 0xDFC
   EGrenadeThrowState m_eThrowStatus; // 0xDFC - 0xE00
   GameTime_t m_fThrowTime; // 0xE00 - 0xE04
   float m_flThrowStrength; // 0xE04 - 0xE08
   float m_flThrowStrengthApproach; // 0xE08 - 0xE0C
   GameTime_t m_fDropTime; // 0xE0C - 0xE10
   unsigned char pad_E10[0x8]; // 0xE10 - 0xE18
}; // size - 0xE18


class CNavVolume /* "navlib" */
{
public:
   unsigned char pad_0[0x70]; // 0x0 - 0x70
}; // size - 0x70


class C_BaseCSGrenade /* "client" */ : public C_CSWeaponBase /* "client" */
{
public:
   bool m_bClientPredictDelete; // 0x1940 - 0x1941
   unsigned char pad_1941[0x27]; // 0x1941 - 0x1968
   bool m_bRedraw; // 0x1968 - 0x1969
   bool m_bIsHeldByPlayer; // 0x1969 - 0x196A
   bool m_bPinPulled; // 0x196A - 0x196B
   bool m_bJumpThrow; // 0x196B - 0x196C
   EGrenadeThrowState m_eThrowStatus; // 0x196C - 0x1970
   GameTime_t m_fThrowTime; // 0x1970 - 0x1974
   float m_flThrowStrength; // 0x1974 - 0x1978
   float m_flThrowStrengthApproach; // 0x1978 - 0x197C
   GameTime_t m_fDropTime; // 0x197C - 0x1980
   unsigned char pad_1980[0x10]; // 0x1980 - 0x1990
}; // size - 0x1990


class C_PointEntity /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x540]; // 0x0 - 0x540
}; // size - 0x540


class CBaseConstraint /* "modellib" */ : public CBoneConstraintBase /* "modellib" */
{
public:
   CUtlString m_name; // 0x28 - 0x30
   Vector m_vUpVector; // 0x30 - 0x3C
   unsigned char pad_3C[0x4]; // 0x3C - 0x40
   CUtlVector< CConstraintSlave > m_slaves; // 0x40 - 0x58
   CUtlVector< CConstraintTarget > m_targets; // 0x58 - 0x70
}; // size - 0x70


class CBasePlatTrain /* "server" */ : public CBaseToggle /* "server" */
{
public:
   CUtlSymbolLarge m_NoiseMoving; // 0x780 - 0x788
   CUtlSymbolLarge m_NoiseArrived; // 0x788 - 0x790
   unsigned char pad_790[0x8]; // 0x790 - 0x798
   float m_volume; // 0x798 - 0x79C
   float m_flTWidth; // 0x79C - 0x7A0
   float m_flTLength; // 0x7A0 - 0x7A4
   unsigned char pad_7A4[0x4]; // 0x7A4 - 0x7A8
}; // size - 0x7A8


class CPlayerControllerComponent /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30
   unsigned char pad_30[0x10]; // 0x30 - 0x40
}; // size - 0x40


class CRuleEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   CUtlSymbolLarge m_iszMaster; // 0x700 - 0x708
}; // size - 0x708


class CMarkupVolume /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bEnabled; // 0x700 - 0x701
   unsigned char pad_701[0x7]; // 0x701 - 0x708
}; // size - 0x708


class CSimpleSimTimer /* "server" */
{
public:
   GameTime_t m_next; // 0x0 - 0x4
   WorldGroupId_t m_nWorldGroupId; // 0x4 - 0x8
}; // size - 0x8


class C_CSPlayerPawnBase /* "client" */ : public C_BasePlayerPawn /* "client" */
{
public:
   unsigned char pad_1238[0x18]; // 0x1238 - 0x1250
   CCSPlayer_PingServices* m_pPingServices; // 0x1250 - 0x1258
   CPlayer_ViewModelServices* m_pViewModelServices; // 0x1258 - 0x1260
   float32 m_fRenderingClipPlane[4]; // 0x1260 - 0x1270
   int32_t m_nLastClipPlaneSetupFrame; // 0x1270 - 0x1274
   Vector m_vecLastClipCameraPos; // 0x1274 - 0x1280
   Vector m_vecLastClipCameraForward; // 0x1280 - 0x128C
   bool m_bClipHitStaticWorld; // 0x128C - 0x128D
   bool m_bCachedPlaneIsValid; // 0x128D - 0x128E
   unsigned char pad_128E[0x2]; // 0x128E - 0x1290
   C_CSWeaponBase* m_pClippingWeapon; // 0x1290 - 0x1298
   CSPlayerState m_previousPlayerState; // 0x1298 - 0x129C
   float m_flLastCollisionCeiling; // 0x129C - 0x12A0
   float m_flLastCollisionCeilingChangeTime; // 0x12A0 - 0x12A4
   unsigned char pad_12A4[0x1C]; // 0x12A4 - 0x12C0
   GameTime_t m_grenadeParameterStashTime; // 0x12C0 - 0x12C4
   bool m_bGrenadeParametersStashed; // 0x12C4 - 0x12C5
   unsigned char pad_12C5[0x3]; // 0x12C5 - 0x12C8
   QAngle m_angStashedShootAngles; // 0x12C8 - 0x12D4
   Vector m_vecStashedGrenadeThrowPosition; // 0x12D4 - 0x12E0
   Vector m_vecStashedVelocity; // 0x12E0 - 0x12EC
   QAngle m_angShootAngleHistory[2]; // 0x12EC - 0x1304
   Vector m_vecThrowPositionHistory[2]; // 0x1304 - 0x131C
   Vector m_vecVelocityHistory[2]; // 0x131C - 0x1334
   unsigned char pad_1334[0x4]; // 0x1334 - 0x1338
   QAngle m_thirdPersonHeading; // 0x1338 - 0x1344
   unsigned char pad_1344[0xC]; // 0x1344 - 0x1350
   float m_flSlopeDropOffset; // 0x1350 - 0x1354
   unsigned char pad_1354[0xC]; // 0x1354 - 0x1360
   float m_flSlopeDropHeight; // 0x1360 - 0x1364
   unsigned char pad_1364[0xC]; // 0x1364 - 0x1370
   Vector m_vHeadConstraintOffset; // 0x1370 - 0x137C
   unsigned char pad_137C[0xC]; // 0x137C - 0x1388
   bool m_bIsScoped; // 0x1388 - 0x1389
   bool m_bIsWalking; // 0x1389 - 0x138A
   bool m_bResumeZoom; // 0x138A - 0x138B
   unsigned char pad_138B[0x1]; // 0x138B - 0x138C
   CSPlayerState m_iPlayerState; // 0x138C - 0x1390
   bool m_bIsDefusing; // 0x1390 - 0x1391
   bool m_bIsGrabbingHostage; // 0x1391 - 0x1392
   unsigned char pad_1392[0x2]; // 0x1392 - 0x1394
   CSPlayerBlockingUseAction_t m_iBlockingUseActionInProgress; // 0x1394 - 0x1398
   bool m_bIsRescuing; // 0x1398 - 0x1399
   unsigned char pad_1399[0x3]; // 0x1399 - 0x139C
   GameTime_t m_fImmuneToGunGameDamageTime; // 0x139C - 0x13A0
   GameTime_t m_fImmuneToGunGameDamageTimeLast; // 0x13A0 - 0x13A4
   bool m_bGunGameImmunity; // 0x13A4 - 0x13A5
   bool m_bHasMovedSinceSpawn; // 0x13A5 - 0x13A6
   unsigned char pad_13A6[0x2]; // 0x13A6 - 0x13A8
   uint32_t m_unTotalRoundDamageDealt; // 0x13A8 - 0x13AC
   float m_fMolotovUseTime; // 0x13AC - 0x13B0
   float m_fMolotovDamageTime; // 0x13B0 - 0x13B4
   int32_t m_nWhichBombZone; // 0x13B4 - 0x13B8
   bool m_bInNoDefuseArea; // 0x13B8 - 0x13B9
   unsigned char pad_13B9[0x3]; // 0x13B9 - 0x13BC
   int32_t m_iThrowGrenadeCounter; // 0x13BC - 0x13C0
   bool m_bWaitForNoAttack; // 0x13C0 - 0x13C1
   unsigned char pad_13C1[0x3]; // 0x13C1 - 0x13C4
   float m_flGuardianTooFarDistFrac; // 0x13C4 - 0x13C8
   GameTime_t m_flDetectedByEnemySensorTime; // 0x13C8 - 0x13CC
   float m_flNextGuardianTooFarWarning; // 0x13CC - 0x13D0
   bool m_bSuppressGuardianTooFarWarningAudio; // 0x13D0 - 0x13D1
   bool m_bKilledByTaser; // 0x13D1 - 0x13D2
   unsigned char pad_13D2[0x2]; // 0x13D2 - 0x13D4
   int32_t m_iMoveState; // 0x13D4 - 0x13D8
   bool m_bCanMoveDuringFreezePeriod; // 0x13D8 - 0x13D9
   unsigned char pad_13D9[0x3]; // 0x13D9 - 0x13DC
   float m_flLowerBodyYawTarget; // 0x13DC - 0x13E0
   bool m_bStrafing; // 0x13E0 - 0x13E1
   unsigned char pad_13E1[0x3]; // 0x13E1 - 0x13E4
   GameTime_t m_flLastSpawnTimeIndex; // 0x13E4 - 0x13E8
   GameTime_t m_flEmitSoundTime; // 0x13E8 - 0x13EC
   int32_t m_iAddonBits; // 0x13EC - 0x13F0
   int32_t m_iPrimaryAddon; // 0x13F0 - 0x13F4
   int32_t m_iSecondaryAddon; // 0x13F4 - 0x13F8
   int32_t m_iProgressBarDuration; // 0x13F8 - 0x13FC
   float m_flProgressBarStartTime; // 0x13FC - 0x1400
   int32_t m_iDirection; // 0x1400 - 0x1404
   int32_t m_iShotsFired; // 0x1404 - 0x1408
   bool m_bNightVisionOn; // 0x1408 - 0x1409
   bool m_bHasNightVision; // 0x1409 - 0x140A
   unsigned char pad_140A[0x2]; // 0x140A - 0x140C
   float m_flVelocityModifier; // 0x140C - 0x1410
   float m_flHitHeading; // 0x1410 - 0x1414
   int32_t m_nHitBodyPart; // 0x1414 - 0x1418
   int32_t m_iStartAccount; // 0x1418 - 0x141C
   Vector m_vecIntroStartEyePosition; // 0x141C - 0x1428
   Vector m_vecIntroStartPlayerForward; // 0x1428 - 0x1434
   GameTime_t m_flClientDeathTime; // 0x1434 - 0x1438
   float m_flNightVisionAlpha; // 0x1438 - 0x143C
   bool m_bScreenTearFrameCaptured; // 0x143C - 0x143D
   unsigned char pad_143D[0x3]; // 0x143D - 0x1440
   float m_flFlashBangTime; // 0x1440 - 0x1444
   float m_flFlashScreenshotAlpha; // 0x1444 - 0x1448
   float m_flFlashOverlayAlpha; // 0x1448 - 0x144C
   bool m_bFlashBuildUp; // 0x144C - 0x144D
   bool m_bFlashDspHasBeenCleared; // 0x144D - 0x144E
   bool m_bFlashScreenshotHasBeenGrabbed; // 0x144E - 0x144F
   unsigned char pad_144F[0x1]; // 0x144F - 0x1450
   float m_flFlashMaxAlpha; // 0x1450 - 0x1454
   float m_flFlashDuration; // 0x1454 - 0x1458
   Vector m_lastStandingPos; // 0x1458 - 0x1464
   Vector m_vecLastMuzzleFlashPos; // 0x1464 - 0x1470
   QAngle m_angLastMuzzleFlashAngle; // 0x1470 - 0x147C
   CHandle< C_BaseEntity > m_hMuzzleFlashShape; // 0x147C - 0x1480
   int32_t m_iHealthBarRenderMaskIndex; // 0x1480 - 0x1484
   float m_flHealthFadeValue; // 0x1484 - 0x1488
   float m_flHealthFadeAlpha; // 0x1488 - 0x148C
   int32_t m_nMyCollisionGroup; // 0x148C - 0x1490
   float m_ignoreLadderJumpTime; // 0x1490 - 0x1494
   unsigned char pad_1494[0x4]; // 0x1494 - 0x1498
   CountdownTimer m_ladderSurpressionTimer; // 0x1498 - 0x14B0
   Vector m_lastLadderNormal; // 0x14B0 - 0x14BC
   Vector m_lastLadderPos; // 0x14BC - 0x14C8
   unsigned char pad_14C8[0x8]; // 0x14C8 - 0x14D0
   float m_flDeathCCWeight; // 0x14D0 - 0x14D4
   bool m_bOldIsScoped; // 0x14D4 - 0x14D5
   unsigned char pad_14D5[0x3]; // 0x14D5 - 0x14D8
   float m_flPrevRoundEndTime; // 0x14D8 - 0x14DC
   float m_flPrevMatchEndTime; // 0x14DC - 0x14E0
   uint16_t m_unCurrentEquipmentValue; // 0x14E0 - 0x14E2
   uint16_t m_unRoundStartEquipmentValue; // 0x14E2 - 0x14E4
   uint16_t m_unFreezetimeEndEquipmentValue; // 0x14E4 - 0x14E6
   unsigned char pad_14E6[0x2]; // 0x14E6 - 0x14E8
   Vector m_vecThirdPersonViewPositionOverride; // 0x14E8 - 0x14F4
   int32_t m_nHeavyAssaultSuitCooldownRemaining; // 0x14F4 - 0x14F8
   int32_t m_ArmorValue; // 0x14F8 - 0x14FC
   unsigned char pad_14FC[0x4]; // 0x14FC - 0x1500
   QAngle m_angEyeAngles; // 0x1500 - 0x150C
   unsigned char pad_150C[0xC]; // 0x150C - 0x1518
   float m_fNextThinkPushAway; // 0x1518 - 0x151C
   bool m_bShouldAutobuyDMWeapons; // 0x151C - 0x151D
   bool m_bShouldAutobuyNow; // 0x151D - 0x151E
   bool m_bHud_MiniScoreHidden; // 0x151E - 0x151F
   bool m_bHud_RadarHidden; // 0x151F - 0x1520
   CEntityIndex m_nLastKillerIndex; // 0x1520 - 0x1524
   int32_t m_nLastConcurrentKilled; // 0x1524 - 0x1528
   int32_t m_nDeathCamMusic; // 0x1528 - 0x152C
   CEntityIndex m_iIDEntIndex; // 0x152C - 0x1530
   CountdownTimer m_delayTargetIDTimer; // 0x1530 - 0x1548
   CEntityIndex m_iTargetedWeaponEntIndex; // 0x1548 - 0x154C
   CEntityIndex m_iOldIDEntIndex; // 0x154C - 0x1550
   CountdownTimer m_holdTargetIDTimer; // 0x1550 - 0x1568
   unsigned char pad_1568[0x4]; // 0x1568 - 0x156C
   float m_flCurrentMusicStartTime; // 0x156C - 0x1570
   float m_flMusicRoundStartTime; // 0x1570 - 0x1574
   bool m_bDeferStartMusicOnWarmup; // 0x1574 - 0x1575
   unsigned char pad_1575[0x3]; // 0x1575 - 0x1578
   int32_t m_cycleLatch; // 0x1578 - 0x157C
   float m_serverIntendedCycle; // 0x157C - 0x1580
   uint32 m_vecPlayerPatchEconIndices[5]; // 0x1580 - 0x1594
   unsigned char pad_1594[0x8]; // 0x1594 - 0x159C
   bool m_bHideTargetID; // 0x159C - 0x159D
   unsigned char pad_159D[0x3]; // 0x159D - 0x15A0
   float m_nextTaserShakeTime; // 0x15A0 - 0x15A4
   float m_firstTaserShakeTime; // 0x15A4 - 0x15A8
   float m_flLastSmokeOverlayAlpha; // 0x15A8 - 0x15AC
   Vector m_vLastSmokeOverlayColor; // 0x15AC - 0x15B8
   ParticleIndex_t m_nPlayerSmokedFx; // 0x15B8 - 0x15BC
   float m_flNextMagDropTime; // 0x15BC - 0x15C0
   int32_t m_nLastMagDropAttachmentIndex; // 0x15C0 - 0x15C4
   unsigned char pad_15C4[0x4]; // 0x15C4 - 0x15C8
   CUtlVector< C_BulletHitModel* > m_vecBulletHitModels; // 0x15C8 - 0x15E0
   CUtlVector< C_PickUpModelSlerper* > m_vecPickupModelSlerpers; // 0x15E0 - 0x15F8
   Vector m_vecLastAliveLocalVelocity; // 0x15F8 - 0x1604
   unsigned char pad_1604[0x1C]; // 0x1604 - 0x1620
   EntitySpottedState_t m_entitySpottedState; // 0x1620 - 0x1638
   int32_t m_nSurvivalTeamNumber; // 0x1638 - 0x163C
   bool m_bGuardianShouldSprayCustomXMark; // 0x163C - 0x163D
   bool m_bHasDeathInfo; // 0x163D - 0x163E
   unsigned char pad_163E[0x2]; // 0x163E - 0x1640
   float m_flDeathInfoTime; // 0x1640 - 0x1644
   Vector m_vecDeathInfoOrigin; // 0x1644 - 0x1650
   bool m_bKilledByHeadshot; // 0x1650 - 0x1651
   unsigned char pad_1651[0x3]; // 0x1651 - 0x1654
   CHandle< CCSPlayerController > m_hOriginalController; // 0x1654 - 0x1658
   unsigned char pad_1658[0x48]; // 0x1658 - 0x16A0
}; // size - 0x16A0


class CSoundOpvarSetPointBase /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x4B0 - 0x4B1
   unsigned char pad_4B1[0x3]; // 0x4B1 - 0x4B4
   CEntityHandle m_hSource; // 0x4B4 - 0x4B8
   unsigned char pad_4B8[0x8]; // 0x4B8 - 0x4C0
   CUtlSymbolLarge m_iszSourceEntityName; // 0x4C0 - 0x4C8
   unsigned char pad_4C8[0x50]; // 0x4C8 - 0x518
   Vector m_vLastPosition; // 0x518 - 0x524
   unsigned char pad_524[0x4]; // 0x524 - 0x528
   CUtlSymbolLarge m_iszStackName; // 0x528 - 0x530
   CUtlSymbolLarge m_iszOperatorName; // 0x530 - 0x538
   CUtlSymbolLarge m_iszOpvarName; // 0x538 - 0x540
   int32_t m_iOpvarIndex; // 0x540 - 0x544
   bool m_bUseAutoCompare; // 0x544 - 0x545
   unsigned char pad_545[0x3]; // 0x545 - 0x548
}; // size - 0x548


class C_SoundOpvarSetPointBase /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   CUtlSymbolLarge m_iszStackName; // 0x540 - 0x548
   CUtlSymbolLarge m_iszOperatorName; // 0x548 - 0x550
   CUtlSymbolLarge m_iszOpvarName; // 0x550 - 0x558
   int32_t m_iOpvarIndex; // 0x558 - 0x55C
   bool m_bUseAutoCompare; // 0x55C - 0x55D
   unsigned char pad_55D[0x3]; // 0x55D - 0x560
}; // size - 0x560


class CBaseCSGrenadeProjectile /* "server" */ : public CBaseGrenade /* "server" */
{
public:
   Vector m_vInitialVelocity; // 0x9C8 - 0x9D4
   int32_t m_nBounces; // 0x9D4 - 0x9D8
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_nExplodeEffectIndex; // 0x9D8 - 0x9E0
   int32_t m_nExplodeEffectTickBegin; // 0x9E0 - 0x9E4
   Vector m_vecExplodeEffectOrigin; // 0x9E4 - 0x9F0
   uint8_t m_unOGSExtraFlags; // 0x9F0 - 0x9F1
   bool m_bDetonationRecorded; // 0x9F1 - 0x9F2
   unsigned char pad_9F2[0x2]; // 0x9F2 - 0x9F4
   GameTime_t m_flDetonateTime; // 0x9F4 - 0x9F8
   uint16_t m_nItemIndex; // 0x9F8 - 0x9FA
   unsigned char pad_9FA[0x2]; // 0x9FA - 0x9FC
   Vector m_vecOriginalSpawnLocation; // 0x9FC - 0xA08
   GameTime_t m_flLastBounceSoundTime; // 0xA08 - 0xA0C
   RotationVector m_vecGrenadeSpin; // 0xA0C - 0xA18
   Vector m_vecLastHitSurfaceNormal; // 0xA18 - 0xA24
   int32_t m_nTicksAtZeroVelocity; // 0xA24 - 0xA28
}; // size - 0xA28


class CCSGO_TeamIntroCharacterPosition /* "server" */ : public CCSGO_TeamPreviewCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC38]; // 0x0 - 0xC38
}; // size - 0xC38


class CConcreteAnimParameter /* "animgraphlib" */ : public CAnimParameterBase /* "animgraphlib" */
{
public:
   AnimParamButton_t m_previewButton; // 0x50 - 0x54
   AnimParamNetworkSetting m_eNetworkSetting; // 0x54 - 0x58
   bool m_bUseMostRecentValue; // 0x58 - 0x59
   bool m_bAutoReset; // 0x59 - 0x5A
   bool m_bGameWritable; // 0x5A - 0x5B
   bool m_bGraphWritable; // 0x5B - 0x5C
   unsigned char pad_5C[0x4]; // 0x5C - 0x60
}; // size - 0x60


class CEnvSoundscape /* "server" */ : public CServerOnlyEntity /* "server" */
{
public:
   CEntityIOOutput m_OnPlay; // 0x4B0 - 0x4D8
   float m_flRadius; // 0x4D8 - 0x4DC
   unsigned char pad_4DC[0x4]; // 0x4DC - 0x4E0
   CUtlSymbolLarge m_soundscapeName; // 0x4E0 - 0x4E8
   CUtlSymbolLarge m_soundEventName; // 0x4E8 - 0x4F0
   bool m_bOverrideWithEvent; // 0x4F0 - 0x4F1
   unsigned char pad_4F1[0x3]; // 0x4F1 - 0x4F4
   int32_t m_soundscapeIndex; // 0x4F4 - 0x4F8
   int32_t m_soundscapeEntityListId; // 0x4F8 - 0x4FC
   uint32_t m_soundEventHash; // 0x4FC - 0x500
   CUtlSymbolLarge m_positionNames[8]; // 0x500 - 0x540
   CHandle< CEnvSoundscape > m_hProxySoundscape; // 0x540 - 0x544
   bool m_bDisabled; // 0x544 - 0x545
   unsigned char pad_545[0x3]; // 0x545 - 0x548
}; // size - 0x548


class CModelPointEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_0[0x700]; // 0x0 - 0x700
}; // size - 0x700


class CTriggerMultiple /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   CEntityIOOutput m_OnTrigger; // 0x8A8 - 0x8D0
}; // size - 0x8D0


class C_BaseClientUIEntity /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_CC0[0x8]; // 0xCC0 - 0xCC8
   bool m_bEnabled; // 0xCC8 - 0xCC9
   unsigned char pad_CC9[0x7]; // 0xCC9 - 0xCD0
   CUtlSymbolLarge m_DialogXMLName; // 0xCD0 - 0xCD8
   CUtlSymbolLarge m_PanelClassName; // 0xCD8 - 0xCE0
   CUtlSymbolLarge m_PanelID; // 0xCE0 - 0xCE8
   unsigned char pad_CE8[0x8]; // 0xCE8 - 0xCF0
}; // size - 0xCF0


class C_CSGO_TeamIntroCharacterPosition /* "client" */ : public C_CSGO_TeamPreviewCharacterPosition /* "client" */
{
public:
   unsigned char pad_0[0x1270]; // 0x0 - 0x1270
}; // size - 0x1270


class C_CSGO_TeamPreviewCamera /* "client" */ : public C_CSGO_MapPreviewCameraPath /* "client" */
{
public:
   int32_t m_nVariant; // 0x5A0 - 0x5A4
   bool m_bDofEnabled; // 0x5A4 - 0x5A5
   unsigned char pad_5A5[0x3]; // 0x5A5 - 0x5A8
   float m_flDofNearBlurry; // 0x5A8 - 0x5AC
   float m_flDofNearCrisp; // 0x5AC - 0x5B0
   float m_flDofFarCrisp; // 0x5B0 - 0x5B4
   float m_flDofFarBlurry; // 0x5B4 - 0x5B8
   float m_flDofTiltToGround; // 0x5B8 - 0x5BC
   unsigned char pad_5BC[0x4]; // 0x5BC - 0x5C0
}; // size - 0x5C0


class MaterialParam_t /* "materialsystem2" */
{
public:
   CUtlString m_name; // 0x0 - 0x8
}; // size - 0x8


class CGameRules /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   char m_szQuestName[128]; // 0x8 - 0x88
   int32_t m_nQuestPhase; // 0x88 - 0x8C
   unsigned char pad_8C[0x4]; // 0x8C - 0x90
}; // size - 0x90


class C_GameRules /* "client" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class C_INIT_RemapParticleCountToScalar /* "particles" */ : public CParticleFunctionInitializer /* "particles" */
{
public:
   ParticleAttributeIndex_t m_nFieldOutput; // 0x1C0 - 0x1C4
   int32_t m_nInputMin; // 0x1C4 - 0x1C8
   int32_t m_nInputMax; // 0x1C8 - 0x1CC
   int32_t m_nScaleControlPoint; // 0x1CC - 0x1D0
   int32_t m_nScaleControlPointField; // 0x1D0 - 0x1D4
   float m_flOutputMin; // 0x1D4 - 0x1D8
   float m_flOutputMax; // 0x1D8 - 0x1DC
   ParticleSetMethod_t m_nSetMethod; // 0x1DC - 0x1E0
   bool m_bActiveRange; // 0x1E0 - 0x1E1
   bool m_bInvert; // 0x1E1 - 0x1E2
   bool m_bWrap; // 0x1E2 - 0x1E3
   unsigned char pad_1E3[0x1]; // 0x1E3 - 0x1E4
   float m_flRemapBias; // 0x1E4 - 0x1E8
   unsigned char pad_1E8[0x8]; // 0x1E8 - 0x1F0
}; // size - 0x1F0


class SpawnPoint /* "server" */ : public CServerOnlyPointEntity /* "server" */
{
public:
   int32_t m_iPriority; // 0x4B0 - 0x4B4
   bool m_bEnabled; // 0x4B4 - 0x4B5
   unsigned char pad_4B5[0x3]; // 0x4B5 - 0x4B8
   int32_t m_nType; // 0x4B8 - 0x4BC
   unsigned char pad_4BC[0x4]; // 0x4BC - 0x4C0
}; // size - 0x4C0


class CAnimMotorUpdaterBase /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlString m_name; // 0x10 - 0x18
   bool m_bDefault; // 0x18 - 0x19
   unsigned char pad_19[0x7]; // 0x19 - 0x20
}; // size - 0x20


class CAnimationGraphVisualizerPrimitiveBase /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CAnimationGraphVisualizerPrimitiveType m_Type; // 0x8 - 0xC
   AnimNodeID m_OwningAnimNodePaths[11]; // 0xC - 0x38
   int32_t m_nOwningAnimNodePathCount; // 0x38 - 0x3C
   unsigned char pad_3C[0x4]; // 0x3C - 0x40
}; // size - 0x40


class CBodyComponent /* "server" */ : public CEntityComponent /* "server" */
{
public:
   CGameSceneNode* m_pSceneNode; // 0x8 - 0x10
   unsigned char pad_10[0x10]; // 0x10 - 0x20
   CNetworkVarChainer __m_pChainEntity; // 0x20 - 0x48
   unsigned char pad_48[0x8]; // 0x48 - 0x50
}; // size - 0x50


class CBodyComponent /* "client" */ : public CEntityComponent /* "client" */
{
public:
   CGameSceneNode* m_pSceneNode; // 0x8 - 0x10
   unsigned char pad_10[0x10]; // 0x10 - 0x20
   CNetworkVarChainer __m_pChainEntity; // 0x20 - 0x48
   unsigned char pad_48[0x8]; // 0x48 - 0x50
}; // size - 0x50


class CPulseCell_BaseValue /* "pulse_runtime_lib" */ : public CPulseCell_Base /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x48]; // 0x0 - 0x48
}; // size - 0x48


class CPulseCell_Inflow_BaseEntrypoint /* "pulse_runtime_lib" */ : public CPulseCell_BaseFlow /* "pulse_runtime_lib" */
{
public:
   PulseRuntimeChunkIndex_t m_EntryChunk; // 0x48 - 0x4C
   unsigned char pad_4C[0x4]; // 0x4C - 0x50
   PulseRegisterMap_t m_RegisterMap; // 0x50 - 0x70
}; // size - 0x70


class C_DynamicProp /* "client" */ : public C_BreakableProp /* "client" */
{
public:
   bool m_bUseHitboxesForRenderBox; // 0xFD0 - 0xFD1
   bool m_bUseAnimGraph; // 0xFD1 - 0xFD2
   unsigned char pad_FD2[0x6]; // 0xFD2 - 0xFD8
   CEntityIOOutput m_pOutputAnimBegun; // 0xFD8 - 0x1000
   CEntityIOOutput m_pOutputAnimOver; // 0x1000 - 0x1028
   CEntityIOOutput m_pOutputAnimLoopCycleOver; // 0x1028 - 0x1050
   CEntityIOOutput m_OnAnimReachedStart; // 0x1050 - 0x1078
   CEntityIOOutput m_OnAnimReachedEnd; // 0x1078 - 0x10A0
   CUtlSymbolLarge m_iszDefaultAnim; // 0x10A0 - 0x10A8
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0x10A8 - 0x10AC
   bool m_bAnimateOnServer; // 0x10AC - 0x10AD
   bool m_bRandomizeCycle; // 0x10AD - 0x10AE
   bool m_bStartDisabled; // 0x10AE - 0x10AF
   bool m_bScriptedMovement; // 0x10AF - 0x10B0
   bool m_bFiredStartEndOutput; // 0x10B0 - 0x10B1
   bool m_bForceNpcExclude; // 0x10B1 - 0x10B2
   bool m_bCreateNonSolid; // 0x10B2 - 0x10B3
   bool m_bIsOverrideProp; // 0x10B3 - 0x10B4
   int32_t m_iInitialGlowState; // 0x10B4 - 0x10B8
   int32_t m_nGlowRange; // 0x10B8 - 0x10BC
   int32_t m_nGlowRangeMin; // 0x10BC - 0x10C0
   Color m_glowColor; // 0x10C0 - 0x10C4
   int32_t m_nGlowTeam; // 0x10C4 - 0x10C8
   int32_t m_iCachedFrameCount; // 0x10C8 - 0x10CC
   Vector m_vecCachedRenderMins; // 0x10CC - 0x10D8
   Vector m_vecCachedRenderMaxs; // 0x10D8 - 0x10E4
   unsigned char pad_10E4[0x4]; // 0x10E4 - 0x10E8
}; // size - 0x10E8


class CBaseRendererSource2 /* "particles" */ : public CParticleFunctionRenderer /* "particles" */
{
public:
   CParticleCollectionRendererFloatInput m_flRadiusScale; // 0x200 - 0x358
   CParticleCollectionRendererFloatInput m_flAlphaScale; // 0x358 - 0x4B0
   CParticleCollectionRendererFloatInput m_flRollScale; // 0x4B0 - 0x608
   ParticleAttributeIndex_t m_nAlpha2Field; // 0x608 - 0x60C
   unsigned char pad_60C[0x4]; // 0x60C - 0x610
   CParticleCollectionRendererVecInput m_vecColorScale; // 0x610 - 0xC68
   ParticleColorBlendType_t m_nColorBlendType; // 0xC68 - 0xC6C
   SpriteCardShaderType_t m_nShaderType; // 0xC6C - 0xC70
   CUtlString m_strShaderOverride; // 0xC70 - 0xC78
   CParticleCollectionRendererFloatInput m_flCenterXOffset; // 0xC78 - 0xDD0
   CParticleCollectionRendererFloatInput m_flCenterYOffset; // 0xDD0 - 0xF28
   float m_flBumpStrength; // 0xF28 - 0xF2C
   ParticleSequenceCropOverride_t m_nCropTextureOverride; // 0xF2C - 0xF30
   CUtlVector< TextureGroup_t > m_vecTexturesInput; // 0xF30 - 0xF48
   float m_flAnimationRate; // 0xF48 - 0xF4C
   AnimationType_t m_nAnimationType; // 0xF4C - 0xF50
   bool m_bAnimateInFPS; // 0xF50 - 0xF51
   unsigned char pad_F51[0x7]; // 0xF51 - 0xF58
   CParticleCollectionRendererFloatInput m_flSelfIllumAmount; // 0xF58 - 0x10B0
   CParticleCollectionRendererFloatInput m_flDiffuseAmount; // 0x10B0 - 0x1208
   int32_t m_nLightingControlPoint; // 0x1208 - 0x120C
   ParticleAttributeIndex_t m_nSelfIllumPerParticle; // 0x120C - 0x1210
   ParticleOutputBlendMode_t m_nOutputBlendMode; // 0x1210 - 0x1214
   bool m_bGammaCorrectVertexColors; // 0x1214 - 0x1215
   bool m_bSaturateColorPreAlphaBlend; // 0x1215 - 0x1216
   unsigned char pad_1216[0x2]; // 0x1216 - 0x1218
   CParticleCollectionRendererFloatInput m_flAddSelfAmount; // 0x1218 - 0x1370
   CParticleCollectionRendererFloatInput m_flDesaturation; // 0x1370 - 0x14C8
   CParticleCollectionRendererFloatInput m_flOverbrightFactor; // 0x14C8 - 0x1620
   int32_t m_nHSVShiftControlPoint; // 0x1620 - 0x1624
   ParticleFogType_t m_nFogType; // 0x1624 - 0x1628
   CParticleCollectionRendererFloatInput m_flFogAmount; // 0x1628 - 0x1780
   bool m_bTintByFOW; // 0x1780 - 0x1781
   bool m_bTintByGlobalLight; // 0x1781 - 0x1782
   unsigned char pad_1782[0x2]; // 0x1782 - 0x1784
   SpriteCardPerParticleScale_t m_nPerParticleAlphaReference; // 0x1784 - 0x1788
   SpriteCardPerParticleScale_t m_nPerParticleAlphaRefWindow; // 0x1788 - 0x178C
   ParticleAlphaReferenceType_t m_nAlphaReferenceType; // 0x178C - 0x1790
   CParticleCollectionRendererFloatInput m_flAlphaReferenceSoftness; // 0x1790 - 0x18E8
   CParticleCollectionRendererFloatInput m_flSourceAlphaValueToMapToZero; // 0x18E8 - 0x1A40
   CParticleCollectionRendererFloatInput m_flSourceAlphaValueToMapToOne; // 0x1A40 - 0x1B98
   bool m_bRefract; // 0x1B98 - 0x1B99
   bool m_bRefractSolid; // 0x1B99 - 0x1B9A
   unsigned char pad_1B9A[0x6]; // 0x1B9A - 0x1BA0
   CParticleCollectionRendererFloatInput m_flRefractAmount; // 0x1BA0 - 0x1CF8
   int32_t m_nRefractBlurRadius; // 0x1CF8 - 0x1CFC
   BlurFilterType_t m_nRefractBlurType; // 0x1CFC - 0x1D00
   bool m_bOnlyRenderInEffectsBloomPass; // 0x1D00 - 0x1D01
   bool m_bOnlyRenderInEffectsWaterPass; // 0x1D01 - 0x1D02
   bool m_bUseMixedResolutionRendering; // 0x1D02 - 0x1D03
   bool m_bOnlyRenderInEffecsGameOverlay; // 0x1D03 - 0x1D04
   char m_stencilTestID[128]; // 0x1D04 - 0x1D84
   bool m_bStencilTestExclude; // 0x1D84 - 0x1D85
   char m_stencilWriteID[128]; // 0x1D85 - 0x1E05
   bool m_bWriteStencilOnDepthPass; // 0x1E05 - 0x1E06
   bool m_bWriteStencilOnDepthFail; // 0x1E06 - 0x1E07
   bool m_bReverseZBuffering; // 0x1E07 - 0x1E08
   bool m_bDisableZBuffering; // 0x1E08 - 0x1E09
   unsigned char pad_1E09[0x3]; // 0x1E09 - 0x1E0C
   ParticleDepthFeatheringMode_t m_nFeatheringMode; // 0x1E0C - 0x1E10
   CParticleCollectionRendererFloatInput m_flFeatheringMinDist; // 0x1E10 - 0x1F68
   CParticleCollectionRendererFloatInput m_flFeatheringMaxDist; // 0x1F68 - 0x20C0
   CParticleCollectionRendererFloatInput m_flFeatheringFilter; // 0x20C0 - 0x2218
   float m_flDepthBias; // 0x2218 - 0x221C
   ParticleSortingChoiceList_t m_nSortMethod; // 0x221C - 0x2220
   bool m_bBlendFramesSeq0; // 0x2220 - 0x2221
   bool m_bMaxLuminanceBlendingSequence0; // 0x2221 - 0x2222
   unsigned char pad_2222[0x24E]; // 0x2222 - 0x2470
}; // size - 0x2470


class CFuncPlat /* "server" */ : public CBasePlatTrain /* "server" */
{
public:
   CUtlSymbolLarge m_sNoise; // 0x7A8 - 0x7B0
}; // size - 0x7B0


class CLightEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   CLightComponent* m_CLightComponent; // 0x700 - 0x708
}; // size - 0x708


class CMarkupVolumeTagged /* "server" */ : public CMarkupVolume /* "server" */
{
public:
   unsigned char pad_708[0x30]; // 0x708 - 0x738
   bool m_bIsGroup; // 0x738 - 0x739
   bool m_bGroupByPrefab; // 0x739 - 0x73A
   bool m_bGroupByVolume; // 0x73A - 0x73B
   bool m_bGroupOtherGroups; // 0x73B - 0x73C
   bool m_bIsInGroup; // 0x73C - 0x73D
   unsigned char pad_73D[0x3]; // 0x73D - 0x740
}; // size - 0x740


class CParticleFloatInput /* "particleslib" */ : public CParticleInput /* "particleslib" */
{
public:
   ParticleFloatType_t m_nType; // 0x10 - 0x14
   ParticleFloatMapType_t m_nMapType; // 0x14 - 0x18
   float m_flLiteralValue; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
   CParticleNamedValueRef m_NamedValue; // 0x20 - 0x60
   int32_t m_nControlPoint; // 0x60 - 0x64
   ParticleAttributeIndex_t m_nScalarAttribute; // 0x64 - 0x68
   ParticleAttributeIndex_t m_nVectorAttribute; // 0x68 - 0x6C
   int32_t m_nVectorComponent; // 0x6C - 0x70
   float m_flRandomMin; // 0x70 - 0x74
   float m_flRandomMax; // 0x74 - 0x78
   bool m_bHasRandomSignFlip; // 0x78 - 0x79
   unsigned char pad_79[0x3]; // 0x79 - 0x7C
   int32_t m_nRandomSeed; // 0x7C - 0x80
   ParticleFloatRandomMode_t m_nRandomMode; // 0x80 - 0x84
   unsigned char pad_84[0x4]; // 0x84 - 0x88
   float m_flLOD0; // 0x88 - 0x8C
   float m_flLOD1; // 0x8C - 0x90
   float m_flLOD2; // 0x90 - 0x94
   float m_flLOD3; // 0x94 - 0x98
   ParticleAttributeIndex_t m_nNoiseInputVectorAttribute; // 0x98 - 0x9C
   float m_flNoiseOutputMin; // 0x9C - 0xA0
   float m_flNoiseOutputMax; // 0xA0 - 0xA4
   float m_flNoiseScale; // 0xA4 - 0xA8
   Vector m_vecNoiseOffsetRate; // 0xA8 - 0xB4
   float m_flNoiseOffset; // 0xB4 - 0xB8
   int32_t m_nNoiseOctaves; // 0xB8 - 0xBC
   PFNoiseTurbulence_t m_nNoiseTurbulence; // 0xBC - 0xC0
   PFNoiseType_t m_nNoiseType; // 0xC0 - 0xC4
   PFNoiseModifier_t m_nNoiseModifier; // 0xC4 - 0xC8
   float m_flNoiseTurbulenceScale; // 0xC8 - 0xCC
   float m_flNoiseTurbulenceMix; // 0xCC - 0xD0
   float m_flNoiseImgPreviewScale; // 0xD0 - 0xD4
   bool m_bNoiseImgPreviewLive; // 0xD4 - 0xD5
   unsigned char pad_D5[0xB]; // 0xD5 - 0xE0
   float m_flNoCameraFallback; // 0xE0 - 0xE4
   bool m_bUseBoundsCenter; // 0xE4 - 0xE5
   unsigned char pad_E5[0x3]; // 0xE5 - 0xE8
   ParticleFloatInputMode_t m_nInputMode; // 0xE8 - 0xEC
   float m_flMultFactor; // 0xEC - 0xF0
   float m_flInput0; // 0xF0 - 0xF4
   float m_flInput1; // 0xF4 - 0xF8
   float m_flOutput0; // 0xF8 - 0xFC
   float m_flOutput1; // 0xFC - 0x100
   float m_flNotchedRangeMin; // 0x100 - 0x104
   float m_flNotchedRangeMax; // 0x104 - 0x108
   float m_flNotchedOutputOutside; // 0x108 - 0x10C
   float m_flNotchedOutputInside; // 0x10C - 0x110
   ParticleFloatBiasType_t m_nBiasType; // 0x110 - 0x114
   float m_flBiasParameter; // 0x114 - 0x118
   CPiecewiseCurve m_Curve; // 0x118 - 0x158
}; // size - 0x158


class C_LightEntity /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   CLightComponent* m_CLightComponent; // 0xCC0 - 0xCC8
}; // size - 0xCC8


class CAnimActionUpdater /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
}; // size - 0x18


class CBasePlayerPawn /* "server" */ : public CBaseCombatCharacter /* "server" */
{
public:
   CPlayer_WeaponServices* m_pWeaponServices; // 0x9D0 - 0x9D8
   CPlayer_ItemServices* m_pItemServices; // 0x9D8 - 0x9E0
   CPlayer_AutoaimServices* m_pAutoaimServices; // 0x9E0 - 0x9E8
   CPlayer_ObserverServices* m_pObserverServices; // 0x9E8 - 0x9F0
   CPlayer_WaterServices* m_pWaterServices; // 0x9F0 - 0x9F8
   CPlayer_UseServices* m_pUseServices; // 0x9F8 - 0xA00
   CPlayer_FlashlightServices* m_pFlashlightServices; // 0xA00 - 0xA08
   CPlayer_CameraServices* m_pCameraServices; // 0xA08 - 0xA10
   CPlayer_MovementServices* m_pMovementServices; // 0xA10 - 0xA18
   unsigned char pad_A18[0x8]; // 0xA18 - 0xA20
   CUtlVectorEmbeddedNetworkVar< ViewAngleServerChange_t > m_ServerViewAngleChanges; // 0xA20 - 0xA70
   uint32_t m_nHighestGeneratedServerViewAngleChangeIndex; // 0xA70 - 0xA74
   QAngle v_angle; // 0xA74 - 0xA80
   QAngle v_anglePrevious; // 0xA80 - 0xA8C
   uint32_t m_iHideHUD; // 0xA8C - 0xA90
   sky3dparams_t m_skybox3d; // 0xA90 - 0xB20
   GameTime_t m_fTimeLastHurt; // 0xB20 - 0xB24
   GameTime_t m_flDeathTime; // 0xB24 - 0xB28
   GameTime_t m_fNextSuicideTime; // 0xB28 - 0xB2C
   bool m_fInitHUD; // 0xB2C - 0xB2D
   unsigned char pad_B2D[0x3]; // 0xB2D - 0xB30
   CAI_Expresser* m_pExpresser; // 0xB30 - 0xB38
   CHandle< CBasePlayerController > m_hController; // 0xB38 - 0xB3C
   unsigned char pad_B3C[0x4]; // 0xB3C - 0xB40
   float m_fHltvReplayDelay; // 0xB40 - 0xB44
   float m_fHltvReplayEnd; // 0xB44 - 0xB48
   CEntityIndex m_iHltvReplayEntity; // 0xB48 - 0xB4C
   unsigned char pad_B4C[0x4]; // 0xB4C - 0xB50
}; // size - 0xB50


class CParticleFunctionEmitter /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   int32_t m_nEmitterIndex; // 0x1B8 - 0x1BC
   unsigned char pad_1BC[0x4]; // 0x1BC - 0x1C0
}; // size - 0x1C0


class CPhysicsProp /* "server" */ : public CBreakableProp /* "server" */
{
public:
   unsigned char pad_A08[0x8]; // 0xA08 - 0xA10
   CEntityIOOutput m_MotionEnabled; // 0xA10 - 0xA38
   CEntityIOOutput m_OnAwakened; // 0xA38 - 0xA60
   CEntityIOOutput m_OnAwake; // 0xA60 - 0xA88
   CEntityIOOutput m_OnAsleep; // 0xA88 - 0xAB0
   CEntityIOOutput m_OnPlayerUse; // 0xAB0 - 0xAD8
   CEntityIOOutput m_OnPlayerPickup; // 0xAD8 - 0xB00
   CEntityIOOutput m_OnOutOfWorld; // 0xB00 - 0xB28
   float m_massScale; // 0xB28 - 0xB2C
   float m_inertiaScale; // 0xB2C - 0xB30
   float m_buoyancyScale; // 0xB30 - 0xB34
   int32_t m_damageType; // 0xB34 - 0xB38
   int32_t m_damageToEnableMotion; // 0xB38 - 0xB3C
   float m_flForceToEnableMotion; // 0xB3C - 0xB40
   bool m_bThrownByPlayer; // 0xB40 - 0xB41
   bool m_bDroppedByPlayer; // 0xB41 - 0xB42
   bool m_bTouchedByPlayer; // 0xB42 - 0xB43
   bool m_bFirstCollisionAfterLaunch; // 0xB43 - 0xB44
   int32_t m_iExploitableByPlayer; // 0xB44 - 0xB48
   bool m_bHasBeenAwakened; // 0xB48 - 0xB49
   bool m_bIsOverrideProp; // 0xB49 - 0xB4A
   unsigned char pad_B4A[0x2]; // 0xB4A - 0xB4C
   GameTime_t m_fNextCheckDisableMotionContactsTime; // 0xB4C - 0xB50
   int32_t m_iInitialGlowState; // 0xB50 - 0xB54
   int32_t m_nGlowRange; // 0xB54 - 0xB58
   int32_t m_nGlowRangeMin; // 0xB58 - 0xB5C
   Color m_glowColor; // 0xB5C - 0xB60
   bool m_bForceNavIgnore; // 0xB60 - 0xB61
   bool m_bNoNavmeshBlocker; // 0xB61 - 0xB62
   bool m_bForceNpcExclude; // 0xB62 - 0xB63
   bool m_bShouldAutoConvertBackFromDebris; // 0xB63 - 0xB64
   bool m_bMuteImpactEffects; // 0xB64 - 0xB65
   unsigned char pad_B65[0x7]; // 0xB65 - 0xB6C
   bool m_bAcceptDamageFromHeldObjects; // 0xB6C - 0xB6D
   bool m_bEnableUseOutput; // 0xB6D - 0xB6E
   bool m_bAwake; // 0xB6E - 0xB6F
   unsigned char pad_B6F[0x1]; // 0xB6F - 0xB70
   int32_t m_nCollisionGroupOverride; // 0xB70 - 0xB74
   unsigned char pad_B74[0x4]; // 0xB74 - 0xB78
}; // size - 0xB78


class CPlayer_CameraServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   QAngle m_vecCsViewPunchAngle; // 0x40 - 0x4C
   GameTick_t m_nCsViewPunchAngleTick; // 0x4C - 0x50
   float m_flCsViewPunchAngleTickRatio; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
   C_fogplayerparams_t m_PlayerFog; // 0x58 - 0x98
   CHandle< C_ColorCorrection > m_hColorCorrectionCtrl; // 0x98 - 0x9C
   CHandle< C_BaseEntity > m_hViewEntity; // 0x9C - 0xA0
   CHandle< C_TonemapController2 > m_hTonemapController; // 0xA0 - 0xA4
   unsigned char pad_A4[0x4]; // 0xA4 - 0xA8
   audioparams_t m_audio; // 0xA8 - 0x120
   C_NetworkUtlVectorBase< CHandle< C_PostProcessingVolume > > m_PostProcessingVolumes; // 0x120 - 0x138
   float m_flOldPlayerZ; // 0x138 - 0x13C
   float m_flOldPlayerViewOffsetZ; // 0x13C - 0x140
   fogparams_t m_CurrentFog; // 0x140 - 0x1A8
   CHandle< C_FogController > m_hOldFogController; // 0x1A8 - 0x1AC
   bool m_bOverrideFogColor[5]; // 0x1AC - 0x1B1
   Color m_OverrideFogColor[5]; // 0x1B1 - 0x1C5
   bool m_bOverrideFogStartEnd[5]; // 0x1C5 - 0x1CA
   unsigned char pad_1CA[0x2]; // 0x1CA - 0x1CC
   float32 m_fOverrideFogStart[5]; // 0x1CC - 0x1E0
   float32 m_fOverrideFogEnd[5]; // 0x1E0 - 0x1F4
   CHandle< C_PostProcessingVolume > m_hActivePostProcessingVolume; // 0x1F4 - 0x1F8
   QAngle m_angDemoViewAngles; // 0x1F8 - 0x204
   unsigned char pad_204[0xC]; // 0x204 - 0x210
}; // size - 0x210


class CPlayer_CameraServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   QAngle m_vecCsViewPunchAngle; // 0x40 - 0x4C
   GameTick_t m_nCsViewPunchAngleTick; // 0x4C - 0x50
   float m_flCsViewPunchAngleTickRatio; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
   fogplayerparams_t m_PlayerFog; // 0x58 - 0x98
   CHandle< CColorCorrection > m_hColorCorrectionCtrl; // 0x98 - 0x9C
   CHandle< CBaseEntity > m_hViewEntity; // 0x9C - 0xA0
   CHandle< CTonemapController2 > m_hTonemapController; // 0xA0 - 0xA4
   unsigned char pad_A4[0x4]; // 0xA4 - 0xA8
   audioparams_t m_audio; // 0xA8 - 0x120
   CNetworkUtlVectorBase< CHandle< CPostProcessingVolume > > m_PostProcessingVolumes; // 0x120 - 0x138
   float m_flOldPlayerZ; // 0x138 - 0x13C
   float m_flOldPlayerViewOffsetZ; // 0x13C - 0x140
   unsigned char pad_140[0x18]; // 0x140 - 0x158
   CUtlVector< CHandle< CEnvSoundscapeTriggerable > > m_hTriggerSoundscapeList; // 0x158 - 0x170
}; // size - 0x170


class CSoundEventEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bStartOnSpawn; // 0x4B0 - 0x4B1
   bool m_bToLocalPlayer; // 0x4B1 - 0x4B2
   bool m_bStopOnNew; // 0x4B2 - 0x4B3
   bool m_bSaveRestore; // 0x4B3 - 0x4B4
   bool m_bSavedIsPlaying; // 0x4B4 - 0x4B5
   unsigned char pad_4B5[0x3]; // 0x4B5 - 0x4B8
   float m_flSavedElapsedTime; // 0x4B8 - 0x4BC
   unsigned char pad_4BC[0x4]; // 0x4BC - 0x4C0
   CUtlSymbolLarge m_iszSourceEntityName; // 0x4C0 - 0x4C8
   CUtlSymbolLarge m_iszAttachmentName; // 0x4C8 - 0x4D0
   CEntityOutputTemplate< uint64 > m_onGUIDChanged; // 0x4D0 - 0x4F8
   CEntityIOOutput m_onSoundFinished; // 0x4F8 - 0x520
   unsigned char pad_520[0x20]; // 0x520 - 0x540
   CUtlSymbolLarge m_iszSoundName; // 0x540 - 0x548
   unsigned char pad_548[0x8]; // 0x548 - 0x550
   CEntityHandle m_hSource; // 0x550 - 0x554
   unsigned char pad_554[0x4]; // 0x554 - 0x558
}; // size - 0x558


class CSprite /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hSpriteMaterial; // 0x700 - 0x708
   CHandle< CBaseEntity > m_hAttachedToEntity; // 0x708 - 0x70C
   AttachmentHandle_t m_nAttachment; // 0x70C - 0x70D
   unsigned char pad_70D[0x3]; // 0x70D - 0x710
   float m_flSpriteFramerate; // 0x710 - 0x714
   float m_flFrame; // 0x714 - 0x718
   GameTime_t m_flDieTime; // 0x718 - 0x71C
   unsigned char pad_71C[0xC]; // 0x71C - 0x728
   uint32_t m_nBrightness; // 0x728 - 0x72C
   float m_flBrightnessDuration; // 0x72C - 0x730
   float m_flSpriteScale; // 0x730 - 0x734
   float m_flScaleDuration; // 0x734 - 0x738
   bool m_bWorldSpaceScale; // 0x738 - 0x739
   unsigned char pad_739[0x3]; // 0x739 - 0x73C
   float m_flGlowProxySize; // 0x73C - 0x740
   float m_flHDRColorScale; // 0x740 - 0x744
   GameTime_t m_flLastTime; // 0x744 - 0x748
   float m_flMaxFrame; // 0x748 - 0x74C
   float m_flStartScale; // 0x74C - 0x750
   float m_flDestScale; // 0x750 - 0x754
   GameTime_t m_flScaleTimeStart; // 0x754 - 0x758
   int32_t m_nStartBrightness; // 0x758 - 0x75C
   int32_t m_nDestBrightness; // 0x75C - 0x760
   GameTime_t m_flBrightnessTimeStart; // 0x760 - 0x764
   int32_t m_nSpriteWidth; // 0x764 - 0x768
   int32_t m_nSpriteHeight; // 0x768 - 0x76C
   unsigned char pad_76C[0x4]; // 0x76C - 0x770
}; // size - 0x770


class C_BaseCSGrenadeProjectile /* "client" */ : public C_BaseGrenade /* "client" */
{
public:
   Vector m_vInitialVelocity; // 0x1068 - 0x1074
   int32_t m_nBounces; // 0x1074 - 0x1078
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_nExplodeEffectIndex; // 0x1078 - 0x1080
   int32_t m_nExplodeEffectTickBegin; // 0x1080 - 0x1084
   Vector m_vecExplodeEffectOrigin; // 0x1084 - 0x1090
   GameTime_t m_flSpawnTime; // 0x1090 - 0x1094
   Vector vecLastTrailLinePos; // 0x1094 - 0x10A0
   GameTime_t flNextTrailLineTime; // 0x10A0 - 0x10A4
   bool m_bExplodeEffectBegan; // 0x10A4 - 0x10A5
   bool m_bCanCreateGrenadeTrail; // 0x10A5 - 0x10A6
   unsigned char pad_10A6[0x2]; // 0x10A6 - 0x10A8
   ParticleIndex_t m_nSnapshotTrajectoryEffectIndex; // 0x10A8 - 0x10AC
   unsigned char pad_10AC[0x4]; // 0x10AC - 0x10B0
   CStrongHandle< InfoForResourceTypeIParticleSnapshot > m_hSnapshotTrajectoryParticleSnapshot; // 0x10B0 - 0x10B8
   CUtlVector< Vector > m_arrTrajectoryTrailPoints; // 0x10B8 - 0x10D0
   CUtlVector< float32 > m_arrTrajectoryTrailPointCreationTimes; // 0x10D0 - 0x10E8
   float m_flTrajectoryTrailEffectCreationTime; // 0x10E8 - 0x10EC
   unsigned char pad_10EC[0x4]; // 0x10EC - 0x10F0
}; // size - 0x10F0


class C_CSPlayerPawn /* "client" */ : public C_CSPlayerPawnBase /* "client" */
{
public:
   CCSPlayer_BulletServices* m_pBulletServices; // 0x16A0 - 0x16A8
   CCSPlayer_HostageServices* m_pHostageServices; // 0x16A8 - 0x16B0
   CCSPlayer_BuyServices* m_pBuyServices; // 0x16B0 - 0x16B8
   CCSPlayer_GlowServices* m_pGlowServices; // 0x16B8 - 0x16C0
   CCSPlayer_ActionTrackingServices* m_pActionTrackingServices; // 0x16C0 - 0x16C8
   GameTime_t m_flHealthShotBoostExpirationTime; // 0x16C8 - 0x16CC
   GameTime_t m_flLastFiredWeaponTime; // 0x16CC - 0x16D0
   bool m_bHasFemaleVoice; // 0x16D0 - 0x16D1
   unsigned char pad_16D1[0x3]; // 0x16D1 - 0x16D4
   float m_flLandseconds; // 0x16D4 - 0x16D8
   float m_flOldFallVelocity; // 0x16D8 - 0x16DC
   char m_szLastPlaceName[18]; // 0x16DC - 0x16EE
   bool m_bPrevDefuser; // 0x16EE - 0x16EF
   bool m_bPrevHelmet; // 0x16EF - 0x16F0
   int32_t m_nPrevArmorVal; // 0x16F0 - 0x16F4
   int32_t m_nPrevGrenadeAmmoCount; // 0x16F4 - 0x16F8
   uint32_t m_unPreviousWeaponHash; // 0x16F8 - 0x16FC
   uint32_t m_unWeaponHash; // 0x16FC - 0x1700
   bool m_bInBuyZone; // 0x1700 - 0x1701
   bool m_bPreviouslyInBuyZone; // 0x1701 - 0x1702
   unsigned char pad_1702[0x2]; // 0x1702 - 0x1704
   QAngle m_aimPunchAngle; // 0x1704 - 0x1710
   QAngle m_aimPunchAngleVel; // 0x1710 - 0x171C
   int32_t m_aimPunchTickBase; // 0x171C - 0x1720
   float m_aimPunchTickFraction; // 0x1720 - 0x1724
   unsigned char pad_1724[0x4]; // 0x1724 - 0x1728
   CUtlVector< QAngle > m_aimPunchCache; // 0x1728 - 0x1740
   unsigned char pad_1740[0x8]; // 0x1740 - 0x1748
   bool m_bInLanding; // 0x1748 - 0x1749
   unsigned char pad_1749[0x3]; // 0x1749 - 0x174C
   float m_flLandingTime; // 0x174C - 0x1750
   bool m_bInHostageRescueZone; // 0x1750 - 0x1751
   bool m_bInBombZone; // 0x1751 - 0x1752
   bool m_bIsBuyMenuOpen; // 0x1752 - 0x1753
   unsigned char pad_1753[0x1]; // 0x1753 - 0x1754
   GameTime_t m_flTimeOfLastInjury; // 0x1754 - 0x1758
   GameTime_t m_flNextSprayDecalTime; // 0x1758 - 0x175C
   unsigned char pad_175C[0x114]; // 0x175C - 0x1870
   int32_t m_iRetakesOffering; // 0x1870 - 0x1874
   int32_t m_iRetakesOfferingCard; // 0x1874 - 0x1878
   bool m_bRetakesHasDefuseKit; // 0x1878 - 0x1879
   bool m_bRetakesMVPLastRound; // 0x1879 - 0x187A
   unsigned char pad_187A[0x2]; // 0x187A - 0x187C
   int32_t m_iRetakesMVPBoostItem; // 0x187C - 0x1880
   loadout_slot_t m_RetakesMVPBoostExtraUtility; // 0x1880 - 0x1884
   unsigned char pad_1884[0x1C]; // 0x1884 - 0x18A0
   bool m_bNeedToReApplyGloves; // 0x18A0 - 0x18A1
   unsigned char pad_18A1[0x7]; // 0x18A1 - 0x18A8
   C_EconItemView m_EconGloves; // 0x18A8 - 0x1CF0
   bool m_bMustSyncRagdollState; // 0x1CF0 - 0x1CF1
   unsigned char pad_1CF1[0x3]; // 0x1CF1 - 0x1CF4
   int32_t m_nRagdollDamageBone; // 0x1CF4 - 0x1CF8
   Vector m_vRagdollDamageForce; // 0x1CF8 - 0x1D04
   Vector m_vRagdollDamagePosition; // 0x1D04 - 0x1D10
   char m_szRagdollDamageWeaponName[64]; // 0x1D10 - 0x1D50
   bool m_bRagdollDamageHeadshot; // 0x1D50 - 0x1D51
   unsigned char pad_1D51[0x53F]; // 0x1D51 - 0x2290
   bool m_bLastHeadBoneTransformIsValid; // 0x2290 - 0x2291
   unsigned char pad_2291[0x3]; // 0x2291 - 0x2294
   GameTime_t m_lastLandTime; // 0x2294 - 0x2298
   bool m_bOnGroundLastTick; // 0x2298 - 0x2299
   unsigned char pad_2299[0x1B]; // 0x2299 - 0x22B4
   QAngle m_qDeathEyeAngles; // 0x22B4 - 0x22C0
   bool m_bSkipOneHeadConstraintUpdate; // 0x22C0 - 0x22C1
   unsigned char pad_22C1[0x7]; // 0x22C1 - 0x22C8
}; // size - 0x22C8


class ISkeletonAnimationController /* "server" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class RnShapeDesc_t /* "physicslib" */
{
public:
   uint32_t m_nCollisionAttributeIndex; // 0x0 - 0x4
   uint32_t m_nSurfacePropertyIndex; // 0x4 - 0x8
   CUtlString m_UserFriendlyName; // 0x8 - 0x10
}; // size - 0x10


class CBaseButton /* "server" */ : public CBaseToggle /* "server" */
{
public:
   QAngle m_angMoveEntitySpace; // 0x780 - 0x78C
   bool m_fStayPushed; // 0x78C - 0x78D
   bool m_fRotating; // 0x78D - 0x78E
   unsigned char pad_78E[0x2]; // 0x78E - 0x790
   locksound_t m_ls; // 0x790 - 0x7B0
   CUtlSymbolLarge m_sUseSound; // 0x7B0 - 0x7B8
   CUtlSymbolLarge m_sLockedSound; // 0x7B8 - 0x7C0
   CUtlSymbolLarge m_sUnlockedSound; // 0x7C0 - 0x7C8
   bool m_bLocked; // 0x7C8 - 0x7C9
   bool m_bDisabled; // 0x7C9 - 0x7CA
   unsigned char pad_7CA[0x2]; // 0x7CA - 0x7CC
   GameTime_t m_flUseLockedTime; // 0x7CC - 0x7D0
   bool m_bSolidBsp; // 0x7D0 - 0x7D1
   unsigned char pad_7D1[0x7]; // 0x7D1 - 0x7D8
   CEntityIOOutput m_OnDamaged; // 0x7D8 - 0x800
   CEntityIOOutput m_OnPressed; // 0x800 - 0x828
   CEntityIOOutput m_OnUseLocked; // 0x828 - 0x850
   CEntityIOOutput m_OnIn; // 0x850 - 0x878
   CEntityIOOutput m_OnOut; // 0x878 - 0x8A0
   int32_t m_nState; // 0x8A0 - 0x8A4
   CEntityHandle m_hConstraint; // 0x8A4 - 0x8A8
   CEntityHandle m_hConstraintParent; // 0x8A8 - 0x8AC
   bool m_bForceNpcExclude; // 0x8AC - 0x8AD
   unsigned char pad_8AD[0x3]; // 0x8AD - 0x8B0
   CUtlSymbolLarge m_sGlowEntity; // 0x8B0 - 0x8B8
   CHandle< CBaseModelEntity > m_glowEntity; // 0x8B8 - 0x8BC
   bool m_usable; // 0x8BC - 0x8BD
   unsigned char pad_8BD[0x3]; // 0x8BD - 0x8C0
   CUtlSymbolLarge m_szDisplayText; // 0x8C0 - 0x8C8
}; // size - 0x8C8


class CBaseClientUIEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bEnabled; // 0x700 - 0x701
   unsigned char pad_701[0x7]; // 0x701 - 0x708
   CUtlSymbolLarge m_DialogXMLName; // 0x708 - 0x710
   CUtlSymbolLarge m_PanelClassName; // 0x710 - 0x718
   CUtlSymbolLarge m_PanelID; // 0x718 - 0x720
   CEntityIOOutput m_CustomOutput0; // 0x720 - 0x748
   CEntityIOOutput m_CustomOutput1; // 0x748 - 0x770
   CEntityIOOutput m_CustomOutput2; // 0x770 - 0x798
   CEntityIOOutput m_CustomOutput3; // 0x798 - 0x7C0
   CEntityIOOutput m_CustomOutput4; // 0x7C0 - 0x7E8
   CEntityIOOutput m_CustomOutput5; // 0x7E8 - 0x810
   CEntityIOOutput m_CustomOutput6; // 0x810 - 0x838
   CEntityIOOutput m_CustomOutput7; // 0x838 - 0x860
   CEntityIOOutput m_CustomOutput8; // 0x860 - 0x888
   CEntityIOOutput m_CustomOutput9; // 0x888 - 0x8B0
}; // size - 0x8B0


class CParticleVecInput /* "particleslib" */ : public CParticleInput /* "particleslib" */
{
public:
   ParticleVecType_t m_nType; // 0x10 - 0x14
   Vector m_vLiteralValue; // 0x14 - 0x20
   Color m_LiteralColor; // 0x20 - 0x24
   unsigned char pad_24[0x4]; // 0x24 - 0x28
   CParticleNamedValueRef m_NamedValue; // 0x28 - 0x68
   bool m_bFollowNamedValue; // 0x68 - 0x69
   unsigned char pad_69[0x3]; // 0x69 - 0x6C
   ParticleAttributeIndex_t m_nVectorAttribute; // 0x6C - 0x70
   Vector m_vVectorAttributeScale; // 0x70 - 0x7C
   int32_t m_nControlPoint; // 0x7C - 0x80
   int32_t m_nDeltaControlPoint; // 0x80 - 0x84
   Vector m_vCPValueScale; // 0x84 - 0x90
   Vector m_vCPRelativePosition; // 0x90 - 0x9C
   Vector m_vCPRelativeDir; // 0x9C - 0xA8
   CParticleFloatInput m_FloatComponentX; // 0xA8 - 0x200
   CParticleFloatInput m_FloatComponentY; // 0x200 - 0x358
   CParticleFloatInput m_FloatComponentZ; // 0x358 - 0x4B0
   CParticleFloatInput m_FloatInterp; // 0x4B0 - 0x608
   float m_flInterpInput0; // 0x608 - 0x60C
   float m_flInterpInput1; // 0x60C - 0x610
   Vector m_vInterpOutput0; // 0x610 - 0x61C
   Vector m_vInterpOutput1; // 0x61C - 0x628
   CColorGradient m_Gradient; // 0x628 - 0x640
   Vector m_vRandomMin; // 0x640 - 0x64C
   Vector m_vRandomMax; // 0x64C - 0x658
}; // size - 0x658


class CPlayer_MovementServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   int32_t m_nImpulse; // 0x40 - 0x44
   unsigned char pad_44[0x4]; // 0x44 - 0x48
   CInButtonState m_nButtons; // 0x48 - 0x68
   uint64_t m_nQueuedButtonDownMask; // 0x68 - 0x70
   uint64_t m_nQueuedButtonChangeMask; // 0x70 - 0x78
   uint64_t m_nButtonDoublePressed; // 0x78 - 0x80
   uint32 m_pButtonPressedCmdNumber[64]; // 0x80 - 0x180
   uint32_t m_nLastCommandNumberProcessed; // 0x180 - 0x184
   unsigned char pad_184[0x4]; // 0x184 - 0x188
   uint64_t m_nToggleButtonDownMask; // 0x188 - 0x190
   float m_flMaxspeed; // 0x190 - 0x194
   float32 m_arrForceSubtickMoveWhen[4]; // 0x194 - 0x1A4
   float m_flForwardMove; // 0x1A4 - 0x1A8
   float m_flLeftMove; // 0x1A8 - 0x1AC
   float m_flUpMove; // 0x1AC - 0x1B0
   Vector m_vecLastMovementImpulses; // 0x1B0 - 0x1BC
   QAngle m_vecOldViewAngles; // 0x1BC - 0x1C8
   unsigned char pad_1C8[0x8]; // 0x1C8 - 0x1D0
}; // size - 0x1D0


class CPlayer_MovementServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   int32_t m_nImpulse; // 0x40 - 0x44
   unsigned char pad_44[0x4]; // 0x44 - 0x48
   CInButtonState m_nButtons; // 0x48 - 0x68
   uint64_t m_nQueuedButtonDownMask; // 0x68 - 0x70
   uint64_t m_nQueuedButtonChangeMask; // 0x70 - 0x78
   uint64_t m_nButtonDoublePressed; // 0x78 - 0x80
   uint32 m_pButtonPressedCmdNumber[64]; // 0x80 - 0x180
   uint32_t m_nLastCommandNumberProcessed; // 0x180 - 0x184
   unsigned char pad_184[0x4]; // 0x184 - 0x188
   uint64_t m_nToggleButtonDownMask; // 0x188 - 0x190
   float m_flMaxspeed; // 0x190 - 0x194
   float32 m_arrForceSubtickMoveWhen[4]; // 0x194 - 0x1A4
   float m_flForwardMove; // 0x1A4 - 0x1A8
   float m_flLeftMove; // 0x1A8 - 0x1AC
   float m_flUpMove; // 0x1AC - 0x1B0
   Vector m_vecLastMovementImpulses; // 0x1B0 - 0x1BC
   QAngle m_vecOldViewAngles; // 0x1BC - 0x1C8
   unsigned char pad_1C8[0x8]; // 0x1C8 - 0x1D0
}; // size - 0x1D0


class CSoundOpvarSetPointEntity /* "server" */ : public CSoundOpvarSetPointBase /* "server" */
{
public:
   CEntityIOOutput m_OnEnter; // 0x548 - 0x570
   CEntityIOOutput m_OnExit; // 0x570 - 0x598
   bool m_bAutoDisable; // 0x598 - 0x599
   unsigned char pad_599[0x43]; // 0x599 - 0x5DC
   float m_flDistanceMin; // 0x5DC - 0x5E0
   float m_flDistanceMax; // 0x5E0 - 0x5E4
   float m_flDistanceMapMin; // 0x5E4 - 0x5E8
   float m_flDistanceMapMax; // 0x5E8 - 0x5EC
   float m_flOcclusionRadius; // 0x5EC - 0x5F0
   float m_flOcclusionMin; // 0x5F0 - 0x5F4
   float m_flOcclusionMax; // 0x5F4 - 0x5F8
   float m_flValSetOnDisable; // 0x5F8 - 0x5FC
   bool m_bSetValueOnDisable; // 0x5FC - 0x5FD
   unsigned char pad_5FD[0x3]; // 0x5FD - 0x600
   int32_t m_nSimulationMode; // 0x600 - 0x604
   int32_t m_nVisibilitySamples; // 0x604 - 0x608
   Vector m_vDynamicProxyPoint; // 0x608 - 0x614
   float m_flDynamicMaximumOcclusion; // 0x614 - 0x618
   CEntityHandle m_hDynamicEntity; // 0x618 - 0x61C
   unsigned char pad_61C[0x4]; // 0x61C - 0x620
   CUtlSymbolLarge m_iszDynamicEntityName; // 0x620 - 0x628
   float m_flPathingDistanceNormFactor; // 0x628 - 0x62C
   Vector m_vPathingSourcePos; // 0x62C - 0x638
   Vector m_vPathingListenerPos; // 0x638 - 0x644
   int32_t m_nPathingSourceIndex; // 0x644 - 0x648
}; // size - 0x648


class C_SoundOpvarSetPointEntity /* "client" */ : public C_SoundOpvarSetPointBase /* "client" */
{
public:
   unsigned char pad_0[0x560]; // 0x0 - 0x560
}; // size - 0x560


class CBinaryUpdateNode /* "animgraphlib" */ : public CAnimUpdateNodeBase /* "animgraphlib" */
{
public:
   CAnimUpdateNodeRef m_pChild1; // 0x58 - 0x68
   CAnimUpdateNodeRef m_pChild2; // 0x68 - 0x78
   BinaryNodeTiming m_timingBehavior; // 0x78 - 0x7C
   float m_flTimingBlend; // 0x7C - 0x80
   bool m_bResetChild1; // 0x80 - 0x81
   bool m_bResetChild2; // 0x81 - 0x82
   unsigned char pad_82[0x6]; // 0x82 - 0x88
}; // size - 0x88


class CCSGameModeRules /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30
}; // size - 0x30


class CCSGameModeRules /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30
}; // size - 0x30


class CGeneralRandomRotation /* "particles" */ : public CParticleFunctionInitializer /* "particles" */
{
public:
   ParticleAttributeIndex_t m_nFieldOutput; // 0x1C0 - 0x1C4
   float m_flDegrees; // 0x1C4 - 0x1C8
   float m_flDegreesMin; // 0x1C8 - 0x1CC
   float m_flDegreesMax; // 0x1CC - 0x1D0
   float m_flRotationRandExponent; // 0x1D0 - 0x1D4
   bool m_bRandomlyFlipDirection; // 0x1D4 - 0x1D5
   unsigned char pad_1D5[0xB]; // 0x1D5 - 0x1E0
}; // size - 0x1E0


class CGlowOverlay /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   Vector m_vPos; // 0x8 - 0x14
   bool m_bDirectional; // 0x14 - 0x15
   unsigned char pad_15[0x3]; // 0x15 - 0x18
   Vector m_vDirection; // 0x18 - 0x24
   bool m_bInSky; // 0x24 - 0x25
   unsigned char pad_25[0x3]; // 0x25 - 0x28
   float m_skyObstructionScale; // 0x28 - 0x2C
   unsigned char pad_2C[0x4]; // 0x2C - 0x30
   CGlowSprite m_Sprites[4]; // 0x30 - 0xB0
   int32_t m_nSprites; // 0xB0 - 0xB4
   float m_flProxyRadius; // 0xB4 - 0xB8
   float m_flHDRColorScale; // 0xB8 - 0xBC
   float m_flGlowObstructionScale; // 0xBC - 0xC0
   bool m_bCacheGlowObstruction; // 0xC0 - 0xC1
   bool m_bCacheSkyObstruction; // 0xC1 - 0xC2
   int16_t m_bActivated; // 0xC2 - 0xC4
   uint16_t m_ListIndex; // 0xC4 - 0xC6
   unsigned char pad_C6[0x2]; // 0xC6 - 0xC8
   int32_t m_queryHandle; // 0xC8 - 0xCC
   unsigned char pad_CC[0x4]; // 0xCC - 0xD0
}; // size - 0xD0


class CRulePointEntity /* "server" */ : public CRuleEntity /* "server" */
{
public:
   int32_t m_Score; // 0x708 - 0x70C
   unsigned char pad_70C[0x4]; // 0x70C - 0x710
}; // size - 0x710


class CSosGroupActionSchema /* "soundsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlString m_name; // 0x8 - 0x10
   ActionType_t m_actionType; // 0x10 - 0x14
   ActionType_t m_actionInstanceType; // 0x14 - 0x18
}; // size - 0x18


class CStopwatchBase /* "server" */ : public CSimpleSimTimer /* "server" */
{
public:
   bool m_fIsRunning; // 0x8 - 0x9
   unsigned char pad_9[0x3]; // 0x9 - 0xC
}; // size - 0xC


class C_INIT_RandomNamedModelElement /* "particles" */ : public CParticleFunctionInitializer /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1C0 - 0x1C8
   CUtlVector< CUtlString > m_names; // 0x1C8 - 0x1E0
   bool m_bShuffle; // 0x1E0 - 0x1E1
   bool m_bLinear; // 0x1E1 - 0x1E2
   bool m_bModelFromRenderer; // 0x1E2 - 0x1E3
   unsigned char pad_1E3[0x1]; // 0x1E3 - 0x1E4
   ParticleAttributeIndex_t m_nFieldOutput; // 0x1E4 - 0x1E8
   unsigned char pad_1E8[0x8]; // 0x1E8 - 0x1F0
}; // size - 0x1F0


class C_INIT_RemapNamedModelElementToScalar /* "particles" */ : public CParticleFunctionInitializer /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1C0 - 0x1C8
   CUtlVector< CUtlString > m_names; // 0x1C8 - 0x1E0
   CUtlVector< float32 > m_values; // 0x1E0 - 0x1F8
   ParticleAttributeIndex_t m_nFieldInput; // 0x1F8 - 0x1FC
   ParticleAttributeIndex_t m_nFieldOutput; // 0x1FC - 0x200
   ParticleSetMethod_t m_nSetMethod; // 0x200 - 0x204
   bool m_bModelFromRenderer; // 0x204 - 0x205
   unsigned char pad_205[0xB]; // 0x205 - 0x210
}; // size - 0x210


class C_INIT_RemapParticleCountToNamedModelElementScalar /* "particles" */ : public C_INIT_RemapParticleCountToScalar /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1F0 - 0x1F8
   CUtlString m_outputMinName; // 0x1F8 - 0x200
   CUtlString m_outputMaxName; // 0x200 - 0x208
   bool m_bModelFromRenderer; // 0x208 - 0x209
   unsigned char pad_209[0x7]; // 0x209 - 0x210
}; // size - 0x210


class C_ModelPointEntity /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_0[0xCC0]; // 0x0 - 0xCC0
}; // size - 0xCC0


class C_OP_RemapNamedModelElementEndCap /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1C0 - 0x1C8
   CUtlVector< CUtlString > m_inNames; // 0x1C8 - 0x1E0
   CUtlVector< CUtlString > m_outNames; // 0x1E0 - 0x1F8
   CUtlVector< CUtlString > m_fallbackNames; // 0x1F8 - 0x210
   bool m_bModelFromRenderer; // 0x210 - 0x211
   unsigned char pad_211[0x3]; // 0x211 - 0x214
   ParticleAttributeIndex_t m_nFieldInput; // 0x214 - 0x218
   ParticleAttributeIndex_t m_nFieldOutput; // 0x218 - 0x21C
   unsigned char pad_21C[0x4]; // 0x21C - 0x220
}; // size - 0x220


class C_OP_RemapNamedModelElementOnceTimed /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1C0 - 0x1C8
   CUtlVector< CUtlString > m_inNames; // 0x1C8 - 0x1E0
   CUtlVector< CUtlString > m_outNames; // 0x1E0 - 0x1F8
   CUtlVector< CUtlString > m_fallbackNames; // 0x1F8 - 0x210
   bool m_bModelFromRenderer; // 0x210 - 0x211
   bool m_bProportional; // 0x211 - 0x212
   unsigned char pad_212[0x2]; // 0x212 - 0x214
   ParticleAttributeIndex_t m_nFieldInput; // 0x214 - 0x218
   ParticleAttributeIndex_t m_nFieldOutput; // 0x218 - 0x21C
   float m_flRemapTime; // 0x21C - 0x220
}; // size - 0x220


class C_Sprite /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_CC0[0x18]; // 0xCC0 - 0xCD8
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hSpriteMaterial; // 0xCD8 - 0xCE0
   CHandle< C_BaseEntity > m_hAttachedToEntity; // 0xCE0 - 0xCE4
   AttachmentHandle_t m_nAttachment; // 0xCE4 - 0xCE5
   unsigned char pad_CE5[0x3]; // 0xCE5 - 0xCE8
   float m_flSpriteFramerate; // 0xCE8 - 0xCEC
   float m_flFrame; // 0xCEC - 0xCF0
   GameTime_t m_flDieTime; // 0xCF0 - 0xCF4
   unsigned char pad_CF4[0xC]; // 0xCF4 - 0xD00
   uint32_t m_nBrightness; // 0xD00 - 0xD04
   float m_flBrightnessDuration; // 0xD04 - 0xD08
   float m_flSpriteScale; // 0xD08 - 0xD0C
   float m_flScaleDuration; // 0xD0C - 0xD10
   bool m_bWorldSpaceScale; // 0xD10 - 0xD11
   unsigned char pad_D11[0x3]; // 0xD11 - 0xD14
   float m_flGlowProxySize; // 0xD14 - 0xD18
   float m_flHDRColorScale; // 0xD18 - 0xD1C
   GameTime_t m_flLastTime; // 0xD1C - 0xD20
   float m_flMaxFrame; // 0xD20 - 0xD24
   float m_flStartScale; // 0xD24 - 0xD28
   float m_flDestScale; // 0xD28 - 0xD2C
   GameTime_t m_flScaleTimeStart; // 0xD2C - 0xD30
   int32_t m_nStartBrightness; // 0xD30 - 0xD34
   int32_t m_nDestBrightness; // 0xD34 - 0xD38
   GameTime_t m_flBrightnessTimeStart; // 0xD38 - 0xD3C
   unsigned char pad_D3C[0x4]; // 0xD3C - 0xD40
   CWeakHandle< InfoForResourceTypeIMaterial2 > m_hOldSpriteMaterial; // 0xD40 - 0xD48
   unsigned char pad_D48[0xA0]; // 0xD48 - 0xDE8
   int32_t m_nSpriteWidth; // 0xDE8 - 0xDEC
   int32_t m_nSpriteHeight; // 0xDEC - 0xDF0
}; // size - 0xDF0


class CAI_Expresser /* "server" */
{
public:
   unsigned char pad_0[0x38]; // 0x0 - 0x38
   GameTime_t m_flStopTalkTime; // 0x38 - 0x3C
   GameTime_t m_flStopTalkTimeWithoutDelay; // 0x3C - 0x40
   GameTime_t m_flBlockedTalkTime; // 0x40 - 0x44
   int32_t m_voicePitch; // 0x44 - 0x48
   GameTime_t m_flLastTimeAcceptedSpeak; // 0x48 - 0x4C
   bool m_bAllowSpeakingInterrupts; // 0x4C - 0x4D
   bool m_bConsiderSceneInvolvementAsSpeech; // 0x4D - 0x4E
   unsigned char pad_4E[0x2]; // 0x4E - 0x50
   int32_t m_nLastSpokenPriority; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
   CBaseFlex* m_pOuter; // 0x58 - 0x60
}; // size - 0x60


class CBasePropDoor /* "server" */ : public CDynamicProp /* "server" */
{
public:
   unsigned char pad_B08[0x10]; // 0xB08 - 0xB18
   float m_flAutoReturnDelay; // 0xB18 - 0xB1C
   unsigned char pad_B1C[0x4]; // 0xB1C - 0xB20
   CUtlVector< CHandle< CBasePropDoor > > m_hDoorList; // 0xB20 - 0xB38
   int32_t m_nHardwareType; // 0xB38 - 0xB3C
   bool m_bNeedsHardware; // 0xB3C - 0xB3D
   unsigned char pad_B3D[0x3]; // 0xB3D - 0xB40
   DoorState_t m_eDoorState; // 0xB40 - 0xB44
   bool m_bLocked; // 0xB44 - 0xB45
   unsigned char pad_B45[0x3]; // 0xB45 - 0xB48
   Vector m_closedPosition; // 0xB48 - 0xB54
   QAngle m_closedAngles; // 0xB54 - 0xB60
   CHandle< CBaseEntity > m_hBlocker; // 0xB60 - 0xB64
   bool m_bFirstBlocked; // 0xB64 - 0xB65
   unsigned char pad_B65[0x3]; // 0xB65 - 0xB68
   locksound_t m_ls; // 0xB68 - 0xB88
   bool m_bForceClosed; // 0xB88 - 0xB89
   unsigned char pad_B89[0x3]; // 0xB89 - 0xB8C
   Vector m_vecLatchWorldPosition; // 0xB8C - 0xB98
   CHandle< CBaseEntity > m_hActivator; // 0xB98 - 0xB9C
   unsigned char pad_B9C[0xC]; // 0xB9C - 0xBA8
   CUtlSymbolLarge m_SoundMoving; // 0xBA8 - 0xBB0
   CUtlSymbolLarge m_SoundOpen; // 0xBB0 - 0xBB8
   CUtlSymbolLarge m_SoundClose; // 0xBB8 - 0xBC0
   CUtlSymbolLarge m_SoundLock; // 0xBC0 - 0xBC8
   CUtlSymbolLarge m_SoundUnlock; // 0xBC8 - 0xBD0
   CUtlSymbolLarge m_SoundLatch; // 0xBD0 - 0xBD8
   CUtlSymbolLarge m_SoundPound; // 0xBD8 - 0xBE0
   CUtlSymbolLarge m_SoundJiggle; // 0xBE0 - 0xBE8
   CUtlSymbolLarge m_SoundLockedAnim; // 0xBE8 - 0xBF0
   int32_t m_numCloseAttempts; // 0xBF0 - 0xBF4
   CUtlStringToken m_nPhysicsMaterial; // 0xBF4 - 0xBF8
   CUtlSymbolLarge m_SlaveName; // 0xBF8 - 0xC00
   CHandle< CBasePropDoor > m_hMaster; // 0xC00 - 0xC04
   unsigned char pad_C04[0x4]; // 0xC04 - 0xC08
   CEntityIOOutput m_OnBlockedClosing; // 0xC08 - 0xC30
   CEntityIOOutput m_OnBlockedOpening; // 0xC30 - 0xC58
   CEntityIOOutput m_OnUnblockedClosing; // 0xC58 - 0xC80
   CEntityIOOutput m_OnUnblockedOpening; // 0xC80 - 0xCA8
   CEntityIOOutput m_OnFullyClosed; // 0xCA8 - 0xCD0
   CEntityIOOutput m_OnFullyOpen; // 0xCD0 - 0xCF8
   CEntityIOOutput m_OnClose; // 0xCF8 - 0xD20
   CEntityIOOutput m_OnOpen; // 0xD20 - 0xD48
   CEntityIOOutput m_OnLockedUse; // 0xD48 - 0xD70
   CEntityIOOutput m_OnAjarOpen; // 0xD70 - 0xD98
}; // size - 0xD98


class CBaseViewModel /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   unsigned char pad_890[0x8]; // 0x890 - 0x898
   Vector m_vecLastFacing; // 0x898 - 0x8A4
   uint32_t m_nViewModelIndex; // 0x8A4 - 0x8A8
   uint32_t m_nAnimationParity; // 0x8A8 - 0x8AC
   float m_flAnimationStartTime; // 0x8AC - 0x8B0
   CHandle< CBasePlayerWeapon > m_hWeapon; // 0x8B0 - 0x8B4
   unsigned char pad_8B4[0x4]; // 0x8B4 - 0x8B8
   CUtlSymbolLarge m_sVMName; // 0x8B8 - 0x8C0
   CUtlSymbolLarge m_sAnimationPrefix; // 0x8C0 - 0x8C8
   HSequence m_hOldLayerSequence; // 0x8C8 - 0x8CC
   int32_t m_oldLayer; // 0x8CC - 0x8D0
   float m_oldLayerStartTime; // 0x8D0 - 0x8D4
   CHandle< CBaseEntity > m_hControlPanel; // 0x8D4 - 0x8D8
}; // size - 0x8D8


class CBtNodeDecorator /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_0[0x58]; // 0x0 - 0x58
}; // size - 0x58


class CFuncPlatRot /* "server" */ : public CFuncPlat /* "server" */
{
public:
   QAngle m_end; // 0x7B0 - 0x7BC
   QAngle m_start; // 0x7BC - 0x7C8
}; // size - 0x7C8


class CHostageExpresserShim /* "server" */ : public CBaseCombatCharacter /* "server" */
{
public:
   CAI_Expresser* m_pExpresser; // 0x9D0 - 0x9D8
}; // size - 0x9D8


class CLogicNPCCounter /* "server" */ : public CBaseEntity /* "server" */
{
public:
   CEntityIOOutput m_OnMinCountAll; // 0x4B0 - 0x4D8
   CEntityIOOutput m_OnMaxCountAll; // 0x4D8 - 0x500
   CEntityOutputTemplate< float32 > m_OnFactorAll; // 0x500 - 0x528
   CEntityOutputTemplate< float32 > m_OnMinPlayerDistAll; // 0x528 - 0x550
   CEntityIOOutput m_OnMinCount_1; // 0x550 - 0x578
   CEntityIOOutput m_OnMaxCount_1; // 0x578 - 0x5A0
   CEntityOutputTemplate< float32 > m_OnFactor_1; // 0x5A0 - 0x5C8
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_1; // 0x5C8 - 0x5F0
   CEntityIOOutput m_OnMinCount_2; // 0x5F0 - 0x618
   CEntityIOOutput m_OnMaxCount_2; // 0x618 - 0x640
   CEntityOutputTemplate< float32 > m_OnFactor_2; // 0x640 - 0x668
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_2; // 0x668 - 0x690
   CEntityIOOutput m_OnMinCount_3; // 0x690 - 0x6B8
   CEntityIOOutput m_OnMaxCount_3; // 0x6B8 - 0x6E0
   CEntityOutputTemplate< float32 > m_OnFactor_3; // 0x6E0 - 0x708
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_3; // 0x708 - 0x730
   CEntityHandle m_hSource; // 0x730 - 0x734
   unsigned char pad_734[0x4]; // 0x734 - 0x738
   CUtlSymbolLarge m_iszSourceEntityName; // 0x738 - 0x740
   float m_flDistanceMax; // 0x740 - 0x744
   bool m_bDisabled; // 0x744 - 0x745
   unsigned char pad_745[0x3]; // 0x745 - 0x748
   int32_t m_nMinCountAll; // 0x748 - 0x74C
   int32_t m_nMaxCountAll; // 0x74C - 0x750
   int32_t m_nMinFactorAll; // 0x750 - 0x754
   int32_t m_nMaxFactorAll; // 0x754 - 0x758
   unsigned char pad_758[0x8]; // 0x758 - 0x760
   CUtlSymbolLarge m_iszNPCClassname_1; // 0x760 - 0x768
   int32_t m_nNPCState_1; // 0x768 - 0x76C
   bool m_bInvertState_1; // 0x76C - 0x76D
   unsigned char pad_76D[0x3]; // 0x76D - 0x770
   int32_t m_nMinCount_1; // 0x770 - 0x774
   int32_t m_nMaxCount_1; // 0x774 - 0x778
   int32_t m_nMinFactor_1; // 0x778 - 0x77C
   int32_t m_nMaxFactor_1; // 0x77C - 0x780
   unsigned char pad_780[0x4]; // 0x780 - 0x784
   float m_flDefaultDist_1; // 0x784 - 0x788
   CUtlSymbolLarge m_iszNPCClassname_2; // 0x788 - 0x790
   int32_t m_nNPCState_2; // 0x790 - 0x794
   bool m_bInvertState_2; // 0x794 - 0x795
   unsigned char pad_795[0x3]; // 0x795 - 0x798
   int32_t m_nMinCount_2; // 0x798 - 0x79C
   int32_t m_nMaxCount_2; // 0x79C - 0x7A0
   int32_t m_nMinFactor_2; // 0x7A0 - 0x7A4
   int32_t m_nMaxFactor_2; // 0x7A4 - 0x7A8
   unsigned char pad_7A8[0x4]; // 0x7A8 - 0x7AC
   float m_flDefaultDist_2; // 0x7AC - 0x7B0
   CUtlSymbolLarge m_iszNPCClassname_3; // 0x7B0 - 0x7B8
   int32_t m_nNPCState_3; // 0x7B8 - 0x7BC
   bool m_bInvertState_3; // 0x7BC - 0x7BD
   unsigned char pad_7BD[0x3]; // 0x7BD - 0x7C0
   int32_t m_nMinCount_3; // 0x7C0 - 0x7C4
   int32_t m_nMaxCount_3; // 0x7C4 - 0x7C8
   int32_t m_nMinFactor_3; // 0x7C8 - 0x7CC
   int32_t m_nMaxFactor_3; // 0x7CC - 0x7D0
   unsigned char pad_7D0[0x4]; // 0x7D0 - 0x7D4
   float m_flDefaultDist_3; // 0x7D4 - 0x7D8
   unsigned char pad_7D8[0x18]; // 0x7D8 - 0x7F0
}; // size - 0x7F0


class CMultiplayRules /* "server" */ : public CGameRules /* "server" */
{
public:
   unsigned char pad_0[0x90]; // 0x0 - 0x90
}; // size - 0x90


class C_BaseViewModel /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   unsigned char pad_E80[0x8]; // 0xE80 - 0xE88
   Vector m_vecLastFacing; // 0xE88 - 0xE94
   uint32_t m_nViewModelIndex; // 0xE94 - 0xE98
   uint32_t m_nAnimationParity; // 0xE98 - 0xE9C
   float m_flAnimationStartTime; // 0xE9C - 0xEA0
   CHandle< C_BasePlayerWeapon > m_hWeapon; // 0xEA0 - 0xEA4
   unsigned char pad_EA4[0x4]; // 0xEA4 - 0xEA8
   CUtlSymbolLarge m_sVMName; // 0xEA8 - 0xEB0
   CUtlSymbolLarge m_sAnimationPrefix; // 0xEB0 - 0xEB8
   CHandle< C_ViewmodelWeapon > m_hWeaponModel; // 0xEB8 - 0xEBC
   AttachmentHandle_t m_iCameraAttachment; // 0xEBC - 0xEBD
   unsigned char pad_EBD[0x3]; // 0xEBD - 0xEC0
   QAngle m_vecLastCameraAngles; // 0xEC0 - 0xECC
   float m_previousElapsedDuration; // 0xECC - 0xED0
   float m_previousCycle; // 0xED0 - 0xED4
   int32_t m_nOldAnimationParity; // 0xED4 - 0xED8
   HSequence m_hOldLayerSequence; // 0xED8 - 0xEDC
   int32_t m_oldLayer; // 0xEDC - 0xEE0
   float m_oldLayerStartTime; // 0xEE0 - 0xEE4
   CHandle< C_BaseEntity > m_hControlPanel; // 0xEE4 - 0xEE8
}; // size - 0xEE8


class C_MultiplayRules /* "client" */ : public C_GameRules /* "client" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class BaseSceneObjectOverride_t /* "worldrenderer" */
{
public:
   uint32_t m_nSceneObjectIndex; // 0x0 - 0x4
}; // size - 0x4


class CAnimEventListenerBase /* "server" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
}; // size - 0x18


class CBarnLight /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bEnabled; // 0x700 - 0x701
   unsigned char pad_701[0x3]; // 0x701 - 0x704
   int32_t m_nColorMode; // 0x704 - 0x708
   Color m_Color; // 0x708 - 0x70C
   float m_flColorTemperature; // 0x70C - 0x710
   float m_flBrightness; // 0x710 - 0x714
   float m_flBrightnessScale; // 0x714 - 0x718
   int32_t m_nDirectLight; // 0x718 - 0x71C
   int32_t m_nBakedShadowIndex; // 0x71C - 0x720
   int32_t m_nLuminaireShape; // 0x720 - 0x724
   float m_flLuminaireSize; // 0x724 - 0x728
   float m_flLuminaireAnisotropy; // 0x728 - 0x72C
   unsigned char pad_72C[0x4]; // 0x72C - 0x730
   CUtlString m_LightStyleString; // 0x730 - 0x738
   GameTime_t m_flLightStyleStartTime; // 0x738 - 0x73C
   unsigned char pad_73C[0x4]; // 0x73C - 0x740
   CNetworkUtlVectorBase< CUtlString > m_QueuedLightStyleStrings; // 0x740 - 0x758
   CNetworkUtlVectorBase< CUtlString > m_LightStyleEvents; // 0x758 - 0x770
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_LightStyleTargets; // 0x770 - 0x788
   CEntityIOOutput m_StyleEvent[4]; // 0x788 - 0x828
   CUtlString m_StyleRadianceVar; // 0x828 - 0x830
   CUtlString m_StyleVar; // 0x830 - 0x838
   unsigned char pad_838[0x20]; // 0x838 - 0x858
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; // 0x858 - 0x860
   float m_flShape; // 0x860 - 0x864
   float m_flSoftX; // 0x864 - 0x868
   float m_flSoftY; // 0x868 - 0x86C
   float m_flSkirt; // 0x86C - 0x870
   float m_flSkirtNear; // 0x870 - 0x874
   Vector m_vSizeParams; // 0x874 - 0x880
   float m_flRange; // 0x880 - 0x884
   Vector m_vShear; // 0x884 - 0x890
   int32_t m_nBakeSpecularToCubemaps; // 0x890 - 0x894
   Vector m_vBakeSpecularToCubemapsSize; // 0x894 - 0x8A0
   int32_t m_nCastShadows; // 0x8A0 - 0x8A4
   int32_t m_nShadowMapSize; // 0x8A4 - 0x8A8
   int32_t m_nShadowPriority; // 0x8A8 - 0x8AC
   bool m_bContactShadow; // 0x8AC - 0x8AD
   unsigned char pad_8AD[0x3]; // 0x8AD - 0x8B0
   int32_t m_nBounceLight; // 0x8B0 - 0x8B4
   float m_flBounceScale; // 0x8B4 - 0x8B8
   float m_flMinRoughness; // 0x8B8 - 0x8BC
   Vector m_vAlternateColor; // 0x8BC - 0x8C8
   float m_fAlternateColorBrightness; // 0x8C8 - 0x8CC
   int32_t m_nFog; // 0x8CC - 0x8D0
   float m_flFogStrength; // 0x8D0 - 0x8D4
   int32_t m_nFogShadows; // 0x8D4 - 0x8D8
   float m_flFogScale; // 0x8D8 - 0x8DC
   float m_flFadeSizeStart; // 0x8DC - 0x8E0
   float m_flFadeSizeEnd; // 0x8E0 - 0x8E4
   float m_flShadowFadeSizeStart; // 0x8E4 - 0x8E8
   float m_flShadowFadeSizeEnd; // 0x8E8 - 0x8EC
   bool m_bPrecomputedFieldsValid; // 0x8EC - 0x8ED
   unsigned char pad_8ED[0x3]; // 0x8ED - 0x8F0
   Vector m_vPrecomputedBoundsMins; // 0x8F0 - 0x8FC
   Vector m_vPrecomputedBoundsMaxs; // 0x8FC - 0x908
   Vector m_vPrecomputedOBBOrigin; // 0x908 - 0x914
   QAngle m_vPrecomputedOBBAngles; // 0x914 - 0x920
   Vector m_vPrecomputedOBBExtent; // 0x920 - 0x92C
   bool m_bPvsModifyEntity; // 0x92C - 0x92D
   unsigned char pad_92D[0xB]; // 0x92D - 0x938
}; // size - 0x938


class CBeam /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   float m_flFrameRate; // 0x700 - 0x704
   float m_flHDRColorScale; // 0x704 - 0x708
   GameTime_t m_flFireTime; // 0x708 - 0x70C
   float m_flDamage; // 0x70C - 0x710
   uint8_t m_nNumBeamEnts; // 0x710 - 0x711
   unsigned char pad_711[0x7]; // 0x711 - 0x718
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hBaseMaterial; // 0x718 - 0x720
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_nHaloIndex; // 0x720 - 0x728
   BeamType_t m_nBeamType; // 0x728 - 0x72C
   uint32_t m_nBeamFlags; // 0x72C - 0x730
   CHandle< CBaseEntity > m_hAttachEntity[10]; // 0x730 - 0x758
   AttachmentHandle_t m_nAttachIndex[10]; // 0x758 - 0x762
   unsigned char pad_762[0x2]; // 0x762 - 0x764
   float m_fWidth; // 0x764 - 0x768
   float m_fEndWidth; // 0x768 - 0x76C
   float m_fFadeLength; // 0x76C - 0x770
   float m_fHaloScale; // 0x770 - 0x774
   float m_fAmplitude; // 0x774 - 0x778
   float m_fStartFrame; // 0x778 - 0x77C
   float m_fSpeed; // 0x77C - 0x780
   float m_flFrame; // 0x780 - 0x784
   BeamClipStyle_t m_nClipStyle; // 0x784 - 0x788
   bool m_bTurnedOff; // 0x788 - 0x789
   unsigned char pad_789[0x3]; // 0x789 - 0x78C
   Vector m_vecEndPos; // 0x78C - 0x798
   CHandle< CBaseEntity > m_hEndEntity; // 0x798 - 0x79C
   int32_t m_nDissolveType; // 0x79C - 0x7A0
}; // size - 0x7A0


class CBodyComponentSkeletonInstance /* "client" */ : public CBodyComponent /* "client" */
{
public:
   CSkeletonInstance m_skeletonInstance; // 0x50 - 0x440
   CNetworkVarChainer __m_pChainEntity; // 0x440 - 0x468
   unsigned char pad_468[0x8]; // 0x468 - 0x470
}; // size - 0x470


class CBodyComponentSkeletonInstance /* "server" */ : public CBodyComponent /* "server" */
{
public:
   CSkeletonInstance m_skeletonInstance; // 0x50 - 0x440
   CNetworkVarChainer __m_pChainEntity; // 0x440 - 0x468
   unsigned char pad_468[0x8]; // 0x468 - 0x470
}; // size - 0x470


class CBreakable /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_700[0x10]; // 0x700 - 0x710
   Materials m_Material; // 0x710 - 0x714
   CHandle< CBaseEntity > m_hBreaker; // 0x714 - 0x718
   Explosions m_Explosion; // 0x718 - 0x71C
   unsigned char pad_71C[0x4]; // 0x71C - 0x720
   CUtlSymbolLarge m_iszSpawnObject; // 0x720 - 0x728
   float m_flPressureDelay; // 0x728 - 0x72C
   int32_t m_iMinHealthDmg; // 0x72C - 0x730
   CUtlSymbolLarge m_iszPropData; // 0x730 - 0x738
   float m_impactEnergyScale; // 0x738 - 0x73C
   EOverrideBlockLOS_t m_nOverrideBlockLOS; // 0x73C - 0x740
   CEntityIOOutput m_OnBreak; // 0x740 - 0x768
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0x768 - 0x790
   float m_flDmgModBullet; // 0x790 - 0x794
   float m_flDmgModClub; // 0x794 - 0x798
   float m_flDmgModExplosive; // 0x798 - 0x79C
   float m_flDmgModFire; // 0x79C - 0x7A0
   CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0x7A0 - 0x7A8
   CUtlSymbolLarge m_iszBasePropData; // 0x7A8 - 0x7B0
   int32_t m_iInteractions; // 0x7B0 - 0x7B4
   PerformanceMode_t m_PerformanceMode; // 0x7B4 - 0x7B8
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x7B8 - 0x7BC
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x7BC - 0x7C0
}; // size - 0x7C0


class CCSGO_TeamSelectCharacterPosition /* "server" */ : public CCSGO_TeamPreviewCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC38]; // 0x0 - 0xC38
}; // size - 0xC38


class CCSGO_WingmanIntroCharacterPosition /* "server" */ : public CCSGO_TeamIntroCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC38]; // 0x0 - 0xC38
}; // size - 0xC38


class CCSGO_WingmanIntroCharacterPosition /* "client" */ : public C_CSGO_TeamIntroCharacterPosition /* "client" */
{
public:
   unsigned char pad_0[0x1270]; // 0x0 - 0x1270
}; // size - 0x1270


class CCSPlayerBase_CameraServices /* "server" */ : public CPlayer_CameraServices /* "server" */
{
public:
   uint32_t m_iFOV; // 0x170 - 0x174
   uint32_t m_iFOVStart; // 0x174 - 0x178
   GameTime_t m_flFOVTime; // 0x178 - 0x17C
   float m_flFOVRate; // 0x17C - 0x180
   CHandle< CBaseEntity > m_hZoomOwner; // 0x180 - 0x184
   unsigned char pad_184[0x4]; // 0x184 - 0x188
   CUtlVector< CHandle< CBaseEntity > > m_hTriggerFogList; // 0x188 - 0x1A0
   CHandle< CBaseEntity > m_hLastFogTrigger; // 0x1A0 - 0x1A4
   unsigned char pad_1A4[0x4]; // 0x1A4 - 0x1A8
}; // size - 0x1A8


class CCSPlayerBase_CameraServices /* "client" */ : public CPlayer_CameraServices /* "client" */
{
public:
   uint32_t m_iFOV; // 0x210 - 0x214
   uint32_t m_iFOVStart; // 0x214 - 0x218
   GameTime_t m_flFOVTime; // 0x218 - 0x21C
   float m_flFOVRate; // 0x21C - 0x220
   CHandle< C_BaseEntity > m_hZoomOwner; // 0x220 - 0x224
   float m_flLastShotFOV; // 0x224 - 0x228
}; // size - 0x228


class CCSPlayerPawnBase /* "server" */ : public CBasePlayerPawn /* "server" */
{
public:
   unsigned char pad_B50[0x10]; // 0xB50 - 0xB60
   CTouchExpansionComponent m_CTouchExpansionComponent; // 0xB60 - 0xBB0
   CCSPlayer_PingServices* m_pPingServices; // 0xBB0 - 0xBB8
   CPlayer_ViewModelServices* m_pViewModelServices; // 0xBB8 - 0xBC0
   uint32_t m_iDisplayHistoryBits; // 0xBC0 - 0xBC4
   float m_flLastAttackedTeammate; // 0xBC4 - 0xBC8
   CHandle< CCSPlayerController > m_hOriginalController; // 0xBC8 - 0xBCC
   GameTime_t m_blindUntilTime; // 0xBCC - 0xBD0
   GameTime_t m_blindStartTime; // 0xBD0 - 0xBD4
   GameTime_t m_allowAutoFollowTime; // 0xBD4 - 0xBD8
   EntitySpottedState_t m_entitySpottedState; // 0xBD8 - 0xBF0
   int32_t m_nSpotRules; // 0xBF0 - 0xBF4
   CSPlayerState m_iPlayerState; // 0xBF4 - 0xBF8
   unsigned char pad_BF8[0x8]; // 0xBF8 - 0xC00
   CountdownTimer m_chickenIdleSoundTimer; // 0xC00 - 0xC18
   CountdownTimer m_chickenJumpSoundTimer; // 0xC18 - 0xC30
   unsigned char pad_C30[0xA0]; // 0xC30 - 0xCD0
   Vector m_vecLastBookmarkedPosition; // 0xCD0 - 0xCDC
   float m_flLastDistanceTraveledNotice; // 0xCDC - 0xCE0
   float m_flAccumulatedDistanceTraveled; // 0xCE0 - 0xCE4
   float m_flLastFriendlyFireDamageReductionRatio; // 0xCE4 - 0xCE8
   bool m_bRespawning; // 0xCE8 - 0xCE9
   unsigned char pad_CE9[0x3]; // 0xCE9 - 0xCEC
   int32_t m_nLastPickupPriority; // 0xCEC - 0xCF0
   float m_flLastPickupPriorityTime; // 0xCF0 - 0xCF4
   bool m_bIsScoped; // 0xCF4 - 0xCF5
   bool m_bIsWalking; // 0xCF5 - 0xCF6
   bool m_bResumeZoom; // 0xCF6 - 0xCF7
   bool m_bIsDefusing; // 0xCF7 - 0xCF8
   bool m_bIsGrabbingHostage; // 0xCF8 - 0xCF9
   unsigned char pad_CF9[0x3]; // 0xCF9 - 0xCFC
   CSPlayerBlockingUseAction_t m_iBlockingUseActionInProgress; // 0xCFC - 0xD00
   GameTime_t m_fImmuneToGunGameDamageTime; // 0xD00 - 0xD04
   bool m_bGunGameImmunity; // 0xD04 - 0xD05
   unsigned char pad_D05[0x3]; // 0xD05 - 0xD08
   uint32_t m_unTotalRoundDamageDealt; // 0xD08 - 0xD0C
   float m_fMolotovDamageTime; // 0xD0C - 0xD10
   bool m_bHasMovedSinceSpawn; // 0xD10 - 0xD11
   bool m_bCanMoveDuringFreezePeriod; // 0xD11 - 0xD12
   unsigned char pad_D12[0x2]; // 0xD12 - 0xD14
   float m_flGuardianTooFarDistFrac; // 0xD14 - 0xD18
   float m_flNextGuardianTooFarHurtTime; // 0xD18 - 0xD1C
   GameTime_t m_flDetectedByEnemySensorTime; // 0xD1C - 0xD20
   float m_flDealtDamageToEnemyMostRecentTimestamp; // 0xD20 - 0xD24
   GameTime_t m_flLastEquippedHelmetTime; // 0xD24 - 0xD28
   GameTime_t m_flLastEquippedArmorTime; // 0xD28 - 0xD2C
   int32_t m_nHeavyAssaultSuitCooldownRemaining; // 0xD2C - 0xD30
   bool m_bResetArmorNextSpawn; // 0xD30 - 0xD31
   unsigned char pad_D31[0x3]; // 0xD31 - 0xD34
   GameTime_t m_flLastBumpMineBumpTime; // 0xD34 - 0xD38
   GameTime_t m_flEmitSoundTime; // 0xD38 - 0xD3C
   int32_t m_iNumSpawns; // 0xD3C - 0xD40
   int32_t m_iShouldHaveCash; // 0xD40 - 0xD44
   bool m_bInvalidSteamLogonDelayed; // 0xD44 - 0xD45
   unsigned char pad_D45[0x3]; // 0xD45 - 0xD48
   GameTime_t m_flLastAction; // 0xD48 - 0xD4C
   float32 m_flNameChangeHistory[5]; // 0xD4C - 0xD60
   float m_fLastGivenDefuserTime; // 0xD60 - 0xD64
   float m_fLastGivenBombTime; // 0xD64 - 0xD68
   bool m_bHasNightVision; // 0xD68 - 0xD69
   bool m_bNightVisionOn; // 0xD69 - 0xD6A
   unsigned char pad_D6A[0x2]; // 0xD6A - 0xD6C
   float m_fNextRadarUpdateTime; // 0xD6C - 0xD70
   float m_flLastMoneyUpdateTime; // 0xD70 - 0xD74
   char m_MenuStringBuffer[1024]; // 0xD74 - 0x1174
   float m_fIntroCamTime; // 0x1174 - 0x1178
   int32_t m_nMyCollisionGroup; // 0x1178 - 0x117C
   bool m_bInNoDefuseArea; // 0x117C - 0x117D
   bool m_bKilledByTaser; // 0x117D - 0x117E
   unsigned char pad_117E[0x2]; // 0x117E - 0x1180
   int32_t m_iMoveState; // 0x1180 - 0x1184
   GameTime_t m_grenadeParameterStashTime; // 0x1184 - 0x1188
   bool m_bGrenadeParametersStashed; // 0x1188 - 0x1189
   unsigned char pad_1189[0x3]; // 0x1189 - 0x118C
   QAngle m_angStashedShootAngles; // 0x118C - 0x1198
   Vector m_vecStashedGrenadeThrowPosition; // 0x1198 - 0x11A4
   Vector m_vecStashedVelocity; // 0x11A4 - 0x11B0
   QAngle m_angShootAngleHistory[2]; // 0x11B0 - 0x11C8
   Vector m_vecThrowPositionHistory[2]; // 0x11C8 - 0x11E0
   Vector m_vecVelocityHistory[2]; // 0x11E0 - 0x11F8
   bool m_bDiedAirborne; // 0x11F8 - 0x11F9
   unsigned char pad_11F9[0x3]; // 0x11F9 - 0x11FC
   CEntityIndex m_iBombSiteIndex; // 0x11FC - 0x1200
   int32_t m_nWhichBombZone; // 0x1200 - 0x1204
   bool m_bInBombZoneTrigger; // 0x1204 - 0x1205
   bool m_bWasInBombZoneTrigger; // 0x1205 - 0x1206
   unsigned char pad_1206[0x2]; // 0x1206 - 0x1208
   int32_t m_iDirection; // 0x1208 - 0x120C
   int32_t m_iShotsFired; // 0x120C - 0x1210
   int32_t m_ArmorValue; // 0x1210 - 0x1214
   float m_flFlinchStack; // 0x1214 - 0x1218
   float m_flVelocityModifier; // 0x1218 - 0x121C
   float m_flHitHeading; // 0x121C - 0x1220
   int32_t m_nHitBodyPart; // 0x1220 - 0x1224
   int32_t m_iHostagesKilled; // 0x1224 - 0x1228
   Vector m_vecTotalBulletForce; // 0x1228 - 0x1234
   float m_flFlashDuration; // 0x1234 - 0x1238
   float m_flFlashMaxAlpha; // 0x1238 - 0x123C
   float m_flProgressBarStartTime; // 0x123C - 0x1240
   int32_t m_iProgressBarDuration; // 0x1240 - 0x1244
   bool m_bWaitForNoAttack; // 0x1244 - 0x1245
   unsigned char pad_1245[0x3]; // 0x1245 - 0x1248
   float m_flLowerBodyYawTarget; // 0x1248 - 0x124C
   bool m_bStrafing; // 0x124C - 0x124D
   unsigned char pad_124D[0x3]; // 0x124D - 0x1250
   Vector m_lastStandingPos; // 0x1250 - 0x125C
   float m_ignoreLadderJumpTime; // 0x125C - 0x1260
   CountdownTimer m_ladderSurpressionTimer; // 0x1260 - 0x1278
   Vector m_lastLadderNormal; // 0x1278 - 0x1284
   Vector m_lastLadderPos; // 0x1284 - 0x1290
   QAngle m_thirdPersonHeading; // 0x1290 - 0x129C
   float m_flSlopeDropOffset; // 0x129C - 0x12A0
   float m_flSlopeDropHeight; // 0x12A0 - 0x12A4
   Vector m_vHeadConstraintOffset; // 0x12A4 - 0x12B0
   unsigned char pad_12B0[0x8]; // 0x12B0 - 0x12B8
   int32_t m_iLastWeaponFireUsercmd; // 0x12B8 - 0x12BC
   QAngle m_angEyeAngles; // 0x12BC - 0x12C8
   bool m_bVCollisionInitted; // 0x12C8 - 0x12C9
   unsigned char pad_12C9[0x3]; // 0x12C9 - 0x12CC
   Vector m_storedSpawnPosition; // 0x12CC - 0x12D8
   QAngle m_storedSpawnAngle; // 0x12D8 - 0x12E4
   bool m_bIsSpawning; // 0x12E4 - 0x12E5
   bool m_bHideTargetID; // 0x12E5 - 0x12E6
   unsigned char pad_12E6[0x2]; // 0x12E6 - 0x12E8
   int32_t m_nNumDangerZoneDamageHits; // 0x12E8 - 0x12EC
   bool m_bHud_MiniScoreHidden; // 0x12EC - 0x12ED
   bool m_bHud_RadarHidden; // 0x12ED - 0x12EE
   unsigned char pad_12EE[0x2]; // 0x12EE - 0x12F0
   CEntityIndex m_nLastKillerIndex; // 0x12F0 - 0x12F4
   int32_t m_nLastConcurrentKilled; // 0x12F4 - 0x12F8
   int32_t m_nDeathCamMusic; // 0x12F8 - 0x12FC
   int32_t m_iAddonBits; // 0x12FC - 0x1300
   int32_t m_iPrimaryAddon; // 0x1300 - 0x1304
   int32_t m_iSecondaryAddon; // 0x1304 - 0x1308
   CUtlStringToken m_currentDeafnessFilter; // 0x1308 - 0x130C
   int32_t m_NumEnemiesKilledThisSpawn; // 0x130C - 0x1310
   int32_t m_NumEnemiesKilledThisRound; // 0x1310 - 0x1314
   int32_t m_NumEnemiesAtRoundStart; // 0x1314 - 0x1318
   bool m_wasNotKilledNaturally; // 0x1318 - 0x1319
   unsigned char pad_1319[0x3]; // 0x1319 - 0x131C
   uint32 m_vecPlayerPatchEconIndices[5]; // 0x131C - 0x1330
   int32_t m_iDeathFlags; // 0x1330 - 0x1334
   CHandle< CChicken > m_hPet; // 0x1334 - 0x1338
   unsigned char pad_1338[0x1C8]; // 0x1338 - 0x1500
   uint16_t m_unCurrentEquipmentValue; // 0x1500 - 0x1502
   uint16_t m_unRoundStartEquipmentValue; // 0x1502 - 0x1504
   uint16_t m_unFreezetimeEndEquipmentValue; // 0x1504 - 0x1506
   unsigned char pad_1506[0x2]; // 0x1506 - 0x1508
   int32_t m_nSurvivalTeamNumber; // 0x1508 - 0x150C
   bool m_bHasDeathInfo; // 0x150C - 0x150D
   unsigned char pad_150D[0x3]; // 0x150D - 0x1510
   float m_flDeathInfoTime; // 0x1510 - 0x1514
   Vector m_vecDeathInfoOrigin; // 0x1514 - 0x1520
   bool m_bKilledByHeadshot; // 0x1520 - 0x1521
   unsigned char pad_1521[0x3]; // 0x1521 - 0x1524
   int32_t m_LastHitBox; // 0x1524 - 0x1528
   int32_t m_LastHealth; // 0x1528 - 0x152C
   float m_flLastCollisionCeiling; // 0x152C - 0x1530
   float m_flLastCollisionCeilingChangeTime; // 0x1530 - 0x1534
   unsigned char pad_1534[0x4]; // 0x1534 - 0x1538
   CCSBot* m_pBot; // 0x1538 - 0x1540
   bool m_bBotAllowActive; // 0x1540 - 0x1541
   bool m_bCommittingSuicideOnTeamChange; // 0x1541 - 0x1542
   unsigned char pad_1542[0x6]; // 0x1542 - 0x1548
}; // size - 0x1548


class CCycleBase /* "modellib" */
{
public:
   float m_flCycle; // 0x0 - 0x4
}; // size - 0x4


class CExampleSchemaVData_PolymorphicBase /* "resourcefile" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   int32_t m_nBase; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
}; // size - 0x10


class CFuncBrush /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   BrushSolidities_e m_iSolidity; // 0x700 - 0x704
   int32_t m_iDisabled; // 0x704 - 0x708
   bool m_bSolidBsp; // 0x708 - 0x709
   unsigned char pad_709[0x7]; // 0x709 - 0x710
   CUtlSymbolLarge m_iszExcludedClass; // 0x710 - 0x718
   bool m_bInvertExclusion; // 0x718 - 0x719
   bool m_bScriptedMovement; // 0x719 - 0x71A
   unsigned char pad_71A[0x6]; // 0x71A - 0x720
}; // size - 0x720


class CGeneralSpin /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   int32_t m_nSpinRateDegrees; // 0x1C0 - 0x1C4
   int32_t m_nSpinRateMinDegrees; // 0x1C4 - 0x1C8
   unsigned char pad_1C8[0x4]; // 0x1C8 - 0x1CC
   float m_fSpinRateStopTime; // 0x1CC - 0x1D0
   unsigned char pad_1D0[0x10]; // 0x1D0 - 0x1E0
}; // size - 0x1E0


class CLogicalEntity /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x540]; // 0x0 - 0x540
}; // size - 0x540


class CMotionNode /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlString m_name; // 0x18 - 0x20
   AnimNodeID m_id; // 0x20 - 0x24
   unsigned char pad_24[0x4]; // 0x24 - 0x28
}; // size - 0x28


class CPathAnimMotorUpdaterBase /* "animgraphlib" */ : public CAnimMotorUpdaterBase /* "animgraphlib" */
{
public:
   bool m_bLockToPath; // 0x20 - 0x21
   unsigned char pad_21[0x7]; // 0x21 - 0x28
}; // size - 0x28


class CPhysForce /* "server" */ : public CPointEntity /* "server" */
{
public:
   unsigned char pad_4B0[0x8]; // 0x4B0 - 0x4B8
   CUtlSymbolLarge m_nameAttach; // 0x4B8 - 0x4C0
   float m_force; // 0x4C0 - 0x4C4
   float m_forceTime; // 0x4C4 - 0x4C8
   CHandle< CBaseEntity > m_attachedObject; // 0x4C8 - 0x4CC
   bool m_wasRestored; // 0x4CC - 0x4CD
   unsigned char pad_4CD[0x3]; // 0x4CD - 0x4D0
   CConstantForceController m_integrator; // 0x4D0 - 0x510
}; // size - 0x510


class CPlayer_UseServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_UseServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_ViewModelServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_ViewModelServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPulseCell_BaseYieldingInflow /* "pulse_runtime_lib" */ : public CPulseCell_BaseFlow /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x48]; // 0x0 - 0x48
}; // size - 0x48


class CPulseExecCursor /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x188]; // 0x0 - 0x188
}; // size - 0x188


class CRagdollProp /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   unsigned char pad_890[0x8]; // 0x890 - 0x898
   ragdoll_t m_ragdoll; // 0x898 - 0x8D0
   bool m_bStartDisabled; // 0x8D0 - 0x8D1
   unsigned char pad_8D1[0x7]; // 0x8D1 - 0x8D8
   CNetworkUtlVectorBase< Vector > m_ragPos; // 0x8D8 - 0x8F0
   CNetworkUtlVectorBase< QAngle > m_ragAngles; // 0x8F0 - 0x908
   CHandle< CBaseEntity > m_hRagdollSource; // 0x908 - 0x90C
   uint32_t m_lastUpdateTickCount; // 0x90C - 0x910
   bool m_allAsleep; // 0x910 - 0x911
   bool m_bFirstCollisionAfterLaunch; // 0x911 - 0x912
   unsigned char pad_912[0x2]; // 0x912 - 0x914
   CHandle< CBaseEntity > m_hDamageEntity; // 0x914 - 0x918
   CHandle< CBaseEntity > m_hKiller; // 0x918 - 0x91C
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x91C - 0x920
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x920 - 0x924
   GameTime_t m_flFadeOutStartTime; // 0x924 - 0x928
   float m_flFadeTime; // 0x928 - 0x92C
   Vector m_vecLastOrigin; // 0x92C - 0x938
   GameTime_t m_flAwakeTime; // 0x938 - 0x93C
   GameTime_t m_flLastOriginChangeTime; // 0x93C - 0x940
   int32_t m_nBloodColor; // 0x940 - 0x944
   unsigned char pad_944[0x4]; // 0x944 - 0x948
   CUtlSymbolLarge m_strOriginClassName; // 0x948 - 0x950
   CUtlSymbolLarge m_strSourceClassName; // 0x950 - 0x958
   bool m_bHasBeenPhysgunned; // 0x958 - 0x959
   bool m_bShouldTeleportPhysics; // 0x959 - 0x95A
   unsigned char pad_95A[0x2]; // 0x95A - 0x95C
   float m_flBlendWeight; // 0x95C - 0x960
   float m_flDefaultFadeScale; // 0x960 - 0x964
   unsigned char pad_964[0x4]; // 0x964 - 0x968
   CUtlVector< Vector > m_ragdollMins; // 0x968 - 0x980
   CUtlVector< Vector > m_ragdollMaxs; // 0x980 - 0x998
   bool m_bShouldDeleteActivationRecord; // 0x998 - 0x999
   unsigned char pad_999[0x5F]; // 0x999 - 0x9F8
   bool m_bValidatePoweredRagdollPose; // 0x9F8 - 0x9F9
   unsigned char pad_9F9[0x3F]; // 0x9F9 - 0xA38
}; // size - 0xA38


class CSSDSMsg_LayerBase /* "scenesystem" */
{
public:
   SceneViewId_t m_viewId; // 0x0 - 0x10
   CUtlString m_ViewName; // 0x10 - 0x18
   int32_t m_nLayerIndex; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
   uint64_t m_nLayerId; // 0x20 - 0x28
   CUtlString m_LayerName; // 0x28 - 0x30
   CUtlString m_displayText; // 0x30 - 0x38
}; // size - 0x38


class CSceneEntity /* "server" */ : public CPointEntity /* "server" */
{
public:
   unsigned char pad_4B0[0x8]; // 0x4B0 - 0x4B8
   CUtlSymbolLarge m_iszSceneFile; // 0x4B8 - 0x4C0
   CUtlSymbolLarge m_iszResumeSceneFile; // 0x4C0 - 0x4C8
   CUtlSymbolLarge m_iszTarget1; // 0x4C8 - 0x4D0
   CUtlSymbolLarge m_iszTarget2; // 0x4D0 - 0x4D8
   CUtlSymbolLarge m_iszTarget3; // 0x4D8 - 0x4E0
   CUtlSymbolLarge m_iszTarget4; // 0x4E0 - 0x4E8
   CUtlSymbolLarge m_iszTarget5; // 0x4E8 - 0x4F0
   CUtlSymbolLarge m_iszTarget6; // 0x4F0 - 0x4F8
   CUtlSymbolLarge m_iszTarget7; // 0x4F8 - 0x500
   CUtlSymbolLarge m_iszTarget8; // 0x500 - 0x508
   CHandle< CBaseEntity > m_hTarget1; // 0x508 - 0x50C
   CHandle< CBaseEntity > m_hTarget2; // 0x50C - 0x510
   CHandle< CBaseEntity > m_hTarget3; // 0x510 - 0x514
   CHandle< CBaseEntity > m_hTarget4; // 0x514 - 0x518
   CHandle< CBaseEntity > m_hTarget5; // 0x518 - 0x51C
   CHandle< CBaseEntity > m_hTarget6; // 0x51C - 0x520
   CHandle< CBaseEntity > m_hTarget7; // 0x520 - 0x524
   CHandle< CBaseEntity > m_hTarget8; // 0x524 - 0x528
   bool m_bIsPlayingBack; // 0x528 - 0x529
   bool m_bPaused; // 0x529 - 0x52A
   bool m_bMultiplayer; // 0x52A - 0x52B
   bool m_bAutogenerated; // 0x52B - 0x52C
   float m_flForceClientTime; // 0x52C - 0x530
   float m_flCurrentTime; // 0x530 - 0x534
   float m_flFrameTime; // 0x534 - 0x538
   bool m_bCancelAtNextInterrupt; // 0x538 - 0x539
   unsigned char pad_539[0x3]; // 0x539 - 0x53C
   float m_fPitch; // 0x53C - 0x540
   bool m_bAutomated; // 0x540 - 0x541
   unsigned char pad_541[0x3]; // 0x541 - 0x544
   int32_t m_nAutomatedAction; // 0x544 - 0x548
   float m_flAutomationDelay; // 0x548 - 0x54C
   float m_flAutomationTime; // 0x54C - 0x550
   CHandle< CBaseEntity > m_hWaitingForThisResumeScene; // 0x550 - 0x554
   bool m_bWaitingForResumeScene; // 0x554 - 0x555
   bool m_bPausedViaInput; // 0x555 - 0x556
   bool m_bPauseAtNextInterrupt; // 0x556 - 0x557
   bool m_bWaitingForActor; // 0x557 - 0x558
   bool m_bWaitingForInterrupt; // 0x558 - 0x559
   bool m_bInterruptedActorsScenes; // 0x559 - 0x55A
   bool m_bBreakOnNonIdle; // 0x55A - 0x55B
   unsigned char pad_55B[0x5]; // 0x55B - 0x560
   CNetworkUtlVectorBase< CHandle< CBaseFlex > > m_hActorList; // 0x560 - 0x578
   CUtlVector< CHandle< CBaseEntity > > m_hRemoveActorList; // 0x578 - 0x590
   unsigned char pad_590[0x10]; // 0x590 - 0x5A0
   int32_t m_nSceneFlushCounter; // 0x5A0 - 0x5A4
   uint16_t m_nSceneStringIndex; // 0x5A4 - 0x5A6
   unsigned char pad_5A6[0x2]; // 0x5A6 - 0x5A8
   CEntityIOOutput m_OnStart; // 0x5A8 - 0x5D0
   CEntityIOOutput m_OnCompletion; // 0x5D0 - 0x5F8
   CEntityIOOutput m_OnCanceled; // 0x5F8 - 0x620
   CEntityIOOutput m_OnPaused; // 0x620 - 0x648
   CEntityIOOutput m_OnResumed; // 0x648 - 0x670
   CEntityIOOutput m_OnTrigger[16]; // 0x670 - 0x8F0
   unsigned char pad_8F0[0x90]; // 0x8F0 - 0x980
   CHandle< CSceneEntity > m_hInterruptScene; // 0x980 - 0x984
   int32_t m_nInterruptCount; // 0x984 - 0x988
   bool m_bSceneMissing; // 0x988 - 0x989
   bool m_bInterrupted; // 0x989 - 0x98A
   bool m_bCompletedEarly; // 0x98A - 0x98B
   bool m_bInterruptSceneFinished; // 0x98B - 0x98C
   bool m_bRestoring; // 0x98C - 0x98D
   unsigned char pad_98D[0x3]; // 0x98D - 0x990
   CUtlVector< CHandle< CSceneEntity > > m_hNotifySceneCompletion; // 0x990 - 0x9A8
   CUtlVector< CHandle< CSceneListManager > > m_hListManagers; // 0x9A8 - 0x9C0
   unsigned char pad_9C0[0x28]; // 0x9C0 - 0x9E8
   CUtlSymbolLarge m_iszSoundName; // 0x9E8 - 0x9F0
   CHandle< CBaseFlex > m_hActor; // 0x9F0 - 0x9F4
   CHandle< CBaseEntity > m_hActivator; // 0x9F4 - 0x9F8
   int32_t m_BusyActor; // 0x9F8 - 0x9FC
   SceneOnPlayerDeath_t m_iPlayerDeathBehavior; // 0x9FC - 0xA00
   unsigned char pad_A00[0x8]; // 0xA00 - 0xA08
}; // size - 0xA08


class CServerOnlyModelEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_0[0x700]; // 0x0 - 0x700
}; // size - 0x700


class CSkeletonAnimationController /* "server" */ : public ISkeletonAnimationController /* "server" */
{
public:
   CSkeletonInstance* m_pSkeletonInstance; // 0x8 - 0x10
}; // size - 0x10


class CSoundAreaEntityBase /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x4B0 - 0x4B1
   unsigned char pad_4B1[0x7]; // 0x4B1 - 0x4B8
   CUtlSymbolLarge m_iszSoundAreaType; // 0x4B8 - 0x4C0
   Vector m_vPos; // 0x4C0 - 0x4CC
   unsigned char pad_4CC[0x4]; // 0x4CC - 0x4D0
}; // size - 0x4D0


class CTriggerHurt /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   float m_flOriginalDamage; // 0x8A8 - 0x8AC
   float m_flDamage; // 0x8AC - 0x8B0
   float m_flDamageCap; // 0x8B0 - 0x8B4
   GameTime_t m_flLastDmgTime; // 0x8B4 - 0x8B8
   float m_flForgivenessDelay; // 0x8B8 - 0x8BC
   int32_t m_bitsDamageInflict; // 0x8BC - 0x8C0
   int32_t m_damageModel; // 0x8C0 - 0x8C4
   bool m_bNoDmgForce; // 0x8C4 - 0x8C5
   unsigned char pad_8C5[0x3]; // 0x8C5 - 0x8C8
   Vector m_vDamageForce; // 0x8C8 - 0x8D4
   bool m_thinkAlways; // 0x8D4 - 0x8D5
   unsigned char pad_8D5[0x3]; // 0x8D5 - 0x8D8
   float m_hurtThinkPeriod; // 0x8D8 - 0x8DC
   unsigned char pad_8DC[0x4]; // 0x8DC - 0x8E0
   CEntityIOOutput m_OnHurt; // 0x8E0 - 0x908
   CEntityIOOutput m_OnHurtPlayer; // 0x908 - 0x930
   CUtlVector< CHandle< CBaseEntity > > m_hurtEntities; // 0x930 - 0x948
}; // size - 0x948


class CTriggerOnce /* "server" */ : public CTriggerMultiple /* "server" */
{
public:
   unsigned char pad_0[0x8D0]; // 0x0 - 0x8D0
}; // size - 0x8D0


class C_BarnLight /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   bool m_bEnabled; // 0xCC0 - 0xCC1
   unsigned char pad_CC1[0x3]; // 0xCC1 - 0xCC4
   int32_t m_nColorMode; // 0xCC4 - 0xCC8
   Color m_Color; // 0xCC8 - 0xCCC
   float m_flColorTemperature; // 0xCCC - 0xCD0
   float m_flBrightness; // 0xCD0 - 0xCD4
   float m_flBrightnessScale; // 0xCD4 - 0xCD8
   int32_t m_nDirectLight; // 0xCD8 - 0xCDC
   int32_t m_nBakedShadowIndex; // 0xCDC - 0xCE0
   int32_t m_nLuminaireShape; // 0xCE0 - 0xCE4
   float m_flLuminaireSize; // 0xCE4 - 0xCE8
   float m_flLuminaireAnisotropy; // 0xCE8 - 0xCEC
   unsigned char pad_CEC[0x4]; // 0xCEC - 0xCF0
   CUtlString m_LightStyleString; // 0xCF0 - 0xCF8
   GameTime_t m_flLightStyleStartTime; // 0xCF8 - 0xCFC
   unsigned char pad_CFC[0x4]; // 0xCFC - 0xD00
   C_NetworkUtlVectorBase< CUtlString > m_QueuedLightStyleStrings; // 0xD00 - 0xD18
   C_NetworkUtlVectorBase< CUtlString > m_LightStyleEvents; // 0xD18 - 0xD30
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_LightStyleTargets; // 0xD30 - 0xD48
   CEntityIOOutput m_StyleEvent[4]; // 0xD48 - 0xDE8
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; // 0xDE8 - 0xDF0
   float m_flShape; // 0xDF0 - 0xDF4
   float m_flSoftX; // 0xDF4 - 0xDF8
   float m_flSoftY; // 0xDF8 - 0xDFC
   float m_flSkirt; // 0xDFC - 0xE00
   float m_flSkirtNear; // 0xE00 - 0xE04
   Vector m_vSizeParams; // 0xE04 - 0xE10
   float m_flRange; // 0xE10 - 0xE14
   Vector m_vShear; // 0xE14 - 0xE20
   int32_t m_nBakeSpecularToCubemaps; // 0xE20 - 0xE24
   Vector m_vBakeSpecularToCubemapsSize; // 0xE24 - 0xE30
   int32_t m_nCastShadows; // 0xE30 - 0xE34
   int32_t m_nShadowMapSize; // 0xE34 - 0xE38
   int32_t m_nShadowPriority; // 0xE38 - 0xE3C
   bool m_bContactShadow; // 0xE3C - 0xE3D
   unsigned char pad_E3D[0x3]; // 0xE3D - 0xE40
   int32_t m_nBounceLight; // 0xE40 - 0xE44
   float m_flBounceScale; // 0xE44 - 0xE48
   float m_flMinRoughness; // 0xE48 - 0xE4C
   Vector m_vAlternateColor; // 0xE4C - 0xE58
   float m_fAlternateColorBrightness; // 0xE58 - 0xE5C
   int32_t m_nFog; // 0xE5C - 0xE60
   float m_flFogStrength; // 0xE60 - 0xE64
   int32_t m_nFogShadows; // 0xE64 - 0xE68
   float m_flFogScale; // 0xE68 - 0xE6C
   float m_flFadeSizeStart; // 0xE6C - 0xE70
   float m_flFadeSizeEnd; // 0xE70 - 0xE74
   float m_flShadowFadeSizeStart; // 0xE74 - 0xE78
   float m_flShadowFadeSizeEnd; // 0xE78 - 0xE7C
   bool m_bPrecomputedFieldsValid; // 0xE7C - 0xE7D
   unsigned char pad_E7D[0x3]; // 0xE7D - 0xE80
   Vector m_vPrecomputedBoundsMins; // 0xE80 - 0xE8C
   Vector m_vPrecomputedBoundsMaxs; // 0xE8C - 0xE98
   Vector m_vPrecomputedOBBOrigin; // 0xE98 - 0xEA4
   QAngle m_vPrecomputedOBBAngles; // 0xEA4 - 0xEB0
   Vector m_vPrecomputedOBBExtent; // 0xEB0 - 0xEBC
   unsigned char pad_EBC[0x4C]; // 0xEBC - 0xF08
}; // size - 0xF08


class C_CSGO_EndOfMatchLineupEndpoint /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x540]; // 0x0 - 0x540
}; // size - 0x540


class C_CSGO_PreviewPlayer /* "client" */ : public C_CSPlayerPawn /* "client" */
{
public:
   CUtlString m_animgraph; // 0x22C8 - 0x22D0
   CUtlString m_animgraphCharacterModeString; // 0x22D0 - 0x22D8
   float m_flInitialModelScale; // 0x22D8 - 0x22DC
   unsigned char pad_22DC[0x84]; // 0x22DC - 0x2360
}; // size - 0x2360


class C_CSGO_TeamSelectCharacterPosition /* "client" */ : public C_CSGO_TeamPreviewCharacterPosition /* "client" */
{
public:
   unsigned char pad_0[0x1270]; // 0x0 - 0x1270
}; // size - 0x1270


class C_FuncBrush /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_0[0xCC0]; // 0x0 - 0xCC0
}; // size - 0xCC0


class C_OP_RemapDistanceToLineSegmentBase /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   int32_t m_nCP0; // 0x1C0 - 0x1C4
   int32_t m_nCP1; // 0x1C4 - 0x1C8
   float m_flMinInputValue; // 0x1C8 - 0x1CC
   float m_flMaxInputValue; // 0x1CC - 0x1D0
   bool m_bInfiniteLine; // 0x1D0 - 0x1D1
   unsigned char pad_1D1[0xF]; // 0x1D1 - 0x1E0
}; // size - 0x1E0


class C_ParticleSystem /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   char m_szSnapshotFileName[512]; // 0xCC0 - 0xEC0
   bool m_bActive; // 0xEC0 - 0xEC1
   bool m_bFrozen; // 0xEC1 - 0xEC2
   unsigned char pad_EC2[0x2]; // 0xEC2 - 0xEC4
   float m_flFreezeTransitionDuration; // 0xEC4 - 0xEC8
   int32_t m_nStopType; // 0xEC8 - 0xECC
   bool m_bAnimateDuringGameplayPause; // 0xECC - 0xECD
   unsigned char pad_ECD[0x3]; // 0xECD - 0xED0
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0xED0 - 0xED8
   GameTime_t m_flStartTime; // 0xED8 - 0xEDC
   float m_flPreSimTime; // 0xEDC - 0xEE0
   Vector m_vServerControlPoints[4]; // 0xEE0 - 0xF10
   uint8 m_iServerControlPointAssignments[4]; // 0xF10 - 0xF14
   CHandle< C_BaseEntity > m_hControlPointEnts[64]; // 0xF14 - 0x1014
   bool m_bNoSave; // 0x1014 - 0x1015
   bool m_bNoFreeze; // 0x1015 - 0x1016
   bool m_bNoRamp; // 0x1016 - 0x1017
   bool m_bStartActive; // 0x1017 - 0x1018
   CUtlSymbolLarge m_iszEffectName; // 0x1018 - 0x1020
   CUtlSymbolLarge m_iszControlPointNames[64]; // 0x1020 - 0x1220
   int32_t m_nDataCP; // 0x1220 - 0x1224
   Vector m_vecDataCPValue; // 0x1224 - 0x1230
   int32_t m_nTintCP; // 0x1230 - 0x1234
   Color m_clrTint; // 0x1234 - 0x1238
   unsigned char pad_1238[0x20]; // 0x1238 - 0x1258
   bool m_bOldActive; // 0x1258 - 0x1259
   bool m_bOldFrozen; // 0x1259 - 0x125A
   unsigned char pad_125A[0x16]; // 0x125A - 0x1270
}; // size - 0x1270


class C_PhysicsProp /* "client" */ : public C_BreakableProp /* "client" */
{
public:
   bool m_bAwake; // 0xFD0 - 0xFD1
   unsigned char pad_FD1[0x7]; // 0xFD1 - 0xFD8
}; // size - 0xFD8


class C_PointClientUIWorldPanel /* "client" */ : public C_BaseClientUIEntity /* "client" */
{
public:
   unsigned char pad_CF0[0x8]; // 0xCF0 - 0xCF8
   bool m_bForceRecreateNextUpdate; // 0xCF8 - 0xCF9
   bool m_bMoveViewToPlayerNextThink; // 0xCF9 - 0xCFA
   bool m_bCheckCSSClasses; // 0xCFA - 0xCFB
   unsigned char pad_CFB[0x5]; // 0xCFB - 0xD00
   CTransform m_anchorDeltaTransform; // 0xD00 - 0xD20
   unsigned char pad_D20[0x180]; // 0xD20 - 0xEA0
   CPointOffScreenIndicatorUi* m_pOffScreenIndicator; // 0xEA0 - 0xEA8
   unsigned char pad_EA8[0x20]; // 0xEA8 - 0xEC8
   bool m_bIgnoreInput; // 0xEC8 - 0xEC9
   bool m_bLit; // 0xEC9 - 0xECA
   bool m_bFollowPlayerAcrossTeleport; // 0xECA - 0xECB
   unsigned char pad_ECB[0x1]; // 0xECB - 0xECC
   float m_flWidth; // 0xECC - 0xED0
   float m_flHeight; // 0xED0 - 0xED4
   float m_flDPI; // 0xED4 - 0xED8
   float m_flInteractDistance; // 0xED8 - 0xEDC
   float m_flDepthOffset; // 0xEDC - 0xEE0
   uint32_t m_unOwnerContext; // 0xEE0 - 0xEE4
   uint32_t m_unHorizontalAlign; // 0xEE4 - 0xEE8
   uint32_t m_unVerticalAlign; // 0xEE8 - 0xEEC
   uint32_t m_unOrientation; // 0xEEC - 0xEF0
   bool m_bAllowInteractionFromAllSceneWorlds; // 0xEF0 - 0xEF1
   unsigned char pad_EF1[0x7]; // 0xEF1 - 0xEF8
   C_NetworkUtlVectorBase< CUtlSymbolLarge > m_vecCSSClasses; // 0xEF8 - 0xF10
   bool m_bOpaque; // 0xF10 - 0xF11
   bool m_bNoDepth; // 0xF11 - 0xF12
   bool m_bRenderBackface; // 0xF12 - 0xF13
   bool m_bUseOffScreenIndicator; // 0xF13 - 0xF14
   bool m_bExcludeFromSaveGames; // 0xF14 - 0xF15
   bool m_bGrabbable; // 0xF15 - 0xF16
   bool m_bOnlyRenderToTexture; // 0xF16 - 0xF17
   bool m_bDisableMipGen; // 0xF17 - 0xF18
   int32_t m_nExplicitImageLayout; // 0xF18 - 0xF1C
   unsigned char pad_F1C[0x4]; // 0xF1C - 0xF20
}; // size - 0xF20


class C_SoundAreaEntityBase /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   bool m_bDisabled; // 0x540 - 0x541
   unsigned char pad_541[0x7]; // 0x541 - 0x548
   bool m_bWasEnabled; // 0x548 - 0x549
   unsigned char pad_549[0x7]; // 0x549 - 0x550
   CUtlSymbolLarge m_iszSoundAreaType; // 0x550 - 0x558
   Vector m_vPos; // 0x558 - 0x564
   unsigned char pad_564[0x4]; // 0x564 - 0x568
}; // size - 0x568


class EventAdvanceTick_t /* "engine2" */ : public EventSimulate_t /* "engine2" */
{
public:
   int32_t m_nCurrentTick; // 0x30 - 0x34
   int32_t m_nCurrentTickThisFrame; // 0x34 - 0x38
   int32_t m_nTotalTicksThisFrame; // 0x38 - 0x3C
   int32_t m_nTotalTicks; // 0x3C - 0x40
}; // size - 0x40


class EventPostAdvanceTick_t /* "engine2" */ : public EventSimulate_t /* "engine2" */
{
public:
   int32_t m_nCurrentTick; // 0x30 - 0x34
   int32_t m_nCurrentTickThisFrame; // 0x34 - 0x38
   int32_t m_nTotalTicksThisFrame; // 0x38 - 0x3C
   int32_t m_nTotalTicks; // 0x3C - 0x40
}; // size - 0x40


class IEconItemInterface /* "server" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class AmmoTypeInfo_t /* "server" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   int32_t m_nMaxCarry; // 0x10 - 0x14
   unsigned char pad_14[0x8]; // 0x14 - 0x1C
   CRangeInt m_nSplashSize; // 0x1C - 0x24
   AmmoFlags_t m_nFlags; // 0x24 - 0x28
   float m_flMass; // 0x28 - 0x2C
   CRangeFloat m_flSpeed; // 0x2C - 0x34
   unsigned char pad_34[0x4]; // 0x34 - 0x38
}; // size - 0x38


class AnimationSnapshotBase_t /* "animationsystem" */
{
public:
   float m_flRealTime; // 0x0 - 0x4
   unsigned char pad_4[0xC]; // 0x4 - 0x10
   matrix3x4a_t m_rootToWorld; // 0x10 - 0x40
   bool m_bBonesInWorldSpace; // 0x40 - 0x41
   unsigned char pad_41[0x7]; // 0x41 - 0x48
   CUtlVector< uint32 > m_boneSetupMask; // 0x48 - 0x60
   CUtlVector< matrix3x4a_t > m_boneTransforms; // 0x60 - 0x78
   CUtlVector< float32 > m_flexControllers; // 0x78 - 0x90
   AnimationSnapshotType_t m_SnapshotType; // 0x90 - 0x94
   bool m_bHasDecodeDump; // 0x94 - 0x95
   unsigned char pad_95[0x3]; // 0x95 - 0x98
   AnimationDecodeDebugDumpElement_t m_DecodeDump; // 0x98 - 0x108
   unsigned char pad_108[0x8]; // 0x108 - 0x110
}; // size - 0x110


class CAI_ExpresserWithFollowup /* "server" */ : public CAI_Expresser /* "server" */
{
public:
   ResponseFollowup* m_pPostponedFollowup; // 0x60 - 0x68
   unsigned char pad_68[0x8]; // 0x68 - 0x70
}; // size - 0x70


class CAnimGraphSettingsGroup /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
}; // size - 0x20


class CAnimScriptBase /* "host" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   bool m_bIsValid; // 0x8 - 0x9
   unsigned char pad_9[0x7]; // 0x9 - 0x10
}; // size - 0x10


class CAttributeManager /* "server" */
{
public:
   class cached_attribute_float_t /* "server" */
   {
   public:
      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4]; // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14
      unsigned char pad_14[0x4]; // 0x14 - 0x18
   }; // size - 0x18

   class cached_attribute_float_t /* "client" */
   {
   public:
      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4]; // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14
      unsigned char pad_14[0x4]; // 0x14 - 0x18
   }; // size - 0x18

   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVector< CHandle< CBaseEntity > > m_Providers; // 0x8 - 0x20
   int32_t m_iReapplyProvisionParity; // 0x20 - 0x24
   CHandle< CBaseEntity > m_hOuter; // 0x24 - 0x28
   bool m_bPreventLoopback; // 0x28 - 0x29
   unsigned char pad_29[0x3]; // 0x29 - 0x2C
   attributeprovidertypes_t m_ProviderType; // 0x2C - 0x30
   CUtlVector< CAttributeManager::cached_attribute_float_t > m_CachedResults; // 0x30 - 0x48
   unsigned char pad_48[0x8]; // 0x48 - 0x50
}; // size - 0x50


class CAttributeManager /* "client" */
{
public:
   class cached_attribute_float_t /* "server" */
   {
   public:
      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4]; // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14
      unsigned char pad_14[0x4]; // 0x14 - 0x18
   }; // size - 0x18

   class cached_attribute_float_t /* "client" */
   {
   public:
      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4]; // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14
      unsigned char pad_14[0x4]; // 0x14 - 0x18
   }; // size - 0x18

   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVector< CHandle< C_BaseEntity > > m_Providers; // 0x8 - 0x20
   int32_t m_iReapplyProvisionParity; // 0x20 - 0x24
   CHandle< C_BaseEntity > m_hOuter; // 0x24 - 0x28
   bool m_bPreventLoopback; // 0x28 - 0x29
   unsigned char pad_29[0x3]; // 0x29 - 0x2C
   attributeprovidertypes_t m_ProviderType; // 0x2C - 0x30
   CUtlVector< CAttributeManager::cached_attribute_float_t > m_CachedResults; // 0x30 - 0x48
   unsigned char pad_48[0x8]; // 0x48 - 0x50
}; // size - 0x50


class CBaseDoor /* "server" */ : public CBaseToggle /* "server" */
{
public:
   unsigned char pad_780[0x10]; // 0x780 - 0x790
   QAngle m_angMoveEntitySpace; // 0x790 - 0x79C
   Vector m_vecMoveDirParentSpace; // 0x79C - 0x7A8
   locksound_t m_ls; // 0x7A8 - 0x7C8
   bool m_bForceClosed; // 0x7C8 - 0x7C9
   bool m_bDoorGroup; // 0x7C9 - 0x7CA
   bool m_bLocked; // 0x7CA - 0x7CB
   bool m_bIgnoreDebris; // 0x7CB - 0x7CC
   FuncDoorSpawnPos_t m_eSpawnPosition; // 0x7CC - 0x7D0
   float m_flBlockDamage; // 0x7D0 - 0x7D4
   unsigned char pad_7D4[0x4]; // 0x7D4 - 0x7D8
   CUtlSymbolLarge m_NoiseMoving; // 0x7D8 - 0x7E0
   CUtlSymbolLarge m_NoiseArrived; // 0x7E0 - 0x7E8
   CUtlSymbolLarge m_NoiseMovingClosed; // 0x7E8 - 0x7F0
   CUtlSymbolLarge m_NoiseArrivedClosed; // 0x7F0 - 0x7F8
   CUtlSymbolLarge m_ChainTarget; // 0x7F8 - 0x800
   CEntityIOOutput m_OnBlockedClosing; // 0x800 - 0x828
   CEntityIOOutput m_OnBlockedOpening; // 0x828 - 0x850
   CEntityIOOutput m_OnUnblockedClosing; // 0x850 - 0x878
   CEntityIOOutput m_OnUnblockedOpening; // 0x878 - 0x8A0
   CEntityIOOutput m_OnFullyClosed; // 0x8A0 - 0x8C8
   CEntityIOOutput m_OnFullyOpen; // 0x8C8 - 0x8F0
   CEntityIOOutput m_OnClose; // 0x8F0 - 0x918
   CEntityIOOutput m_OnOpen; // 0x918 - 0x940
   CEntityIOOutput m_OnLockedUse; // 0x940 - 0x968
   bool m_bLoopMoveSound; // 0x968 - 0x969
   unsigned char pad_969[0x17]; // 0x969 - 0x980
   bool m_bCreateNavObstacle; // 0x980 - 0x981
   bool m_isChaining; // 0x981 - 0x982
   bool m_bIsUsable; // 0x982 - 0x983
   unsigned char pad_983[0x5]; // 0x983 - 0x988
}; // size - 0x988


class CBaseFire /* "server" */ : public CBaseEntity /* "server" */
{
public:
   float m_flScale; // 0x4B0 - 0x4B4
   float m_flStartScale; // 0x4B4 - 0x4B8
   float m_flScaleTime; // 0x4B8 - 0x4BC
   uint32_t m_nFlags; // 0x4BC - 0x4C0
}; // size - 0x4C0


class CBasePlayerController /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_4B0[0x8]; // 0x4B0 - 0x4B8
   uint64_t m_nInButtonsWhichAreToggles; // 0x4B8 - 0x4C0
   uint32_t m_nTickBase; // 0x4C0 - 0x4C4
   unsigned char pad_4C4[0x2C]; // 0x4C4 - 0x4F0
   CHandle< CBasePlayerPawn > m_hPawn; // 0x4F0 - 0x4F4
   CSplitScreenSlot m_nSplitScreenSlot; // 0x4F4 - 0x4F8
   CHandle< CBasePlayerController > m_hSplitOwner; // 0x4F8 - 0x4FC
   unsigned char pad_4FC[0x4]; // 0x4FC - 0x500
   CUtlVector< CHandle< CBasePlayerController > > m_hSplitScreenPlayers; // 0x500 - 0x518
   bool m_bIsHLTV; // 0x518 - 0x519
   unsigned char pad_519[0x3]; // 0x519 - 0x51C
   PlayerConnectedState m_iConnected; // 0x51C - 0x520
   char m_iszPlayerName[128]; // 0x520 - 0x5A0
   CUtlString m_szNetworkIDString; // 0x5A0 - 0x5A8
   float m_fLerpTime; // 0x5A8 - 0x5AC
   bool m_bLagCompensation; // 0x5AC - 0x5AD
   bool m_bPredict; // 0x5AD - 0x5AE
   bool m_bAutoKickDisabled; // 0x5AE - 0x5AF
   bool m_bIsLowViolence; // 0x5AF - 0x5B0
   bool m_bGamePaused; // 0x5B0 - 0x5B1
   unsigned char pad_5B1[0x77]; // 0x5B1 - 0x628
   int32_t m_nHighestCommandNumberReceived; // 0x628 - 0x62C
   unsigned char pad_62C[0x4]; // 0x62C - 0x630
   int64_t m_nUsecTimestampLastUserCmdReceived; // 0x630 - 0x638
   unsigned char pad_638[0x10]; // 0x638 - 0x648
   ChatIgnoreType_t m_iIgnoreGlobalChat; // 0x648 - 0x64C
   float m_flLastPlayerTalkTime; // 0x64C - 0x650
   float m_flLastEntitySteadyState; // 0x650 - 0x654
   int32_t m_nAvailableEntitySteadyState; // 0x654 - 0x658
   bool m_bHasAnySteadyStateEnts; // 0x658 - 0x659
   unsigned char pad_659[0xF]; // 0x659 - 0x668
   uint64_t m_steamID; // 0x668 - 0x670
   uint32_t m_iDesiredFOV; // 0x670 - 0x674
   unsigned char pad_674[0x1C]; // 0x674 - 0x690
}; // size - 0x690


class CBasePlayerController /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_540[0x8]; // 0x540 - 0x548
   int32_t m_nFinalPredictedTick; // 0x548 - 0x54C
   unsigned char pad_54C[0x4]; // 0x54C - 0x550
   C_CommandContext m_CommandContext; // 0x550 - 0x5D0
   uint64_t m_nInButtonsWhichAreToggles; // 0x5D0 - 0x5D8
   uint32_t m_nTickBase; // 0x5D8 - 0x5DC
   CHandle< C_BasePlayerPawn > m_hPawn; // 0x5DC - 0x5E0
   CHandle< C_BasePlayerPawn > m_hPredictedPawn; // 0x5E0 - 0x5E4
   CSplitScreenSlot m_nSplitScreenSlot; // 0x5E4 - 0x5E8
   CHandle< CBasePlayerController > m_hSplitOwner; // 0x5E8 - 0x5EC
   unsigned char pad_5EC[0x4]; // 0x5EC - 0x5F0
   CUtlVector< CHandle< CBasePlayerController > > m_hSplitScreenPlayers; // 0x5F0 - 0x608
   bool m_bIsHLTV; // 0x608 - 0x609
   unsigned char pad_609[0x3]; // 0x609 - 0x60C
   PlayerConnectedState m_iConnected; // 0x60C - 0x610
   char m_iszPlayerName[128]; // 0x610 - 0x690
   unsigned char pad_690[0x8]; // 0x690 - 0x698
   uint64_t m_steamID; // 0x698 - 0x6A0
   bool m_bIsLocalPlayerController; // 0x6A0 - 0x6A1
   unsigned char pad_6A1[0x3]; // 0x6A1 - 0x6A4
   uint32_t m_iDesiredFOV; // 0x6A4 - 0x6A8
   unsigned char pad_6A8[0x18]; // 0x6A8 - 0x6C0
}; // size - 0x6C0


class CBasePlayerWeaponVData /* "client" */ : public CEntitySubclassVDataBase /* "client" */
{
public:
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_szWorldModel; // 0x28 - 0x108
   bool m_bBuiltRightHanded; // 0x108 - 0x109
   bool m_bAllowFlipping; // 0x109 - 0x10A
   bool m_bIsFullAuto; // 0x10A - 0x10B
   unsigned char pad_10B[0x1]; // 0x10B - 0x10C
   int32_t m_nNumBullets; // 0x10C - 0x110
   CUtlString m_sMuzzleAttachment; // 0x110 - 0x118
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szMuzzleFlashParticle; // 0x118 - 0x1F8
   ItemFlagTypes_t m_iFlags; // 0x1F8 - 0x1F9
   AmmoIndex_t m_nPrimaryAmmoType; // 0x1F9 - 0x1FA
   AmmoIndex_t m_nSecondaryAmmoType; // 0x1FA - 0x1FB
   unsigned char pad_1FB[0x1]; // 0x1FB - 0x1FC
   int32_t m_iMaxClip1; // 0x1FC - 0x200
   int32_t m_iMaxClip2; // 0x200 - 0x204
   int32_t m_iDefaultClip1; // 0x204 - 0x208
   int32_t m_iDefaultClip2; // 0x208 - 0x20C
   int32_t m_iWeight; // 0x20C - 0x210
   bool m_bAutoSwitchTo; // 0x210 - 0x211
   bool m_bAutoSwitchFrom; // 0x211 - 0x212
   unsigned char pad_212[0x2]; // 0x212 - 0x214
   RumbleEffect_t m_iRumbleEffect; // 0x214 - 0x218
   CUtlMap< WeaponSound_t, CSoundEventName > m_aShootSounds; // 0x218 - 0x238
   int32_t m_iSlot; // 0x238 - 0x23C
   int32_t m_iPosition; // 0x23C - 0x240
}; // size - 0x240


class CBasePlayerWeaponVData /* "server" */ : public CEntitySubclassVDataBase /* "server" */
{
public:
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_szWorldModel; // 0x28 - 0x108
   bool m_bBuiltRightHanded; // 0x108 - 0x109
   bool m_bAllowFlipping; // 0x109 - 0x10A
   bool m_bIsFullAuto; // 0x10A - 0x10B
   unsigned char pad_10B[0x1]; // 0x10B - 0x10C
   int32_t m_nNumBullets; // 0x10C - 0x110
   CUtlString m_sMuzzleAttachment; // 0x110 - 0x118
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szMuzzleFlashParticle; // 0x118 - 0x1F8
   ItemFlagTypes_t m_iFlags; // 0x1F8 - 0x1F9
   AmmoIndex_t m_nPrimaryAmmoType; // 0x1F9 - 0x1FA
   AmmoIndex_t m_nSecondaryAmmoType; // 0x1FA - 0x1FB
   unsigned char pad_1FB[0x1]; // 0x1FB - 0x1FC
   int32_t m_iMaxClip1; // 0x1FC - 0x200
   int32_t m_iMaxClip2; // 0x200 - 0x204
   int32_t m_iDefaultClip1; // 0x204 - 0x208
   int32_t m_iDefaultClip2; // 0x208 - 0x20C
   int32_t m_iWeight; // 0x20C - 0x210
   bool m_bAutoSwitchTo; // 0x210 - 0x211
   bool m_bAutoSwitchFrom; // 0x211 - 0x212
   unsigned char pad_212[0x2]; // 0x212 - 0x214
   RumbleEffect_t m_iRumbleEffect; // 0x214 - 0x218
   CUtlMap< WeaponSound_t, CSoundEventName > m_aShootSounds; // 0x218 - 0x238
   int32_t m_iSlot; // 0x238 - 0x23C
   int32_t m_iPosition; // 0x23C - 0x240
}; // size - 0x240


class CBaseTrailRenderer /* "particles" */ : public CBaseRendererSource2 /* "particles" */
{
public:
   ParticleOrientationChoiceList_t m_nOrientationType; // 0x2470 - 0x2474
   int32_t m_nOrientationControlPoint; // 0x2474 - 0x2478
   float m_flMinSize; // 0x2478 - 0x247C
   float m_flMaxSize; // 0x247C - 0x2480
   CParticleCollectionRendererFloatInput m_flStartFadeSize; // 0x2480 - 0x25D8
   CParticleCollectionRendererFloatInput m_flEndFadeSize; // 0x25D8 - 0x2730
   bool m_bClampV; // 0x2730 - 0x2731
   unsigned char pad_2731[0xF]; // 0x2731 - 0x2740
}; // size - 0x2740


class CBot /* "server" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CCSPlayerController* m_pController; // 0x10 - 0x18
   CCSPlayerPawn* m_pPlayer; // 0x18 - 0x20
   bool m_bHasSpawned; // 0x20 - 0x21
   unsigned char pad_21[0x3]; // 0x21 - 0x24
   uint32_t m_id; // 0x24 - 0x28
   unsigned char pad_28[0x70]; // 0x28 - 0x98
   bool m_isRunning; // 0x98 - 0x99
   bool m_isCrouching; // 0x99 - 0x9A
   unsigned char pad_9A[0x2]; // 0x9A - 0x9C
   float m_forwardSpeed; // 0x9C - 0xA0
   float m_leftSpeed; // 0xA0 - 0xA4
   float m_verticalSpeed; // 0xA4 - 0xA8
   uint64_t m_buttonFlags; // 0xA8 - 0xB0
   float m_jumpTimestamp; // 0xB0 - 0xB4
   Vector m_viewForward; // 0xB4 - 0xC0
   unsigned char pad_C0[0x10]; // 0xC0 - 0xD0
   int32_t m_postureStackIndex; // 0xD0 - 0xD4
   unsigned char pad_D4[0x4]; // 0xD4 - 0xD8
}; // size - 0xD8


class CBtNodeCondition /* "server" */ : public CBtNodeDecorator /* "server" */
{
public:
   bool m_bNegated; // 0x58 - 0x59
   unsigned char pad_59[0x7]; // 0x59 - 0x60
}; // size - 0x60


class CEntityComponent /* "entity2" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class CEntityComponent /* "entity2" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class CEnvCubemap /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_4B0[0x88]; // 0x4B0 - 0x538
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hCubemapTexture; // 0x538 - 0x540
   bool m_bCustomCubemapTexture; // 0x540 - 0x541
   unsigned char pad_541[0x3]; // 0x541 - 0x544
   float m_flInfluenceRadius; // 0x544 - 0x548
   Vector m_vBoxProjectMins; // 0x548 - 0x554
   Vector m_vBoxProjectMaxs; // 0x554 - 0x560
   CUtlSymbolLarge m_LightGroups; // 0x560 - 0x568
   bool m_bMoveable; // 0x568 - 0x569
   unsigned char pad_569[0x3]; // 0x569 - 0x56C
   int32_t m_nHandshake; // 0x56C - 0x570
   int32_t m_nEnvCubeMapArrayIndex; // 0x570 - 0x574
   int32_t m_nPriority; // 0x574 - 0x578
   float m_flEdgeFadeDist; // 0x578 - 0x57C
   Vector m_vEdgeFadeDists; // 0x57C - 0x588
   float m_flDiffuseScale; // 0x588 - 0x58C
   bool m_bStartDisabled; // 0x58C - 0x58D
   bool m_bDefaultEnvMap; // 0x58D - 0x58E
   bool m_bDefaultSpecEnvMap; // 0x58E - 0x58F
   bool m_bIndoorCubeMap; // 0x58F - 0x590
   bool m_bCopyDiffuseFromDefaultCubemap; // 0x590 - 0x591
   unsigned char pad_591[0xF]; // 0x591 - 0x5A0
   bool m_bEnabled; // 0x5A0 - 0x5A1
   unsigned char pad_5A1[0x7]; // 0x5A1 - 0x5A8
}; // size - 0x5A8


class CEnvSoundscapeProxy /* "server" */ : public CEnvSoundscape /* "server" */
{
public:
   CUtlSymbolLarge m_MainSoundscapeName; // 0x548 - 0x550
}; // size - 0x550


class CEnvSoundscapeTriggerable /* "server" */ : public CEnvSoundscape /* "server" */
{
public:
   unsigned char pad_0[0x548]; // 0x0 - 0x548
}; // size - 0x548


class CFuncLadder /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   Vector m_vecLadderDir; // 0x700 - 0x70C
   unsigned char pad_70C[0x4]; // 0x70C - 0x710
   CUtlVector< CHandle< CInfoLadderDismount > > m_Dismounts; // 0x710 - 0x728
   Vector m_vecLocalTop; // 0x728 - 0x734
   Vector m_vecPlayerMountPositionTop; // 0x734 - 0x740
   Vector m_vecPlayerMountPositionBottom; // 0x740 - 0x74C
   float m_flAutoRideSpeed; // 0x74C - 0x750
   bool m_bDisabled; // 0x750 - 0x751
   bool m_bFakeLadder; // 0x751 - 0x752
   bool m_bHasSlack; // 0x752 - 0x753
   unsigned char pad_753[0x5]; // 0x753 - 0x758
   CUtlSymbolLarge m_surfacePropName; // 0x758 - 0x760
   CEntityIOOutput m_OnPlayerGotOnLadder; // 0x760 - 0x788
   CEntityIOOutput m_OnPlayerGotOffLadder; // 0x788 - 0x7B0
}; // size - 0x7B0


class CFuncMoveLinear /* "server" */ : public CBaseToggle /* "server" */
{
public:
   MoveLinearAuthoredPos_t m_authoredPosition; // 0x780 - 0x784
   QAngle m_angMoveEntitySpace; // 0x784 - 0x790
   Vector m_vecMoveDirParentSpace; // 0x790 - 0x79C
   unsigned char pad_79C[0x4]; // 0x79C - 0x7A0
   CUtlSymbolLarge m_soundStart; // 0x7A0 - 0x7A8
   CUtlSymbolLarge m_soundStop; // 0x7A8 - 0x7B0
   CUtlSymbolLarge m_currentSound; // 0x7B0 - 0x7B8
   float m_flBlockDamage; // 0x7B8 - 0x7BC
   float m_flStartPosition; // 0x7BC - 0x7C0
   float m_flMoveDistance; // 0x7C0 - 0x7C4
   unsigned char pad_7C4[0xC]; // 0x7C4 - 0x7D0
   CEntityIOOutput m_OnFullyOpen; // 0x7D0 - 0x7F8
   CEntityIOOutput m_OnFullyClosed; // 0x7F8 - 0x820
   bool m_bCreateMovableNavMesh; // 0x820 - 0x821
   bool m_bCreateNavObstacle; // 0x821 - 0x822
   unsigned char pad_822[0xE]; // 0x822 - 0x830
}; // size - 0x830


class CFuncNavBlocker /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x700 - 0x701
   unsigned char pad_701[0x3]; // 0x701 - 0x704
   int32_t m_nBlockedTeamNumber; // 0x704 - 0x708
   unsigned char pad_708[0x8]; // 0x708 - 0x710
}; // size - 0x710


class CFuncTrackChange /* "server" */ : public CFuncPlatRot /* "server" */
{
public:
   CPathTrack* m_trackTop; // 0x7C8 - 0x7D0
   CPathTrack* m_trackBottom; // 0x7D0 - 0x7D8
   CFuncTrackTrain* m_train; // 0x7D8 - 0x7E0
   CUtlSymbolLarge m_trackTopName; // 0x7E0 - 0x7E8
   CUtlSymbolLarge m_trackBottomName; // 0x7E8 - 0x7F0
   CUtlSymbolLarge m_trainName; // 0x7F0 - 0x7F8
   TRAIN_CODE m_code; // 0x7F8 - 0x7FC
   int32_t m_targetState; // 0x7FC - 0x800
   int32_t m_use; // 0x800 - 0x804
   unsigned char pad_804[0x4]; // 0x804 - 0x808
}; // size - 0x808


class CFuncTrackTrain /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   CHandle< CPathTrack > m_ppath; // 0x700 - 0x704
   float m_length; // 0x704 - 0x708
   Vector m_vPosPrev; // 0x708 - 0x714
   QAngle m_angPrev; // 0x714 - 0x720
   Vector m_controlMins; // 0x720 - 0x72C
   Vector m_controlMaxs; // 0x72C - 0x738
   Vector m_lastBlockPos; // 0x738 - 0x744
   int32_t m_lastBlockTick; // 0x744 - 0x748
   float m_flVolume; // 0x748 - 0x74C
   float m_flBank; // 0x74C - 0x750
   float m_oldSpeed; // 0x750 - 0x754
   float m_flBlockDamage; // 0x754 - 0x758
   float m_height; // 0x758 - 0x75C
   float m_maxSpeed; // 0x75C - 0x760
   float m_dir; // 0x760 - 0x764
   unsigned char pad_764[0x4]; // 0x764 - 0x768
   CUtlSymbolLarge m_iszSoundMove; // 0x768 - 0x770
   CUtlSymbolLarge m_iszSoundMovePing; // 0x770 - 0x778
   CUtlSymbolLarge m_iszSoundStart; // 0x778 - 0x780
   CUtlSymbolLarge m_iszSoundStop; // 0x780 - 0x788
   CUtlSymbolLarge m_strPathTarget; // 0x788 - 0x790
   float m_flMoveSoundMinDuration; // 0x790 - 0x794
   float m_flMoveSoundMaxDuration; // 0x794 - 0x798
   GameTime_t m_flNextMoveSoundTime; // 0x798 - 0x79C
   float m_flMoveSoundMinPitch; // 0x79C - 0x7A0
   float m_flMoveSoundMaxPitch; // 0x7A0 - 0x7A4
   TrainOrientationType_t m_eOrientationType; // 0x7A4 - 0x7A8
   TrainVelocityType_t m_eVelocityType; // 0x7A8 - 0x7AC
   unsigned char pad_7AC[0xC]; // 0x7AC - 0x7B8
   CEntityIOOutput m_OnStart; // 0x7B8 - 0x7E0
   CEntityIOOutput m_OnNext; // 0x7E0 - 0x808
   CEntityIOOutput m_OnArrivedAtDestinationNode; // 0x808 - 0x830
   bool m_bManualSpeedChanges; // 0x830 - 0x831
   unsigned char pad_831[0x3]; // 0x831 - 0x834
   float m_flDesiredSpeed; // 0x834 - 0x838
   GameTime_t m_flSpeedChangeTime; // 0x838 - 0x83C
   float m_flAccelSpeed; // 0x83C - 0x840
   float m_flDecelSpeed; // 0x840 - 0x844
   bool m_bAccelToSpeed; // 0x844 - 0x845
   unsigned char pad_845[0x3]; // 0x845 - 0x848
   float m_flTimeScale; // 0x848 - 0x84C
   GameTime_t m_flNextMPSoundTime; // 0x84C - 0x850
}; // size - 0x850


class CFuncWall /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   int32_t m_nState; // 0x700 - 0x704
   unsigned char pad_704[0x4]; // 0x704 - 0x708
}; // size - 0x708


class CGameRulesProxy /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_0[0x4B0]; // 0x0 - 0x4B0
}; // size - 0x4B0


class CGameSceneNode /* "client" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CTransform m_nodeToWorld; // 0x10 - 0x30
   CEntityInstance* m_pOwner; // 0x30 - 0x38
   CGameSceneNode* m_pParent; // 0x38 - 0x40
   CGameSceneNode* m_pChild; // 0x40 - 0x48
   CGameSceneNode* m_pNextSibling; // 0x48 - 0x50
   unsigned char pad_50[0x20]; // 0x50 - 0x70
   CGameSceneNodeHandle m_hParent; // 0x70 - 0x80
   CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x80 - 0xB0
   unsigned char pad_B0[0x8]; // 0xB0 - 0xB8
   QAngle m_angRotation; // 0xB8 - 0xC4
   float m_flScale; // 0xC4 - 0xC8
   Vector m_vecAbsOrigin; // 0xC8 - 0xD4
   QAngle m_angAbsRotation; // 0xD4 - 0xE0
   float m_flAbsScale; // 0xE0 - 0xE4
   int16_t m_nParentAttachmentOrBone; // 0xE4 - 0xE6
   bool m_bDebugAbsOriginChanges; // 0xE6 - 0xE7
   bool m_bDormant; // 0xE7 - 0xE8
   bool m_bForceParentToBeNetworked; // 0xE8 - 0xE9
   unsigned char m_bDirtyHierarchy : 1; // 0xE9 - 0xEA
   unsigned char m_bDirtyBoneMergeInfo : 1; // 0xE9 - 0xEA
   unsigned char m_bNetworkedPositionChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bNetworkedAnglesChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bNetworkedScaleChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bWillBeCallingPostDataUpdate : 1; // 0xE9 - 0xEA
   unsigned char m_bNotifyBoneTransformsChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bBoneMergeFlex : 1; // 0xE9 - 0xEA
   unsigned char m_nLatchAbsOrigin : 2; // 0xEA - 0xEB
   unsigned char m_bDirtyBoneMergeBoneToRoot : 1; // 0xEA - 0xEB
   uint8_t m_nHierarchicalDepth; // 0xEB - 0xEC
   uint8_t m_nHierarchyType; // 0xEC - 0xED
   uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0xED - 0xEE
   unsigned char pad_EE[0x2]; // 0xEE - 0xF0
   CUtlStringToken m_name; // 0xF0 - 0xF4
   unsigned char pad_F4[0x3C]; // 0xF4 - 0x130
   CUtlStringToken m_hierarchyAttachName; // 0x130 - 0x134
   float m_flZOffset; // 0x134 - 0x138
   Vector m_vRenderOrigin; // 0x138 - 0x144
   unsigned char pad_144[0xC]; // 0x144 - 0x150
}; // size - 0x150


class CGameSceneNode /* "server" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CTransform m_nodeToWorld; // 0x10 - 0x30
   CEntityInstance* m_pOwner; // 0x30 - 0x38
   CGameSceneNode* m_pParent; // 0x38 - 0x40
   CGameSceneNode* m_pChild; // 0x40 - 0x48
   CGameSceneNode* m_pNextSibling; // 0x48 - 0x50
   unsigned char pad_50[0x20]; // 0x50 - 0x70
   CGameSceneNodeHandle m_hParent; // 0x70 - 0x80
   CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x80 - 0xB0
   unsigned char pad_B0[0x8]; // 0xB0 - 0xB8
   QAngle m_angRotation; // 0xB8 - 0xC4
   float m_flScale; // 0xC4 - 0xC8
   Vector m_vecAbsOrigin; // 0xC8 - 0xD4
   QAngle m_angAbsRotation; // 0xD4 - 0xE0
   float m_flAbsScale; // 0xE0 - 0xE4
   int16_t m_nParentAttachmentOrBone; // 0xE4 - 0xE6
   bool m_bDebugAbsOriginChanges; // 0xE6 - 0xE7
   bool m_bDormant; // 0xE7 - 0xE8
   bool m_bForceParentToBeNetworked; // 0xE8 - 0xE9
   unsigned char m_bDirtyHierarchy : 1; // 0xE9 - 0xEA
   unsigned char m_bDirtyBoneMergeInfo : 1; // 0xE9 - 0xEA
   unsigned char m_bNetworkedPositionChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bNetworkedAnglesChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bNetworkedScaleChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bWillBeCallingPostDataUpdate : 1; // 0xE9 - 0xEA
   unsigned char m_bNotifyBoneTransformsChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bBoneMergeFlex : 1; // 0xE9 - 0xEA
   unsigned char m_nLatchAbsOrigin : 2; // 0xEA - 0xEB
   unsigned char m_bDirtyBoneMergeBoneToRoot : 1; // 0xEA - 0xEB
   uint8_t m_nHierarchicalDepth; // 0xEB - 0xEC
   uint8_t m_nHierarchyType; // 0xEC - 0xED
   uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0xED - 0xEE
   unsigned char pad_EE[0x2]; // 0xEE - 0xF0
   CUtlStringToken m_name; // 0xF0 - 0xF4
   unsigned char pad_F4[0x3C]; // 0xF4 - 0x130
   CUtlStringToken m_hierarchyAttachName; // 0x130 - 0x134
   float m_flZOffset; // 0x134 - 0x138
   Vector m_vRenderOrigin; // 0x138 - 0x144
   unsigned char pad_144[0xC]; // 0x144 - 0x150
}; // size - 0x150


class CHostage /* "server" */ : public CHostageExpresserShim /* "server" */
{
public:
   unsigned char pad_9D8[0x10]; // 0x9D8 - 0x9E8
   CEntityIOOutput m_OnHostageBeginGrab; // 0x9E8 - 0xA10
   CEntityIOOutput m_OnFirstPickedUp; // 0xA10 - 0xA38
   CEntityIOOutput m_OnDroppedNotRescued; // 0xA38 - 0xA60
   CEntityIOOutput m_OnRescued; // 0xA60 - 0xA88
   EntitySpottedState_t m_entitySpottedState; // 0xA88 - 0xAA0
   int32_t m_nSpotRules; // 0xAA0 - 0xAA4
   uint32_t m_uiHostageSpawnExclusionGroupMask; // 0xAA4 - 0xAA8
   uint32_t m_nHostageSpawnRandomFactor; // 0xAA8 - 0xAAC
   bool m_bRemove; // 0xAAC - 0xAAD
   unsigned char pad_AAD[0x3]; // 0xAAD - 0xAB0
   Vector m_vel; // 0xAB0 - 0xABC
   bool m_isRescued; // 0xABC - 0xABD
   bool m_jumpedThisFrame; // 0xABD - 0xABE
   unsigned char pad_ABE[0x2]; // 0xABE - 0xAC0
   int32_t m_nHostageState; // 0xAC0 - 0xAC4
   CHandle< CBaseEntity > m_leader; // 0xAC4 - 0xAC8
   CHandle< CCSPlayerPawnBase > m_lastLeader; // 0xAC8 - 0xACC
   unsigned char pad_ACC[0x4]; // 0xACC - 0xAD0
   CountdownTimer m_reuseTimer; // 0xAD0 - 0xAE8
   bool m_hasBeenUsed; // 0xAE8 - 0xAE9
   unsigned char pad_AE9[0x3]; // 0xAE9 - 0xAEC
   Vector m_accel; // 0xAEC - 0xAF8
   bool m_isRunning; // 0xAF8 - 0xAF9
   bool m_isCrouching; // 0xAF9 - 0xAFA
   unsigned char pad_AFA[0x6]; // 0xAFA - 0xB00
   CountdownTimer m_jumpTimer; // 0xB00 - 0xB18
   bool m_isWaitingForLeader; // 0xB18 - 0xB19
   unsigned char pad_B19[0x200F]; // 0xB19 - 0x2B28
   CountdownTimer m_repathTimer; // 0x2B28 - 0x2B40
   CountdownTimer m_inhibitDoorTimer; // 0x2B40 - 0x2B58
   unsigned char pad_2B58[0x78]; // 0x2B58 - 0x2BD0
   CountdownTimer m_inhibitObstacleAvoidanceTimer; // 0x2BD0 - 0x2BE8
   unsigned char pad_2BE8[0x8]; // 0x2BE8 - 0x2BF0
   CountdownTimer m_wiggleTimer; // 0x2BF0 - 0x2C08
   unsigned char pad_2C08[0x4]; // 0x2C08 - 0x2C0C
   bool m_isAdjusted; // 0x2C0C - 0x2C0D
   bool m_bHandsHaveBeenCut; // 0x2C0D - 0x2C0E
   unsigned char pad_2C0E[0x2]; // 0x2C0E - 0x2C10
   CHandle< CCSPlayerPawn > m_hHostageGrabber; // 0x2C10 - 0x2C14
   GameTime_t m_fLastGrabTime; // 0x2C14 - 0x2C18
   Vector m_vecPositionWhenStartedDroppingToGround; // 0x2C18 - 0x2C24
   Vector m_vecGrabbedPos; // 0x2C24 - 0x2C30
   GameTime_t m_flRescueStartTime; // 0x2C30 - 0x2C34
   GameTime_t m_flGrabSuccessTime; // 0x2C34 - 0x2C38
   GameTime_t m_flDropStartTime; // 0x2C38 - 0x2C3C
   int32_t m_nApproachRewardPayouts; // 0x2C3C - 0x2C40
   int32_t m_nPickupEventCount; // 0x2C40 - 0x2C44
   Vector m_vecSpawnGroundPos; // 0x2C44 - 0x2C50
   unsigned char pad_2C50[0x18]; // 0x2C50 - 0x2C68
}; // size - 0x2C68


class CHostageRescueZoneShim /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   unsigned char pad_0[0x8A8]; // 0x0 - 0x8A8
}; // size - 0x8A8


class CHostageRescueZoneShim /* "client" */ : public C_BaseTrigger /* "client" */
{
public:
   unsigned char pad_0[0xCC8]; // 0x0 - 0xCC8
}; // size - 0xCC8


class CInferno /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_700[0x10]; // 0x700 - 0x710
   int32 m_fireXDelta[64]; // 0x710 - 0x810
   int32 m_fireYDelta[64]; // 0x810 - 0x910
   int32 m_fireZDelta[64]; // 0x910 - 0xA10
   int32 m_fireParentXDelta[64]; // 0xA10 - 0xB10
   int32 m_fireParentYDelta[64]; // 0xB10 - 0xC10
   int32 m_fireParentZDelta[64]; // 0xC10 - 0xD10
   bool m_bFireIsBurning[64]; // 0xD10 - 0xD50
   Vector m_BurnNormal[64]; // 0xD50 - 0x1050
   int32_t m_fireCount; // 0x1050 - 0x1054
   int32_t m_nInfernoType; // 0x1054 - 0x1058
   int32_t m_nFireEffectTickBegin; // 0x1058 - 0x105C
   float m_nFireLifetime; // 0x105C - 0x1060
   bool m_bInPostEffectTime; // 0x1060 - 0x1061
   unsigned char pad_1061[0x3]; // 0x1061 - 0x1064
   int32_t m_nFiresExtinguishCount; // 0x1064 - 0x1068
   bool m_bWasCreatedInSmoke; // 0x1068 - 0x1069
   unsigned char pad_1069[0x207]; // 0x1069 - 0x1270
   Extent m_extent; // 0x1270 - 0x1288
   CountdownTimer m_damageTimer; // 0x1288 - 0x12A0
   CountdownTimer m_damageRampTimer; // 0x12A0 - 0x12B8
   Vector m_splashVelocity; // 0x12B8 - 0x12C4
   Vector m_InitialSplashVelocity; // 0x12C4 - 0x12D0
   Vector m_startPos; // 0x12D0 - 0x12DC
   Vector m_vecOriginalSpawnLocation; // 0x12DC - 0x12E8
   IntervalTimer m_activeTimer; // 0x12E8 - 0x12F8
   int32_t m_fireSpawnOffset; // 0x12F8 - 0x12FC
   int32_t m_nMaxFlames; // 0x12FC - 0x1300
   CountdownTimer m_BookkeepingTimer; // 0x1300 - 0x1318
   CountdownTimer m_NextSpreadTimer; // 0x1318 - 0x1330
   uint16_t m_nSourceItemDefIndex; // 0x1330 - 0x1332
   unsigned char pad_1332[0x4E]; // 0x1332 - 0x1380
}; // size - 0x1380


class CInfoDynamicShadowHint /* "client" */ : public C_PointEntity /* "client" */
{
public:
   bool m_bDisabled; // 0x540 - 0x541
   unsigned char pad_541[0x3]; // 0x541 - 0x544
   float m_flRange; // 0x544 - 0x548
   int32_t m_nImportance; // 0x548 - 0x54C
   int32_t m_nLightChoice; // 0x54C - 0x550
   CHandle< C_BaseEntity > m_hLight; // 0x550 - 0x554
   unsigned char pad_554[0x4]; // 0x554 - 0x558
}; // size - 0x558


class CInfoDynamicShadowHint /* "server" */ : public CPointEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x4B0 - 0x4B1
   unsigned char pad_4B1[0x3]; // 0x4B1 - 0x4B4
   float m_flRange; // 0x4B4 - 0x4B8
   int32_t m_nImportance; // 0x4B8 - 0x4BC
   int32_t m_nLightChoice; // 0x4BC - 0x4C0
   CHandle< CBaseEntity > m_hLight; // 0x4C0 - 0x4C4
   unsigned char pad_4C4[0x4]; // 0x4C4 - 0x4C8
}; // size - 0x4C8


class CItemAssaultSuit /* "server" */ : public CItem /* "server" */
{
public:
   unsigned char pad_0[0x968]; // 0x0 - 0x968
}; // size - 0x968


class CItemDefuser /* "server" */ : public CItem /* "server" */
{
public:
   EntitySpottedState_t m_entitySpottedState; // 0x968 - 0x980
   int32_t m_nSpotRules; // 0x980 - 0x984
   unsigned char pad_984[0x4]; // 0x984 - 0x988
}; // size - 0x988


class CLightDirectionalEntity /* "server" */ : public CLightEntity /* "server" */
{
public:
   unsigned char pad_0[0x708]; // 0x0 - 0x708
}; // size - 0x708


class CLogicAutosave /* "server" */ : public CLogicalEntity /* "server" */
{
public:
   bool m_bForceNewLevelUnit; // 0x4B0 - 0x4B1
   unsigned char pad_4B1[0x3]; // 0x4B1 - 0x4B4
   int32_t m_minHitPoints; // 0x4B4 - 0x4B8
   int32_t m_minHitPointsToCommit; // 0x4B8 - 0x4BC
   unsigned char pad_4BC[0x4]; // 0x4BC - 0x4C0
}; // size - 0x4C0


class CLogicNPCCounterAABB /* "server" */ : public CLogicNPCCounter /* "server" */
{
public:
   Vector m_vDistanceOuterMins; // 0x7F0 - 0x7FC
   Vector m_vDistanceOuterMaxs; // 0x7FC - 0x808
   Vector m_vOuterMins; // 0x808 - 0x814
   Vector m_vOuterMaxs; // 0x814 - 0x820
}; // size - 0x820


class CMarkupVolumeWithRef /* "server" */ : public CMarkupVolumeTagged /* "server" */
{
public:
   bool m_bUseRef; // 0x740 - 0x741
   unsigned char pad_741[0x3]; // 0x741 - 0x744
   Vector m_vRefPos; // 0x744 - 0x750
   float m_flRefDot; // 0x750 - 0x754
   unsigned char pad_754[0x4]; // 0x754 - 0x758
}; // size - 0x758


class CMolotovGrenade /* "server" */ : public CBaseCSGrenade /* "server" */
{
public:
   unsigned char pad_0[0xE18]; // 0x0 - 0xE18
}; // size - 0xE18


class CMotionGraph /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CParamSpanUpdater m_paramSpans; // 0x10 - 0x28
   CUtlVector< TagSpan_t > m_tags; // 0x28 - 0x40
   CSmartPtr< CMotionNode > m_pRootNode; // 0x40 - 0x48
   int32_t m_nParameterCount; // 0x48 - 0x4C
   int32_t m_nConfigStartIndex; // 0x4C - 0x50
   int32_t m_nConfigCount; // 0x50 - 0x54
   bool m_bLoop; // 0x54 - 0x55
   unsigned char pad_55[0x3]; // 0x55 - 0x58
}; // size - 0x58


class CNavVolumeCalculatedVector /* "server" */ : public CNavVolume /* "server" */
{
public:
   unsigned char pad_0[0x98]; // 0x0 - 0x98
}; // size - 0x98


class CNavVolumeSphere /* "navlib" */ : public CNavVolume /* "navlib" */
{
public:
   Vector m_vCenter; // 0x70 - 0x7C
   float m_flRadius; // 0x7C - 0x80
}; // size - 0x80


class CNavVolumeVector /* "navlib" */ : public CNavVolume /* "navlib" */
{
public:
   unsigned char pad_70[0x8]; // 0x70 - 0x78
   bool m_bHasBeenPreFiltered; // 0x78 - 0x79
   unsigned char pad_79[0x1F]; // 0x79 - 0x98
}; // size - 0x98


class CParticleCollectionBindingInstance /* "particleslib" */ : public CBasePulseGraphInstance /* "particleslib" */
{
public:
   unsigned char pad_0[0x110]; // 0x0 - 0x110
}; // size - 0x110


class CParticleCollectionFloatInput /* "particleslib" */ : public CParticleFloatInput /* "particleslib" */
{
public:
   unsigned char pad_0[0x158]; // 0x0 - 0x158
}; // size - 0x158


class CParticleCollectionVecInput /* "particleslib" */ : public CParticleVecInput /* "particleslib" */
{
public:
   unsigned char pad_0[0x658]; // 0x0 - 0x658
}; // size - 0x658


class CParticleSystem /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   char m_szSnapshotFileName[512]; // 0x700 - 0x900
   bool m_bActive; // 0x900 - 0x901
   bool m_bFrozen; // 0x901 - 0x902
   unsigned char pad_902[0x2]; // 0x902 - 0x904
   float m_flFreezeTransitionDuration; // 0x904 - 0x908
   int32_t m_nStopType; // 0x908 - 0x90C
   bool m_bAnimateDuringGameplayPause; // 0x90C - 0x90D
   unsigned char pad_90D[0x3]; // 0x90D - 0x910
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x910 - 0x918
   GameTime_t m_flStartTime; // 0x918 - 0x91C
   float m_flPreSimTime; // 0x91C - 0x920
   Vector m_vServerControlPoints[4]; // 0x920 - 0x950
   uint8 m_iServerControlPointAssignments[4]; // 0x950 - 0x954
   CHandle< CBaseEntity > m_hControlPointEnts[64]; // 0x954 - 0xA54
   bool m_bNoSave; // 0xA54 - 0xA55
   bool m_bNoFreeze; // 0xA55 - 0xA56
   bool m_bNoRamp; // 0xA56 - 0xA57
   bool m_bStartActive; // 0xA57 - 0xA58
   CUtlSymbolLarge m_iszEffectName; // 0xA58 - 0xA60
   CUtlSymbolLarge m_iszControlPointNames[64]; // 0xA60 - 0xC60
   int32_t m_nDataCP; // 0xC60 - 0xC64
   Vector m_vecDataCPValue; // 0xC64 - 0xC70
   int32_t m_nTintCP; // 0xC70 - 0xC74
   Color m_clrTint; // 0xC74 - 0xC78
}; // size - 0xC78


class CPathCorner /* "server" */ : public CPointEntity /* "server" */
{
public:
   float m_flWait; // 0x4B0 - 0x4B4
   float m_flRadius; // 0x4B4 - 0x4B8
   CEntityIOOutput m_OnPass; // 0x4B8 - 0x4E0
}; // size - 0x4E0


class CPathKeyFrame /* "server" */ : public CLogicalEntity /* "server" */
{
public:
   Vector m_Origin; // 0x4B0 - 0x4BC
   QAngle m_Angles; // 0x4BC - 0x4C8
   unsigned char pad_4C8[0x8]; // 0x4C8 - 0x4D0
   Quaternion m_qAngle; // 0x4D0 - 0x4E0
   CUtlSymbolLarge m_iNextKey; // 0x4E0 - 0x4E8
   float m_flNextTime; // 0x4E8 - 0x4EC
   unsigned char pad_4EC[0x4]; // 0x4EC - 0x4F0
   CPathKeyFrame* m_pNextKey; // 0x4F0 - 0x4F8
   CPathKeyFrame* m_pPrevKey; // 0x4F8 - 0x500
   float m_flSpeed; // 0x500 - 0x504
   unsigned char pad_504[0xC]; // 0x504 - 0x510
}; // size - 0x510


class CPathParticleRope /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bStartActive; // 0x4B0 - 0x4B1
   unsigned char pad_4B1[0x3]; // 0x4B1 - 0x4B4
   float m_flMaxSimulationTime; // 0x4B4 - 0x4B8
   CUtlSymbolLarge m_iszEffectName; // 0x4B8 - 0x4C0
   CUtlVector< CUtlSymbolLarge > m_PathNodes_Name; // 0x4C0 - 0x4D8
   float m_flParticleSpacing; // 0x4D8 - 0x4DC
   float m_flSlack; // 0x4DC - 0x4E0
   float m_flRadius; // 0x4E0 - 0x4E4
   Color m_ColorTint; // 0x4E4 - 0x4E8
   int32_t m_nEffectState; // 0x4E8 - 0x4EC
   unsigned char pad_4EC[0x4]; // 0x4EC - 0x4F0
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x4F0 - 0x4F8
   CNetworkUtlVectorBase< Vector > m_PathNodes_Position; // 0x4F8 - 0x510
   CNetworkUtlVectorBase< Vector > m_PathNodes_TangentIn; // 0x510 - 0x528
   CNetworkUtlVectorBase< Vector > m_PathNodes_TangentOut; // 0x528 - 0x540
   CNetworkUtlVectorBase< Vector > m_PathNodes_Color; // 0x540 - 0x558
   CNetworkUtlVectorBase< bool > m_PathNodes_PinEnabled; // 0x558 - 0x570
   CNetworkUtlVectorBase< float32 > m_PathNodes_RadiusScale; // 0x570 - 0x588
   unsigned char pad_588[0x8]; // 0x588 - 0x590
}; // size - 0x590


class CPhysHinge /* "server" */ : public CPhysConstraint /* "server" */
{
public:
   unsigned char pad_508[0x8]; // 0x508 - 0x510
   ConstraintSoundInfo m_soundInfo; // 0x510 - 0x598
   CEntityIOOutput m_NotifyMinLimitReached; // 0x598 - 0x5C0
   CEntityIOOutput m_NotifyMaxLimitReached; // 0x5C0 - 0x5E8
   bool m_bAtMinLimit; // 0x5E8 - 0x5E9
   bool m_bAtMaxLimit; // 0x5E9 - 0x5EA
   unsigned char pad_5EA[0x2]; // 0x5EA - 0x5EC
   constraint_hingeparams_t m_hinge; // 0x5EC - 0x62C
   float m_hingeFriction; // 0x62C - 0x630
   float m_systemLoadScale; // 0x630 - 0x634
   bool m_bIsAxisLocal; // 0x634 - 0x635
   unsigned char pad_635[0x3]; // 0x635 - 0x638
   float m_flMinRotation; // 0x638 - 0x63C
   float m_flMaxRotation; // 0x63C - 0x640
   float m_flInitialRotation; // 0x640 - 0x644
   float m_flMotorFrequency; // 0x644 - 0x648
   float m_flMotorDampingRatio; // 0x648 - 0x64C
   float m_flAngleSpeed; // 0x64C - 0x650
   float m_flAngleSpeedThreshold; // 0x650 - 0x654
   unsigned char pad_654[0x4]; // 0x654 - 0x658
   CEntityIOOutput m_OnStartMoving; // 0x658 - 0x680
   CEntityIOOutput m_OnStopMoving; // 0x680 - 0x6A8
}; // size - 0x6A8


class CPlayer_ItemServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_ItemServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_MovementServices_Humanoid /* "server" */ : public CPlayer_MovementServices /* "server" */
{
public:
   float m_flStepSoundTime; // 0x1D0 - 0x1D4
   float m_flFallVelocity; // 0x1D4 - 0x1D8
   bool m_bInCrouch; // 0x1D8 - 0x1D9
   unsigned char pad_1D9[0x3]; // 0x1D9 - 0x1DC
   uint32_t m_nCrouchState; // 0x1DC - 0x1E0
   GameTime_t m_flCrouchTransitionStartTime; // 0x1E0 - 0x1E4
   bool m_bDucked; // 0x1E4 - 0x1E5
   bool m_bDucking; // 0x1E5 - 0x1E6
   bool m_bInDuckJump; // 0x1E6 - 0x1E7
   unsigned char pad_1E7[0x1]; // 0x1E7 - 0x1E8
   Vector m_groundNormal; // 0x1E8 - 0x1F4
   float m_flSurfaceFriction; // 0x1F4 - 0x1F8
   CUtlStringToken m_surfaceProps; // 0x1F8 - 0x1FC
   unsigned char pad_1FC[0xC]; // 0x1FC - 0x208
   int32_t m_nStepside; // 0x208 - 0x20C
   int32_t m_iTargetVolume; // 0x20C - 0x210
   Vector m_vecSmoothedVelocity; // 0x210 - 0x21C
   unsigned char pad_21C[0x4]; // 0x21C - 0x220
}; // size - 0x220


class CPlayer_MovementServices_Humanoid /* "client" */ : public CPlayer_MovementServices /* "client" */
{
public:
   float m_flStepSoundTime; // 0x1D0 - 0x1D4
   float m_flFallVelocity; // 0x1D4 - 0x1D8
   bool m_bInCrouch; // 0x1D8 - 0x1D9
   unsigned char pad_1D9[0x3]; // 0x1D9 - 0x1DC
   uint32_t m_nCrouchState; // 0x1DC - 0x1E0
   GameTime_t m_flCrouchTransitionStartTime; // 0x1E0 - 0x1E4
   bool m_bDucked; // 0x1E4 - 0x1E5
   bool m_bDucking; // 0x1E5 - 0x1E6
   bool m_bInDuckJump; // 0x1E6 - 0x1E7
   unsigned char pad_1E7[0x1]; // 0x1E7 - 0x1E8
   Vector m_groundNormal; // 0x1E8 - 0x1F4
   float m_flSurfaceFriction; // 0x1F4 - 0x1F8
   CUtlStringToken m_surfaceProps; // 0x1F8 - 0x1FC
   unsigned char pad_1FC[0xC]; // 0x1FC - 0x208
   int32_t m_nStepside; // 0x208 - 0x20C
   unsigned char pad_20C[0x4]; // 0x20C - 0x210
}; // size - 0x210


class CPlayer_ObserverServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   uint8_t m_iObserverMode; // 0x40 - 0x41
   unsigned char pad_41[0x3]; // 0x41 - 0x44
   CHandle< C_BaseEntity > m_hObserverTarget; // 0x44 - 0x48
   ObserverMode_t m_iObserverLastMode; // 0x48 - 0x4C
   bool m_bForcedObserverMode; // 0x4C - 0x4D
   unsigned char pad_4D[0x3]; // 0x4D - 0x50
   float m_flObserverChaseDistance; // 0x50 - 0x54
   GameTime_t m_flObserverChaseDistanceCalcTime; // 0x54 - 0x58
}; // size - 0x58


class CPlayer_ObserverServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   uint8_t m_iObserverMode; // 0x40 - 0x41
   unsigned char pad_41[0x3]; // 0x41 - 0x44
   CHandle< CBaseEntity > m_hObserverTarget; // 0x44 - 0x48
   ObserverMode_t m_iObserverLastMode; // 0x48 - 0x4C
   bool m_bForcedObserverMode; // 0x4C - 0x4D
   unsigned char pad_4D[0x3]; // 0x4D - 0x50
}; // size - 0x50


class CPlayer_WaterServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_WaterServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_WeaponServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   bool m_bAllowSwitchToNoWeapon; // 0x40 - 0x41
   unsigned char pad_41[0x7]; // 0x41 - 0x48
   CNetworkUtlVectorBase< CHandle< CBasePlayerWeapon > > m_hMyWeapons; // 0x48 - 0x60
   CHandle< CBasePlayerWeapon > m_hActiveWeapon; // 0x60 - 0x64
   CHandle< CBasePlayerWeapon > m_hLastWeapon; // 0x64 - 0x68
   uint16 m_iAmmo[32]; // 0x68 - 0xA8
   bool m_bPreventWeaponPickup; // 0xA8 - 0xA9
   unsigned char pad_A9[0x7]; // 0xA9 - 0xB0
}; // size - 0xB0


class CPlayer_WeaponServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   bool m_bAllowSwitchToNoWeapon; // 0x40 - 0x41
   unsigned char pad_41[0x7]; // 0x41 - 0x48
   C_NetworkUtlVectorBase< CHandle< C_BasePlayerWeapon > > m_hMyWeapons; // 0x48 - 0x60
   CHandle< C_BasePlayerWeapon > m_hActiveWeapon; // 0x60 - 0x64
   CHandle< C_BasePlayerWeapon > m_hLastWeapon; // 0x64 - 0x68
   uint16 m_iAmmo[32]; // 0x68 - 0xA8
}; // size - 0xA8


class CPointCamera /* "server" */ : public CBaseEntity /* "server" */
{
public:
   float m_FOV; // 0x4B0 - 0x4B4
   float m_Resolution; // 0x4B4 - 0x4B8
   bool m_bFogEnable; // 0x4B8 - 0x4B9
   Color m_FogColor; // 0x4B9 - 0x4BD
   unsigned char pad_4BD[0x3]; // 0x4BD - 0x4C0
   float m_flFogStart; // 0x4C0 - 0x4C4
   float m_flFogEnd; // 0x4C4 - 0x4C8
   float m_flFogMaxDensity; // 0x4C8 - 0x4CC
   bool m_bActive; // 0x4CC - 0x4CD
   bool m_bUseScreenAspectRatio; // 0x4CD - 0x4CE
   unsigned char pad_4CE[0x2]; // 0x4CE - 0x4D0
   float m_flAspectRatio; // 0x4D0 - 0x4D4
   bool m_bNoSky; // 0x4D4 - 0x4D5
   unsigned char pad_4D5[0x3]; // 0x4D5 - 0x4D8
   float m_fBrightness; // 0x4D8 - 0x4DC
   float m_flZFar; // 0x4DC - 0x4E0
   float m_flZNear; // 0x4E0 - 0x4E4
   bool m_bCanHLTVUse; // 0x4E4 - 0x4E5
   bool m_bDofEnabled; // 0x4E5 - 0x4E6
   unsigned char pad_4E6[0x2]; // 0x4E6 - 0x4E8
   float m_flDofNearBlurry; // 0x4E8 - 0x4EC
   float m_flDofNearCrisp; // 0x4EC - 0x4F0
   float m_flDofFarCrisp; // 0x4F0 - 0x4F4
   float m_flDofFarBlurry; // 0x4F4 - 0x4F8
   float m_flDofTiltToGround; // 0x4F8 - 0x4FC
   float m_TargetFOV; // 0x4FC - 0x500
   float m_DegreesPerSecond; // 0x500 - 0x504
   bool m_bIsOn; // 0x504 - 0x505
   unsigned char pad_505[0x3]; // 0x505 - 0x508
   CPointCamera* m_pNext; // 0x508 - 0x510
}; // size - 0x510


class CPointClientUIWorldPanel /* "server" */ : public CBaseClientUIEntity /* "server" */
{
public:
   bool m_bIgnoreInput; // 0x8B0 - 0x8B1
   bool m_bLit; // 0x8B1 - 0x8B2
   bool m_bFollowPlayerAcrossTeleport; // 0x8B2 - 0x8B3
   unsigned char pad_8B3[0x1]; // 0x8B3 - 0x8B4
   float m_flWidth; // 0x8B4 - 0x8B8
   float m_flHeight; // 0x8B8 - 0x8BC
   float m_flDPI; // 0x8BC - 0x8C0
   float m_flInteractDistance; // 0x8C0 - 0x8C4
   float m_flDepthOffset; // 0x8C4 - 0x8C8
   uint32_t m_unOwnerContext; // 0x8C8 - 0x8CC
   uint32_t m_unHorizontalAlign; // 0x8CC - 0x8D0
   uint32_t m_unVerticalAlign; // 0x8D0 - 0x8D4
   uint32_t m_unOrientation; // 0x8D4 - 0x8D8
   bool m_bAllowInteractionFromAllSceneWorlds; // 0x8D8 - 0x8D9
   unsigned char pad_8D9[0x7]; // 0x8D9 - 0x8E0
   CNetworkUtlVectorBase< CUtlSymbolLarge > m_vecCSSClasses; // 0x8E0 - 0x8F8
   bool m_bOpaque; // 0x8F8 - 0x8F9
   bool m_bNoDepth; // 0x8F9 - 0x8FA
   bool m_bRenderBackface; // 0x8FA - 0x8FB
   bool m_bUseOffScreenIndicator; // 0x8FB - 0x8FC
   bool m_bExcludeFromSaveGames; // 0x8FC - 0x8FD
   bool m_bGrabbable; // 0x8FD - 0x8FE
   bool m_bOnlyRenderToTexture; // 0x8FE - 0x8FF
   bool m_bDisableMipGen; // 0x8FF - 0x900
   int32_t m_nExplicitImageLayout; // 0x900 - 0x904
   unsigned char pad_904[0x4]; // 0x904 - 0x908
}; // size - 0x908


class CPredictedViewModel /* "server" */ : public CBaseViewModel /* "server" */
{
public:
   unsigned char pad_0[0x8D8]; // 0x0 - 0x8D8
}; // size - 0x8D8


class CPropDoorRotating /* "server" */ : public CBasePropDoor /* "server" */
{
public:
   Vector m_vecAxis; // 0xD98 - 0xDA4
   float m_flDistance; // 0xDA4 - 0xDA8
   PropDoorRotatingSpawnPos_t m_eSpawnPosition; // 0xDA8 - 0xDAC
   PropDoorRotatingOpenDirection_e m_eOpenDirection; // 0xDAC - 0xDB0
   PropDoorRotatingOpenDirection_e m_eCurrentOpenDirection; // 0xDB0 - 0xDB4
   float m_flAjarAngle; // 0xDB4 - 0xDB8
   QAngle m_angRotationAjarDeprecated; // 0xDB8 - 0xDC4
   QAngle m_angRotationClosed; // 0xDC4 - 0xDD0
   QAngle m_angRotationOpenForward; // 0xDD0 - 0xDDC
   QAngle m_angRotationOpenBack; // 0xDDC - 0xDE8
   QAngle m_angGoal; // 0xDE8 - 0xDF4
   Vector m_vecForwardBoundsMin; // 0xDF4 - 0xE00
   Vector m_vecForwardBoundsMax; // 0xE00 - 0xE0C
   Vector m_vecBackBoundsMin; // 0xE0C - 0xE18
   Vector m_vecBackBoundsMax; // 0xE18 - 0xE24
   bool m_bAjarDoorShouldntAlwaysOpen; // 0xE24 - 0xE25
   unsigned char pad_E25[0x3]; // 0xE25 - 0xE28
   CHandle< CEntityBlocker > m_hEntityBlocker; // 0xE28 - 0xE2C
   unsigned char pad_E2C[0x4]; // 0xE2C - 0xE30
}; // size - 0xE30


class CPulseGraphInstance_TestDomain /* "pulse_runtime_lib" */ : public CBasePulseGraphInstance /* "pulse_runtime_lib" */
{
public:
   bool m_bIsRunningUnitTests; // 0xD0 - 0xD1
   bool m_bExplicitTimeStepping; // 0xD1 - 0xD2
   bool m_bExpectingToDestroyWithYieldedCursors; // 0xD2 - 0xD3
   unsigned char pad_D3[0x1]; // 0xD3 - 0xD4
   int32_t m_nNextValidateIndex; // 0xD4 - 0xD8
   CUtlVector< CUtlString > m_Tracepoints; // 0xD8 - 0xF0
   bool m_bTestYesOrNoPath; // 0xF0 - 0xF1
   unsigned char pad_F1[0x7]; // 0xF1 - 0xF8
}; // size - 0xF8


class CPulse_OutflowConnection /* "pulse_runtime_lib" */
{
public:
   CUtlSymbolLarge m_SourceOutflowName; // 0x0 - 0x8
   PulseRuntimeChunkIndex_t m_nDestChunk; // 0x8 - 0xC
   int32_t m_nInstruction; // 0xC - 0x10
}; // size - 0x10


class CRopeKeyframe /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_700[0x8]; // 0x700 - 0x708
   uint16_t m_RopeFlags; // 0x708 - 0x70A
   unsigned char pad_70A[0x6]; // 0x70A - 0x710
   CUtlSymbolLarge m_iNextLinkName; // 0x710 - 0x718
   int16_t m_Slack; // 0x718 - 0x71A
   unsigned char pad_71A[0x2]; // 0x71A - 0x71C
   float m_Width; // 0x71C - 0x720
   float m_TextureScale; // 0x720 - 0x724
   uint8_t m_nSegments; // 0x724 - 0x725
   bool m_bConstrainBetweenEndpoints; // 0x725 - 0x726
   unsigned char pad_726[0x2]; // 0x726 - 0x728
   CUtlSymbolLarge m_strRopeMaterialModel; // 0x728 - 0x730
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_iRopeMaterialModelIndex; // 0x730 - 0x738
   uint8_t m_Subdiv; // 0x738 - 0x739
   uint8_t m_nChangeCount; // 0x739 - 0x73A
   int16_t m_RopeLength; // 0x73A - 0x73C
   uint8_t m_fLockedPoints; // 0x73C - 0x73D
   bool m_bCreatedFromMapFile; // 0x73D - 0x73E
   unsigned char pad_73E[0x2]; // 0x73E - 0x740
   float m_flScrollSpeed; // 0x740 - 0x744
   bool m_bStartPointValid; // 0x744 - 0x745
   bool m_bEndPointValid; // 0x745 - 0x746
   unsigned char pad_746[0x2]; // 0x746 - 0x748
   CHandle< CBaseEntity > m_hStartPoint; // 0x748 - 0x74C
   CHandle< CBaseEntity > m_hEndPoint; // 0x74C - 0x750
   AttachmentHandle_t m_iStartAttachment; // 0x750 - 0x751
   AttachmentHandle_t m_iEndAttachment; // 0x751 - 0x752
   unsigned char pad_752[0x6]; // 0x752 - 0x758
}; // size - 0x758


class CRotButton /* "server" */ : public CBaseButton /* "server" */
{
public:
   unsigned char pad_0[0x8C8]; // 0x0 - 0x8C8
}; // size - 0x8C8


class CRuleBrushEntity /* "server" */ : public CRuleEntity /* "server" */
{
public:
   unsigned char pad_0[0x708]; // 0x0 - 0x708
}; // size - 0x708


class CSAdditionalPerRoundStats_t /* "server" */
{
public:
   int32_t m_numChickensKilled; // 0x0 - 0x4
   int32_t m_killsWhileBlind; // 0x4 - 0x8
   int32_t m_bombCarrierkills; // 0x8 - 0xC
   int32_t m_iBurnDamageInflicted; // 0xC - 0x10
   int32_t m_iDinks; // 0x10 - 0x14
}; // size - 0x14


class CSPerRoundStats_t /* "client" */
{
public:
   unsigned char pad_0[0x30]; // 0x0 - 0x30
   int32_t m_iKills; // 0x30 - 0x34
   int32_t m_iDeaths; // 0x34 - 0x38
   int32_t m_iAssists; // 0x38 - 0x3C
   int32_t m_iDamage; // 0x3C - 0x40
   int32_t m_iEquipmentValue; // 0x40 - 0x44
   int32_t m_iMoneySaved; // 0x44 - 0x48
   int32_t m_iKillReward; // 0x48 - 0x4C
   int32_t m_iLiveTime; // 0x4C - 0x50
   int32_t m_iHeadShotKills; // 0x50 - 0x54
   int32_t m_iObjective; // 0x54 - 0x58
   int32_t m_iCashEarned; // 0x58 - 0x5C
   int32_t m_iUtilityDamage; // 0x5C - 0x60
   int32_t m_iEnemiesFlashed; // 0x60 - 0x64
   unsigned char pad_64[0x4]; // 0x64 - 0x68
}; // size - 0x68


class CSPerRoundStats_t /* "server" */
{
public:
   unsigned char pad_0[0x30]; // 0x0 - 0x30
   int32_t m_iKills; // 0x30 - 0x34
   int32_t m_iDeaths; // 0x34 - 0x38
   int32_t m_iAssists; // 0x38 - 0x3C
   int32_t m_iDamage; // 0x3C - 0x40
   int32_t m_iEquipmentValue; // 0x40 - 0x44
   int32_t m_iMoneySaved; // 0x44 - 0x48
   int32_t m_iKillReward; // 0x48 - 0x4C
   int32_t m_iLiveTime; // 0x4C - 0x50
   int32_t m_iHeadShotKills; // 0x50 - 0x54
   int32_t m_iObjective; // 0x54 - 0x58
   int32_t m_iCashEarned; // 0x58 - 0x5C
   int32_t m_iUtilityDamage; // 0x5C - 0x60
   int32_t m_iEnemiesFlashed; // 0x60 - 0x64
   unsigned char pad_64[0x4]; // 0x64 - 0x68
}; // size - 0x68


class CSequenceUpdateNode /* "animgraphlib" */ : public CLeafUpdateNode /* "animgraphlib" */
{
public:
   unsigned char pad_58[0x8]; // 0x58 - 0x60
   CParamSpanUpdater m_paramSpans; // 0x60 - 0x78
   CUtlVector< TagSpan_t > m_tags; // 0x78 - 0x90
   unsigned char pad_90[0x4]; // 0x90 - 0x94
   HSequence m_hSequence; // 0x94 - 0x98
   float m_playbackSpeed; // 0x98 - 0x9C
   float m_duration; // 0x9C - 0xA0
   bool m_bLoop; // 0xA0 - 0xA1
   unsigned char pad_A1[0x7]; // 0xA1 - 0xA8
}; // size - 0xA8


class CSosGroupBranchPattern /* "soundsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   bool m_bMatchEventName; // 0x8 - 0x9
   bool m_bMatchEventSubString; // 0x9 - 0xA
   bool m_bMatchEntIndex; // 0xA - 0xB
   bool m_bMatchOpvar; // 0xB - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
}; // size - 0x10


class CSoundOpvarSetAABBEntity /* "server" */ : public CSoundOpvarSetPointEntity /* "server" */
{
public:
   Vector m_vDistanceInnerMins; // 0x648 - 0x654
   Vector m_vDistanceInnerMaxs; // 0x654 - 0x660
   Vector m_vDistanceOuterMins; // 0x660 - 0x66C
   Vector m_vDistanceOuterMaxs; // 0x66C - 0x678
   int32_t m_nAABBDirection; // 0x678 - 0x67C
   Vector m_vInnerMins; // 0x67C - 0x688
   Vector m_vInnerMaxs; // 0x688 - 0x694
   Vector m_vOuterMins; // 0x694 - 0x6A0
   Vector m_vOuterMaxs; // 0x6A0 - 0x6AC
   unsigned char pad_6AC[0x4]; // 0x6AC - 0x6B0
}; // size - 0x6B0


class CSpinUpdateBase /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   unsigned char pad_0[0x1C0]; // 0x0 - 0x1C0
}; // size - 0x1C0


class CStaticPoseCache /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CCachedPose > m_poses; // 0x10 - 0x28
   int32_t m_nBoneCount; // 0x28 - 0x2C
   int32_t m_nMorphCount; // 0x2C - 0x30
}; // size - 0x30


class CTeam /* "server" */ : public CBaseEntity /* "server" */
{
public:
   CNetworkUtlVectorBase< CHandle< CBasePlayerController > > m_aPlayerControllers; // 0x4B0 - 0x4C8
   CNetworkUtlVectorBase< CHandle< CBasePlayerPawn > > m_aPlayers; // 0x4C8 - 0x4E0
   int32_t m_iScore; // 0x4E0 - 0x4E4
   char m_szTeamname[129]; // 0x4E4 - 0x565
   unsigned char pad_565[0x3]; // 0x565 - 0x568
}; // size - 0x568


class CTeamplayRules /* "server" */ : public CMultiplayRules /* "server" */
{
public:
   unsigned char pad_0[0x90]; // 0x0 - 0x90
}; // size - 0x90


class CTonemapController2 /* "server" */ : public CBaseEntity /* "server" */
{
public:
   float m_flAutoExposureMin; // 0x4B0 - 0x4B4
   float m_flAutoExposureMax; // 0x4B4 - 0x4B8
   float m_flTonemapPercentTarget; // 0x4B8 - 0x4BC
   float m_flTonemapPercentBrightPixels; // 0x4BC - 0x4C0
   float m_flTonemapMinAvgLum; // 0x4C0 - 0x4C4
   float m_flExposureAdaptationSpeedUp; // 0x4C4 - 0x4C8
   float m_flExposureAdaptationSpeedDown; // 0x4C8 - 0x4CC
   float m_flTonemapEVSmoothingRange; // 0x4CC - 0x4D0
   unsigned char pad_4D0[0x8]; // 0x4D0 - 0x4D8
}; // size - 0x4D8


class CTriggerPush /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   QAngle m_angPushEntitySpace; // 0x8A8 - 0x8B4
   Vector m_vecPushDirEntitySpace; // 0x8B4 - 0x8C0
   bool m_bTriggerOnStartTouch; // 0x8C0 - 0x8C1
   unsigned char pad_8C1[0x3]; // 0x8C1 - 0x8C4
   float m_flAlternateTicksFix; // 0x8C4 - 0x8C8
   float m_flPushSpeed; // 0x8C8 - 0x8CC
   unsigned char pad_8CC[0x4]; // 0x8CC - 0x8D0
}; // size - 0x8D0


class CWeaponBaseItem /* "server" */ : public CCSWeaponBase /* "server" */
{
public:
   CountdownTimer m_SequenceCompleteTimer; // 0xDD8 - 0xDF0
   bool m_bRedraw; // 0xDF0 - 0xDF1
   unsigned char pad_DF1[0x7]; // 0xDF1 - 0xDF8
}; // size - 0xDF8


class C_BaseFire /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   float m_flScale; // 0x540 - 0x544
   float m_flStartScale; // 0x544 - 0x548
   float m_flScaleTime; // 0x548 - 0x54C
   uint32_t m_nFlags; // 0x54C - 0x550
}; // size - 0x550


class C_Breakable /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_0[0xCC0]; // 0x0 - 0xCC0
}; // size - 0xCC0


class C_CSGO_PreviewModel /* "client" */ : public C_BaseFlex /* "client" */
{
public:
   CUtlString m_animgraph; // 0x1018 - 0x1020
   CUtlString m_animgraphCharacterModeString; // 0x1020 - 0x1028
   CUtlString m_defaultAnim; // 0x1028 - 0x1030
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0x1030 - 0x1034
   float m_flInitialModelScale; // 0x1034 - 0x1038
   unsigned char pad_1038[0xA8]; // 0x1038 - 0x10E0
}; // size - 0x10E0


class C_EnvCubemap /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_540[0x88]; // 0x540 - 0x5C8
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hCubemapTexture; // 0x5C8 - 0x5D0
   bool m_bCustomCubemapTexture; // 0x5D0 - 0x5D1
   unsigned char pad_5D1[0x3]; // 0x5D1 - 0x5D4
   float m_flInfluenceRadius; // 0x5D4 - 0x5D8
   Vector m_vBoxProjectMins; // 0x5D8 - 0x5E4
   Vector m_vBoxProjectMaxs; // 0x5E4 - 0x5F0
   CUtlSymbolLarge m_LightGroups; // 0x5F0 - 0x5F8
   bool m_bMoveable; // 0x5F8 - 0x5F9
   unsigned char pad_5F9[0x3]; // 0x5F9 - 0x5FC
   int32_t m_nHandshake; // 0x5FC - 0x600
   int32_t m_nEnvCubeMapArrayIndex; // 0x600 - 0x604
   int32_t m_nPriority; // 0x604 - 0x608
   float m_flEdgeFadeDist; // 0x608 - 0x60C
   Vector m_vEdgeFadeDists; // 0x60C - 0x618
   float m_flDiffuseScale; // 0x618 - 0x61C
   bool m_bStartDisabled; // 0x61C - 0x61D
   bool m_bDefaultEnvMap; // 0x61D - 0x61E
   bool m_bDefaultSpecEnvMap; // 0x61E - 0x61F
   bool m_bIndoorCubeMap; // 0x61F - 0x620
   bool m_bCopyDiffuseFromDefaultCubemap; // 0x620 - 0x621
   unsigned char pad_621[0xF]; // 0x621 - 0x630
   bool m_bEnabled; // 0x630 - 0x631
   unsigned char pad_631[0x7]; // 0x631 - 0x638
}; // size - 0x638


class C_GameRulesProxy /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x540]; // 0x0 - 0x540
}; // size - 0x540


class C_Inferno /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_CC0[0x40]; // 0xCC0 - 0xD00
   ParticleIndex_t m_nfxFireDamageEffect; // 0xD00 - 0xD04
   int32 m_fireXDelta[64]; // 0xD04 - 0xE04
   int32 m_fireYDelta[64]; // 0xE04 - 0xF04
   int32 m_fireZDelta[64]; // 0xF04 - 0x1004
   int32 m_fireParentXDelta[64]; // 0x1004 - 0x1104
   int32 m_fireParentYDelta[64]; // 0x1104 - 0x1204
   int32 m_fireParentZDelta[64]; // 0x1204 - 0x1304
   bool m_bFireIsBurning[64]; // 0x1304 - 0x1344
   Vector m_BurnNormal[64]; // 0x1344 - 0x1644
   int32_t m_fireCount; // 0x1644 - 0x1648
   int32_t m_nInfernoType; // 0x1648 - 0x164C
   float m_nFireLifetime; // 0x164C - 0x1650
   bool m_bInPostEffectTime; // 0x1650 - 0x1651
   unsigned char pad_1651[0x3]; // 0x1651 - 0x1654
   int32_t m_lastFireCount; // 0x1654 - 0x1658
   int32_t m_nFireEffectTickBegin; // 0x1658 - 0x165C
   unsigned char pad_165C[0x6C04]; // 0x165C - 0x8260
   int32_t m_drawableCount; // 0x8260 - 0x8264
   bool m_blosCheck; // 0x8264 - 0x8265
   unsigned char pad_8265[0x3]; // 0x8265 - 0x8268
   int32_t m_nlosperiod; // 0x8268 - 0x826C
   float m_maxFireHalfWidth; // 0x826C - 0x8270
   float m_maxFireHeight; // 0x8270 - 0x8274
   Vector m_minBounds; // 0x8274 - 0x8280
   Vector m_maxBounds; // 0x8280 - 0x828C
   float m_flLastGrassBurnThink; // 0x828C - 0x8290
   unsigned char pad_8290[0x10]; // 0x8290 - 0x82A0
}; // size - 0x82A0


class C_Item /* "client" */ : public C_EconEntity /* "client" */
{
public:
   bool m_bShouldGlow; // 0x1560 - 0x1561
   char m_pReticleHintTextName[256]; // 0x1561 - 0x1661
   unsigned char pad_1661[0x7]; // 0x1661 - 0x1668
}; // size - 0x1668


class C_LightDirectionalEntity /* "client" */ : public C_LightEntity /* "client" */
{
public:
   unsigned char pad_0[0xCC8]; // 0x0 - 0xCC8
}; // size - 0xCC8


class C_MolotovGrenade /* "client" */ : public C_BaseCSGrenade /* "client" */
{
public:
   unsigned char pad_0[0x19B0]; // 0x0 - 0x19B0
}; // size - 0x19B0


class C_OP_RenderPoints /* "particles" */ : public CParticleFunctionRenderer /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x200 - 0x208
   unsigned char pad_208[0x8]; // 0x208 - 0x210
}; // size - 0x210


class C_PathParticleRope /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   bool m_bStartActive; // 0x540 - 0x541
   unsigned char pad_541[0x3]; // 0x541 - 0x544
   float m_flMaxSimulationTime; // 0x544 - 0x548
   CUtlSymbolLarge m_iszEffectName; // 0x548 - 0x550
   CUtlVector< CUtlSymbolLarge > m_PathNodes_Name; // 0x550 - 0x568
   float m_flParticleSpacing; // 0x568 - 0x56C
   float m_flSlack; // 0x56C - 0x570
   float m_flRadius; // 0x570 - 0x574
   Color m_ColorTint; // 0x574 - 0x578
   int32_t m_nEffectState; // 0x578 - 0x57C
   unsigned char pad_57C[0x4]; // 0x57C - 0x580
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x580 - 0x588
   C_NetworkUtlVectorBase< Vector > m_PathNodes_Position; // 0x588 - 0x5A0
   C_NetworkUtlVectorBase< Vector > m_PathNodes_TangentIn; // 0x5A0 - 0x5B8
   C_NetworkUtlVectorBase< Vector > m_PathNodes_TangentOut; // 0x5B8 - 0x5D0
   C_NetworkUtlVectorBase< Vector > m_PathNodes_Color; // 0x5D0 - 0x5E8
   C_NetworkUtlVectorBase< bool > m_PathNodes_PinEnabled; // 0x5E8 - 0x600
   C_NetworkUtlVectorBase< float32 > m_PathNodes_RadiusScale; // 0x600 - 0x618
   unsigned char pad_618[0x30]; // 0x618 - 0x648
}; // size - 0x648


class C_PointCamera /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   float m_FOV; // 0x540 - 0x544
   float m_Resolution; // 0x544 - 0x548
   bool m_bFogEnable; // 0x548 - 0x549
   Color m_FogColor; // 0x549 - 0x54D
   unsigned char pad_54D[0x3]; // 0x54D - 0x550
   float m_flFogStart; // 0x550 - 0x554
   float m_flFogEnd; // 0x554 - 0x558
   float m_flFogMaxDensity; // 0x558 - 0x55C
   bool m_bActive; // 0x55C - 0x55D
   bool m_bUseScreenAspectRatio; // 0x55D - 0x55E
   unsigned char pad_55E[0x2]; // 0x55E - 0x560
   float m_flAspectRatio; // 0x560 - 0x564
   bool m_bNoSky; // 0x564 - 0x565
   unsigned char pad_565[0x3]; // 0x565 - 0x568
   float m_fBrightness; // 0x568 - 0x56C
   float m_flZFar; // 0x56C - 0x570
   float m_flZNear; // 0x570 - 0x574
   bool m_bCanHLTVUse; // 0x574 - 0x575
   bool m_bDofEnabled; // 0x575 - 0x576
   unsigned char pad_576[0x2]; // 0x576 - 0x578
   float m_flDofNearBlurry; // 0x578 - 0x57C
   float m_flDofNearCrisp; // 0x57C - 0x580
   float m_flDofFarCrisp; // 0x580 - 0x584
   float m_flDofFarBlurry; // 0x584 - 0x588
   float m_flDofTiltToGround; // 0x588 - 0x58C
   float m_TargetFOV; // 0x58C - 0x590
   float m_DegreesPerSecond; // 0x590 - 0x594
   bool m_bIsOn; // 0x594 - 0x595
   unsigned char pad_595[0x3]; // 0x595 - 0x598
   C_PointCamera* m_pNext; // 0x598 - 0x5A0
}; // size - 0x5A0


class C_PredictedViewModel /* "client" */ : public C_BaseViewModel /* "client" */
{
public:
   QAngle m_LagAnglesHistory; // 0xEE8 - 0xEF4
   unsigned char pad_EF4[0xC]; // 0xEF4 - 0xF00
   Vector m_vPredictedOffset; // 0xF00 - 0xF0C
   unsigned char pad_F0C[0x4]; // 0xF0C - 0xF10
}; // size - 0xF10


class C_RagdollProp /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   unsigned char pad_E80[0x8]; // 0xE80 - 0xE88
   C_NetworkUtlVectorBase< Vector > m_ragPos; // 0xE88 - 0xEA0
   C_NetworkUtlVectorBase< QAngle > m_ragAngles; // 0xEA0 - 0xEB8
   float m_flBlendWeight; // 0xEB8 - 0xEBC
   CHandle< C_BaseEntity > m_hRagdollSource; // 0xEBC - 0xEC0
   AttachmentHandle_t m_iEyeAttachment; // 0xEC0 - 0xEC1
   unsigned char pad_EC1[0x3]; // 0xEC1 - 0xEC4
   float m_flBlendWeightCurrent; // 0xEC4 - 0xEC8
   CUtlVector< int32 > m_parentPhysicsBoneIndices; // 0xEC8 - 0xEE0
   CUtlVector< int32 > m_worldSpaceBoneComputationOrder; // 0xEE0 - 0xEF8
}; // size - 0xEF8


class C_SoundOpvarSetAABBEntity /* "client" */ : public C_SoundOpvarSetPointEntity /* "client" */
{
public:
   unsigned char pad_0[0x560]; // 0x0 - 0x560
}; // size - 0x560


class C_Team /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   C_NetworkUtlVectorBase< CHandle< CBasePlayerController > > m_aPlayerControllers; // 0x540 - 0x558
   C_NetworkUtlVectorBase< CHandle< C_BasePlayerPawn > > m_aPlayers; // 0x558 - 0x570
   int32_t m_iScore; // 0x570 - 0x574
   char m_szTeamname[129]; // 0x574 - 0x5F5
   unsigned char pad_5F5[0x3]; // 0x5F5 - 0x5F8
}; // size - 0x5F8


class C_TeamplayRules /* "client" */ : public C_MultiplayRules /* "client" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class C_TonemapController2 /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   float m_flAutoExposureMin; // 0x540 - 0x544
   float m_flAutoExposureMax; // 0x544 - 0x548
   float m_flTonemapPercentTarget; // 0x548 - 0x54C
   float m_flTonemapPercentBrightPixels; // 0x54C - 0x550
   float m_flTonemapMinAvgLum; // 0x550 - 0x554
   float m_flExposureAdaptationSpeedUp; // 0x554 - 0x558
   float m_flExposureAdaptationSpeedDown; // 0x558 - 0x55C
   float m_flTonemapEVSmoothingRange; // 0x55C - 0x560
   unsigned char pad_560[0x8]; // 0x560 - 0x568
}; // size - 0x568


class C_WeaponBaseItem /* "client" */ : public C_CSWeaponBase /* "client" */
{
public:
   CountdownTimer m_SequenceCompleteTimer; // 0x1940 - 0x1958
   bool m_bRedraw; // 0x1958 - 0x1959
   unsigned char pad_1959[0x7]; // 0x1959 - 0x1960
}; // size - 0x1960


class FeBoxRigid_t /* "physicslib" */
{
public:
   CTransform tmFrame2; // 0x0 - 0x20
   uint16_t nNode; // 0x20 - 0x22
   uint16_t nCollisionMask; // 0x22 - 0x24
   Vector vSize; // 0x24 - 0x30
   uint16_t nVertexMapIndex; // 0x30 - 0x32
   uint16_t nFlags; // 0x32 - 0x34
   unsigned char pad_34[0xC]; // 0x34 - 0x40
}; // size - 0x40


class FeSphereRigid_t /* "physicslib" */
{
public:
   fltx4 vSphere; // 0x0 - 0x10
   uint16_t nNode; // 0x10 - 0x12
   uint16_t nCollisionMask; // 0x12 - 0x14
   uint16_t nVertexMapIndex; // 0x14 - 0x16
   uint16_t nFlags; // 0x16 - 0x18
   unsigned char pad_18[0x8]; // 0x18 - 0x20
}; // size - 0x20


class FeTaperedCapsuleRigid_t /* "physicslib" */
{
public:
   fltx4 vSphere[2]; // 0x0 - 0x20
   uint16_t nNode; // 0x20 - 0x22
   uint16_t nCollisionMask; // 0x22 - 0x24
   uint16_t nVertexMapIndex; // 0x24 - 0x26
   uint16_t nFlags; // 0x26 - 0x28
   unsigned char pad_28[0x8]; // 0x28 - 0x30
}; // size - 0x30


class IChoreoServices /* "server" */
{
public:

   enum class ScriptState_t : std::uint32_t
   {
      SCRIPT_PLAYING = 0,
      SCRIPT_WAIT = 1,
      SCRIPT_POST_IDLE = 2,
      SCRIPT_CLEANUP = 3,
      SCRIPT_WALK_TO_MARK = 4,
      SCRIPT_RUN_TO_MARK = 5,
      SCRIPT_CUSTOM_MOVE_TO_MARK = 6
   };

   enum class ChoreoState_t : std::uint32_t
   {
      STATE_PRE_SCRIPT = 0,
      STATE_WAIT_FOR_SCRIPT = 1,
      STATE_WALK_TO_MARK = 2,
      STATE_SYNCHRONIZE_SCRIPT = 3,
      STATE_PLAY_SCRIPT = 4,
      STATE_PLAY_SCRIPT_POST_IDLE = 5,
      STATE_PLAY_SCRIPT_POST_IDLE_DONE = 6
   };
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class IClientAlphaProperty /* "client" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class IParticleEffect /* "particleslib" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class IParticleSystemDefinition /* "particles" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class IntervalTimer /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   GameTime_t m_timestamp; // 0x8 - 0xC
   WorldGroupId_t m_nWorldGroupId; // 0xC - 0x10
}; // size - 0x10


class IntervalTimer /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   GameTime_t m_timestamp; // 0x8 - 0xC
   WorldGroupId_t m_nWorldGroupId; // 0xC - 0x10
}; // size - 0x10


class PointDefinition_t /* "particles" */
{
public:
   int32_t m_nControlPoint; // 0x0 - 0x4
   bool m_bLocalCoords; // 0x4 - 0x5
   unsigned char pad_5[0x3]; // 0x5 - 0x8
   Vector m_vOffset; // 0x8 - 0x14
}; // size - 0x14


class Relationship_t /* "server" */
{
public:
   Disposition_t disposition; // 0x0 - 0x4
   int32_t priority; // 0x4 - 0x8
}; // size - 0x8


class RnBodyDesc_t /* "physicslib" */
{
public:
   CUtlString m_sDebugName; // 0x0 - 0x8
   Vector m_vPosition; // 0x8 - 0x14
   QuaternionStorage m_qOrientation; // 0x14 - 0x24
   Vector m_vLinearVelocity; // 0x24 - 0x30
   Vector m_vAngularVelocity; // 0x30 - 0x3C
   Vector m_vLocalMassCenter; // 0x3C - 0x48
   Vector m_LocalInertiaInv[3]; // 0x48 - 0x6C
   float m_flMassInv; // 0x6C - 0x70
   float m_flGameMass; // 0x70 - 0x74
   float m_flInertiaScaleInv; // 0x74 - 0x78
   float m_flLinearDamping; // 0x78 - 0x7C
   float m_flAngularDamping; // 0x7C - 0x80
   float m_flLinearDrag; // 0x80 - 0x84
   float m_flAngularDrag; // 0x84 - 0x88
   float m_flLinearBuoyancyDrag; // 0x88 - 0x8C
   float m_flAngularBuoyancyDrag; // 0x8C - 0x90
   Vector m_vLastAwakeForceAccum; // 0x90 - 0x9C
   Vector m_vLastAwakeTorqueAccum; // 0x9C - 0xA8
   float m_flBuoyancyFactor; // 0xA8 - 0xAC
   float m_flGravityScale; // 0xAC - 0xB0
   float m_flTimeScale; // 0xB0 - 0xB4
   int32_t m_nBodyType; // 0xB4 - 0xB8
   uint32_t m_nGameIndex; // 0xB8 - 0xBC
   uint32_t m_nGameFlags; // 0xBC - 0xC0
   int8_t m_nMinVelocityIterations; // 0xC0 - 0xC1
   int8_t m_nMinPositionIterations; // 0xC1 - 0xC2
   int8_t m_nMassPriority; // 0xC2 - 0xC3
   bool m_bEnabled; // 0xC3 - 0xC4
   bool m_bSleeping; // 0xC4 - 0xC5
   bool m_bIsContinuousEnabled; // 0xC5 - 0xC6
   bool m_bDragEnabled; // 0xC6 - 0xC7
   bool m_bBuoyancyDragEnabled; // 0xC7 - 0xC8
   bool m_bGravityDisabled; // 0xC8 - 0xC9
   bool m_bSpeculativeEnabled; // 0xC9 - 0xCA
   bool m_bHasShadowController; // 0xCA - 0xCB
   unsigned char pad_CB[0x5]; // 0xCB - 0xD0
}; // size - 0xD0


class SpawnPointCoopEnemy /* "server" */ : public SpawnPoint /* "server" */
{
public:

   enum class BotDefaultBehavior_t : std::uint32_t
   {
      DEFEND_AREA = 0,
      HUNT = 1,
      CHARGE_ENEMY = 2,
      DEFEND_INVESTIGATE = 3
   };
   CUtlSymbolLarge m_szWeaponsToGive; // 0x4C0 - 0x4C8
   CUtlSymbolLarge m_szPlayerModelToUse; // 0x4C8 - 0x4D0
   int32_t m_nArmorToSpawnWith; // 0x4D0 - 0x4D4
   SpawnPointCoopEnemy::BotDefaultBehavior_t m_nDefaultBehavior; // 0x4D4 - 0x4D8
   int32_t m_nBotDifficulty; // 0x4D8 - 0x4DC
   bool m_bIsAgressive; // 0x4DC - 0x4DD
   bool m_bStartAsleep; // 0x4DD - 0x4DE
   unsigned char pad_4DE[0x2]; // 0x4DE - 0x4E0
   float m_flHideRadius; // 0x4E0 - 0x4E4
   unsigned char pad_4E4[0xC]; // 0x4E4 - 0x4F0
   CUtlSymbolLarge m_szBehaviorTreeFile; // 0x4F0 - 0x4F8
}; // size - 0x4F8


class dynpitchvol_base_t /* "server" */
{
public:
   int32_t preset; // 0x0 - 0x4
   int32_t pitchrun; // 0x4 - 0x8
   int32_t pitchstart; // 0x8 - 0xC
   int32_t spinup; // 0xC - 0x10
   int32_t spindown; // 0x10 - 0x14
   int32_t volrun; // 0x14 - 0x18
   int32_t volstart; // 0x18 - 0x1C
   int32_t fadein; // 0x1C - 0x20
   int32_t fadeout; // 0x20 - 0x24
   int32_t lfotype; // 0x24 - 0x28
   int32_t lforate; // 0x28 - 0x2C
   int32_t lfomodpitch; // 0x2C - 0x30
   int32_t lfomodvol; // 0x30 - 0x34
   int32_t cspinup; // 0x34 - 0x38
   int32_t cspincount; // 0x38 - 0x3C
   int32_t pitch; // 0x3C - 0x40
   int32_t spinupsav; // 0x40 - 0x44
   int32_t spindownsav; // 0x44 - 0x48
   int32_t pitchfrac; // 0x48 - 0x4C
   int32_t vol; // 0x4C - 0x50
   int32_t fadeinsav; // 0x50 - 0x54
   int32_t fadeoutsav; // 0x54 - 0x58
   int32_t volfrac; // 0x58 - 0x5C
   int32_t lfofrac; // 0x5C - 0x60
   int32_t lfomult; // 0x60 - 0x64
}; // size - 0x64


class AABB_t /* "mathlib_extended" */
{
public:
   Vector m_vMinBounds; // 0x0 - 0xC
   Vector m_vMaxBounds; // 0xC - 0x18
}; // size - 0x18


class ActiveModelConfig_t /* "client" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
   ModelConfigHandle_t m_Handle; // 0x28 - 0x2C
   unsigned char pad_2C[0x4]; // 0x2C - 0x30
   CUtlSymbolLarge m_Name; // 0x30 - 0x38
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_AssociatedEntities; // 0x38 - 0x50
   C_NetworkUtlVectorBase< CUtlSymbolLarge > m_AssociatedEntityNames; // 0x50 - 0x68
}; // size - 0x68


class ActiveModelConfig_t /* "server" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
   ModelConfigHandle_t m_Handle; // 0x28 - 0x2C
   unsigned char pad_2C[0x4]; // 0x2C - 0x30
   CUtlSymbolLarge m_Name; // 0x30 - 0x38
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_AssociatedEntities; // 0x38 - 0x50
   CNetworkUtlVectorBase< CUtlSymbolLarge > m_AssociatedEntityNames; // 0x50 - 0x68
}; // size - 0x68


class AggregateLODSetup_t /* "worldrenderer" */
{
public:
   Vector m_vLODOrigin; // 0x0 - 0xC
   float m_fMaxObjectScale; // 0xC - 0x10
   CUtlVectorFixedGrowable< float32 > m_fSwitchDistances; // 0x10 - 0x38
}; // size - 0x38


class AggregateMeshInfo_t /* "worldrenderer" */
{
public:
   uint32_t m_nVisClusterMemberOffset; // 0x0 - 0x4
   uint8_t m_nVisClusterMemberCount; // 0x4 - 0x5
   bool m_bHasTransform; // 0x5 - 0x6
   int16_t m_nDrawCallIndex; // 0x6 - 0x8
   int16_t m_nLODSetupIndex; // 0x8 - 0xA
   uint8_t m_nLODGroupMask; // 0xA - 0xB
   Color m_vTintColor; // 0xB - 0xF
   unsigned char pad_F[0x1]; // 0xF - 0x10
   ObjectTypeFlags_t m_objectFlags; // 0x10 - 0x14
   int32_t m_nLightProbeVolumePrecomputedHandshake; // 0x14 - 0x18
}; // size - 0x18


class AggregateSceneObject_t /* "worldrenderer" */
{
public:
   ObjectTypeFlags_t m_allFlags; // 0x0 - 0x4
   ObjectTypeFlags_t m_anyFlags; // 0x4 - 0x8
   int16_t m_nLayer; // 0x8 - 0xA
   unsigned char pad_A[0x6]; // 0xA - 0x10
   CUtlVector< AggregateMeshInfo_t > m_aggregateMeshes; // 0x10 - 0x28
   CUtlVector< AggregateLODSetup_t > m_lodSetups; // 0x28 - 0x40
   CUtlVector< uint16 > m_visClusterMembership; // 0x40 - 0x58
   CUtlVector< matrix3x4_t > m_fragmentTransforms; // 0x58 - 0x70
   CStrongHandle< InfoForResourceTypeCModel > m_renderableModel; // 0x70 - 0x78
}; // size - 0x78


class AimMatrixOpFixedSettings_t /* "animgraphlib" */
{
public:
   CAnimAttachment m_attachment; // 0x0 - 0x80
   CAnimInputDamping m_damping; // 0x80 - 0x90
   CPoseHandle m_poseCacheHandles[10]; // 0x90 - 0xB8
   AimMatrixBlendMode m_eBlendMode; // 0xB8 - 0xBC
   float m_fAngleIncrement; // 0xBC - 0xC0
   int32_t m_nSequenceMaxFrame; // 0xC0 - 0xC4
   int32_t m_nBoneMaskIndex; // 0xC4 - 0xC8
   bool m_bTargetIsPosition; // 0xC8 - 0xC9
   unsigned char pad_C9[0x7]; // 0xC9 - 0xD0
}; // size - 0xD0


class AmmoIndex_t /* "server" */
{
public:
   int8_t m_Value; // 0x0 - 0x1
}; // size - 0x1


class AnimComponentID /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimNodeID /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimNodeOutputID /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimParamID /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimScriptHandle /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimStateID /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimTagID /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimationDecodeDebugDumpElement_t /* "animationsystem" */
{
public:
   int32_t m_nEntityIndex; // 0x0 - 0x4
   unsigned char pad_4[0x4]; // 0x4 - 0x8
   CUtlString m_modelName; // 0x8 - 0x10
   CUtlVector< CUtlString > m_poseParams; // 0x10 - 0x28
   CUtlVector< CUtlString > m_decodeOps; // 0x28 - 0x40
   CUtlVector< CUtlString > m_internalOps; // 0x40 - 0x58
   CUtlVector< CUtlString > m_decodedAnims; // 0x58 - 0x70
}; // size - 0x70


class AnimationDecodeDebugDump_t /* "animationsystem" */
{
public:
   AnimationProcessingType_t m_processingType; // 0x0 - 0x4
   unsigned char pad_4[0x4]; // 0x4 - 0x8
   CUtlVector< AnimationDecodeDebugDumpElement_t > m_elems; // 0x8 - 0x20
}; // size - 0x20


class AnimationSnapshot_t /* "animationsystem" */ : public AnimationSnapshotBase_t /* "animationsystem" */
{
public:
   int32_t m_nEntIndex; // 0x110 - 0x114
   unsigned char pad_114[0x4]; // 0x114 - 0x118
   CUtlString m_modelName; // 0x118 - 0x120
}; // size - 0x120


class AnimationUpdateListHandle_t /* "server" */
{
public:
   uint32_t m_Value; // 0x0 - 0x4
}; // size - 0x4


class AttachmentHandle_t /* "modellib" */
{
public:
   uint8_t m_Value; // 0x0 - 0x1
}; // size - 0x1


class BakedLightingInfo_t /* "worldrenderer" */
{
public:
   uint32_t m_nLightmapVersionNumber; // 0x0 - 0x4
   uint32_t m_nLightmapGameVersionNumber; // 0x4 - 0x8
   Vector2D m_vLightmapUvScale; // 0x8 - 0x10
   bool m_bHasLightmaps; // 0x10 - 0x11
   unsigned char pad_11[0x7]; // 0x11 - 0x18
   CUtlVector< CStrongHandle< InfoForResourceTypeCTextureBase > > m_lightMaps; // 0x18 - 0x30
}; // size - 0x30


class BlendItem_t /* "animgraphlib" */
{
public:
   CUtlVector< TagSpan_t > m_tags; // 0x0 - 0x18
   CAnimUpdateNodeRef m_pChild; // 0x18 - 0x28
   HSequence m_hSequence; // 0x28 - 0x2C
   Vector2D m_vPos; // 0x2C - 0x34
   float m_flDuration; // 0x34 - 0x38
   bool m_bUseCustomDuration; // 0x38 - 0x39
   unsigned char pad_39[0x7]; // 0x39 - 0x40
}; // size - 0x40


class BoneDemoCaptureSettings_t /* "animgraphlib" */
{
public:
   CUtlString m_boneName; // 0x0 - 0x8
   float m_flChainLength; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
}; // size - 0x10


class CAISound /* "server" */ : public CPointEntity /* "server" */
{
public:
   int32_t m_iSoundType; // 0x4B0 - 0x4B4
   int32_t m_iSoundContext; // 0x4B4 - 0x4B8
   int32_t m_iVolume; // 0x4B8 - 0x4BC
   int32_t m_iSoundIndex; // 0x4BC - 0x4C0
   float m_flDuration; // 0x4C0 - 0x4C4
   unsigned char pad_4C4[0x4]; // 0x4C4 - 0x4C8
   CUtlSymbolLarge m_iszProxyEntityName; // 0x4C8 - 0x4D0
}; // size - 0x4D0


class CAI_ChangeHintGroup /* "server" */ : public CBaseEntity /* "server" */
{
public:
   int32_t m_iSearchType; // 0x4B0 - 0x4B4
   unsigned char pad_4B4[0x4]; // 0x4B4 - 0x4B8
   CUtlSymbolLarge m_strSearchName; // 0x4B8 - 0x4C0
   CUtlSymbolLarge m_strNewHintGroup; // 0x4C0 - 0x4C8
   float m_flRadius; // 0x4C8 - 0x4CC
   unsigned char pad_4CC[0x4]; // 0x4CC - 0x4D0
}; // size - 0x4D0


class CAI_ChangeTarget /* "server" */ : public CBaseEntity /* "server" */
{
public:
   CUtlSymbolLarge m_iszNewTarget; // 0x4B0 - 0x4B8
}; // size - 0x4B8


class CAK47 /* "server" */ : public CCSWeaponBaseGun /* "server" */
{
public:
   unsigned char pad_0[0xDF8]; // 0x0 - 0xDF8
}; // size - 0xDF8


class CActionComponentUpdater /* "animgraphlib" */ : public CAnimComponentUpdater /* "animgraphlib" */
{
public:
   CUtlVector< CSmartPtr< CAnimActionUpdater > > m_actions; // 0x30 - 0x48
}; // size - 0x48


class CAddUpdateNode /* "animgraphlib" */ : public CBinaryUpdateNode /* "animgraphlib" */
{
public:
   unsigned char pad_88[0x4]; // 0x88 - 0x8C
   BinaryNodeChildOption m_footMotionTiming; // 0x8C - 0x90
   bool m_bApplyToFootMotion; // 0x90 - 0x91
   bool m_bApplyChannelsSeparately; // 0x91 - 0x92
   bool m_bUseModelSpace; // 0x92 - 0x93
   unsigned char pad_93[0x5]; // 0x93 - 0x98
}; // size - 0x98


class CAimConstraint /* "modellib" */ : public CBaseConstraint /* "modellib" */
{
public:
   Quaternion m_qAimOffset; // 0x70 - 0x80
   uint32_t m_nUpType; // 0x80 - 0x84
   unsigned char pad_84[0xC]; // 0x84 - 0x90
}; // size - 0x90


class CAimMatrixUpdateNode /* "animgraphlib" */ : public CUnaryUpdateNode /* "animgraphlib" */
{
public:
   unsigned char pad_68[0x8]; // 0x68 - 0x70
   AimMatrixOpFixedSettings_t m_opFixedSettings; // 0x70 - 0x140
   unsigned char pad_140[0x8]; // 0x140 - 0x148
   AnimVectorSource m_target; // 0x148 - 0x14C
   CAnimParamHandle m_paramIndex; // 0x14C - 0x14E
   unsigned char pad_14E[0x2]; // 0x14E - 0x150
   HSequence m_hSequence; // 0x150 - 0x154
   bool m_bResetChild; // 0x154 - 0x155
   bool m_bLockWhenWaning; // 0x155 - 0x156
   unsigned char pad_156[0xA]; // 0x156 - 0x160
}; // size - 0x160


class CAmbientGeneric /* "server" */ : public CPointEntity /* "server" */
{
public:
   float m_radius; // 0x4B0 - 0x4B4
   float m_flMaxRadius; // 0x4B4 - 0x4B8
   soundlevel_t m_iSoundLevel; // 0x4B8 - 0x4BC
   dynpitchvol_t m_dpv; // 0x4BC - 0x520
   bool m_fActive; // 0x520 - 0x521
   bool m_fLooping; // 0x521 - 0x522
   unsigned char pad_522[0x6]; // 0x522 - 0x528
   CUtlSymbolLarge m_iszSound; // 0x528 - 0x530
   CUtlSymbolLarge m_sSourceEntName; // 0x530 - 0x538
   CHandle< CBaseEntity > m_hSoundSource; // 0x538 - 0x53C
   CEntityIndex m_nSoundSourceEntIndex; // 0x53C - 0x540
   unsigned char pad_540[0x8]; // 0x540 - 0x548
}; // size - 0x548


class CAnimActivity /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   int32_t m_nActivity; // 0x10 - 0x14
   int32_t m_nFlags; // 0x14 - 0x18
   int32_t m_nWeight; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
}; // size - 0x20


class CAnimAttachment /* "modellib" */
{
public:
   Quaternion m_influenceRotations[3]; // 0x0 - 0x30
   VectorAligned m_influenceOffsets[3]; // 0x30 - 0x60
   int32 m_influenceIndices[3]; // 0x60 - 0x6C
   float32 m_influenceWeights[3]; // 0x6C - 0x78
   uint8_t m_numInfluences; // 0x78 - 0x79
   unsigned char pad_79[0x7]; // 0x79 - 0x80
}; // size - 0x80


class CAnimBone /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   int32_t m_parent; // 0x10 - 0x14
   Vector m_pos; // 0x14 - 0x20
   QuaternionStorage m_quat; // 0x20 - 0x30
   float m_scale; // 0x30 - 0x34
   QuaternionStorage m_qAlignment; // 0x34 - 0x44
   int32_t m_flags; // 0x44 - 0x48
}; // size - 0x48


class CAnimBoneDifference /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   CBufferString m_parent; // 0x10 - 0x20
   Vector m_posError; // 0x20 - 0x2C
   bool m_bHasRotation; // 0x2C - 0x2D
   bool m_bHasMovement; // 0x2D - 0x2E
   unsigned char pad_2E[0x2]; // 0x2E - 0x30
}; // size - 0x30


class CAnimCycle /* "modellib" */ : public CCycleBase /* "modellib" */
{
public:
   unsigned char pad_0[0x4]; // 0x0 - 0x4
}; // size - 0x4


class CAnimData /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CBufferString m_name; // 0x10 - 0x20
   CUtlVector< CAnimDesc > m_animArray; // 0x20 - 0x38
   CUtlVector< CAnimDecoder > m_decoderArray; // 0x38 - 0x50
   int32_t m_nMaxUniqueFrameIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
   CUtlVector< CAnimFrameSegment > m_segmentArray; // 0x58 - 0x70
}; // size - 0x70


class CAnimDataChannelDesc /* "animationsystem" */
{
public:
   CBufferString m_szChannelClass; // 0x0 - 0x10
   CBufferString m_szVariableName; // 0x10 - 0x20
   int32_t m_nFlags; // 0x20 - 0x24
   int32_t m_nType; // 0x24 - 0x28
   CBufferString m_szGrouping; // 0x28 - 0x38
   CBufferString m_szDescription; // 0x38 - 0x48
   CUtlVector< CBufferString > m_szElementNameArray; // 0x48 - 0x60
   CUtlVector< int32 > m_nElementIndexArray; // 0x60 - 0x78
   CUtlVector< uint32 > m_nElementMaskArray; // 0x78 - 0x90
}; // size - 0x90


class CAnimDecoder /* "animationsystem" */
{
public:
   CBufferString m_szName; // 0x0 - 0x10
   int32_t m_nVersion; // 0x10 - 0x14
   int32_t m_nType; // 0x14 - 0x18
}; // size - 0x18


class CAnimDemoCaptureSettings /* "animgraphlib" */
{
public:
   Vector2D m_rangeBoneChainLength; // 0x0 - 0x8
   Vector2D m_rangeMaxSplineErrorRotation; // 0x8 - 0x10
   float m_flMaxSplineErrorTranslation; // 0x10 - 0x14
   float m_flMaxSplineErrorScale; // 0x14 - 0x18
   float m_flIkRotation_MaxSplineError; // 0x18 - 0x1C
   float m_flIkTranslation_MaxSplineError; // 0x1C - 0x20
   float m_flMaxQuantizationErrorRotation; // 0x20 - 0x24
   float m_flMaxQuantizationErrorTranslation; // 0x24 - 0x28
   float m_flMaxQuantizationErrorScale; // 0x28 - 0x2C
   float m_flIkRotation_MaxQuantizationError; // 0x2C - 0x30
   float m_flIkTranslation_MaxQuantizationError; // 0x30 - 0x34
   unsigned char pad_34[0x4]; // 0x34 - 0x38
   CUtlString m_baseSequence; // 0x38 - 0x40
   int32_t m_nBaseSequenceFrame; // 0x40 - 0x44
   EDemoBoneSelectionMode m_boneSelectionMode; // 0x44 - 0x48
   CUtlVector< BoneDemoCaptureSettings_t > m_bones; // 0x48 - 0x60
   CUtlVector< IKDemoCaptureSettings_t > m_ikChains; // 0x60 - 0x78
}; // size - 0x78


class CAnimDesc /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   CAnimDesc_Flag m_flags; // 0x10 - 0x18
   float fps; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
   CAnimEncodedFrames m_Data; // 0x20 - 0xF8
   CUtlVector< CAnimMovement > m_movementArray; // 0xF8 - 0x110
   CUtlVector< CAnimEventDefinition > m_eventArray; // 0x110 - 0x128
   CUtlVector< CAnimActivity > m_activityArray; // 0x128 - 0x140
   CUtlVector< CAnimLocalHierarchy > m_hierarchyArray; // 0x140 - 0x158
   float framestalltime; // 0x158 - 0x15C
   Vector m_vecRootMin; // 0x15C - 0x168
   Vector m_vecRootMax; // 0x168 - 0x174
   unsigned char pad_174[0x4]; // 0x174 - 0x178
   CUtlVector< Vector > m_vecBoneWorldMin; // 0x178 - 0x190
   CUtlVector< Vector > m_vecBoneWorldMax; // 0x190 - 0x1A8
   CAnimSequenceParams m_sequenceParams; // 0x1A8 - 0x1B0
}; // size - 0x1B0


class CAnimDesc_Flag /* "animationsystem" */
{
public:
   bool m_bLooping; // 0x0 - 0x1
   bool m_bAllZeros; // 0x1 - 0x2
   bool m_bHidden; // 0x2 - 0x3
   bool m_bDelta; // 0x3 - 0x4
   bool m_bLegacyWorldspace; // 0x4 - 0x5
   bool m_bModelDoc; // 0x5 - 0x6
   bool m_bImplicitSeqIgnoreDelta; // 0x6 - 0x7
   bool m_bAnimGraphAdditive; // 0x7 - 0x8
}; // size - 0x8


class CAnimEncodeDifference /* "animationsystem" */
{
public:
   CUtlVector< CAnimBoneDifference > m_boneArray; // 0x0 - 0x18
   CUtlVector< CAnimMorphDifference > m_morphArray; // 0x18 - 0x30
   CUtlVector< CAnimUserDifference > m_userArray; // 0x30 - 0x48
   CUtlVector< uint8 > m_bHasRotationBitArray; // 0x48 - 0x60
   CUtlVector< uint8 > m_bHasMovementBitArray; // 0x60 - 0x78
   CUtlVector< uint8 > m_bHasMorphBitArray; // 0x78 - 0x90
   CUtlVector< uint8 > m_bHasUserBitArray; // 0x90 - 0xA8
}; // size - 0xA8


class CAnimEncodedFrames /* "animationsystem" */
{
public:
   CBufferString m_fileName; // 0x0 - 0x10
   int32_t m_nFrames; // 0x10 - 0x14
   int32_t m_nFramesPerBlock; // 0x14 - 0x18
   CUtlVector< CAnimFrameBlockAnim > m_frameblockArray; // 0x18 - 0x30
   CAnimEncodeDifference m_usageDifferences; // 0x30 - 0xD8
}; // size - 0xD8


class CAnimEnum /* "animationsystem" */
{
public:
   uint8_t m_value; // 0x0 - 0x1
}; // size - 0x1


class CAnimEventDefinition /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   int32_t m_nFrame; // 0x8 - 0xC
   float m_flCycle; // 0xC - 0x10
   KeyValues3 m_EventData; // 0x10 - 0x20
   CBufferString m_sLegacyOptions; // 0x20 - 0x30
   CGlobalSymbol m_sEventName; // 0x30 - 0x38
}; // size - 0x38


class CAnimEventListener /* "server" */ : public CAnimEventListenerBase /* "server" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
}; // size - 0x20


class CAnimEventQueueListener /* "server" */ : public CAnimEventListenerBase /* "server" */
{
public:
   unsigned char pad_0[0x38]; // 0x0 - 0x38
}; // size - 0x38


class CAnimFoot /* "modellib" */
{
public:
   CUtlString m_name; // 0x0 - 0x8
   Vector m_vBallOffset; // 0x8 - 0x14
   Vector m_vHeelOffset; // 0x14 - 0x20
   int32_t m_ankleBoneIndex; // 0x20 - 0x24
   int32_t m_toeBoneIndex; // 0x24 - 0x28
}; // size - 0x28


class CAnimFrameBlockAnim /* "animationsystem" */
{
public:
   int32_t m_nStartFrame; // 0x0 - 0x4
   int32_t m_nEndFrame; // 0x4 - 0x8
   CUtlVector< int32 > m_segmentIndexArray; // 0x8 - 0x20
}; // size - 0x20


class CAnimFrameSegment /* "animationsystem" */
{
public:
   int32_t m_nUniqueFrameIndex; // 0x0 - 0x4
   uint32_t m_nLocalElementMasks; // 0x4 - 0x8
   int32_t m_nLocalChannel; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
   CUtlBinaryBlock m_container; // 0x10 - 0x28
}; // size - 0x28


class CAnimGraphControllerBase /* "server" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
}; // size - 0x18


class CAnimGraphDebugReplay /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
   CUtlString m_animGraphFileName; // 0x40 - 0x48
   CUtlVector< CSmartPtr< CAnimReplayFrame > > m_frameList; // 0x48 - 0x60
   int32_t m_startIndex; // 0x60 - 0x64
   int32_t m_writeIndex; // 0x64 - 0x68
   int32_t m_frameCount; // 0x68 - 0x6C
   unsigned char pad_6C[0x4]; // 0x6C - 0x70
}; // size - 0x70


class CAnimGraphModelBinding /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlString m_modelName; // 0x8 - 0x10
   CSmartPtr< CAnimUpdateSharedData > m_pSharedData; // 0x10 - 0x18
   unsigned char pad_18[0x10]; // 0x18 - 0x28
}; // size - 0x28


class CAnimGraphNetworkSettings /* "animgraphlib" */ : public CAnimGraphSettingsGroup /* "animgraphlib" */
{
public:
   bool m_bNetworkingEnabled; // 0x20 - 0x21
   unsigned char pad_21[0x7]; // 0x21 - 0x28
}; // size - 0x28


class CAnimGraphNetworkedVariables /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkUtlVectorBase< uint32 > m_PredNetBoolVariables; // 0x8 - 0x20
   CNetworkUtlVectorBase< uint8 > m_PredNetByteVariables; // 0x20 - 0x38
   CNetworkUtlVectorBase< uint16 > m_PredNetUInt16Variables; // 0x38 - 0x50
   CNetworkUtlVectorBase< int32 > m_PredNetIntVariables; // 0x50 - 0x68
   CNetworkUtlVectorBase< uint32 > m_PredNetUInt32Variables; // 0x68 - 0x80
   CNetworkUtlVectorBase< uint64 > m_PredNetUInt64Variables; // 0x80 - 0x98
   CNetworkUtlVectorBase< float32 > m_PredNetFloatVariables; // 0x98 - 0xB0
   CNetworkUtlVectorBase< Vector > m_PredNetVectorVariables; // 0xB0 - 0xC8
   CNetworkUtlVectorBase< Quaternion > m_PredNetQuaternionVariables; // 0xC8 - 0xE0
   CNetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetBoolVariables; // 0xE0 - 0xF8
   CNetworkUtlVectorBase< uint8 > m_OwnerOnlyPredNetByteVariables; // 0xF8 - 0x110
   CNetworkUtlVectorBase< uint16 > m_OwnerOnlyPredNetUInt16Variables; // 0x110 - 0x128
   CNetworkUtlVectorBase< int32 > m_OwnerOnlyPredNetIntVariables; // 0x128 - 0x140
   CNetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetUInt32Variables; // 0x140 - 0x158
   CNetworkUtlVectorBase< uint64 > m_OwnerOnlyPredNetUInt64Variables; // 0x158 - 0x170
   CNetworkUtlVectorBase< float32 > m_OwnerOnlyPredNetFloatVariables; // 0x170 - 0x188
   CNetworkUtlVectorBase< Vector > m_OwnerOnlyPredNetVectorVariables; // 0x188 - 0x1A0
   CNetworkUtlVectorBase< Quaternion > m_OwnerOnlyPredNetQuaternionVariables; // 0x1A0 - 0x1B8
   int32_t m_nBoolVariablesCount; // 0x1B8 - 0x1BC
   int32_t m_nOwnerOnlyBoolVariablesCount; // 0x1BC - 0x1C0
   int32_t m_nRandomSeedOffset; // 0x1C0 - 0x1C4
   float m_flLastTeleportTime; // 0x1C4 - 0x1C8
   unsigned char pad_1C8[0x10]; // 0x1C8 - 0x1D8
}; // size - 0x1D8


class CAnimGraphNetworkedVariables /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   C_NetworkUtlVectorBase< uint32 > m_PredNetBoolVariables; // 0x8 - 0x20
   C_NetworkUtlVectorBase< uint8 > m_PredNetByteVariables; // 0x20 - 0x38
   C_NetworkUtlVectorBase< uint16 > m_PredNetUInt16Variables; // 0x38 - 0x50
   C_NetworkUtlVectorBase< int32 > m_PredNetIntVariables; // 0x50 - 0x68
   C_NetworkUtlVectorBase< uint32 > m_PredNetUInt32Variables; // 0x68 - 0x80
   C_NetworkUtlVectorBase< uint64 > m_PredNetUInt64Variables; // 0x80 - 0x98
   C_NetworkUtlVectorBase< float32 > m_PredNetFloatVariables; // 0x98 - 0xB0
   C_NetworkUtlVectorBase< Vector > m_PredNetVectorVariables; // 0xB0 - 0xC8
   C_NetworkUtlVectorBase< Quaternion > m_PredNetQuaternionVariables; // 0xC8 - 0xE0
   C_NetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetBoolVariables; // 0xE0 - 0xF8
   C_NetworkUtlVectorBase< uint8 > m_OwnerOnlyPredNetByteVariables; // 0xF8 - 0x110
   C_NetworkUtlVectorBase< uint16 > m_OwnerOnlyPredNetUInt16Variables; // 0x110 - 0x128
   C_NetworkUtlVectorBase< int32 > m_OwnerOnlyPredNetIntVariables; // 0x128 - 0x140
   C_NetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetUInt32Variables; // 0x140 - 0x158
   C_NetworkUtlVectorBase< uint64 > m_OwnerOnlyPredNetUInt64Variables; // 0x158 - 0x170
   C_NetworkUtlVectorBase< float32 > m_OwnerOnlyPredNetFloatVariables; // 0x170 - 0x188
   C_NetworkUtlVectorBase< Vector > m_OwnerOnlyPredNetVectorVariables; // 0x188 - 0x1A0
   C_NetworkUtlVectorBase< Quaternion > m_OwnerOnlyPredNetQuaternionVariables; // 0x1A0 - 0x1B8
   int32_t m_nBoolVariablesCount; // 0x1B8 - 0x1BC
   int32_t m_nOwnerOnlyBoolVariablesCount; // 0x1BC - 0x1C0
   int32_t m_nRandomSeedOffset; // 0x1C0 - 0x1C4
   float m_flLastTeleportTime; // 0x1C4 - 0x1C8
   unsigned char pad_1C8[0x1118]; // 0x1C8 - 0x12E0
}; // size - 0x12E0


class CAnimGraphSettingsManager /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< CSmartPtr< CAnimGraphSettingsGroup > > m_settingsGroups; // 0x18 - 0x30
}; // size - 0x30


class CAnimGraphTagRef /* "server" */
{
public:
   int32_t m_nTagIndex; // 0x0 - 0x4
   unsigned char pad_4[0xC]; // 0x4 - 0x10
   CGlobalSymbol m_tagName; // 0x10 - 0x18
}; // size - 0x18


class CAnimInputDamping /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   DampingSpeedFunction m_speedFunction; // 0x8 - 0xC
   float m_fSpeedScale; // 0xC - 0x10
}; // size - 0x10


class CAnimKeyData /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   CUtlVector< CAnimBone > m_boneArray; // 0x10 - 0x28
   CUtlVector< CAnimUser > m_userArray; // 0x28 - 0x40
   CUtlVector< CBufferString > m_morphArray; // 0x40 - 0x58
   int32_t m_nChannelElements; // 0x58 - 0x5C
   unsigned char pad_5C[0x4]; // 0x5C - 0x60
   CUtlVector< CAnimDataChannelDesc > m_dataChannelArray; // 0x60 - 0x78
}; // size - 0x78


class CAnimLocalHierarchy /* "animationsystem" */
{
public:
   CBufferString m_sBone; // 0x0 - 0x10
   CBufferString m_sNewParent; // 0x10 - 0x20
   int32_t m_nStartFrame; // 0x20 - 0x24
   int32_t m_nPeakFrame; // 0x24 - 0x28
   int32_t m_nTailFrame; // 0x28 - 0x2C
   int32_t m_nEndFrame; // 0x2C - 0x30
}; // size - 0x30


class CAnimMorphDifference /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
}; // size - 0x10


class CAnimMovement /* "animationsystem" */
{
public:
   int32_t endframe; // 0x0 - 0x4
   int32_t motionflags; // 0x4 - 0x8
   float v0; // 0x8 - 0xC
   float v1; // 0xC - 0x10
   float angle; // 0x10 - 0x14
   Vector vector; // 0x14 - 0x20
   Vector position; // 0x20 - 0x2C
}; // size - 0x2C


class CAnimNodePath /* "animgraphlib" */
{
public:
   AnimNodeID m_path[11]; // 0x0 - 0x2C
   int32_t m_nCount; // 0x2C - 0x30
}; // size - 0x30


class CAnimParamHandle /* "animgraphlib" */
{
public:
   AnimParamType_t m_type; // 0x0 - 0x1
   uint8_t m_index; // 0x1 - 0x2
}; // size - 0x2


class CAnimParamHandleMap /* "animgraphlib" */
{
public:
   CUtlHashtable< uint16, int16 > m_list; // 0x0 - 0x20
}; // size - 0x20


class CAnimParameterManagerUpdater /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< CSmartPtr< CAnimParameterBase > > m_parameters; // 0x18 - 0x30
   CUtlHashtable< AnimParamID, int32 > m_idToIndexMap; // 0x30 - 0x50
   CUtlHashtable< CUtlString, int32 > m_nameToIndexMap; // 0x50 - 0x70
   CUtlVector< CAnimParamHandle > m_indexToHandle; // 0x70 - 0x88
   CUtlVector< CUtlPair< CAnimParamHandle, CAnimVariant > > m_autoResetParams; // 0x88 - 0xA0
   CUtlHashtable< CAnimParamHandle, int16 > m_autoResetMap; // 0xA0 - 0xC0
   unsigned char pad_C0[0x40]; // 0xC0 - 0x100
}; // size - 0x100


class CAnimReplayFrame /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CUtlBinaryBlock > m_inputDataBlocks; // 0x10 - 0x28
   CUtlBinaryBlock m_instanceData; // 0x28 - 0x40
   CTransform m_startingLocalToWorldTransform; // 0x40 - 0x60
   CTransform m_localToWorldTransform; // 0x60 - 0x80
   float m_timeStamp; // 0x80 - 0x84
   unsigned char pad_84[0xC]; // 0x84 - 0x90
}; // size - 0x90


class CAnimScriptComponentUpdater /* "animgraphlib" */ : public CAnimComponentUpdater /* "animgraphlib" */
{
public:
   AnimScriptHandle m_hScript; // 0x30 - 0x34
   unsigned char pad_34[0x4]; // 0x34 - 0x38
}; // size - 0x38


class CAnimScriptManager /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< ScriptInfo_t > m_scriptInfo; // 0x10 - 0x28
   unsigned char pad_28[0x178]; // 0x28 - 0x1A0
}; // size - 0x1A0


class CAnimSequenceParams /* "animationsystem" */
{
public:
   float m_flFadeInTime; // 0x0 - 0x4
   float m_flFadeOutTime; // 0x4 - 0x8
}; // size - 0x8


class CAnimSkeleton /* "modellib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CTransform > m_localSpaceTransforms; // 0x10 - 0x28
   CUtlVector< CTransform > m_modelSpaceTransforms; // 0x28 - 0x40
   CUtlVector< CUtlString > m_boneNames; // 0x40 - 0x58
   CUtlVector< CUtlVector< int32 > > m_children; // 0x58 - 0x70
   CUtlVector< int32 > m_parents; // 0x70 - 0x88
   CUtlVector< CAnimFoot > m_feet; // 0x88 - 0xA0
   CUtlVector< CUtlString > m_morphNames; // 0xA0 - 0xB8
   CUtlVector< int32 > m_lodBoneCounts; // 0xB8 - 0xD0
}; // size - 0xD0


class CAnimStateMachineUpdater /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVector< CStateUpdateData > m_states; // 0x8 - 0x20
   CUtlVector< CTransitionUpdateData > m_transitions; // 0x20 - 0x38
   unsigned char pad_38[0x18]; // 0x38 - 0x50
   int32_t m_startStateIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
}; // size - 0x58


class CAnimTagManagerUpdater /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< CSmartPtr< CAnimTagBase > > m_tags; // 0x18 - 0x30
   unsigned char pad_30[0x8]; // 0x30 - 0x38
}; // size - 0x38


class CAnimUpdateNodeRef /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   int32_t m_nodeIndex; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
}; // size - 0x10


class CAnimUpdateSharedData /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CSmartPtr< CAnimUpdateNodeBase > > m_nodes; // 0x10 - 0x28
   CUtlHashtable< CAnimNodePath, int32 > m_nodeIndexMap; // 0x28 - 0x48
   CUtlVector< CSmartPtr< CAnimComponentUpdater > > m_components; // 0x48 - 0x60
   CSmartPtr< CAnimParameterManagerUpdater > m_pParamListUpdater; // 0x60 - 0x68
   CSmartPtr< CAnimTagManagerUpdater > m_pTagManagerUpdater; // 0x68 - 0x70
   CSmartPtr< CAnimScriptManager > m_scriptManager; // 0x70 - 0x78
   CAnimGraphSettingsManager m_settings; // 0x78 - 0xA8
   CSmartPtr< CStaticPoseCacheBuilder > m_pStaticPoseCache; // 0xA8 - 0xB0
   CSmartPtr< CAnimSkeleton > m_pSkeleton; // 0xB0 - 0xB8
   CAnimNodePath m_rootNodePath; // 0xB8 - 0xE8
   unsigned char pad_E8[0x18]; // 0xE8 - 0x100
}; // size - 0x100


class CAnimUser /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   int32_t m_nType; // 0x10 - 0x14
   unsigned char pad_14[0x4]; // 0x14 - 0x18
}; // size - 0x18


class CAnimUserDifference /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   int32_t m_nType; // 0x10 - 0x14
   unsigned char pad_14[0x4]; // 0x14 - 0x18
}; // size - 0x18


class CAnimationGraphVisualizerAxis /* "animgraphlib" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animgraphlib" */
{
public:
   CTransform m_xWsTransform; // 0x40 - 0x60
   float m_flAxisSize; // 0x60 - 0x64
   unsigned char pad_64[0xC]; // 0x64 - 0x70
}; // size - 0x70


class CAnimationGraphVisualizerLine /* "animgraphlib" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animgraphlib" */
{
public:
   VectorAligned m_vWsPositionStart; // 0x40 - 0x50
   VectorAligned m_vWsPositionEnd; // 0x50 - 0x60
   Color m_Color; // 0x60 - 0x64
   unsigned char pad_64[0xC]; // 0x64 - 0x70
}; // size - 0x70


class CAnimationGraphVisualizerPie /* "animgraphlib" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animgraphlib" */
{
public:
   VectorAligned m_vWsCenter; // 0x40 - 0x50
   VectorAligned m_vWsStart; // 0x50 - 0x60
   VectorAligned m_vWsEnd; // 0x60 - 0x70
   Color m_Color; // 0x70 - 0x74
   unsigned char pad_74[0xC]; // 0x74 - 0x80
}; // size - 0x80


class CAnimationGraphVisualizerSphere /* "animgraphlib" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animgraphlib" */
{
public:
   VectorAligned m_vWsPosition; // 0x40 - 0x50
   float m_flRadius; // 0x50 - 0x54
   Color m_Color; // 0x54 - 0x58
   unsigned char pad_58[0x8]; // 0x58 - 0x60
}; // size - 0x60


class CAnimationGraphVisualizerText /* "animgraphlib" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animgraphlib" */
{
public:
   VectorAligned m_vWsPosition; // 0x40 - 0x50
   Color m_Color; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
   CUtlString m_Text; // 0x58 - 0x60
}; // size - 0x60


class CAnimationGroup /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   uint32_t m_nFlags; // 0x10 - 0x14
   unsigned char pad_14[0x4]; // 0x14 - 0x18
   CBufferString m_name; // 0x18 - 0x28
   unsigned char pad_28[0x38]; // 0x28 - 0x60
   CUtlVector< CStrongHandle< InfoForResourceTypeCAnimData > > m_localHAnimArray_Handle; // 0x60 - 0x78
   CUtlVector< CStrongHandle< InfoForResourceTypeCAnimationGroup > > m_includedGroupArray_Handle; // 0x78 - 0x90
   CStrongHandle< InfoForResourceTypeCSequenceGroupData > m_directHSeqGroup_Handle; // 0x90 - 0x98
   CAnimKeyData m_decodeKey; // 0x98 - 0x110
   CUtlVector< CBufferString > m_szScripts; // 0x110 - 0x128
   unsigned char pad_128[0x8]; // 0x128 - 0x130
}; // size - 0x130


class CAttachment /* "modellib" */
{
public:
   CUtlString m_name; // 0x0 - 0x8
   CUtlString m_influenceNames[3]; // 0x8 - 0x20
   Quaternion m_vInfluenceRotations[3]; // 0x20 - 0x50
   Vector m_vInfluenceOffsets[3]; // 0x50 - 0x74
   float32 m_influenceWeights[3]; // 0x74 - 0x80
   bool m_bInfluenceRootTransform[3]; // 0x80 - 0x83
   uint8_t m_nInfluences; // 0x83 - 0x84
   bool m_bIgnoreRotation; // 0x84 - 0x85
   unsigned char pad_85[0xB]; // 0x85 - 0x90
}; // size - 0x90


class CAttributeContainer /* "server" */ : public CAttributeManager /* "server" */
{
public:
   CEconItemView m_Item; // 0x50 - 0x2C8
}; // size - 0x2C8


class CAttributeList /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVectorEmbeddedNetworkVar< CEconItemAttribute > m_Attributes; // 0x8 - 0x58
   CAttributeManager* m_pManager; // 0x58 - 0x60
}; // size - 0x60


class CAttributeList /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   C_UtlVectorEmbeddedNetworkVar< CEconItemAttribute > m_Attributes; // 0x8 - 0x58
   CAttributeManager* m_pManager; // 0x58 - 0x60
}; // size - 0x60




class CAudioAnimTag /* "animgraphlib" */ : public CAnimTagBase /* "animgraphlib" */
{
public:
   unsigned char pad_30[0x8]; // 0x30 - 0x38
   CUtlString m_clipName; // 0x38 - 0x40
   CUtlString m_attachmentName; // 0x40 - 0x48
   float m_flVolume; // 0x48 - 0x4C
   bool m_bStopWhenTagEnds; // 0x4C - 0x4D
   bool m_bStopWhenGraphEnds; // 0x4D - 0x4E
   bool m_bPlayOnServer; // 0x4E - 0x4F
   bool m_bPlayOnClient; // 0x4F - 0x50
}; // size - 0x50


class CBaseAnimGraphController /* "client" */ : public CSkeletonAnimationController /* "client" */
{
public:
   unsigned char pad_10[0x8]; // 0x10 - 0x18
   CNetworkedSequenceOperation m_baseLayer; // 0x18 - 0x40
   CAnimGraphNetworkedVariables m_animGraphNetworkedVars; // 0x40 - 0x1320
   bool m_bSequenceFinished; // 0x1320 - 0x1321
   unsigned char pad_1321[0x3]; // 0x1321 - 0x1324
   float m_flLastEventCycle; // 0x1324 - 0x1328
   float m_flLastEventAnimTime; // 0x1328 - 0x132C
   CNetworkedQuantizedFloat m_flPlaybackRate; // 0x132C - 0x1334
   float m_flPrevAnimTime; // 0x1334 - 0x1338
   bool m_bClientSideAnimation; // 0x1338 - 0x1339
   bool m_bNetworkedAnimationInputsChanged; // 0x1339 - 0x133A
   uint8_t m_nPrevNewSequenceParity; // 0x133A - 0x133B
   uint8_t m_nPrevResetEventsParity; // 0x133B - 0x133C
   int32_t m_nNewSequenceParity; // 0x133C - 0x1340
   int32_t m_nResetEventsParity; // 0x1340 - 0x1344
   AnimLoopMode_t m_nAnimLoopMode; // 0x1344 - 0x1348
   unsigned char pad_1348[0x9C]; // 0x1348 - 0x13E4
   AnimationUpdateListHandle_t m_hAnimationUpdate; // 0x13E4 - 0x13E8
   HSequence m_hLastAnimEventSequence; // 0x13E8 - 0x13EC
   unsigned char pad_13EC[0x54]; // 0x13EC - 0x1440
}; // size - 0x1440


class CBaseAnimGraphController /* "server" */ : public CSkeletonAnimationController /* "server" */
{
public:
   unsigned char pad_10[0x8]; // 0x10 - 0x18
   CNetworkedSequenceOperation m_baseLayer; // 0x18 - 0x40
   CAnimGraphNetworkedVariables m_animGraphNetworkedVars; // 0x40 - 0x218
   bool m_bSequenceFinished; // 0x218 - 0x219
   unsigned char pad_219[0x3]; // 0x219 - 0x21C
   float m_flLastEventCycle; // 0x21C - 0x220
   float m_flLastEventAnimTime; // 0x220 - 0x224
   CNetworkedQuantizedFloat m_flPlaybackRate; // 0x224 - 0x22C
   float m_flPrevAnimTime; // 0x22C - 0x230
   bool m_bClientSideAnimation; // 0x230 - 0x231
   bool m_bNetworkedAnimationInputsChanged; // 0x231 - 0x232
   unsigned char pad_232[0x2]; // 0x232 - 0x234
   int32_t m_nNewSequenceParity; // 0x234 - 0x238
   int32_t m_nResetEventsParity; // 0x238 - 0x23C
   AnimLoopMode_t m_nAnimLoopMode; // 0x23C - 0x240
   unsigned char pad_240[0x9C]; // 0x240 - 0x2DC
   AnimationUpdateListHandle_t m_hAnimationUpdate; // 0x2DC - 0x2E0
}; // size - 0x2E0


class CBaseDMStart /* "server" */ : public CPointEntity /* "server" */
{
public:
   CUtlSymbolLarge m_Master; // 0x4B0 - 0x4B8
}; // size - 0x4B8


class CBaseFlexAlias_funCBaseFlex /* "server" */ : public CBaseFlex /* "server" */
{
public:
   unsigned char pad_0[0x920]; // 0x0 - 0x920
}; // size - 0x920


class CBaseIssue /* "server" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
   char m_szTypeString[64]; // 0x20 - 0x60
   char m_szDetailsString[260]; // 0x60 - 0x164
   int32_t m_iNumYesVotes; // 0x164 - 0x168
   int32_t m_iNumNoVotes; // 0x168 - 0x16C
   int32_t m_iNumPotentialVotes; // 0x16C - 0x170
   CVoteController* m_pVoteController; // 0x170 - 0x178
}; // size - 0x178


class CBaseMoveBehavior /* "server" */ : public CPathKeyFrame /* "server" */
{
public:
   int32_t m_iPositionInterpolator; // 0x510 - 0x514
   int32_t m_iRotationInterpolator; // 0x514 - 0x518
   float m_flAnimStartTime; // 0x518 - 0x51C
   float m_flAnimEndTime; // 0x51C - 0x520
   float m_flAverageSpeedAcrossFrame; // 0x520 - 0x524
   unsigned char pad_524[0x4]; // 0x524 - 0x528
   CPathKeyFrame* m_pCurrentKeyFrame; // 0x528 - 0x530
   CPathKeyFrame* m_pTargetKeyFrame; // 0x530 - 0x538
   CPathKeyFrame* m_pPreKeyFrame; // 0x538 - 0x540
   CPathKeyFrame* m_pPostKeyFrame; // 0x540 - 0x548
   float m_flTimeIntoFrame; // 0x548 - 0x54C
   int32_t m_iDirection; // 0x54C - 0x550
}; // size - 0x550


class CBasePlayerVData /* "client" */ : public CEntitySubclassVDataBase /* "client" */
{
public:
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_sModelName; // 0x28 - 0x108
   CSkillFloat m_flHeadDamageMultiplier; // 0x108 - 0x118
   CSkillFloat m_flChestDamageMultiplier; // 0x118 - 0x128
   CSkillFloat m_flStomachDamageMultiplier; // 0x128 - 0x138
   CSkillFloat m_flArmDamageMultiplier; // 0x138 - 0x148
   CSkillFloat m_flLegDamageMultiplier; // 0x148 - 0x158
   float m_flHoldBreathTime; // 0x158 - 0x15C
   float m_flDrowningDamageInterval; // 0x15C - 0x160
   int32_t m_nDrowningDamageInitial; // 0x160 - 0x164
   int32_t m_nDrowningDamageMax; // 0x164 - 0x168
   int32_t m_nWaterSpeed; // 0x168 - 0x16C
   float m_flUseRange; // 0x16C - 0x170
   float m_flUseAngleTolerance; // 0x170 - 0x174
   float m_flCrouchTime; // 0x174 - 0x178
}; // size - 0x178


class CBasePlayerVData /* "server" */ : public CEntitySubclassVDataBase /* "server" */
{
public:
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_sModelName; // 0x28 - 0x108
   CSkillFloat m_flHeadDamageMultiplier; // 0x108 - 0x118
   CSkillFloat m_flChestDamageMultiplier; // 0x118 - 0x128
   CSkillFloat m_flStomachDamageMultiplier; // 0x128 - 0x138
   CSkillFloat m_flArmDamageMultiplier; // 0x138 - 0x148
   CSkillFloat m_flLegDamageMultiplier; // 0x148 - 0x158
   float m_flHoldBreathTime; // 0x158 - 0x15C
   float m_flDrowningDamageInterval; // 0x15C - 0x160
   int32_t m_nDrowningDamageInitial; // 0x160 - 0x164
   int32_t m_nDrowningDamageMax; // 0x164 - 0x168
   int32_t m_nWaterSpeed; // 0x168 - 0x16C
   float m_flUseRange; // 0x16C - 0x170
   float m_flUseAngleTolerance; // 0x170 - 0x174
   float m_flCrouchTime; // 0x174 - 0x178
}; // size - 0x178


class CBindPoseUpdateNode /* "animgraphlib" */ : public CLeafUpdateNode /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x60]; // 0x0 - 0x60
}; // size - 0x60


class CBlend2DUpdateNode /* "animgraphlib" */ : public CAnimUpdateNodeBase /* "animgraphlib" */
{
public:
   unsigned char pad_58[0x8]; // 0x58 - 0x60
   CUtlVector< BlendItem_t > m_items; // 0x60 - 0x78
   CUtlVector< TagSpan_t > m_tags; // 0x78 - 0x90
   CParamSpanUpdater m_paramSpans; // 0x90 - 0xA8
   CUtlVector< int32 > m_nodeItemIndices; // 0xA8 - 0xC0
   CAnimInputDamping m_damping; // 0xC0 - 0xD0
   AnimValueSource m_blendSourceX; // 0xD0 - 0xD4
   CAnimParamHandle m_paramX; // 0xD4 - 0xD6
   unsigned char pad_D6[0x2]; // 0xD6 - 0xD8
   AnimValueSource m_blendSourceY; // 0xD8 - 0xDC
   CAnimParamHandle m_paramY; // 0xDC - 0xDE
   unsigned char pad_DE[0x2]; // 0xDE - 0xE0
   Blend2DMode m_eBlendMode; // 0xE0 - 0xE4
   float m_playbackSpeed; // 0xE4 - 0xE8
   bool m_bLoop; // 0xE8 - 0xE9
   bool m_bLockBlendOnReset; // 0xE9 - 0xEA
   bool m_bLockWhenWaning; // 0xEA - 0xEB
   bool m_bAnimEventsAndTagsOnMostWeightedOnly; // 0xEB - 0xEC
   unsigned char pad_EC[0x4]; // 0xEC - 0xF0
}; // size - 0xF0


class CBlendCurve /* "animgraphlib" */
{
public:
   float m_flControlPoint1; // 0x0 - 0x4
   float m_flControlPoint2; // 0x4 - 0x8
}; // size - 0x8


class CBlendUpdateNode /* "animgraphlib" */ : public CAnimUpdateNodeBase /* "animgraphlib" */
{
public:
   unsigned char pad_58[0x8]; // 0x58 - 0x60
   CUtlVector< CAnimUpdateNodeRef > m_children; // 0x60 - 0x78
   CUtlVector< uint8 > m_sortedOrder; // 0x78 - 0x90
   CUtlVector< float32 > m_targetValues; // 0x90 - 0xA8
   unsigned char pad_A8[0x4]; // 0xA8 - 0xAC
   AnimValueSource m_blendValueSource; // 0xAC - 0xB0
   CAnimParamHandle m_paramIndex; // 0xB0 - 0xB2
   unsigned char pad_B2[0x6]; // 0xB2 - 0xB8
   CAnimInputDamping m_damping; // 0xB8 - 0xC8
   BlendKeyType m_blendKeyType; // 0xC8 - 0xCC
   bool m_bLockBlendOnReset; // 0xCC - 0xCD
   bool m_bSyncCycles; // 0xCD - 0xCE
   bool m_bLoop; // 0xCE - 0xCF
   bool m_bLockWhenWaning; // 0xCF - 0xD0
}; // size - 0xD0


class CBlockSelectionMetricEvaluator /* "animgraphlib" */ : public CMotionMetricEvaluator /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x50]; // 0x0 - 0x50
}; // size - 0x50


class CBlood /* "server" */ : public CPointEntity /* "server" */
{
public:
   QAngle m_vecSprayAngles; // 0x4B0 - 0x4BC
   Vector m_vecSprayDir; // 0x4BC - 0x4C8
   float m_flAmount; // 0x4C8 - 0x4CC
   int32_t m_Color; // 0x4CC - 0x4D0
}; // size - 0x4D0


class CBodyComponentBaseAnimGraph /* "client" */ : public CBodyComponentSkeletonInstance /* "client" */
{
public:
   CBaseAnimGraphController m_animationController; // 0x470 - 0x18B0
   CNetworkVarChainer __m_pChainEntity; // 0x18B0 - 0x18D8
   unsigned char pad_18D8[0x8]; // 0x18D8 - 0x18E0
}; // size - 0x18E0


class CBodyComponentBaseAnimGraph /* "server" */ : public CBodyComponentSkeletonInstance /* "server" */
{
public:
   CBaseAnimGraphController m_animationController; // 0x470 - 0x750
   CNetworkVarChainer __m_pChainEntity; // 0x750 - 0x778
   unsigned char pad_778[0x8]; // 0x778 - 0x780
}; // size - 0x780


class CBodyComponentBaseModelEntity /* "client" */ : public CBodyComponentSkeletonInstance /* "client" */
{
public:
   CNetworkVarChainer __m_pChainEntity; // 0x470 - 0x498
   unsigned char pad_498[0x8]; // 0x498 - 0x4A0
}; // size - 0x4A0


class CBodyComponentBaseModelEntity /* "server" */ : public CBodyComponentSkeletonInstance /* "server" */
{
public:
   CNetworkVarChainer __m_pChainEntity; // 0x470 - 0x498
   unsigned char pad_498[0x8]; // 0x498 - 0x4A0
}; // size - 0x4A0


class CBodyComponentPoint /* "client" */ : public CBodyComponent /* "client" */
{
public:
   CGameSceneNode m_sceneNode; // 0x50 - 0x1A0
   CNetworkVarChainer __m_pChainEntity; // 0x1A0 - 0x1C8
   unsigned char pad_1C8[0x8]; // 0x1C8 - 0x1D0
}; // size - 0x1D0


class CBodyComponentPoint /* "server" */ : public CBodyComponent /* "server" */
{
public:
   CGameSceneNode m_sceneNode; // 0x50 - 0x1A0
   CNetworkVarChainer __m_pChainEntity; // 0x1A0 - 0x1C8
   unsigned char pad_1C8[0x8]; // 0x1C8 - 0x1D0
}; // size - 0x1D0


class CBodyGroupAnimTag /* "animgraphlib" */ : public CAnimTagBase /* "animgraphlib" */
{
public:
   unsigned char pad_30[0x8]; // 0x30 - 0x38
   int32_t m_nPriority; // 0x38 - 0x3C
   unsigned char pad_3C[0x4]; // 0x3C - 0x40
   CUtlVector< CBodyGroupSetting > m_bodyGroupSettings; // 0x40 - 0x58
}; // size - 0x58


class CBodyGroupSetting /* "animgraphlib" */
{
public:
   CUtlString m_BodyGroupName; // 0x0 - 0x8
   int32_t m_nBodyGroupOption; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
}; // size - 0x10


class CBombTarget /* "client" */ : public C_BaseTrigger /* "client" */
{
public:
   bool m_bBombPlantedHere; // 0xCC8 - 0xCC9
   unsigned char pad_CC9[0x7]; // 0xCC9 - 0xCD0
}; // size - 0xCD0


class CBombTarget /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   CEntityIOOutput m_OnBombExplode; // 0x8A8 - 0x8D0
   CEntityIOOutput m_OnBombPlanted; // 0x8D0 - 0x8F8
   CEntityIOOutput m_OnBombDefused; // 0x8F8 - 0x920
   bool m_bIsBombSiteB; // 0x920 - 0x921
   bool m_bIsHeistBombTarget; // 0x921 - 0x922
   bool m_bBombPlantedHere; // 0x922 - 0x923
   unsigned char pad_923[0x5]; // 0x923 - 0x928
   CUtlSymbolLarge m_szMountTarget; // 0x928 - 0x930
   CHandle< CBaseEntity > m_hInstructorHint; // 0x930 - 0x934
   int32_t m_nBombSiteDesignation; // 0x934 - 0x938
}; // size - 0x938


class CBoneConstraintDotToMorph /* "modellib" */ : public CBoneConstraintBase /* "modellib" */
{
public:
   CUtlString m_sBoneName; // 0x28 - 0x30
   CUtlString m_sTargetBoneName; // 0x30 - 0x38
   CUtlString m_sMorphChannelName; // 0x38 - 0x40
   float32 m_flRemap[4]; // 0x40 - 0x50
   unsigned char pad_50[0x10]; // 0x50 - 0x60
}; // size - 0x60


class CBoneConstraintPoseSpaceBone /* "modellib" */ : public CBaseConstraint /* "modellib" */
{
public:
   class Input_t /* "modellib" */
   {
   public:
      Vector m_inputValue; // 0x0 - 0xC
      unsigned char pad_C[0x4]; // 0xC - 0x10
      CUtlVector< CTransform > m_outputTransformList; // 0x10 - 0x28
   }; // size - 0x28

   CUtlVector< CBoneConstraintPoseSpaceBone::Input_t > m_inputList; // 0x70 - 0x88
   unsigned char pad_88[0x10]; // 0x88 - 0x98
}; // size - 0x98



class CBoneConstraintPoseSpaceMorph /* "modellib" */ : public CBoneConstraintBase /* "modellib" */
{
public:
   class Input_t /* "modellib" */
   {
   public:
      Vector m_inputValue; // 0x0 - 0xC
      unsigned char pad_C[0x4]; // 0xC - 0x10
      CUtlVector< float32 > m_outputWeightList; // 0x10 - 0x28
   }; // size - 0x28

   CUtlString m_sBoneName; // 0x28 - 0x30
   CUtlString m_sAttachmentName; // 0x30 - 0x38
   CUtlVector< CUtlString > m_outputMorph; // 0x38 - 0x50
   CUtlVector< CBoneConstraintPoseSpaceMorph::Input_t > m_inputList; // 0x50 - 0x68
   bool m_bClamp; // 0x68 - 0x69
   unsigned char pad_69[0x3F]; // 0x69 - 0xA8
}; // size - 0xA8



class CBoneMaskUpdateNode /* "animgraphlib" */ : public CBinaryUpdateNode /* "animgraphlib" */
{
public:
   unsigned char pad_88[0x4]; // 0x88 - 0x8C
   int32_t m_nWeightListIndex; // 0x8C - 0x90
   float m_flRootMotionBlend; // 0x90 - 0x94
   BoneMaskBlendSpace m_blendSpace; // 0x94 - 0x98
   BinaryNodeChildOption m_footMotionTiming; // 0x98 - 0x9C
   bool m_bUseBlendScale; // 0x9C - 0x9D
   unsigned char pad_9D[0x3]; // 0x9D - 0xA0
   AnimValueSource m_blendValueSource; // 0xA0 - 0xA4
   CAnimParamHandle m_hBlendParameter; // 0xA4 - 0xA6
   unsigned char pad_A6[0x2]; // 0xA6 - 0xA8
}; // size - 0xA8


class CBonePositionMetricEvaluator /* "animgraphlib" */ : public CMotionMetricEvaluator /* "animgraphlib" */
{
public:
   int32_t m_nBoneIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
}; // size - 0x58


class CBoneVelocityMetricEvaluator /* "animgraphlib" */ : public CMotionMetricEvaluator /* "animgraphlib" */
{
public:
   int32_t m_nBoneIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
}; // size - 0x58


class CBoolAnimParameter /* "animgraphlib" */ : public CConcreteAnimParameter /* "animgraphlib" */
{
public:
   bool m_bDefaultValue; // 0x60 - 0x61
   unsigned char pad_61[0x7]; // 0x61 - 0x68
}; // size - 0x68


class CBreachCharge /* "server" */ : public CCSWeaponBase /* "server" */
{
public:
   unsigned char pad_0[0xDD8]; // 0x0 - 0xDD8
}; // size - 0xDD8


class CBreachCharge /* "client" */ : public C_CSWeaponBase /* "client" */
{
public:
   unsigned char pad_0[0x1940]; // 0x0 - 0x1940
}; // size - 0x1940


class CBreachChargeProjectile /* "client" */ : public C_BaseGrenade /* "client" */
{
public:
   unsigned char pad_0[0x1068]; // 0x0 - 0x1068
}; // size - 0x1068


class CBreachChargeProjectile /* "server" */ : public CBaseGrenade /* "server" */
{
public:
   unsigned char pad_0[0x9C8]; // 0x0 - 0x9C8
}; // size - 0x9C8


class CBreakableStageHelper /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   int32_t m_nCurrentStage; // 0x8 - 0xC
   int32_t m_nStageCount; // 0xC - 0x10
   unsigned char pad_10[0x8]; // 0x10 - 0x18
}; // size - 0x18


class CBtActionAim /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_58[0x10]; // 0x58 - 0x68
   CUtlString m_szSensorInputKey; // 0x68 - 0x70
   unsigned char pad_70[0x10]; // 0x70 - 0x80
   CUtlString m_szAimReadyKey; // 0x80 - 0x88
   float m_flZoomCooldownTimestamp; // 0x88 - 0x8C
   bool m_bDoneAiming; // 0x8C - 0x8D
   unsigned char pad_8D[0x3]; // 0x8D - 0x90
   float m_flLerpStartTime; // 0x90 - 0x94
   float m_flNextLookTargetLerpTime; // 0x94 - 0x98
   float m_flPenaltyReductionRatio; // 0x98 - 0x9C
   QAngle m_NextLookTarget; // 0x9C - 0xA8
   CountdownTimer m_AimTimer; // 0xA8 - 0xC0
   CountdownTimer m_SniperHoldTimer; // 0xC0 - 0xD8
   CountdownTimer m_FocusIntervalTimer; // 0xD8 - 0xF0
   bool m_bAcquired; // 0xF0 - 0xF1
   unsigned char pad_F1[0x7]; // 0xF1 - 0xF8
}; // size - 0xF8


class CBtActionCombatPositioning /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_58[0x10]; // 0x58 - 0x68
   CUtlString m_szSensorInputKey; // 0x68 - 0x70
   unsigned char pad_70[0x10]; // 0x70 - 0x80
   CUtlString m_szIsAttackingKey; // 0x80 - 0x88
   CountdownTimer m_ActionTimer; // 0x88 - 0xA0
   bool m_bCrouching; // 0xA0 - 0xA1
   unsigned char pad_A1[0xF]; // 0xA1 - 0xB0
}; // size - 0xB0


class CBtActionMoveTo /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_58[0x8]; // 0x58 - 0x60
   CUtlString m_szDestinationInputKey; // 0x60 - 0x68
   CUtlString m_szHidingSpotInputKey; // 0x68 - 0x70
   CUtlString m_szThreatInputKey; // 0x70 - 0x78
   Vector m_vecDestination; // 0x78 - 0x84
   bool m_bAutoLookAdjust; // 0x84 - 0x85
   bool m_bComputePath; // 0x85 - 0x86
   unsigned char pad_86[0x2]; // 0x86 - 0x88
   float m_flDamagingAreasPenaltyCost; // 0x88 - 0x8C
   unsigned char pad_8C[0x4]; // 0x8C - 0x90
   CountdownTimer m_CheckApproximateCornersTimer; // 0x90 - 0xA8
   CountdownTimer m_CheckHighPriorityItem; // 0xA8 - 0xC0
   CountdownTimer m_RepathTimer; // 0xC0 - 0xD8
   float m_flArrivalEpsilon; // 0xD8 - 0xDC
   float m_flAdditionalArrivalEpsilon2D; // 0xDC - 0xE0
   float m_flHidingSpotCheckDistanceThreshold; // 0xE0 - 0xE4
   float m_flNearestAreaDistanceThreshold; // 0xE4 - 0xE8
}; // size - 0xE8


class CBtActionParachutePositioning /* "server" */ : public CBtNode /* "server" */
{
public:
   CountdownTimer m_ActionTimer; // 0x58 - 0x70
   unsigned char pad_70[0x8]; // 0x70 - 0x78
}; // size - 0x78


class CBtNodeComposite /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_0[0x58]; // 0x0 - 0x58
}; // size - 0x58


class CBtNodeConditionInactive /* "server" */ : public CBtNodeCondition /* "server" */
{
public:
   unsigned char pad_60[0x18]; // 0x60 - 0x78
   float m_flRoundStartThresholdSeconds; // 0x78 - 0x7C
   float m_flSensorInactivityThresholdSeconds; // 0x7C - 0x80
   CountdownTimer m_SensorInactivityTimer; // 0x80 - 0x98
}; // size - 0x98


class CBubbling /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   int32_t m_density; // 0x700 - 0x704
   int32_t m_frequency; // 0x704 - 0x708
   int32_t m_state; // 0x708 - 0x70C
   unsigned char pad_70C[0x4]; // 0x70C - 0x710
}; // size - 0x710


class CBumpMine /* "client" */ : public C_CSWeaponBase /* "client" */
{
public:
   unsigned char pad_0[0x1940]; // 0x0 - 0x1940
}; // size - 0x1940


class CBumpMine /* "server" */ : public CCSWeaponBase /* "server" */
{
public:
   unsigned char pad_0[0xDD8]; // 0x0 - 0xDD8
}; // size - 0xDD8


class CBumpMineProjectile /* "client" */ : public C_BaseGrenade /* "client" */
{
public:
   unsigned char pad_0[0x1068]; // 0x0 - 0x1068
}; // size - 0x1068


class CBumpMineProjectile /* "server" */ : public CBaseGrenade /* "server" */
{
public:
   unsigned char pad_0[0x9C8]; // 0x0 - 0x9C8
}; // size - 0x9C8


class CBuoyancyHelper /* "server" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   float m_flFluidDensity; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
}; // size - 0x20


class CBuoyancyHelper /* "client" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   float m_flFluidDensity; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
}; // size - 0x20


class CBuyZone /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   int32_t m_LegacyTeamNum; // 0x8A8 - 0x8AC
   unsigned char pad_8AC[0x4]; // 0x8AC - 0x8B0
}; // size - 0x8B0


class CC4 /* "server" */ : public CCSWeaponBase /* "server" */
{
public:
   Vector m_vecLastValidPlayerHeldPosition; // 0xDD8 - 0xDE4
   Vector m_vecLastValidDroppedPosition; // 0xDE4 - 0xDF0
   bool m_bDoValidDroppedPositionCheck; // 0xDF0 - 0xDF1
   bool m_bStartedArming; // 0xDF1 - 0xDF2
   unsigned char pad_DF2[0x2]; // 0xDF2 - 0xDF4
   GameTime_t m_fArmedTime; // 0xDF4 - 0xDF8
   bool m_bBombPlacedAnimation; // 0xDF8 - 0xDF9
   bool m_bIsPlantingViaUse; // 0xDF9 - 0xDFA
   unsigned char pad_DFA[0x6]; // 0xDFA - 0xE00
   EntitySpottedState_t m_entitySpottedState; // 0xE00 - 0xE18
   int32_t m_nSpotRules; // 0xE18 - 0xE1C
   bool m_bPlayedArmingBeeps[7]; // 0xE1C - 0xE23
   bool m_bBombPlanted; // 0xE23 - 0xE24
   bool m_bDroppedFromDeath; // 0xE24 - 0xE25
   unsigned char pad_E25[0x3]; // 0xE25 - 0xE28
}; // size - 0xE28


class CCPPScriptComponentUpdater /* "animgraphlib" */ : public CAnimComponentUpdater /* "animgraphlib" */
{
public:
   CUtlVector< CGlobalSymbol > m_scriptsToRun; // 0x30 - 0x48
   unsigned char pad_48[0x18]; // 0x48 - 0x60
}; // size - 0x60


class CCSBot /* "server" */ : public CBot /* "server" */
{
public:
   CHandle< SpawnPointCoopEnemy > m_lastCoopSpawnPoint; // 0xD8 - 0xDC
   unsigned char pad_DC[0xC]; // 0xDC - 0xE8
   Vector m_eyePosition; // 0xE8 - 0xF4
   char m_name[64]; // 0xF4 - 0x134
   float m_combatRange; // 0x134 - 0x138
   bool m_isRogue; // 0x138 - 0x139
   unsigned char pad_139[0x7]; // 0x139 - 0x140
   CountdownTimer m_rogueTimer; // 0x140 - 0x158
   unsigned char pad_158[0x4]; // 0x158 - 0x15C
   bool m_diedLastRound; // 0x15C - 0x15D
   unsigned char pad_15D[0x3]; // 0x15D - 0x160
   float m_safeTime; // 0x160 - 0x164
   bool m_wasSafe; // 0x164 - 0x165
   unsigned char pad_165[0x7]; // 0x165 - 0x16C
   bool m_blindFire; // 0x16C - 0x16D
   unsigned char pad_16D[0x3]; // 0x16D - 0x170
   CountdownTimer m_surpriseTimer; // 0x170 - 0x188
   bool m_bAllowActive; // 0x188 - 0x189
   bool m_isFollowing; // 0x189 - 0x18A
   unsigned char pad_18A[0x2]; // 0x18A - 0x18C
   CHandle< CCSPlayerPawn > m_leader; // 0x18C - 0x190
   float m_followTimestamp; // 0x190 - 0x194
   float m_allowAutoFollowTime; // 0x194 - 0x198
   CountdownTimer m_hurryTimer; // 0x198 - 0x1B0
   CountdownTimer m_alertTimer; // 0x1B0 - 0x1C8
   CountdownTimer m_sneakTimer; // 0x1C8 - 0x1E0
   CountdownTimer m_panicTimer; // 0x1E0 - 0x1F8
   unsigned char pad_1F8[0x2B8]; // 0x1F8 - 0x4B0
   float m_stateTimestamp; // 0x4B0 - 0x4B4
   bool m_isAttacking; // 0x4B4 - 0x4B5
   bool m_isOpeningDoor; // 0x4B5 - 0x4B6
   unsigned char pad_4B6[0x6]; // 0x4B6 - 0x4BC
   CHandle< CBaseEntity > m_taskEntity; // 0x4BC - 0x4C0
   unsigned char pad_4C0[0xC]; // 0x4C0 - 0x4CC
   Vector m_goalPosition; // 0x4CC - 0x4D8
   CHandle< CBaseEntity > m_goalEntity; // 0x4D8 - 0x4DC
   CHandle< CBaseEntity > m_avoid; // 0x4DC - 0x4E0
   float m_avoidTimestamp; // 0x4E0 - 0x4E4
   bool m_isStopping; // 0x4E4 - 0x4E5
   bool m_hasVisitedEnemySpawn; // 0x4E5 - 0x4E6
   unsigned char pad_4E6[0x2]; // 0x4E6 - 0x4E8
   IntervalTimer m_stillTimer; // 0x4E8 - 0x4F8
   bool m_bEyeAnglesUnderPathFinderControl; // 0x4F8 - 0x4F9
   unsigned char pad_4F9[0x60F7]; // 0x4F9 - 0x65F0
   int32_t m_pathIndex; // 0x65F0 - 0x65F4
   GameTime_t m_areaEnteredTimestamp; // 0x65F4 - 0x65F8
   CountdownTimer m_repathTimer; // 0x65F8 - 0x6610
   CountdownTimer m_avoidFriendTimer; // 0x6610 - 0x6628
   bool m_isFriendInTheWay; // 0x6628 - 0x6629
   unsigned char pad_6629[0x7]; // 0x6629 - 0x6630
   CountdownTimer m_politeTimer; // 0x6630 - 0x6648
   bool m_isWaitingBehindFriend; // 0x6648 - 0x6649
   unsigned char pad_6649[0x2B]; // 0x6649 - 0x6674
   float m_pathLadderEnd; // 0x6674 - 0x6678
   unsigned char pad_6678[0x48]; // 0x6678 - 0x66C0
   CountdownTimer m_mustRunTimer; // 0x66C0 - 0x66D8
   CountdownTimer m_waitTimer; // 0x66D8 - 0x66F0
   CountdownTimer m_updateTravelDistanceTimer; // 0x66F0 - 0x6708
   float32 m_playerTravelDistance[64]; // 0x6708 - 0x6808
   uint8_t m_travelDistancePhase; // 0x6808 - 0x6809
   unsigned char pad_6809[0x197]; // 0x6809 - 0x69A0
   uint8_t m_hostageEscortCount; // 0x69A0 - 0x69A1
   unsigned char pad_69A1[0x3]; // 0x69A1 - 0x69A4
   float m_hostageEscortCountTimestamp; // 0x69A4 - 0x69A8
   int32_t m_desiredTeam; // 0x69A8 - 0x69AC
   bool m_hasJoined; // 0x69AC - 0x69AD
   bool m_isWaitingForHostage; // 0x69AD - 0x69AE
   unsigned char pad_69AE[0x2]; // 0x69AE - 0x69B0
   CountdownTimer m_inhibitWaitingForHostageTimer; // 0x69B0 - 0x69C8
   CountdownTimer m_waitForHostageTimer; // 0x69C8 - 0x69E0
   Vector m_noisePosition; // 0x69E0 - 0x69EC
   float m_noiseTravelDistance; // 0x69EC - 0x69F0
   float m_noiseTimestamp; // 0x69F0 - 0x69F4
   unsigned char pad_69F4[0x4]; // 0x69F4 - 0x69F8
   CCSPlayerPawn* m_noiseSource; // 0x69F8 - 0x6A00
   unsigned char pad_6A00[0x10]; // 0x6A00 - 0x6A10
   CountdownTimer m_noiseBendTimer; // 0x6A10 - 0x6A28
   Vector m_bentNoisePosition; // 0x6A28 - 0x6A34
   bool m_bendNoisePositionValid; // 0x6A34 - 0x6A35
   unsigned char pad_6A35[0x3]; // 0x6A35 - 0x6A38
   float m_lookAroundStateTimestamp; // 0x6A38 - 0x6A3C
   float m_lookAheadAngle; // 0x6A3C - 0x6A40
   float m_forwardAngle; // 0x6A40 - 0x6A44
   float m_inhibitLookAroundTimestamp; // 0x6A44 - 0x6A48
   unsigned char pad_6A48[0x4]; // 0x6A48 - 0x6A4C
   Vector m_lookAtSpot; // 0x6A4C - 0x6A58
   unsigned char pad_6A58[0x4]; // 0x6A58 - 0x6A5C
   float m_lookAtSpotDuration; // 0x6A5C - 0x6A60
   float m_lookAtSpotTimestamp; // 0x6A60 - 0x6A64
   float m_lookAtSpotAngleTolerance; // 0x6A64 - 0x6A68
   bool m_lookAtSpotClearIfClose; // 0x6A68 - 0x6A69
   bool m_lookAtSpotAttack; // 0x6A69 - 0x6A6A
   unsigned char pad_6A6A[0x6]; // 0x6A6A - 0x6A70
   char* m_lookAtDesc; // 0x6A70 - 0x6A78
   float m_peripheralTimestamp; // 0x6A78 - 0x6A7C
   unsigned char pad_6A7C[0x184]; // 0x6A7C - 0x6C00
   uint8_t m_approachPointCount; // 0x6C00 - 0x6C01
   unsigned char pad_6C01[0x3]; // 0x6C01 - 0x6C04
   Vector m_approachPointViewPosition; // 0x6C04 - 0x6C10
   IntervalTimer m_viewSteadyTimer; // 0x6C10 - 0x6C20
   unsigned char pad_6C20[0x8]; // 0x6C20 - 0x6C28
   CountdownTimer m_tossGrenadeTimer; // 0x6C28 - 0x6C40
   unsigned char pad_6C40[0x8]; // 0x6C40 - 0x6C48
   CountdownTimer m_isAvoidingGrenade; // 0x6C48 - 0x6C60
   unsigned char pad_6C60[0x8]; // 0x6C60 - 0x6C68
   float m_spotCheckTimestamp; // 0x6C68 - 0x6C6C
   unsigned char pad_6C6C[0x404]; // 0x6C6C - 0x7070
   int32_t m_checkedHidingSpotCount; // 0x7070 - 0x7074
   float m_lookPitch; // 0x7074 - 0x7078
   float m_lookPitchVel; // 0x7078 - 0x707C
   float m_lookYaw; // 0x707C - 0x7080
   float m_lookYawVel; // 0x7080 - 0x7084
   Vector m_targetSpot; // 0x7084 - 0x7090
   Vector m_targetSpotVelocity; // 0x7090 - 0x709C
   Vector m_targetSpotPredicted; // 0x709C - 0x70A8
   QAngle m_aimError; // 0x70A8 - 0x70B4
   QAngle m_aimGoal; // 0x70B4 - 0x70C0
   GameTime_t m_targetSpotTime; // 0x70C0 - 0x70C4
   float m_aimFocus; // 0x70C4 - 0x70C8
   float m_aimFocusInterval; // 0x70C8 - 0x70CC
   GameTime_t m_aimFocusNextUpdate; // 0x70CC - 0x70D0
   unsigned char pad_70D0[0x8]; // 0x70D0 - 0x70D8
   CountdownTimer m_ignoreEnemiesTimer; // 0x70D8 - 0x70F0
   CHandle< CCSPlayerPawn > m_enemy; // 0x70F0 - 0x70F4
   bool m_isEnemyVisible; // 0x70F4 - 0x70F5
   uint8_t m_visibleEnemyParts; // 0x70F5 - 0x70F6
   unsigned char pad_70F6[0x2]; // 0x70F6 - 0x70F8
   Vector m_lastEnemyPosition; // 0x70F8 - 0x7104
   float m_lastSawEnemyTimestamp; // 0x7104 - 0x7108
   float m_firstSawEnemyTimestamp; // 0x7108 - 0x710C
   float m_currentEnemyAcquireTimestamp; // 0x710C - 0x7110
   float m_enemyDeathTimestamp; // 0x7110 - 0x7114
   float m_friendDeathTimestamp; // 0x7114 - 0x7118
   bool m_isLastEnemyDead; // 0x7118 - 0x7119
   unsigned char pad_7119[0x3]; // 0x7119 - 0x711C
   int32_t m_nearbyEnemyCount; // 0x711C - 0x7120
   unsigned char pad_7120[0x208]; // 0x7120 - 0x7328
   CHandle< CCSPlayerPawn > m_bomber; // 0x7328 - 0x732C
   int32_t m_nearbyFriendCount; // 0x732C - 0x7330
   CHandle< CCSPlayerPawn > m_closestVisibleFriend; // 0x7330 - 0x7334
   CHandle< CCSPlayerPawn > m_closestVisibleHumanFriend; // 0x7334 - 0x7338
   IntervalTimer m_attentionInterval; // 0x7338 - 0x7348
   CHandle< CCSPlayerPawn > m_attacker; // 0x7348 - 0x734C
   float m_attackedTimestamp; // 0x734C - 0x7350
   IntervalTimer m_burnedByFlamesTimer; // 0x7350 - 0x7360
   int32_t m_lastVictimID; // 0x7360 - 0x7364
   bool m_isAimingAtEnemy; // 0x7364 - 0x7365
   bool m_isRapidFiring; // 0x7365 - 0x7366
   unsigned char pad_7366[0x2]; // 0x7366 - 0x7368
   IntervalTimer m_equipTimer; // 0x7368 - 0x7378
   CountdownTimer m_zoomTimer; // 0x7378 - 0x7390
   GameTime_t m_fireWeaponTimestamp; // 0x7390 - 0x7394
   unsigned char pad_7394[0x4]; // 0x7394 - 0x7398
   CountdownTimer m_lookForWeaponsOnGroundTimer; // 0x7398 - 0x73B0
   bool m_bIsSleeping; // 0x73B0 - 0x73B1
   bool m_isEnemySniperVisible; // 0x73B1 - 0x73B2
   unsigned char pad_73B2[0x6]; // 0x73B2 - 0x73B8
   CountdownTimer m_sawEnemySniperTimer; // 0x73B8 - 0x73D0
   unsigned char pad_73D0[0xA0]; // 0x73D0 - 0x7470
   uint8_t m_enemyQueueIndex; // 0x7470 - 0x7471
   uint8_t m_enemyQueueCount; // 0x7471 - 0x7472
   uint8_t m_enemyQueueAttendIndex; // 0x7472 - 0x7473
   bool m_isStuck; // 0x7473 - 0x7474
   GameTime_t m_stuckTimestamp; // 0x7474 - 0x7478
   Vector m_stuckSpot; // 0x7478 - 0x7484
   unsigned char pad_7484[0x4]; // 0x7484 - 0x7488
   CountdownTimer m_wiggleTimer; // 0x7488 - 0x74A0
   CountdownTimer m_stuckJumpTimer; // 0x74A0 - 0x74B8
   GameTime_t m_nextCleanupCheckTimestamp; // 0x74B8 - 0x74BC
   float32 m_avgVel[10]; // 0x74BC - 0x74E4
   int32_t m_avgVelIndex; // 0x74E4 - 0x74E8
   int32_t m_avgVelCount; // 0x74E8 - 0x74EC
   Vector m_lastOrigin; // 0x74EC - 0x74F8
   unsigned char pad_74F8[0x4]; // 0x74F8 - 0x74FC
   float m_lastRadioRecievedTimestamp; // 0x74FC - 0x7500
   float m_lastRadioSentTimestamp; // 0x7500 - 0x7504
   CHandle< CCSPlayerPawn > m_radioSubject; // 0x7504 - 0x7508
   Vector m_radioPosition; // 0x7508 - 0x7514
   float m_voiceEndTimestamp; // 0x7514 - 0x7518
   unsigned char pad_7518[0x8]; // 0x7518 - 0x7520
   int32_t m_lastValidReactionQueueFrame; // 0x7520 - 0x7524
   unsigned char pad_7524[0x4]; // 0x7524 - 0x7528
}; // size - 0x7528


class CCSGOPlayerAnimGraphState /* "server" */
{
public:
   unsigned char pad_0[0x538]; // 0x0 - 0x538
}; // size - 0x538


class CCSGOViewModel /* "server" */ : public CPredictedViewModel /* "server" */
{
public:
   bool m_bShouldIgnoreOffsetAndAccuracy; // 0x8D8 - 0x8D9
   unsigned char pad_8D9[0x3]; // 0x8D9 - 0x8DC
   uint32_t m_nWeaponParity; // 0x8DC - 0x8E0
   uint32_t m_nOldWeaponParity; // 0x8E0 - 0x8E4
   unsigned char pad_8E4[0x4]; // 0x8E4 - 0x8E8
}; // size - 0x8E8


class CCSGO_TeamIntroCounterTerroristPosition /* "server" */ : public CCSGO_TeamIntroCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC38]; // 0x0 - 0xC38
}; // size - 0xC38


class CCSGO_TeamIntroTerroristPosition /* "server" */ : public CCSGO_TeamIntroCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC38]; // 0x0 - 0xC38
}; // size - 0xC38


class CCSGO_TeamSelectCounterTerroristPosition /* "server" */ : public CCSGO_TeamSelectCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC38]; // 0x0 - 0xC38
}; // size - 0xC38


class CCSGO_TeamSelectTerroristPosition /* "server" */ : public CCSGO_TeamSelectCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC38]; // 0x0 - 0xC38
}; // size - 0xC38


class CCSGO_WingmanIntroCounterTerroristPosition /* "server" */ : public CCSGO_WingmanIntroCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC38]; // 0x0 - 0xC38
}; // size - 0xC38


class CCSGO_WingmanIntroCounterTerroristPosition /* "client" */ : public CCSGO_WingmanIntroCharacterPosition /* "client" */
{
public:
   unsigned char pad_0[0x1270]; // 0x0 - 0x1270
}; // size - 0x1270


class CCSGO_WingmanIntroTerroristPosition /* "client" */ : public CCSGO_WingmanIntroCharacterPosition /* "client" */
{
public:
   unsigned char pad_0[0x1270]; // 0x0 - 0x1270
}; // size - 0x1270


class CCSGO_WingmanIntroTerroristPosition /* "server" */ : public CCSGO_WingmanIntroCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC38]; // 0x0 - 0xC38
}; // size - 0xC38


class CCSGameModeRules_Deathmatch /* "client" */ : public CCSGameModeRules /* "client" */
{
public:
   bool m_bFirstThink; // 0x30 - 0x31
   bool m_bFirstThinkAfterConnected; // 0x31 - 0x32
   unsigned char pad_32[0x2]; // 0x32 - 0x34
   GameTime_t m_flDMBonusStartTime; // 0x34 - 0x38
   float m_flDMBonusTimeLength; // 0x38 - 0x3C
   int16_t m_nDMBonusWeaponLoadoutSlot; // 0x3C - 0x3E
   unsigned char pad_3E[0x2]; // 0x3E - 0x40
}; // size - 0x40


class CCSGameModeRules_Deathmatch /* "server" */ : public CCSGameModeRules /* "server" */
{
public:
   bool m_bFirstThink; // 0x30 - 0x31
   bool m_bFirstThinkAfterConnected; // 0x31 - 0x32
   unsigned char pad_32[0x2]; // 0x32 - 0x34
   GameTime_t m_flDMBonusStartTime; // 0x34 - 0x38
   float m_flDMBonusTimeLength; // 0x38 - 0x3C
   int16_t m_nDMBonusWeaponLoadoutSlot; // 0x3C - 0x3E
   unsigned char pad_3E[0x2]; // 0x3E - 0x40
}; // size - 0x40


class CCSGameModeRules_Noop /* "client" */ : public CCSGameModeRules /* "client" */
{
public:
   unsigned char pad_0[0x30]; // 0x0 - 0x30
}; // size - 0x30


class CCSGameModeRules_Noop /* "server" */ : public CCSGameModeRules /* "server" */
{
public:
   unsigned char pad_0[0x30]; // 0x0 - 0x30
}; // size - 0x30


class CCSGameModeRules_Scripted /* "server" */ : public CCSGameModeRules /* "server" */
{
public:
   unsigned char pad_0[0x30]; // 0x0 - 0x30
}; // size - 0x30


class CCSGameModeRules_Scripted /* "client" */ : public CCSGameModeRules /* "client" */
{
public:
   unsigned char pad_0[0x30]; // 0x0 - 0x30
}; // size - 0x30


class CCSGameModeScript /* "server" */ : public CBasePulseGraphInstance /* "server" */
{
public:
   unsigned char pad_0[0xD0]; // 0x0 - 0xD0
}; // size - 0xD0


class CCSGameModeScript /* "client" */ : public CBasePulseGraphInstance /* "client" */
{
public:
   unsigned char pad_0[0xD0]; // 0x0 - 0xD0
}; // size - 0xD0


class CCSGameRules /* "server" */ : public CTeamplayRules /* "server" */
{
public:
   unsigned char pad_90[0x8]; // 0x90 - 0x98
   CNetworkVarChainer __m_pChainEntity; // 0x98 - 0xC0
   CHandle< CBaseEntity > m_coopMissionManager; // 0xC0 - 0xC4
   bool m_bFreezePeriod; // 0xC4 - 0xC5
   bool m_bWarmupPeriod; // 0xC5 - 0xC6
   unsigned char pad_C6[0x2]; // 0xC6 - 0xC8
   GameTime_t m_fWarmupPeriodEnd; // 0xC8 - 0xCC
   GameTime_t m_fWarmupPeriodStart; // 0xCC - 0xD0
   int32_t m_nTotalPausedTicks; // 0xD0 - 0xD4
   int32_t m_nPauseStartTick; // 0xD4 - 0xD8
   bool m_bServerPaused; // 0xD8 - 0xD9
   bool m_bGamePaused; // 0xD9 - 0xDA
   bool m_bTerroristTimeOutActive; // 0xDA - 0xDB
   bool m_bCTTimeOutActive; // 0xDB - 0xDC
   float m_flTerroristTimeOutRemaining; // 0xDC - 0xE0
   float m_flCTTimeOutRemaining; // 0xE0 - 0xE4
   int32_t m_nTerroristTimeOuts; // 0xE4 - 0xE8
   int32_t m_nCTTimeOuts; // 0xE8 - 0xEC
   bool m_bTechnicalTimeOut; // 0xEC - 0xED
   bool m_bMatchWaitingForResume; // 0xED - 0xEE
   unsigned char pad_EE[0x2]; // 0xEE - 0xF0
   int32_t m_iRoundTime; // 0xF0 - 0xF4
   float m_fMatchStartTime; // 0xF4 - 0xF8
   GameTime_t m_fRoundStartTime; // 0xF8 - 0xFC
   GameTime_t m_flRestartRoundTime; // 0xFC - 0x100
   bool m_bGameRestart; // 0x100 - 0x101
   unsigned char pad_101[0x3]; // 0x101 - 0x104
   float m_flGameStartTime; // 0x104 - 0x108
   float m_timeUntilNextPhaseStarts; // 0x108 - 0x10C
   int32_t m_gamePhase; // 0x10C - 0x110
   int32_t m_totalRoundsPlayed; // 0x110 - 0x114
   int32_t m_nRoundsPlayedThisPhase; // 0x114 - 0x118
   int32_t m_nOvertimePlaying; // 0x118 - 0x11C
   int32_t m_iHostagesRemaining; // 0x11C - 0x120
   bool m_bAnyHostageReached; // 0x120 - 0x121
   bool m_bMapHasBombTarget; // 0x121 - 0x122
   bool m_bMapHasRescueZone; // 0x122 - 0x123
   bool m_bMapHasBuyZone; // 0x123 - 0x124
   bool m_bIsQueuedMatchmaking; // 0x124 - 0x125
   unsigned char pad_125[0x3]; // 0x125 - 0x128
   int32_t m_nQueuedMatchmakingMode; // 0x128 - 0x12C
   bool m_bIsValveDS; // 0x12C - 0x12D
   bool m_bLogoMap; // 0x12D - 0x12E
   bool m_bPlayAllStepSoundsOnServer; // 0x12E - 0x12F
   unsigned char pad_12F[0x1]; // 0x12F - 0x130
   int32_t m_iSpectatorSlotCount; // 0x130 - 0x134
   int32_t m_MatchDevice; // 0x134 - 0x138
   bool m_bHasMatchStarted; // 0x138 - 0x139
   unsigned char pad_139[0x3]; // 0x139 - 0x13C
   int32_t m_nNextMapInMapgroup; // 0x13C - 0x140
   char m_szTournamentEventName[512]; // 0x140 - 0x340
   char m_szTournamentEventStage[512]; // 0x340 - 0x540
   char m_szMatchStatTxt[512]; // 0x540 - 0x740
   char m_szTournamentPredictionsTxt[512]; // 0x740 - 0x940
   int32_t m_nTournamentPredictionsPct; // 0x940 - 0x944
   GameTime_t m_flCMMItemDropRevealStartTime; // 0x944 - 0x948
   GameTime_t m_flCMMItemDropRevealEndTime; // 0x948 - 0x94C
   bool m_bIsDroppingItems; // 0x94C - 0x94D
   bool m_bIsQuestEligible; // 0x94D - 0x94E
   bool m_bIsHltvActive; // 0x94E - 0x94F
   unsigned char pad_94F[0x1]; // 0x94F - 0x950
   int32_t m_nGuardianModeWaveNumber; // 0x950 - 0x954
   int32_t m_nGuardianModeSpecialKillsRemaining; // 0x954 - 0x958
   int32_t m_nGuardianModeSpecialWeaponNeeded; // 0x958 - 0x95C
   int32_t m_nGuardianGrenadesToGiveBots; // 0x95C - 0x960
   int32_t m_nNumHeaviesToSpawn; // 0x960 - 0x964
   uint32_t m_numGlobalGiftsGiven; // 0x964 - 0x968
   uint32_t m_numGlobalGifters; // 0x968 - 0x96C
   uint32_t m_numGlobalGiftsPeriodSeconds; // 0x96C - 0x970
   uint32 m_arrFeaturedGiftersAccounts[4]; // 0x970 - 0x980
   uint32 m_arrFeaturedGiftersGifts[4]; // 0x980 - 0x990
   uint16 m_arrProhibitedItemIndices[100]; // 0x990 - 0xA58
   uint32 m_arrTournamentActiveCasterAccounts[4]; // 0xA58 - 0xA68
   int32_t m_numBestOfMaps; // 0xA68 - 0xA6C
   int32_t m_nHalloweenMaskListSeed; // 0xA6C - 0xA70
   bool m_bBombDropped; // 0xA70 - 0xA71
   bool m_bBombPlanted; // 0xA71 - 0xA72
   unsigned char pad_A72[0x2]; // 0xA72 - 0xA74
   int32_t m_iRoundWinStatus; // 0xA74 - 0xA78
   int32_t m_eRoundWinReason; // 0xA78 - 0xA7C
   bool m_bTCantBuy; // 0xA7C - 0xA7D
   bool m_bCTCantBuy; // 0xA7D - 0xA7E
   unsigned char pad_A7E[0x2]; // 0xA7E - 0xA80
   GameTime_t m_flGuardianBuyUntilTime; // 0xA80 - 0xA84
   int32 m_iMatchStats_RoundResults[30]; // 0xA84 - 0xAFC
   int32 m_iMatchStats_PlayersAlive_CT[30]; // 0xAFC - 0xB74
   int32 m_iMatchStats_PlayersAlive_T[30]; // 0xB74 - 0xBEC
   float32 m_TeamRespawnWaveTimes[32]; // 0xBEC - 0xC6C
   GameTime_t m_flNextRespawnWave[32]; // 0xC6C - 0xCEC
   int32_t m_nServerQuestID; // 0xCEC - 0xCF0
   Vector m_vMinimapMins; // 0xCF0 - 0xCFC
   Vector m_vMinimapMaxs; // 0xCFC - 0xD08
   float32 m_MinimapVerticalSectionHeights[8]; // 0xD08 - 0xD28
   bool m_bDontIncrementCoopWave; // 0xD28 - 0xD29
   bool m_bSpawnedTerrorHuntHeavy; // 0xD29 - 0xD2A
   unsigned char pad_D2A[0x2]; // 0xD2A - 0xD2C
   int32 m_nEndMatchMapGroupVoteTypes[10]; // 0xD2C - 0xD54
   int32 m_nEndMatchMapGroupVoteOptions[10]; // 0xD54 - 0xD7C
   int32_t m_nEndMatchMapVoteWinner; // 0xD7C - 0xD80
   int32_t m_iNumConsecutiveCTLoses; // 0xD80 - 0xD84
   int32_t m_iNumConsecutiveTerroristLoses; // 0xD84 - 0xD88
   unsigned char pad_D88[0x18]; // 0xD88 - 0xDA0
   bool m_bHasHostageBeenTouched; // 0xDA0 - 0xDA1
   unsigned char pad_DA1[0x3]; // 0xDA1 - 0xDA4
   GameTime_t m_flIntermissionStartTime; // 0xDA4 - 0xDA8
   GameTime_t m_flIntermissionEndTime; // 0xDA8 - 0xDAC
   bool m_bLevelInitialized; // 0xDAC - 0xDAD
   unsigned char pad_DAD[0x3]; // 0xDAD - 0xDB0
   int32_t m_iTotalRoundsPlayed; // 0xDB0 - 0xDB4
   int32_t m_iUnBalancedRounds; // 0xDB4 - 0xDB8
   bool m_endMatchOnRoundReset; // 0xDB8 - 0xDB9
   bool m_endMatchOnThink; // 0xDB9 - 0xDBA
   unsigned char pad_DBA[0x2]; // 0xDBA - 0xDBC
   int32_t m_iFreezeTime; // 0xDBC - 0xDC0
   int32_t m_iNumTerrorist; // 0xDC0 - 0xDC4
   int32_t m_iNumCT; // 0xDC4 - 0xDC8
   int32_t m_iNumSpawnableTerrorist; // 0xDC8 - 0xDCC
   int32_t m_iNumSpawnableCT; // 0xDCC - 0xDD0
   CUtlVector< int32 > m_arrSelectedHostageSpawnIndices; // 0xDD0 - 0xDE8
   bool m_bFirstConnected; // 0xDE8 - 0xDE9
   bool m_bCompleteReset; // 0xDE9 - 0xDEA
   bool m_bPickNewTeamsOnReset; // 0xDEA - 0xDEB
   bool m_bScrambleTeamsOnRestart; // 0xDEB - 0xDEC
   bool m_bSwapTeamsOnRestart; // 0xDEC - 0xDED
   unsigned char pad_DED[0xB]; // 0xDED - 0xDF8
   CUtlVector< int32 > m_nEndMatchTiedVotes; // 0xDF8 - 0xE10
   unsigned char pad_E10[0x4]; // 0xE10 - 0xE14
   bool m_bNeedToAskPlayersForContinueVote; // 0xE14 - 0xE15
   unsigned char pad_E15[0x3]; // 0xE15 - 0xE18
   uint32_t m_numQueuedMatchmakingAccounts; // 0xE18 - 0xE1C
   unsigned char pad_E1C[0x4]; // 0xE1C - 0xE20
   char* m_pQueuedMatchmakingReservationString; // 0xE20 - 0xE28
   uint32_t m_numTotalTournamentDrops; // 0xE28 - 0xE2C
   uint32_t m_numSpectatorsCountMax; // 0xE2C - 0xE30
   uint32_t m_numSpectatorsCountMaxTV; // 0xE30 - 0xE34
   uint32_t m_numSpectatorsCountMaxLnk; // 0xE34 - 0xE38
