m_hActiveWeapon#pragma once

#include "SDK.hpp"

class IHandleEntity /* "entity2" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class CEntityInstance /* "entity2" */ : public IHandleEntity /* "entity2" */
{
public:
   CUtlSymbolLarge m_iszPrivateVScripts; // 0x8 - 0x10
   CEntityIdentity* m_pEntity; // 0x10 - 0x18
   unsigned char pad_18[0x10]; // 0x18 - 0x28
   CScriptComponent* m_CScriptComponent; // 0x28 - 0x30
}; // size - 0x30


class CBaseEntity /* "server" */ : public CEntityInstance /* "server" */
{
public:
   CBodyComponent* m_CBodyComponent; // 0x30 - 0x38
   CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x38 - 0x1D8
   unsigned char pad_1D8[0x40]; // 0x1D8 - 0x218
   CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x218 - 0x230
   int32_t m_iCurrentThinkContext; // 0x230 - 0x234
   GameTick_t m_nLastThinkTick; // 0x234 - 0x238
   unsigned char pad_238[0x8]; // 0x238 - 0x240
   CBitVec< 64 > m_isSteadyState; // 0x240 - 0x248
   float m_lastNetworkChange; // 0x248 - 0x24C
   unsigned char pad_24C[0xC]; // 0x24C - 0x258
   CUtlVector< ResponseContext_t > m_ResponseContexts; // 0x258 - 0x270
   CUtlSymbolLarge m_iszResponseContext; // 0x270 - 0x278
   unsigned char pad_278[0x20]; // 0x278 - 0x298
   int32_t m_iHealth; // 0x298 - 0x29C
   int32_t m_iMaxHealth; // 0x29C - 0x2A0
   uint8_t m_lifeState; // 0x2A0 - 0x2A1
   unsigned char pad_2A1[0x3]; // 0x2A1 - 0x2A4
   float m_flDamageAccumulator; // 0x2A4 - 0x2A8
   bool m_bTakesDamage; // 0x2A8 - 0x2A9
   unsigned char pad_2A9[0x3]; // 0x2A9 - 0x2AC
   TakeDamageFlags_t m_nTakeDamageFlags; // 0x2AC - 0x2B0
   unsigned char pad_2B0[0x1]; // 0x2B0 - 0x2B1
   MoveCollide_t m_MoveCollide; // 0x2B1 - 0x2B2
   MoveType_t m_MoveType; // 0x2B2 - 0x2B3
   uint8_t m_nWaterTouch; // 0x2B3 - 0x2B4
   uint8_t m_nSlimeTouch; // 0x2B4 - 0x2B5
   bool m_bRestoreInHierarchy; // 0x2B5 - 0x2B6
   unsigned char pad_2B6[0x2]; // 0x2B6 - 0x2B8
   CUtlSymbolLarge m_target; // 0x2B8 - 0x2C0
   float m_flMoveDoneTime; // 0x2C0 - 0x2C4
   CHandle< CBaseFilter > m_hDamageFilter; // 0x2C4 - 0x2C8
   CUtlSymbolLarge m_iszDamageFilterName; // 0x2C8 - 0x2D0
   CUtlStringToken m_nSubclassID; // 0x2D0 - 0x2D4
   unsigned char pad_2D4[0xC]; // 0x2D4 - 0x2E0
   float m_flAnimTime; // 0x2E0 - 0x2E4
   float m_flSimulationTime; // 0x2E4 - 0x2E8
   GameTime_t m_flCreateTime; // 0x2E8 - 0x2EC
   bool m_bClientSideRagdoll; // 0x2EC - 0x2ED
   uint8_t m_ubInterpolationFrame; // 0x2ED - 0x2EE
   unsigned char pad_2EE[0x2]; // 0x2EE - 0x2F0
   Vector m_vPrevVPhysicsUpdatePos; // 0x2F0 - 0x2FC
   uint8_t m_iTeamNum; // 0x2FC - 0x2FD
   unsigned char pad_2FD[0x3]; // 0x2FD - 0x300
   CUtlSymbolLarge m_iGlobalname; // 0x300 - 0x308
   int32_t m_iSentToClients; // 0x308 - 0x30C
   float m_flSpeed; // 0x30C - 0x310
   CUtlString m_sUniqueHammerID; // 0x310 - 0x318
   uint32_t m_spawnflags; // 0x318 - 0x31C
   GameTick_t m_nNextThinkTick; // 0x31C - 0x320
   int32_t m_nSimulationTick; // 0x320 - 0x324
   unsigned char pad_324[0x4]; // 0x324 - 0x328
   CEntityIOOutput m_OnKilled; // 0x328 - 0x350
   uint32_t m_fFlags; // 0x350 - 0x354
   Vector m_vecAbsVelocity; // 0x354 - 0x360
   CNetworkVelocityVector m_vecVelocity; // 0x360 - 0x388
   unsigned char pad_388[0x8]; // 0x388 - 0x390
   Vector m_vecBaseVelocity; // 0x390 - 0x39C
   int32_t m_nPushEnumCount; // 0x39C - 0x3A0
   CCollisionProperty* m_pCollision; // 0x3A0 - 0x3A8
   CHandle< CBaseEntity > m_hEffectEntity; // 0x3A8 - 0x3AC
   CHandle< CBaseEntity > m_hOwnerEntity; // 0x3AC - 0x3B0
   uint32_t m_fEffects; // 0x3B0 - 0x3B4
   CHandle< CBaseEntity > m_hGroundEntity; // 0x3B4 - 0x3B8
   float m_flFriction; // 0x3B8 - 0x3BC
   float m_flElasticity; // 0x3BC - 0x3C0
   float m_flGravityScale; // 0x3C0 - 0x3C4
   float m_flTimeScale; // 0x3C4 - 0x3C8
   float m_flWaterLevel; // 0x3C8 - 0x3CC
   bool m_bSimulatedEveryTick; // 0x3CC - 0x3CD
   bool m_bAnimatedEveryTick; // 0x3CD - 0x3CE
   uint8_t m_nMinCPULevel; // 0x3CE - 0x3CF
   uint8_t m_nMaxCPULevel; // 0x3CF - 0x3D0
   uint8_t m_nMinGPULevel; // 0x3D0 - 0x3D1
   uint8_t m_nMaxGPULevel; // 0x3D1 - 0x3D2
   bool m_bDisableLowViolence; // 0x3D2 - 0x3D3
   uint8_t m_nWaterType; // 0x3D3 - 0x3D4
   int32_t m_iEFlags; // 0x3D4 - 0x3D8
   CEntityIOOutput m_OnUser1; // 0x3D8 - 0x400
   CEntityIOOutput m_OnUser2; // 0x400 - 0x428
   CEntityIOOutput m_OnUser3; // 0x428 - 0x450
   CEntityIOOutput m_OnUser4; // 0x450 - 0x478
   int32_t m_iInitialTeamNum; // 0x478 - 0x47C
   GameTime_t m_flNavIgnoreUntilTime; // 0x47C - 0x480
   QAngle m_vecAngVelocity; // 0x480 - 0x48C
   bool m_bNetworkQuantizeOriginAndAngles; // 0x48C - 0x48D
   bool m_bLagCompensate; // 0x48D - 0x48E
   unsigned char pad_48E[0x2]; // 0x48E - 0x490
   float m_flOverriddenFriction; // 0x490 - 0x494
   CHandle< CBaseEntity > m_pBlocker; // 0x494 - 0x498
   float m_flLocalTime; // 0x498 - 0x49C
   float m_flVPhysicsUpdateLocalTime; // 0x49C - 0x4A0
}; // size - 0x4A0


class CEntityInstance /* "entity2" */ : public IHandleEntity /* "entity2" */
{
public:
   CUtlSymbolLarge m_iszPrivateVScripts; // 0x8 - 0x10
   CEntityIdentity* m_pEntity; // 0x10 - 0x18
   unsigned char pad_18[0x10]; // 0x18 - 0x28
   CScriptComponent* m_CScriptComponent; // 0x28 - 0x30
}; // size - 0x30


class CBaseModelEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   CRenderComponent* m_CRenderComponent; // 0x4A0 - 0x4A8
   CHitboxComponent m_CHitboxComponent; // 0x4A8 - 0x4D0
   GameTime_t m_flDissolveStartTime; // 0x4D0 - 0x4D4
   unsigned char pad_4D4[0x4]; // 0x4D4 - 0x4D8
   CEntityIOOutput m_OnIgnite; // 0x4D8 - 0x500
   RenderMode_t m_nRenderMode; // 0x500 - 0x501
   RenderFx_t m_nRenderFX; // 0x501 - 0x502
   bool m_bAllowFadeInView; // 0x502 - 0x503
   Color m_clrRender; // 0x503 - 0x507
   unsigned char pad_507[0x1]; // 0x507 - 0x508
   CUtlVectorEmbeddedNetworkVar< EntityRenderAttribute_t > m_vecRenderAttributes; // 0x508 - 0x558
   CUtlStringToken m_LightGroup; // 0x558 - 0x55C
   bool m_bRenderToCubemaps; // 0x55C - 0x55D
   unsigned char pad_55D[0x3]; // 0x55D - 0x560
   CCollisionProperty m_Collision; // 0x560 - 0x610
   CGlowProperty m_Glow; // 0x610 - 0x668
   float m_flGlowBackfaceMult; // 0x668 - 0x66C
   float m_fadeMinDist; // 0x66C - 0x670
   float m_fadeMaxDist; // 0x670 - 0x674
   float m_flFadeScale; // 0x674 - 0x678
   float m_flShadowStrength; // 0x678 - 0x67C
   uint8_t m_nObjectCulling; // 0x67C - 0x67D
   unsigned char pad_67D[0x3]; // 0x67D - 0x680
   int32_t m_nAddDecal; // 0x680 - 0x684
   Vector m_vDecalPosition; // 0x684 - 0x690
   Vector m_vDecalForwardAxis; // 0x690 - 0x69C
   float m_flDecalHealBloodRate; // 0x69C - 0x6A0
   float m_flDecalHealHeightRate; // 0x6A0 - 0x6A4
   unsigned char pad_6A4[0x4]; // 0x6A4 - 0x6A8
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_ConfigEntitiesToPropagateMaterialDecalsTo; // 0x6A8 - 0x6C0
   CNetworkViewOffsetVector m_vecViewOffset; // 0x6C0 - 0x6E8
   unsigned char pad_6E8[0x8]; // 0x6E8 - 0x6F0
}; // size - 0x6F0


class C_BaseEntity /* "client" */ : public CEntityInstance /* "client" */
{
public:
   CBodyComponent* m_CBodyComponent; // 0x30 - 0x38
   CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x38 - 0x1D8
   unsigned char pad_1D8[0x120]; // 0x1D8 - 0x2F8
   GameTick_t m_nLastThinkTick; // 0x2F8 - 0x2FC
   unsigned char pad_2FC[0x4]; // 0x2FC - 0x300
   CGameSceneNode* m_pGameSceneNode; // 0x300 - 0x308
   CRenderComponent* m_pRenderComponent; // 0x308 - 0x310
   CCollisionProperty* m_pCollision; // 0x310 - 0x318
   int32_t m_iMaxHealth; // 0x318 - 0x31C
   int32_t m_iHealth; // 0x31C - 0x320
   uint8_t m_lifeState; // 0x320 - 0x321
   bool m_bTakesDamage; // 0x321 - 0x322
   unsigned char pad_322[0x2]; // 0x322 - 0x324
   TakeDamageFlags_t m_nTakeDamageFlags; // 0x324 - 0x328
   uint8_t m_ubInterpolationFrame; // 0x328 - 0x329
   unsigned char pad_329[0x3]; // 0x329 - 0x32C
   CHandle< C_BaseEntity > m_hSceneObjectController; // 0x32C - 0x330
   int32_t m_nNoInterpolationTick; // 0x330 - 0x334
   int32_t m_nVisibilityNoInterpolationTick; // 0x334 - 0x338
   float m_flProxyRandomValue; // 0x338 - 0x33C
   int32_t m_iEFlags; // 0x33C - 0x340
   uint8_t m_nWaterType; // 0x340 - 0x341
   bool m_bInterpolateEvenWithNoModel; // 0x341 - 0x342
   bool m_bPredictionEligible; // 0x342 - 0x343
   bool m_bApplyLayerMatchIDToModel; // 0x343 - 0x344
   CUtlStringToken m_tokLayerMatchID; // 0x344 - 0x348
   CUtlStringToken m_nSubclassID; // 0x348 - 0x34C
   unsigned char pad_34C[0xC]; // 0x34C - 0x358
   int32_t m_nSimulationTick; // 0x358 - 0x35C
   int32_t m_iCurrentThinkContext; // 0x35C - 0x360
   CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x360 - 0x378
   float m_flAnimTime; // 0x378 - 0x37C
   float m_flSimulationTime; // 0x37C - 0x380
   uint8_t m_nSceneObjectOverrideFlags; // 0x380 - 0x381
   bool m_bHasSuccessfullyInterpolated; // 0x381 - 0x382
   bool m_bHasAddedVarsToInterpolation; // 0x382 - 0x383
   bool m_bRenderEvenWhenNotSuccessfullyInterpolated; // 0x383 - 0x384
   int32 m_nInterpolationLatchDirtyFlags[2]; // 0x384 - 0x38C
   uint16 m_ListEntry[11]; // 0x38C - 0x3A2
   unsigned char pad_3A2[0x2]; // 0x3A2 - 0x3A4
   GameTime_t m_flCreateTime; // 0x3A4 - 0x3A8
   float m_flSpeed; // 0x3A8 - 0x3AC
   uint16_t m_EntClientFlags; // 0x3AC - 0x3AE
   bool m_bClientSideRagdoll; // 0x3AE - 0x3AF
   uint8_t m_iTeamNum; // 0x3AF - 0x3B0
   uint32_t m_spawnflags; // 0x3B0 - 0x3B4
   GameTick_t m_nNextThinkTick; // 0x3B4 - 0x3B8
   uint32_t m_fFlags; // 0x3B8 - 0x3BC
   Vector m_vecAbsVelocity; // 0x3BC - 0x3C8
   CNetworkVelocityVector m_vecVelocity; // 0x3C8 - 0x3F0
   unsigned char pad_3F0[0x8]; // 0x3F0 - 0x3F8
   Vector m_vecBaseVelocity; // 0x3F8 - 0x404
   CHandle< C_BaseEntity > m_hEffectEntity; // 0x404 - 0x408
   CHandle< C_BaseEntity > m_hOwnerEntity; // 0x408 - 0x40C
   MoveCollide_t m_MoveCollide; // 0x40C - 0x40D
   MoveType_t m_MoveType; // 0x40D - 0x40E
   unsigned char pad_40E[0x2]; // 0x40E - 0x410
   float m_flWaterLevel; // 0x410 - 0x414
   uint32_t m_fEffects; // 0x414 - 0x418
   CHandle< C_BaseEntity > m_hGroundEntity; // 0x418 - 0x41C
   float m_flFriction; // 0x41C - 0x420
   float m_flElasticity; // 0x420 - 0x424
   float m_flGravityScale; // 0x424 - 0x428
   float m_flTimeScale; // 0x428 - 0x42C
   bool m_bSimulatedEveryTick; // 0x42C - 0x42D
   bool m_bAnimatedEveryTick; // 0x42D - 0x42E
   uint8_t m_nMinCPULevel; // 0x42E - 0x42F
   uint8_t m_nMaxCPULevel; // 0x42F - 0x430
   uint8_t m_nMinGPULevel; // 0x430 - 0x431
   uint8_t m_nMaxGPULevel; // 0x431 - 0x432
   unsigned char pad_432[0x2]; // 0x432 - 0x434
   GameTime_t m_flNavIgnoreUntilTime; // 0x434 - 0x438
   uint16_t m_hThink; // 0x438 - 0x43A
   unsigned char pad_43A[0xE]; // 0x43A - 0x448
   uint8_t m_fBBoxVisFlags; // 0x448 - 0x449
   bool m_bPredictable; // 0x449 - 0x44A
   bool m_bRenderWithViewModels; // 0x44A - 0x44B
   unsigned char pad_44B[0x1]; // 0x44B - 0x44C
   CSplitScreenSlot m_nSplitUserPlayerPredictionSlot; // 0x44C - 0x450
   int32_t m_nFirstPredictableCommand; // 0x450 - 0x454
   int32_t m_nLastPredictableCommand; // 0x454 - 0x458
   CHandle< C_BaseEntity > m_hOldMoveParent; // 0x458 - 0x45C
   unsigned char pad_45C[0x4]; // 0x45C - 0x460
   CParticleProperty m_Particles; // 0x460 - 0x488
   CUtlVector< float32 > m_vecPredictedScriptFloats; // 0x488 - 0x4A0
   CUtlVector< int32 > m_vecPredictedScriptFloatIDs; // 0x4A0 - 0x4B8
   unsigned char pad_4B8[0x18]; // 0x4B8 - 0x4D0
   int32_t m_nNextScriptVarRecordID; // 0x4D0 - 0x4D4
   unsigned char pad_4D4[0xC]; // 0x4D4 - 0x4E0
   QAngle m_vecAngVelocity; // 0x4E0 - 0x4EC
   int32_t m_DataChangeEventRef; // 0x4EC - 0x4F0
   CUtlVector< CEntityHandle > m_dependencies; // 0x4F0 - 0x508
   int32_t m_nCreationTick; // 0x508 - 0x50C
   unsigned char pad_50C[0x15]; // 0x50C - 0x521
   bool m_bAnimTimeChanged; // 0x521 - 0x522
   bool m_bSimulationTimeChanged; // 0x522 - 0x523
   unsigned char pad_523[0xD]; // 0x523 - 0x530
   CUtlString m_sUniqueHammerID; // 0x530 - 0x538
}; // size - 0x538


class CParticleFunction /* "particles" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CParticleCollectionFloatInput m_flOpStrength; // 0x8 - 0x148
   ParticleEndcapMode_t m_nOpEndCapState; // 0x148 - 0x14C
   float m_flOpStartFadeInTime; // 0x14C - 0x150
   float m_flOpEndFadeInTime; // 0x150 - 0x154
   float m_flOpStartFadeOutTime; // 0x154 - 0x158
   float m_flOpEndFadeOutTime; // 0x158 - 0x15C
   float m_flOpFadeOscillatePeriod; // 0x15C - 0x160
   bool m_bNormalizeToStopTime; // 0x160 - 0x161
   unsigned char pad_161[0x3]; // 0x161 - 0x164
   float m_flOpTimeOffsetMin; // 0x164 - 0x168
   float m_flOpTimeOffsetMax; // 0x168 - 0x16C
   int32_t m_nOpTimeOffsetSeed; // 0x16C - 0x170
   int32_t m_nOpTimeScaleSeed; // 0x170 - 0x174
   float m_flOpTimeScaleMin; // 0x174 - 0x178
   float m_flOpTimeScaleMax; // 0x178 - 0x17C
   unsigned char pad_17C[0x1]; // 0x17C - 0x17D
   bool m_bDisableOperator; // 0x17D - 0x17E
   unsigned char pad_17E[0x2]; // 0x17E - 0x180
   CUtlString m_Notes; // 0x180 - 0x188
   unsigned char pad_188[0x88]; // 0x188 - 0x210
}; // size - 0x210


class C_BaseModelEntity /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_538[0x50]; // 0x538 - 0x588
   CRenderComponent* m_CRenderComponent; // 0x588 - 0x590
   CHitboxComponent m_CHitboxComponent; // 0x590 - 0x5B8
   unsigned char pad_5B8[0x20]; // 0x5B8 - 0x5D8
   bool m_bInitModelEffects; // 0x5D8 - 0x5D9
   bool m_bIsStaticProp; // 0x5D9 - 0x5DA
   unsigned char pad_5DA[0x2]; // 0x5DA - 0x5DC
   int32_t m_nLastAddDecal; // 0x5DC - 0x5E0
   int32_t m_nDecalsAdded; // 0x5E0 - 0x5E4
   int32_t m_iOldHealth; // 0x5E4 - 0x5E8
   RenderMode_t m_nRenderMode; // 0x5E8 - 0x5E9
   RenderFx_t m_nRenderFX; // 0x5E9 - 0x5EA
   bool m_bAllowFadeInView; // 0x5EA - 0x5EB
   Color m_clrRender; // 0x5EB - 0x5EF
   unsigned char pad_5EF[0x1]; // 0x5EF - 0x5F0
   C_UtlVectorEmbeddedNetworkVar< EntityRenderAttribute_t > m_vecRenderAttributes; // 0x5F0 - 0x640
   unsigned char pad_640[0x18]; // 0x640 - 0x658
   CUtlStringToken m_LightGroup; // 0x658 - 0x65C
   bool m_bRenderToCubemaps; // 0x65C - 0x65D
   unsigned char pad_65D[0x3]; // 0x65D - 0x660
   CCollisionProperty m_Collision; // 0x660 - 0x710
   CGlowProperty m_Glow; // 0x710 - 0x768
   float m_flGlowBackfaceMult; // 0x768 - 0x76C
   float m_fadeMinDist; // 0x76C - 0x770
   float m_fadeMaxDist; // 0x770 - 0x774
   float m_flFadeScale; // 0x774 - 0x778
   float m_flShadowStrength; // 0x778 - 0x77C
   uint8_t m_nObjectCulling; // 0x77C - 0x77D
   unsigned char pad_77D[0x3]; // 0x77D - 0x780
   int32_t m_nAddDecal; // 0x780 - 0x784
   Vector m_vDecalPosition; // 0x784 - 0x790
   Vector m_vDecalForwardAxis; // 0x790 - 0x79C
   float m_flDecalHealBloodRate; // 0x79C - 0x7A0
   float m_flDecalHealHeightRate; // 0x7A0 - 0x7A4
   unsigned char pad_7A4[0x4]; // 0x7A4 - 0x7A8
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_ConfigEntitiesToPropagateMaterialDecalsTo; // 0x7A8 - 0x7C0
   CNetworkViewOffsetVector m_vecViewOffset; // 0x7C0 - 0x7E8
   unsigned char pad_7E8[0x8]; // 0x7E8 - 0x7F0
   CClientAlphaProperty* m_pClientAlphaProperty; // 0x7F0 - 0x7F8
   Color m_ClientOverrideTint; // 0x7F8 - 0x7FC
   bool m_bUseClientOverrideTint; // 0x7FC - 0x7FD
   unsigned char pad_7FD[0x3B]; // 0x7FD - 0x838
}; // size - 0x838


class CBaseAnimGraph /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_6F0[0x10]; // 0x6F0 - 0x700
   PhysicsRagdollPose_t* m_pRagdollPose; // 0x700 - 0x708
   bool m_bClientRagdoll; // 0x708 - 0x709
   unsigned char pad_709[0x3]; // 0x709 - 0x70C
   Vector m_vecForce; // 0x70C - 0x718
   int32_t m_nForceBone; // 0x718 - 0x71C
   bool m_bShouldAnimateDuringGameplayPause; // 0x71C - 0x71D
   bool m_bAnimGraphUpdateEnabled; // 0x71D - 0x71E
   bool m_bInitiallyPopulateInterpHistory; // 0x71E - 0x71F
   unsigned char pad_71F[0x1]; // 0x71F - 0x720
   float m_flMaxSlopeDistance; // 0x720 - 0x724
   Vector m_vLastSlopeCheckPos; // 0x724 - 0x730
   IChoreoServices* m_pChoreoServices; // 0x730 - 0x738
   bool m_bAnimGraphDirty; // 0x738 - 0x739
   unsigned char pad_739[0xE7]; // 0x739 - 0x820
}; // size - 0x820


class CBaseAnimGraph /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_838[0x10]; // 0x838 - 0x848
   PhysicsRagdollPose_t* m_pRagdollPose; // 0x848 - 0x850
   bool m_bClientRagdoll; // 0x850 - 0x851
   unsigned char pad_851[0x3]; // 0x851 - 0x854
   Vector m_vecForce; // 0x854 - 0x860
   int32_t m_nForceBone; // 0x860 - 0x864
   bool m_bShouldAnimateDuringGameplayPause; // 0x864 - 0x865
   bool m_bAnimGraphUpdateEnabled; // 0x865 - 0x866
   bool m_bInitiallyPopulateInterpHistory; // 0x866 - 0x867
   unsigned char pad_867[0x1]; // 0x867 - 0x868
   float m_flMaxSlopeDistance; // 0x868 - 0x86C
   Vector m_vLastSlopeCheckPos; // 0x86C - 0x878
   bool m_bHasAnimatedMaterialAttributes; // 0x878 - 0x879
   unsigned char pad_879[0x7]; // 0x879 - 0x880
   CBaseAnimGraph* m_pClientsideRagdoll; // 0x880 - 0x888
   bool m_builtRagdoll; // 0x888 - 0x889
   unsigned char pad_889[0xF]; // 0x889 - 0x898
   bool m_bSuppressAnimEventSounds; // 0x898 - 0x899
   unsigned char pad_899[0xFF]; // 0x899 - 0x998
}; // size - 0x998


class CParticleFunctionOperator /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   unsigned char pad_0[0x210]; // 0x0 - 0x210
}; // size - 0x210


class C_BaseFlex /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   class Emphasized_Phoneme /* "client" */
   {
   public:
      CUtlString m_sClassName; // 0x0 - 0x8
      unsigned char pad_8[0x10]; // 0x8 - 0x18
      float m_flAmount; // 0x18 - 0x1C
      bool m_bRequired; // 0x1C - 0x1D
      bool m_bBasechecked; // 0x1D - 0x1E
      bool m_bValid; // 0x1E - 0x1F
      unsigned char pad_1F[0x1]; // 0x1F - 0x20
   }; // size - 0x20

   unsigned char pad_998[0x8]; // 0x998 - 0x9A0
   C_NetworkUtlVectorBase< float32 > m_flexWeight; // 0x9A0 - 0x9B8
   bool m_blinktoggle; // 0x9B8 - 0x9B9
   unsigned char pad_9B9[0x7]; // 0x9B9 - 0x9C0
   Vector m_vLookTargetPosition; // 0x9C0 - 0x9CC
   unsigned char pad_9CC[0x64]; // 0x9CC - 0xA30
   int32_t m_nLastFlexUpdateFrameCount; // 0xA30 - 0xA34
   Vector m_CachedViewTarget; // 0xA34 - 0xA40
   uint32_t m_nNextSceneEventId; // 0xA40 - 0xA44
   int32_t m_iBlink; // 0xA44 - 0xA48
   float m_blinktime; // 0xA48 - 0xA4C
   bool m_prevblinktoggle; // 0xA4C - 0xA4D
   unsigned char pad_A4D[0x3]; // 0xA4D - 0xA50
   int32_t m_iJawOpen; // 0xA50 - 0xA54
   float m_flJawOpenAmount; // 0xA54 - 0xA58
   float m_flBlinkAmount; // 0xA58 - 0xA5C
   AttachmentHandle_t m_iMouthAttachment; // 0xA5C - 0xA5D
   AttachmentHandle_t m_iEyeAttachment; // 0xA5D - 0xA5E
   bool m_bResetFlexWeightsOnModelChange; // 0xA5E - 0xA5F
   unsigned char pad_A5F[0x19]; // 0xA5F - 0xA78
   int32_t m_nEyeOcclusionRendererBone; // 0xA78 - 0xA7C
   matrix3x4_t m_mEyeOcclusionRendererCameraToBoneTransform; // 0xA7C - 0xAAC
   Vector m_vEyeOcclusionRendererHalfExtent; // 0xAAC - 0xAB8
   unsigned char pad_AB8[0x10]; // 0xAB8 - 0xAC8
   C_BaseFlex::Emphasized_Phoneme m_PhonemeClasses[3]; // 0xAC8 - 0xB28
}; // size - 0xB28


class CBaseFlex /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   CNetworkUtlVectorBase< float32 > m_flexWeight; // 0x820 - 0x838
   Vector m_vLookTargetPosition; // 0x838 - 0x844
   bool m_blinktoggle; // 0x844 - 0x845
   unsigned char pad_845[0x53]; // 0x845 - 0x898
   GameTime_t m_flAllowResponsesEndTime; // 0x898 - 0x89C
   GameTime_t m_flLastFlexAnimationTime; // 0x89C - 0x8A0
   uint32_t m_nNextSceneEventId; // 0x8A0 - 0x8A4
   bool m_bUpdateLayerPriorities; // 0x8A4 - 0x8A5
   unsigned char pad_8A5[0xB]; // 0x8A5 - 0x8B0
}; // size - 0x8B0


class CServerOnlyEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_0[0x4A0]; // 0x0 - 0x4A0
}; // size - 0x4A0


class C_EconEntity /* "client" */ : public C_BaseFlex /* "client" */
{
public:
   class AttachedModelData_t /* "client" */
   {
   public:
      int32_t m_iModelDisplayFlags; // 0x0 - 0x4
   }; // size - 0x4

   unsigned char pad_B28[0x10]; // 0xB28 - 0xB38
   float m_flFlexDelayTime; // 0xB38 - 0xB3C
   unsigned char pad_B3C[0x4]; // 0xB3C - 0xB40
   float32* m_flFlexDelayedWeight; // 0xB40 - 0xB48
   bool m_bAttributesInitialized; // 0xB48 - 0xB49
   unsigned char pad_B49[0x7]; // 0xB49 - 0xB50
   C_AttributeContainer m_AttributeManager; // 0xB50 - 0xFF8
   uint32_t m_OriginalOwnerXuidLow; // 0xFF8 - 0xFFC
   uint32_t m_OriginalOwnerXuidHigh; // 0xFFC - 0x1000
   int32_t m_nFallbackPaintKit; // 0x1000 - 0x1004
   int32_t m_nFallbackSeed; // 0x1004 - 0x1008
   float m_flFallbackWear; // 0x1008 - 0x100C
   int32_t m_nFallbackStatTrak; // 0x100C - 0x1010
   bool m_bClientside; // 0x1010 - 0x1011
   bool m_bParticleSystemsCreated; // 0x1011 - 0x1012
   unsigned char pad_1012[0x6]; // 0x1012 - 0x1018
   CUtlVector< int32 > m_vecAttachedParticles; // 0x1018 - 0x1030
   CHandle< CBaseAnimGraph > m_hViewmodelAttachment; // 0x1030 - 0x1034
   int32_t m_iOldTeam; // 0x1034 - 0x1038
   bool m_bAttachmentDirty; // 0x1038 - 0x1039
   unsigned char pad_1039[0x3]; // 0x1039 - 0x103C
   int32_t m_nUnloadedModelIndex; // 0x103C - 0x1040
   int32_t m_iNumOwnerValidationRetries; // 0x1040 - 0x1044
   unsigned char pad_1044[0xC]; // 0x1044 - 0x1050
   CHandle< C_BaseEntity > m_hOldProvidee; // 0x1050 - 0x1054
   unsigned char pad_1054[0x4]; // 0x1054 - 0x1058
   CUtlVector< C_EconEntity::AttachedModelData_t > m_vecAttachedModels; // 0x1058 - 0x1070
}; // size - 0x1070


class CEconEntity /* "server" */ : public CBaseFlex /* "server" */
{
public:
   unsigned char pad_8B0[0x10]; // 0x8B0 - 0x8C0
   CAttributeContainer m_AttributeManager; // 0x8C0 - 0xB88
   uint32_t m_OriginalOwnerXuidLow; // 0xB88 - 0xB8C
   uint32_t m_OriginalOwnerXuidHigh; // 0xB8C - 0xB90
   int32_t m_nFallbackPaintKit; // 0xB90 - 0xB94
   int32_t m_nFallbackSeed; // 0xB94 - 0xB98
   float m_flFallbackWear; // 0xB98 - 0xB9C
   int32_t m_nFallbackStatTrak; // 0xB9C - 0xBA0
   CHandle< CBaseEntity > m_hOldProvidee; // 0xBA0 - 0xBA4
   int32_t m_iOldOwnerClass; // 0xBA4 - 0xBA8
}; // size - 0xBA8


class CParticleFunctionInitializer /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   int32_t m_nAssociatedEmitterIndex; // 0x210 - 0x214
   unsigned char pad_214[0xC]; // 0x214 - 0x220
}; // size - 0x220


class CBaseProp /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   bool m_bModelOverrodeBlockLOS; // 0x820 - 0x821
   unsigned char pad_821[0x3]; // 0x821 - 0x824
   int32_t m_iShapeType; // 0x824 - 0x828
   bool m_bConformToCollisionBounds; // 0x828 - 0x829
   unsigned char pad_829[0x3]; // 0x829 - 0x82C
   matrix3x4_t m_mPreferredCatchTransform; // 0x82C - 0x85C
   unsigned char pad_85C[0x4]; // 0x85C - 0x860
}; // size - 0x860


class CBaseToggle /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   TOGGLE_STATE m_toggle_state; // 0x6F0 - 0x6F4
   float m_flMoveDistance; // 0x6F4 - 0x6F8
   float m_flWait; // 0x6F8 - 0x6FC
   float m_flLip; // 0x6FC - 0x700
   bool m_bAlwaysFireBlockedOutputs; // 0x700 - 0x701
   unsigned char pad_701[0x3]; // 0x701 - 0x704
   Vector m_vecPosition1; // 0x704 - 0x710
   Vector m_vecPosition2; // 0x710 - 0x71C
   QAngle m_vecMoveAng; // 0x71C - 0x728
   QAngle m_vecAngle1; // 0x728 - 0x734
   QAngle m_vecAngle2; // 0x734 - 0x740
   float m_flHeight; // 0x740 - 0x744
   CHandle< CBaseEntity > m_hActivator; // 0x744 - 0x748
   Vector m_vecFinalDest; // 0x748 - 0x754
   QAngle m_vecFinalAngle; // 0x754 - 0x760
   int32_t m_movementType; // 0x760 - 0x764
   unsigned char pad_764[0x4]; // 0x764 - 0x768
   CUtlSymbolLarge m_sMaster; // 0x768 - 0x770
}; // size - 0x770


class CBasePlayerWeapon /* "server" */ : public CEconEntity /* "server" */
{
public:
   WeaponState_t m_iState; // 0xBA8 - 0xBAC
   bool m_bRemoveable; // 0xBAC - 0xBAD
   unsigned char pad_BAD[0x3]; // 0xBAD - 0xBB0
   GameTick_t m_nNextPrimaryAttackTick; // 0xBB0 - 0xBB4
   float m_flNextPrimaryAttackTickRatio; // 0xBB4 - 0xBB8
   GameTick_t m_nNextSecondaryAttackTick; // 0xBB8 - 0xBBC
   float m_flNextSecondaryAttackTickRatio; // 0xBBC - 0xBC0
   int32_t m_iClip1; // 0xBC0 - 0xBC4
   int32_t m_iClip2; // 0xBC4 - 0xBC8
   int32 m_pReserveAmmo[2]; // 0xBC8 - 0xBD0
   CEntityIOOutput m_OnPlayerUse; // 0xBD0 - 0xBF8
}; // size - 0xBF8


class C_BasePlayerWeapon /* "client" */ : public C_EconEntity /* "client" */
{
public:
   WeaponState_t m_iState; // 0x1070 - 0x1074
   WeaponState_t m_iOldState; // 0x1074 - 0x1078
   bool m_bRemoveable; // 0x1078 - 0x1079
   unsigned char pad_1079[0x3]; // 0x1079 - 0x107C
   GameTick_t m_nNextPrimaryAttackTick; // 0x107C - 0x1080
   float m_flNextPrimaryAttackTickRatio; // 0x1080 - 0x1084
   GameTick_t m_nNextSecondaryAttackTick; // 0x1084 - 0x1088
   float m_flNextSecondaryAttackTickRatio; // 0x1088 - 0x108C
   int32_t m_iClip1; // 0x108C - 0x1090
   int32_t m_iClip2; // 0x1090 - 0x1094
   int32 m_pReserveAmmo[2]; // 0x1094 - 0x109C
   unsigned char pad_109C[0x4]; // 0x109C - 0x10A0
}; // size - 0x10A0


class CBreakableProp /* "server" */ : public CBaseProp /* "server" */
{
public:
   unsigned char pad_860[0x10]; // 0x860 - 0x870
   CEntityIOOutput m_OnBreak; // 0x870 - 0x898
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0x898 - 0x8C0
   CEntityIOOutput m_OnTakeDamage; // 0x8C0 - 0x8E8
   float m_impactEnergyScale; // 0x8E8 - 0x8EC
   int32_t m_iMinHealthDmg; // 0x8EC - 0x8F0
   QAngle m_preferredCarryAngles; // 0x8F0 - 0x8FC
   float m_flPressureDelay; // 0x8FC - 0x900
   CHandle< CBaseEntity > m_hBreaker; // 0x900 - 0x904
   PerformanceMode_t m_PerformanceMode; // 0x904 - 0x908
   float m_flDmgModBullet; // 0x908 - 0x90C
   float m_flDmgModClub; // 0x90C - 0x910
   float m_flDmgModExplosive; // 0x910 - 0x914
   float m_flDmgModFire; // 0x914 - 0x918
   CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0x918 - 0x920
   CUtlSymbolLarge m_iszBasePropData; // 0x920 - 0x928
   int32_t m_iInteractions; // 0x928 - 0x92C
   GameTime_t m_flPreventDamageBeforeTime; // 0x92C - 0x930
   bool m_bHasBreakPiecesOrCommands; // 0x930 - 0x931
   unsigned char pad_931[0x3]; // 0x931 - 0x934
   float m_explodeDamage; // 0x934 - 0x938
   float m_explodeRadius; // 0x938 - 0x93C
   unsigned char pad_93C[0x4]; // 0x93C - 0x940
   float m_explosionDelay; // 0x940 - 0x944
   unsigned char pad_944[0x4]; // 0x944 - 0x948
   CUtlSymbolLarge m_explosionBuildupSound; // 0x948 - 0x950
   CUtlSymbolLarge m_explosionCustomEffect; // 0x950 - 0x958
   CUtlSymbolLarge m_explosionCustomSound; // 0x958 - 0x960
   CUtlSymbolLarge m_explosionModifier; // 0x960 - 0x968
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x968 - 0x96C
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x96C - 0x970
   bool m_bOriginalBlockLOS; // 0x970 - 0x971
   unsigned char pad_971[0x3]; // 0x971 - 0x974
   float m_flDefaultFadeScale; // 0x974 - 0x978
   CHandle< CBaseEntity > m_hLastAttacker; // 0x978 - 0x97C
   CHandle< CBaseEntity > m_hFlareEnt; // 0x97C - 0x980
   bool m_bUsePuntSound; // 0x980 - 0x981
   unsigned char pad_981[0x7]; // 0x981 - 0x988
   CUtlSymbolLarge m_iszPuntSound; // 0x988 - 0x990
   bool m_noGhostCollision; // 0x990 - 0x991
   unsigned char pad_991[0x7]; // 0x991 - 0x998
}; // size - 0x998


class CPointEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_0[0x4A0]; // 0x0 - 0x4A0
}; // size - 0x4A0


class CLogicalEntity /* "server" */ : public CServerOnlyEntity /* "server" */
{
public:
   unsigned char pad_0[0x4A0]; // 0x0 - 0x4A0
}; // size - 0x4A0


class CWeaponCSBase /* "server" */ : public CBasePlayerWeapon /* "server" */
{
public:
   unsigned char pad_BF8[0x28]; // 0xBF8 - 0xC20
   float m_flFireSequenceStartTime; // 0xC20 - 0xC24
   int32_t m_nFireSequenceStartTimeChange; // 0xC24 - 0xC28
   int32_t m_nFireSequenceStartTimeAck; // 0xC28 - 0xC2C
   bool m_bPlayerFireEventIsPrimary; // 0xC2C - 0xC2D
   unsigned char pad_C2D[0x3]; // 0xC2D - 0xC30
   HSequence m_seqIdle; // 0xC30 - 0xC34
   HSequence m_seqFirePrimary; // 0xC34 - 0xC38
   HSequence m_seqFireSecondary; // 0xC38 - 0xC3C
   unsigned char pad_C3C[0xC]; // 0xC3C - 0xC48
   bool m_bPlayerAmmoStockOnPickup; // 0xC48 - 0xC49
   bool m_bRequireUseToTouch; // 0xC49 - 0xC4A
   unsigned char pad_C4A[0x2]; // 0xC4A - 0xC4C
   GameTime_t m_flLastTimeInAir; // 0xC4C - 0xC50
   GameTime_t m_flLastDeployTime; // 0xC50 - 0xC54
   uint32_t m_nViewModelIndex; // 0xC54 - 0xC58
   bool m_bReloadsWithClips; // 0xC58 - 0xC59
   unsigned char pad_C59[0x3]; // 0xC59 - 0xC5C
   GameTime_t m_flTimeWeaponIdle; // 0xC5C - 0xC60
   bool m_bFireOnEmpty; // 0xC60 - 0xC61
   unsigned char pad_C61[0x7]; // 0xC61 - 0xC68
   CEntityIOOutput m_OnPlayerPickup; // 0xC68 - 0xC90
   CSWeaponMode m_weaponMode; // 0xC90 - 0xC94
   float m_flTurningInaccuracyDelta; // 0xC94 - 0xC98
   Vector m_vecTurningInaccuracyEyeDirLast; // 0xC98 - 0xCA4
   float m_flTurningInaccuracy; // 0xCA4 - 0xCA8
   float m_fAccuracyPenalty; // 0xCA8 - 0xCAC
   GameTime_t m_flLastAccuracyUpdateTime; // 0xCAC - 0xCB0
   float m_fAccuracySmoothedForZoom; // 0xCB0 - 0xCB4
   GameTime_t m_fScopeZoomEndTime; // 0xCB4 - 0xCB8
   int32_t m_iRecoilIndex; // 0xCB8 - 0xCBC
   float m_flRecoilIndex; // 0xCBC - 0xCC0
   bool m_bBurstMode; // 0xCC0 - 0xCC1
   unsigned char pad_CC1[0x3]; // 0xCC1 - 0xCC4
   GameTime_t m_flPostponeFireReadyTime; // 0xCC4 - 0xCC8
   bool m_bInReload; // 0xCC8 - 0xCC9
   bool m_bReloadVisuallyComplete; // 0xCC9 - 0xCCA
   unsigned char pad_CCA[0x2]; // 0xCCA - 0xCCC
   GameTime_t m_flDroppedAtTime; // 0xCCC - 0xCD0
   bool m_bIsHauledBack; // 0xCD0 - 0xCD1
   bool m_bSilencerOn; // 0xCD1 - 0xCD2
   unsigned char pad_CD2[0x2]; // 0xCD2 - 0xCD4
   GameTime_t m_flTimeSilencerSwitchComplete; // 0xCD4 - 0xCD8
   int32_t m_iOriginalTeamNumber; // 0xCD8 - 0xCDC
   float m_flNextAttackRenderTimeOffset; // 0xCDC - 0xCE0
   unsigned char pad_CE0[0x8]; // 0xCE0 - 0xCE8
   bool m_bCanBePickedUp; // 0xCE8 - 0xCE9
   bool m_bUseCanOverrideNextOwnerTouchTime; // 0xCE9 - 0xCEA
   unsigned char pad_CEA[0x2]; // 0xCEA - 0xCEC
   GameTime_t m_nextOwnerTouchTime; // 0xCEC - 0xCF0
   GameTime_t m_nextPrevOwnerTouchTime; // 0xCF0 - 0xCF4
   CHandle< CCSPlayerPawnBase > m_hPrevOwner; // 0xCF4 - 0xCF8
   unsigned char pad_CF8[0x1C]; // 0xCF8 - 0xD14
   bool m_donated; // 0xD14 - 0xD15
   unsigned char pad_D15[0x3]; // 0xD15 - 0xD18
   GameTime_t m_fLastShotTime; // 0xD18 - 0xD1C
   bool m_bWasOwnedByCT; // 0xD1C - 0xD1D
   bool m_bWasOwnedByTerrorist; // 0xD1D - 0xD1E
   bool m_bFiredOutOfAmmoEvent; // 0xD1E - 0xD1F
   unsigned char pad_D1F[0x1]; // 0xD1F - 0xD20
   int32_t m_numRemoveUnownedWeaponThink; // 0xD20 - 0xD24
   unsigned char pad_D24[0x4]; // 0xD24 - 0xD28
   CIronSightController m_IronSightController; // 0xD28 - 0xD40
   int32_t m_iIronSightMode; // 0xD40 - 0xD44
   GameTime_t m_flLastLOSTraceFailureTime; // 0xD44 - 0xD48
   int32_t m_iNumEmptyAttacks; // 0xD48 - 0xD4C
   unsigned char pad_D4C[0x4]; // 0xD4C - 0xD50
}; // size - 0xD50


class C_WeaponCSBase /* "client" */ : public C_BasePlayerWeapon /* "client" */
{
public:
   unsigned char pad_10A0[0x38]; // 0x10A0 - 0x10D8
   float m_flFireSequenceStartTime; // 0x10D8 - 0x10DC
   int32_t m_nFireSequenceStartTimeChange; // 0x10DC - 0x10E0
   int32_t m_nFireSequenceStartTimeAck; // 0x10E0 - 0x10E4
   bool m_bPlayerFireEventIsPrimary; // 0x10E4 - 0x10E5
   unsigned char pad_10E5[0x3]; // 0x10E5 - 0x10E8
   HSequence m_seqIdle; // 0x10E8 - 0x10EC
   HSequence m_seqFirePrimary; // 0x10EC - 0x10F0
   HSequence m_seqFireSecondary; // 0x10F0 - 0x10F4
   unsigned char pad_10F4[0x14]; // 0x10F4 - 0x1108
   float m_flCrosshairDistance; // 0x1108 - 0x110C
   int32_t m_iAmmoLastCheck; // 0x110C - 0x1110
   int32_t m_iAlpha; // 0x1110 - 0x1114
   int32_t m_iScopeTextureID; // 0x1114 - 0x1118
   int32_t m_iCrosshairTextureID; // 0x1118 - 0x111C
   float m_flGunAccuracyPosition; // 0x111C - 0x1120
   uint32_t m_nViewModelIndex; // 0x1120 - 0x1124
   bool m_bReloadsWithClips; // 0x1124 - 0x1125
   unsigned char pad_1125[0x3]; // 0x1125 - 0x1128
   GameTime_t m_flTimeWeaponIdle; // 0x1128 - 0x112C
   bool m_bFireOnEmpty; // 0x112C - 0x112D
   unsigned char pad_112D[0x3]; // 0x112D - 0x1130
   CEntityIOOutput m_OnPlayerPickup; // 0x1130 - 0x1158
   CSWeaponMode m_weaponMode; // 0x1158 - 0x115C
   float m_flTurningInaccuracyDelta; // 0x115C - 0x1160
   Vector m_vecTurningInaccuracyEyeDirLast; // 0x1160 - 0x116C
   float m_flTurningInaccuracy; // 0x116C - 0x1170
   float m_fAccuracyPenalty; // 0x1170 - 0x1174
   GameTime_t m_flLastAccuracyUpdateTime; // 0x1174 - 0x1178
   float m_fAccuracySmoothedForZoom; // 0x1178 - 0x117C
   GameTime_t m_fScopeZoomEndTime; // 0x117C - 0x1180
   int32_t m_iRecoilIndex; // 0x1180 - 0x1184
   float m_flRecoilIndex; // 0x1184 - 0x1188
   bool m_bBurstMode; // 0x1188 - 0x1189
   unsigned char pad_1189[0x3]; // 0x1189 - 0x118C
   GameTime_t m_flPostponeFireReadyTime; // 0x118C - 0x1190
   bool m_bInReload; // 0x1190 - 0x1191
   bool m_bReloadVisuallyComplete; // 0x1191 - 0x1192
   unsigned char pad_1192[0x2]; // 0x1192 - 0x1194
   GameTime_t m_flDroppedAtTime; // 0x1194 - 0x1198
   bool m_bIsHauledBack; // 0x1198 - 0x1199
   bool m_bSilencerOn; // 0x1199 - 0x119A
   unsigned char pad_119A[0x2]; // 0x119A - 0x119C
   GameTime_t m_flTimeSilencerSwitchComplete; // 0x119C - 0x11A0
   int32_t m_iOriginalTeamNumber; // 0x11A0 - 0x11A4
   float m_flNextAttackRenderTimeOffset; // 0x11A4 - 0x11A8
   unsigned char pad_11A8[0x88]; // 0x11A8 - 0x1230
   bool m_bVisualsDataSet; // 0x1230 - 0x1231
   bool m_bOldFirstPersonSpectatedState; // 0x1231 - 0x1232
   unsigned char pad_1232[0x2]; // 0x1232 - 0x1234
   CHandle< C_BaseEntity > m_hOurPing; // 0x1234 - 0x1238
   CEntityIndex m_nOurPingIndex; // 0x1238 - 0x123C
   Vector m_vecOurPingPos; // 0x123C - 0x1248
   bool m_bGlowForPing; // 0x1248 - 0x1249
   bool m_bUIWeapon; // 0x1249 - 0x124A
   unsigned char pad_124A[0xE]; // 0x124A - 0x1258
   CHandle< C_CSPlayerPawnBase > m_hPrevOwner; // 0x1258 - 0x125C
   unsigned char pad_125C[0x20]; // 0x125C - 0x127C
   bool m_donated; // 0x127C - 0x127D
   unsigned char pad_127D[0x3]; // 0x127D - 0x1280
   GameTime_t m_fLastShotTime; // 0x1280 - 0x1284
   bool m_bWasOwnedByCT; // 0x1284 - 0x1285
   bool m_bWasOwnedByTerrorist; // 0x1285 - 0x1286
   unsigned char pad_1286[0x2]; // 0x1286 - 0x1288
   float m_gunHeat; // 0x1288 - 0x128C
   uint32_t m_smokeAttachments; // 0x128C - 0x1290
   GameTime_t m_lastSmokeTime; // 0x1290 - 0x1294
   float m_flLastClientFireBulletTime; // 0x1294 - 0x1298
   unsigned char pad_1298[0x58]; // 0x1298 - 0x12F0
   C_IronSightController m_IronSightController; // 0x12F0 - 0x13A0
   int32_t m_iIronSightMode; // 0x13A0 - 0x13A4
   unsigned char pad_13A4[0xC]; // 0x13A4 - 0x13B0
   GameTime_t m_flLastLOSTraceFailureTime; // 0x13B0 - 0x13B4
   int32_t m_iNumEmptyAttacks; // 0x13B4 - 0x13B8
   unsigned char pad_13B8[0x18]; // 0x13B8 - 0x13D0
}; // size - 0x13D0


class CAnimUpdateNodeBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CAnimNodePath m_nodePath; // 0x18 - 0x48
   CUtlString m_name; // 0x48 - 0x50
   AnimNodeNetworkMode m_networkMode; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
}; // size - 0x58


class CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30
   unsigned char pad_30[0x10]; // 0x30 - 0x40
}; // size - 0x40


class CAnimNodeBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
   CUtlString m_sName; // 0x20 - 0x28
   Vector2D m_vecPosition; // 0x28 - 0x30
   AnimNodeID m_nNodeID; // 0x30 - 0x34
   AnimNodeNetworkMode m_networkMode; // 0x34 - 0x38
}; // size - 0x38


class CPhysicsProp /* "server" */ : public CBreakableProp /* "server" */
{
public:
   unsigned char pad_998[0x8]; // 0x998 - 0x9A0
   CEntityIOOutput m_MotionEnabled; // 0x9A0 - 0x9C8
   CEntityIOOutput m_OnAwakened; // 0x9C8 - 0x9F0
   CEntityIOOutput m_OnAwake; // 0x9F0 - 0xA18
   CEntityIOOutput m_OnAsleep; // 0xA18 - 0xA40
   CEntityIOOutput m_OnPlayerUse; // 0xA40 - 0xA68
   CEntityIOOutput m_OnPlayerPickup; // 0xA68 - 0xA90
   CEntityIOOutput m_OnOutOfWorld; // 0xA90 - 0xAB8
   float m_massScale; // 0xAB8 - 0xABC
   float m_inertiaScale; // 0xABC - 0xAC0
   int32_t m_damageType; // 0xAC0 - 0xAC4
   int32_t m_damageToEnableMotion; // 0xAC4 - 0xAC8
   float m_flForceToEnableMotion; // 0xAC8 - 0xACC
   bool m_bThrownByPlayer; // 0xACC - 0xACD
   bool m_bDroppedByPlayer; // 0xACD - 0xACE
   bool m_bTouchedByPlayer; // 0xACE - 0xACF
   bool m_bFirstCollisionAfterLaunch; // 0xACF - 0xAD0
   int32_t m_iExploitableByPlayer; // 0xAD0 - 0xAD4
   bool m_bHasBeenAwakened; // 0xAD4 - 0xAD5
   bool m_bIsOverrideProp; // 0xAD5 - 0xAD6
   unsigned char pad_AD6[0x2]; // 0xAD6 - 0xAD8
   GameTime_t m_fNextCheckDisableMotionContactsTime; // 0xAD8 - 0xADC
   int32_t m_iInitialGlowState; // 0xADC - 0xAE0
   int32_t m_nGlowRange; // 0xAE0 - 0xAE4
   int32_t m_nGlowRangeMin; // 0xAE4 - 0xAE8
   Color m_glowColor; // 0xAE8 - 0xAEC
   bool m_bForceNavIgnore; // 0xAEC - 0xAED
   bool m_bNoNavmeshBlocker; // 0xAED - 0xAEE
   bool m_bForceNpcExclude; // 0xAEE - 0xAEF
   bool m_bShouldAutoConvertBackFromDebris; // 0xAEF - 0xAF0
   bool m_bMuteImpactEffects; // 0xAF0 - 0xAF1
   unsigned char pad_AF1[0x7]; // 0xAF1 - 0xAF8
   bool m_bAcceptDamageFromHeldObjects; // 0xAF8 - 0xAF9
   bool m_bEnableUseOutput; // 0xAF9 - 0xAFA
   bool m_bAwake; // 0xAFA - 0xAFB
   unsigned char pad_AFB[0x1]; // 0xAFB - 0xAFC
   int32_t m_nCollisionGroupOverride; // 0xAFC - 0xB00
}; // size - 0xB00


class CPulseCell_Base /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   PulseDocNodeID_t m_nEditorNodeID; // 0x8 - 0xC
   unsigned char pad_C[0x3C]; // 0xC - 0x48
}; // size - 0x48


class CBaseTrigger /* "server" */ : public CBaseToggle /* "server" */
{
public:
   bool m_bDisabled; // 0x770 - 0x771
   unsigned char pad_771[0x7]; // 0x771 - 0x778
   CUtlSymbolLarge m_iFilterName; // 0x778 - 0x780
   CHandle< CBaseFilter > m_hFilter; // 0x780 - 0x784
   unsigned char pad_784[0x4]; // 0x784 - 0x788
   CEntityIOOutput m_OnStartTouch; // 0x788 - 0x7B0
   CEntityIOOutput m_OnStartTouchAll; // 0x7B0 - 0x7D8
   CEntityIOOutput m_OnEndTouch; // 0x7D8 - 0x800
   CEntityIOOutput m_OnEndTouchAll; // 0x800 - 0x828
   CEntityIOOutput m_OnTouching; // 0x828 - 0x850
   CEntityIOOutput m_OnNotTouching; // 0x850 - 0x878
   CUtlVector< CHandle< CBaseEntity > > m_hTouchingEntities; // 0x878 - 0x890
   bool m_bClientSidePredicted; // 0x890 - 0x891
   unsigned char pad_891[0x7]; // 0x891 - 0x898
}; // size - 0x898


class CParticleFunctionPreEmission /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   bool m_bRunOnce; // 0x210 - 0x211
   unsigned char pad_211[0xF]; // 0x211 - 0x220
}; // size - 0x220


class CPhysicsPropMultiplayer /* "server" */ : public CPhysicsProp /* "server" */
{
public:
   unsigned char pad_0[0xB00]; // 0x0 - 0xB00
}; // size - 0xB00


class CBaseProp /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   bool m_bModelOverrodeBlockLOS; // 0x998 - 0x999
   unsigned char pad_999[0x3]; // 0x999 - 0x99C
   int32_t m_iShapeType; // 0x99C - 0x9A0
   bool m_bConformToCollisionBounds; // 0x9A0 - 0x9A1
   unsigned char pad_9A1[0x3]; // 0x9A1 - 0x9A4
   matrix3x4_t m_mPreferredCatchTransform; // 0x9A4 - 0x9D4
   unsigned char pad_9D4[0x4]; // 0x9D4 - 0x9D8
}; // size - 0x9D8


class CParticleFunctionRenderer /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   CParticleVisibilityInputs VisibilityInputs; // 0x210 - 0x254
   bool m_bCannotBeRefracted; // 0x254 - 0x255
   bool m_bSkipRenderingOnMobile; // 0x255 - 0x256
   unsigned char pad_256[0xA]; // 0x256 - 0x260
}; // size - 0x260


class CPulseCell_BaseFlow /* "pulse_runtime_lib" */ : public CPulseCell_Base /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x48]; // 0x0 - 0x48
}; // size - 0x48


class CWeaponCSBaseGun /* "server" */ : public CWeaponCSBase /* "server" */
{
public:
   int32_t m_zoomLevel; // 0xD50 - 0xD54
   int32_t m_iBurstShotsRemaining; // 0xD54 - 0xD58
   unsigned char pad_D58[0x8]; // 0xD58 - 0xD60
   int32_t m_silencedModelIndex; // 0xD60 - 0xD64
   bool m_inPrecache; // 0xD64 - 0xD65
   bool m_bNeedsBoltAction; // 0xD65 - 0xD66
   bool m_bSkillReloadAvailable; // 0xD66 - 0xD67
   bool m_bSkillReloadLiftedReloadKey; // 0xD67 - 0xD68
   bool m_bSkillBoltInterruptAvailable; // 0xD68 - 0xD69
   bool m_bSkillBoltLiftedFireKey; // 0xD69 - 0xD6A
   unsigned char pad_D6A[0x6]; // 0xD6A - 0xD70
}; // size - 0xD70


class C_WeaponCSBaseGun /* "client" */ : public C_WeaponCSBase /* "client" */
{
public:
   int32_t m_zoomLevel; // 0x13D0 - 0x13D4
   int32_t m_iBurstShotsRemaining; // 0x13D4 - 0x13D8
   int32_t m_iSilencerBodygroup; // 0x13D8 - 0x13DC
   unsigned char pad_13DC[0xC]; // 0x13DC - 0x13E8
   int32_t m_silencedModelIndex; // 0x13E8 - 0x13EC
   bool m_inPrecache; // 0x13EC - 0x13ED
   bool m_bNeedsBoltAction; // 0x13ED - 0x13EE
   unsigned char pad_13EE[0x2]; // 0x13EE - 0x13F0
}; // size - 0x13F0


class CBrBaseItem /* "server" */ : public CPhysicsPropMultiplayer /* "server" */
{
public:
   unsigned char pad_0[0xB28]; // 0x0 - 0xB28
}; // size - 0xB28


class CEntityComponent /* "entity2" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class CUnaryUpdateNode /* "animationsystem" */ : public CAnimUpdateNodeBase /* "animationsystem" */
{
public:
   CAnimUpdateNodeRef m_pChildNode; // 0x58 - 0x68
}; // size - 0x68


class C_BreakableProp /* "client" */ : public CBaseProp /* "client" */
{
public:
   unsigned char pad_9D8[0x8]; // 0x9D8 - 0x9E0
   CEntityIOOutput m_OnBreak; // 0x9E0 - 0xA08
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0xA08 - 0xA30
   CEntityIOOutput m_OnTakeDamage; // 0xA30 - 0xA58
   float m_impactEnergyScale; // 0xA58 - 0xA5C
   int32_t m_iMinHealthDmg; // 0xA5C - 0xA60
   float m_flPressureDelay; // 0xA60 - 0xA64
   CHandle< C_BaseEntity > m_hBreaker; // 0xA64 - 0xA68
   PerformanceMode_t m_PerformanceMode; // 0xA68 - 0xA6C
   float m_flDmgModBullet; // 0xA6C - 0xA70
   float m_flDmgModClub; // 0xA70 - 0xA74
   float m_flDmgModExplosive; // 0xA74 - 0xA78
   float m_flDmgModFire; // 0xA78 - 0xA7C
   unsigned char pad_A7C[0x4]; // 0xA7C - 0xA80
   CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0xA80 - 0xA88
   CUtlSymbolLarge m_iszBasePropData; // 0xA88 - 0xA90
   int32_t m_iInteractions; // 0xA90 - 0xA94
   GameTime_t m_flPreventDamageBeforeTime; // 0xA94 - 0xA98
   bool m_bHasBreakPiecesOrCommands; // 0xA98 - 0xA99
   unsigned char pad_A99[0x3]; // 0xA99 - 0xA9C
   float m_explodeDamage; // 0xA9C - 0xAA0
   float m_explodeRadius; // 0xAA0 - 0xAA4
   unsigned char pad_AA4[0x4]; // 0xAA4 - 0xAA8
   float m_explosionDelay; // 0xAA8 - 0xAAC
   unsigned char pad_AAC[0x4]; // 0xAAC - 0xAB0
   CUtlSymbolLarge m_explosionBuildupSound; // 0xAB0 - 0xAB8
   CUtlSymbolLarge m_explosionCustomEffect; // 0xAB8 - 0xAC0
   CUtlSymbolLarge m_explosionCustomSound; // 0xAC0 - 0xAC8
   CUtlSymbolLarge m_explosionModifier; // 0xAC8 - 0xAD0
   CHandle< C_BasePlayerPawn > m_hPhysicsAttacker; // 0xAD0 - 0xAD4
   GameTime_t m_flLastPhysicsInfluenceTime; // 0xAD4 - 0xAD8
   float m_flDefaultFadeScale; // 0xAD8 - 0xADC
   CHandle< C_BaseEntity > m_hLastAttacker; // 0xADC - 0xAE0
   CHandle< C_BaseEntity > m_hFlareEnt; // 0xAE0 - 0xAE4
   bool m_noGhostCollision; // 0xAE4 - 0xAE5
   unsigned char pad_AE5[0x3]; // 0xAE5 - 0xAE8
}; // size - 0xAE8


class CServerOnlyPointEntity /* "server" */ : public CServerOnlyEntity /* "server" */
{
public:
   unsigned char pad_0[0x4A0]; // 0x0 - 0x4A0
}; // size - 0x4A0


class CParticleFunctionForce /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   unsigned char pad_0[0x210]; // 0x0 - 0x210
}; // size - 0x210


class C_BaseCombatCharacter /* "client" */ : public C_BaseFlex /* "client" */
{
public:

   enum class WaterWakeMode_t : std::uint32_t
   {
      WATER_WAKE_NONE = 0,
      WATER_WAKE_IDLE = 1,
      WATER_WAKE_WALKING = 2,
      WATER_WAKE_RUNNING = 3,
      WATER_WAKE_WATER_OVERHEAD = 4
   };
   C_NetworkUtlVectorBase< CHandle< C_EconWearable > > m_hMyWearables; // 0xB28 - 0xB40
   int32_t m_bloodColor; // 0xB40 - 0xB44
   AttachmentHandle_t m_leftFootAttachment; // 0xB44 - 0xB45
   AttachmentHandle_t m_rightFootAttachment; // 0xB45 - 0xB46
   unsigned char pad_B46[0x2]; // 0xB46 - 0xB48
   C_BaseCombatCharacter::WaterWakeMode_t m_nWaterWakeMode; // 0xB48 - 0xB4C
   float m_flWaterWorldZ; // 0xB4C - 0xB50
   float m_flWaterNextTraceTime; // 0xB50 - 0xB54
   float m_flFieldOfView; // 0xB54 - 0xB58
   unsigned char pad_B58[0x60]; // 0xB58 - 0xBB8
}; // size - 0xBB8


class EventSimulate_t /* "engine2" */
{
public:
   EngineLoopState_t m_LoopState; // 0x0 - 0x28
   bool m_bFirstTick; // 0x28 - 0x29
   bool m_bLastTick; // 0x29 - 0x2A
   unsigned char pad_2A[0x6]; // 0x2A - 0x30
}; // size - 0x30


class CBoneConstraintBase /* "modellib" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
}; // size - 0x28


class CPhysPropWeaponUpgrade /* "server" */ : public CBrBaseItem /* "server" */
{
public:
   int32_t m_nEventPriority; // 0xB28 - 0xB2C
   GameTime_t m_flTimeLastUsed; // 0xB2C - 0xB30
}; // size - 0xB30


class CBaseFilter /* "server" */ : public CLogicalEntity /* "server" */
{
public:
   bool m_bNegated; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x7]; // 0x4A1 - 0x4A8
   CEntityIOOutput m_OnPass; // 0x4A8 - 0x4D0
   CEntityIOOutput m_OnFail; // 0x4D0 - 0x4F8
}; // size - 0x4F8


class CBaseGrenade /* "server" */ : public CBaseFlex /* "server" */
{
public:
   unsigned char pad_8B0[0x8]; // 0x8B0 - 0x8B8
   CEntityIOOutput m_OnPlayerPickup; // 0x8B8 - 0x8E0
   CEntityIOOutput m_OnExplode; // 0x8E0 - 0x908
   bool m_bHasWarnedAI; // 0x908 - 0x909
   bool m_bIsSmokeGrenade; // 0x909 - 0x90A
   bool m_bIsLive; // 0x90A - 0x90B
   unsigned char pad_90B[0x1]; // 0x90B - 0x90C
   float m_DmgRadius; // 0x90C - 0x910
   GameTime_t m_flDetonateTime; // 0x910 - 0x914
   float m_flWarnAITime; // 0x914 - 0x918
   float m_flDamage; // 0x918 - 0x91C
   unsigned char pad_91C[0x4]; // 0x91C - 0x920
   CUtlSymbolLarge m_iszBounceSound; // 0x920 - 0x928
   CUtlString m_ExplosionSound; // 0x928 - 0x930
   unsigned char pad_930[0x4]; // 0x930 - 0x934
   CHandle< CBaseEntity > m_hThrower; // 0x934 - 0x938
   unsigned char pad_938[0x18]; // 0x938 - 0x950
   GameTime_t m_flNextAttack; // 0x950 - 0x954
   CHandle< CBaseEntity > m_hOriginalThrower; // 0x954 - 0x958
}; // size - 0x958


class CDynamicProp /* "server" */ : public CBreakableProp /* "server" */
{
public:
   unsigned char pad_998[0x8]; // 0x998 - 0x9A0
   bool m_bCreateNavObstacle; // 0x9A0 - 0x9A1
   bool m_bUseHitboxesForRenderBox; // 0x9A1 - 0x9A2
   bool m_bUseAnimGraph; // 0x9A2 - 0x9A3
   unsigned char pad_9A3[0x5]; // 0x9A3 - 0x9A8
   CEntityIOOutput m_pOutputAnimBegun; // 0x9A8 - 0x9D0
   CEntityIOOutput m_pOutputAnimOver; // 0x9D0 - 0x9F8
   CEntityIOOutput m_pOutputAnimLoopCycleOver; // 0x9F8 - 0xA20
   CEntityIOOutput m_OnAnimReachedStart; // 0xA20 - 0xA48
   CEntityIOOutput m_OnAnimReachedEnd; // 0xA48 - 0xA70
   CUtlSymbolLarge m_iszDefaultAnim; // 0xA70 - 0xA78
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0xA78 - 0xA7C
   bool m_bAnimateOnServer; // 0xA7C - 0xA7D
   bool m_bRandomizeCycle; // 0xA7D - 0xA7E
   bool m_bStartDisabled; // 0xA7E - 0xA7F
   bool m_bScriptedMovement; // 0xA7F - 0xA80
   bool m_bFiredStartEndOutput; // 0xA80 - 0xA81
   bool m_bForceNpcExclude; // 0xA81 - 0xA82
   bool m_bCreateNonSolid; // 0xA82 - 0xA83
   bool m_bIsOverrideProp; // 0xA83 - 0xA84
   int32_t m_iInitialGlowState; // 0xA84 - 0xA88
   int32_t m_nGlowRange; // 0xA88 - 0xA8C
   int32_t m_nGlowRangeMin; // 0xA8C - 0xA90
   Color m_glowColor; // 0xA90 - 0xA94
   int32_t m_nGlowTeam; // 0xA94 - 0xA98
}; // size - 0xA98


class CMotionMetricBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
   float m_flWeight; // 0x20 - 0x24
   unsigned char pad_24[0x4]; // 0x24 - 0x28
}; // size - 0x28


class CMotionMetricEvaluator /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< float32 > m_means; // 0x18 - 0x30
   CUtlVector< float32 > m_standardDeviations; // 0x30 - 0x48
   float m_flWeight; // 0x48 - 0x4C
   int32_t m_nDimensionStartIndex; // 0x4C - 0x50
}; // size - 0x50


class C_BaseToggle /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_0[0x838]; // 0x0 - 0x838
}; // size - 0x838


class CParticleFunctionConstraint /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   unsigned char pad_0[0x210]; // 0x0 - 0x210
}; // size - 0x210


class CLeafUpdateNode /* "animationsystem" */ : public CAnimUpdateNodeBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x58]; // 0x0 - 0x58
}; // size - 0x58


class CPhysConstraint /* "server" */ : public CLogicalEntity /* "server" */
{
public:
   unsigned char pad_4A0[0x8]; // 0x4A0 - 0x4A8
   CUtlSymbolLarge m_nameAttach1; // 0x4A8 - 0x4B0
   CUtlSymbolLarge m_nameAttach2; // 0x4B0 - 0x4B8
   CUtlSymbolLarge m_breakSound; // 0x4B8 - 0x4C0
   float m_forceLimit; // 0x4C0 - 0x4C4
   float m_torqueLimit; // 0x4C4 - 0x4C8
   uint32_t m_teleportTick; // 0x4C8 - 0x4CC
   float m_minTeleportDistance; // 0x4CC - 0x4D0
   CEntityIOOutput m_OnBreak; // 0x4D0 - 0x4F8
}; // size - 0x4F8


class CAnimComponentBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlString m_group; // 0x18 - 0x20
   unsigned char pad_20[0x8]; // 0x20 - 0x28
   AnimComponentID m_id; // 0x28 - 0x2C
   bool m_bStartEnabled; // 0x2C - 0x2D
   unsigned char pad_2D[0x3]; // 0x2D - 0x30
   int32_t m_nPriority; // 0x30 - 0x34
   AnimNodeNetworkMode m_networkMode; // 0x34 - 0x38
}; // size - 0x38


class CAnimComponentUpdater /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlString m_name; // 0x18 - 0x20
   AnimComponentID m_id; // 0x20 - 0x24
   AnimNodeNetworkMode m_networkMode; // 0x24 - 0x28
   bool m_bStartEnabled; // 0x28 - 0x29
   unsigned char pad_29[0x7]; // 0x29 - 0x30
}; // size - 0x30


class CAnimTagBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
   CUtlString m_name; // 0x20 - 0x28
   CUtlString m_group; // 0x28 - 0x30
   AnimTagID m_tagID; // 0x30 - 0x34
   bool m_bIsReferenced; // 0x34 - 0x35
   unsigned char pad_35[0x3]; // 0x35 - 0x38
}; // size - 0x38


class CBaseCombatCharacter /* "server" */ : public CBaseFlex /* "server" */
{
public:
   bool m_bForceServerRagdoll; // 0x8B0 - 0x8B1
   unsigned char pad_8B1[0x7]; // 0x8B1 - 0x8B8
   CNetworkUtlVectorBase< CHandle< CEconWearable > > m_hMyWearables; // 0x8B8 - 0x8D0
   float m_flFieldOfView; // 0x8D0 - 0x8D4
   float m_impactEnergyScale; // 0x8D4 - 0x8D8
   HitGroup_t m_LastHitGroup; // 0x8D8 - 0x8DC
   bool m_bApplyStressDamage; // 0x8DC - 0x8DD
   unsigned char pad_8DD[0x3]; // 0x8DD - 0x8E0
   int32_t m_bloodColor; // 0x8E0 - 0x8E4
   unsigned char pad_8E4[0x5C]; // 0x8E4 - 0x940
   int32_t m_registeredNavTeam; // 0x940 - 0x944
   int32_t m_navMeshID; // 0x944 - 0x948
   int32_t m_iDamageCount; // 0x948 - 0x94C
   unsigned char pad_94C[0x4]; // 0x94C - 0x950
   CUtlVector< RelationshipOverride_t >* m_pVecRelationships; // 0x950 - 0x958
   CUtlSymbolLarge m_strRelationships; // 0x958 - 0x960
   Hull_t m_eHull; // 0x960 - 0x964
   uint32_t m_nNavHullIdx; // 0x964 - 0x968
}; // size - 0x968


class C_BasePlayerPawn /* "client" */ : public C_BaseCombatCharacter /* "client" */
{
public:
   CPlayer_WeaponServices* m_pWeaponServices; // 0xBB8 - 0xBC0
   CPlayer_ItemServices* m_pItemServices; // 0xBC0 - 0xBC8
   CPlayer_AutoaimServices* m_pAutoaimServices; // 0xBC8 - 0xBD0
   CPlayer_ObserverServices* m_pObserverServices; // 0xBD0 - 0xBD8
   CPlayer_WaterServices* m_pWaterServices; // 0xBD8 - 0xBE0
   CPlayer_UseServices* m_pUseServices; // 0xBE0 - 0xBE8
   CPlayer_FlashlightServices* m_pFlashlightServices; // 0xBE8 - 0xBF0
   CPlayer_CameraServices* m_pCameraServices; // 0xBF0 - 0xBF8
   CPlayer_MovementServices* m_pMovementServices; // 0xBF8 - 0xC00
   unsigned char pad_C00[0x8]; // 0xC00 - 0xC08
   FixAngleSet_t m_fixAngleChangeType; // 0xC08 - 0xC09
   unsigned char pad_C09[0x3]; // 0xC09 - 0xC0C
   QAngle m_fixAngleChangeAngle; // 0xC0C - 0xC18
   int32_t m_fixAngleChangeTick; // 0xC18 - 0xC1C
   QAngle v_angle; // 0xC1C - 0xC28
   uint32_t m_iHideHUD; // 0xC28 - 0xC2C
   unsigned char pad_C2C[0x4]; // 0xC2C - 0xC30
   sky3dparams_t m_skybox3d; // 0xC30 - 0xCC0
   GameTime_t m_flDeathTime; // 0xCC0 - 0xCC4
   Vector m_vecPredictionError; // 0xCC4 - 0xCD0
   GameTime_t m_flPredictionErrorTime; // 0xCD0 - 0xCD4
   float m_flFOVSensitivityAdjust; // 0xCD4 - 0xCD8
   float m_flMouseSensitivity; // 0xCD8 - 0xCDC
   Vector m_vOldOrigin; // 0xCDC - 0xCE8
   float m_flOldSimulationTime; // 0xCE8 - 0xCEC
   int32_t m_nLastExecutedCommandNumber; // 0xCEC - 0xCF0
   int32_t m_nLastExecutedCommandTick; // 0xCF0 - 0xCF4
   CHandle< CBasePlayerController > m_hController; // 0xCF4 - 0xCF8
   bool m_bIsSwappingToPredictableController; // 0xCF8 - 0xCF9
   unsigned char pad_CF9[0x7]; // 0xCF9 - 0xD00
}; // size - 0xD00


class C_PhysicsProp /* "client" */ : public C_BreakableProp /* "client" */
{
public:
   bool m_bAwake; // 0xAE8 - 0xAE9
   unsigned char pad_AE9[0x7]; // 0xAE9 - 0xAF0
}; // size - 0xAF0


class CItem /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   unsigned char pad_820[0x8]; // 0x820 - 0x828
   CEntityIOOutput m_OnPlayerTouch; // 0x828 - 0x850
   bool m_bActivateWhenAtRest; // 0x850 - 0x851
   unsigned char pad_851[0x7]; // 0x851 - 0x858
   CEntityIOOutput m_OnCacheInteraction; // 0x858 - 0x880
   CEntityIOOutput m_OnPlayerPickup; // 0x880 - 0x8A8
   CEntityIOOutput m_OnGlovePulled; // 0x8A8 - 0x8D0
   Vector m_vOriginalSpawnOrigin; // 0x8D0 - 0x8DC
   QAngle m_vOriginalSpawnAngles; // 0x8DC - 0x8E8
   bool m_bPhysStartAsleep; // 0x8E8 - 0x8E9
   unsigned char pad_8E9[0xF]; // 0x8E9 - 0x8F8
}; // size - 0x8F8


class CModelConfigElement /* "modellib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlString m_ElementName; // 0x8 - 0x10
   CUtlVector< CModelConfigElement* > m_NestedElements; // 0x10 - 0x28
   unsigned char pad_28[0x20]; // 0x28 - 0x48
}; // size - 0x48


class C_BaseGrenade /* "client" */ : public C_BaseFlex /* "client" */
{
public:
   bool m_bHasWarnedAI; // 0xB28 - 0xB29
   bool m_bIsSmokeGrenade; // 0xB29 - 0xB2A
   bool m_bIsLive; // 0xB2A - 0xB2B
   unsigned char pad_B2B[0x1]; // 0xB2B - 0xB2C
   float m_DmgRadius; // 0xB2C - 0xB30
   GameTime_t m_flDetonateTime; // 0xB30 - 0xB34
   float m_flWarnAITime; // 0xB34 - 0xB38
   float m_flDamage; // 0xB38 - 0xB3C
   unsigned char pad_B3C[0x4]; // 0xB3C - 0xB40
   CUtlSymbolLarge m_iszBounceSound; // 0xB40 - 0xB48
   CUtlString m_ExplosionSound; // 0xB48 - 0xB50
   unsigned char pad_B50[0x4]; // 0xB50 - 0xB54
   CHandle< C_BaseEntity > m_hThrower; // 0xB54 - 0xB58
   unsigned char pad_B58[0x18]; // 0xB58 - 0xB70
   GameTime_t m_flNextAttack; // 0xB70 - 0xB74
   CHandle< C_BaseEntity > m_hOriginalThrower; // 0xB74 - 0xB78
}; // size - 0xB78


class CBtNode /* "server" */
{
public:
   unsigned char pad_0[0x58]; // 0x0 - 0x58
}; // size - 0x58


class CEntitySubclassVDataBase /* "server" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
}; // size - 0x28


class C_CSGO_TeamPreviewCharacterPosition /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   int32_t m_nOrdinal; // 0x538 - 0x53C
   unsigned char pad_53C[0x4]; // 0x53C - 0x540
   CUtlString m_sWeaponName; // 0x540 - 0x548
   uint64_t m_xuid; // 0x548 - 0x550
   C_EconItemView m_weaponItem; // 0x550 - 0x998
   unsigned char pad_998[0x38]; // 0x998 - 0x9D0
}; // size - 0x9D0


class CBaseCSGrenade /* "server" */ : public CWeaponCSBase /* "server" */
{
public:
   unsigned char pad_D50[0x20]; // 0xD50 - 0xD70
   bool m_bRedraw; // 0xD70 - 0xD71
   bool m_bIsHeldByPlayer; // 0xD71 - 0xD72
   bool m_bPinPulled; // 0xD72 - 0xD73
   unsigned char pad_D73[0x1]; // 0xD73 - 0xD74
   EGrenadeThrowState m_eThrowStatus; // 0xD74 - 0xD78
   GameTime_t m_fThrowTime; // 0xD78 - 0xD7C
   float m_flThrowStrength; // 0xD7C - 0xD80
   float m_flThrowStrengthApproach; // 0xD80 - 0xD84
   GameTime_t m_fDropTime; // 0xD84 - 0xD88
   unsigned char pad_D88[0x8]; // 0xD88 - 0xD90
}; // size - 0xD90


class CNavVolume /* "navlib" */
{
public:
   unsigned char pad_0[0x70]; // 0x0 - 0x70
}; // size - 0x70


class C_BaseCSGrenade /* "client" */ : public C_WeaponCSBase /* "client" */
{
public:
   unsigned char pad_13D0[0x20]; // 0x13D0 - 0x13F0
   bool m_bRedraw; // 0x13F0 - 0x13F1
   bool m_bIsHeldByPlayer; // 0x13F1 - 0x13F2
   bool m_bPinPulled; // 0x13F2 - 0x13F3
   unsigned char pad_13F3[0x1]; // 0x13F3 - 0x13F4
   EGrenadeThrowState m_eThrowStatus; // 0x13F4 - 0x13F8
   GameTime_t m_fThrowTime; // 0x13F8 - 0x13FC
   float m_flThrowStrength; // 0x13FC - 0x1400
   float m_flThrowStrengthApproach; // 0x1400 - 0x1404
   GameTime_t m_fDropTime; // 0x1404 - 0x1408
   unsigned char pad_1408[0x8]; // 0x1408 - 0x1410
}; // size - 0x1410


class C_PointEntity /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x538]; // 0x0 - 0x538
}; // size - 0x538


class CBaseConstraint /* "modellib" */ : public CBoneConstraintBase /* "modellib" */
{
public:
   CUtlString m_name; // 0x28 - 0x30
   Vector m_vUpVector; // 0x30 - 0x3C
   unsigned char pad_3C[0x4]; // 0x3C - 0x40
   CUtlVector< CConstraintSlave > m_slaves; // 0x40 - 0x58
   CUtlVector< CConstraintTarget > m_targets; // 0x58 - 0x70
}; // size - 0x70


class CBasePlatTrain /* "server" */ : public CBaseToggle /* "server" */
{
public:
   CUtlSymbolLarge m_NoiseMoving; // 0x770 - 0x778
   CUtlSymbolLarge m_NoiseArrived; // 0x778 - 0x780
   unsigned char pad_780[0x8]; // 0x780 - 0x788
   float m_volume; // 0x788 - 0x78C
   float m_flTWidth; // 0x78C - 0x790
   float m_flTLength; // 0x790 - 0x794
   unsigned char pad_794[0x4]; // 0x794 - 0x798
}; // size - 0x798


class CCSGO_TeamPreviewCharacterPosition /* "server" */ : public CBaseEntity /* "server" */
{
public:
   int32_t m_nOrdinal; // 0x4A0 - 0x4A4
   unsigned char pad_4A4[0x4]; // 0x4A4 - 0x4A8
   CUtlString m_sWeaponName; // 0x4A8 - 0x4B0
   uint64_t m_xuid; // 0x4B0 - 0x4B8
   CEconItemView m_weaponItem; // 0x4B8 - 0x730
}; // size - 0x730


class CConditionBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
}; // size - 0x28


class CPlayerControllerComponent /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30
   unsigned char pad_30[0x10]; // 0x30 - 0x40
}; // size - 0x40


class CRuleEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   CUtlSymbolLarge m_iszMaster; // 0x6F0 - 0x6F8
}; // size - 0x6F8


class CMarkupVolume /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bEnabled; // 0x6F0 - 0x6F1
   unsigned char pad_6F1[0x7]; // 0x6F1 - 0x6F8
}; // size - 0x6F8


class CSimpleSimTimer /* "server" */
{
public:
   GameTime_t m_next; // 0x0 - 0x4
   WorldGroupId_t m_nWorldGroupId; // 0x4 - 0x8
}; // size - 0x8


class C_BaseClientUIEntity /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_838[0x8]; // 0x838 - 0x840
   bool m_bEnabled; // 0x840 - 0x841
   unsigned char pad_841[0x7]; // 0x841 - 0x848
   CUtlSymbolLarge m_DialogXMLName; // 0x848 - 0x850
   CUtlSymbolLarge m_PanelClassName; // 0x850 - 0x858
   CUtlSymbolLarge m_PanelID; // 0x858 - 0x860
   unsigned char pad_860[0x8]; // 0x860 - 0x868
}; // size - 0x868


class C_CSPlayerPawnBase /* "client" */ : public C_BasePlayerPawn /* "client" */
{
public:
   unsigned char pad_D00[0x18]; // 0xD00 - 0xD18
   CCSPlayer_ActionTrackingServices* m_pActionTrackingServices; // 0xD18 - 0xD20
   CCSPlayer_PingServices* m_pPingServices; // 0xD20 - 0xD28
   CCSPlayer_ViewModelServices* m_pViewModelServices; // 0xD28 - 0xD30
   float32 m_fRenderingClipPlane[4]; // 0xD30 - 0xD40
   int32_t m_nLastClipPlaneSetupFrame; // 0xD40 - 0xD44
   Vector m_vecLastClipCameraPos; // 0xD44 - 0xD50
   Vector m_vecLastClipCameraForward; // 0xD50 - 0xD5C
   bool m_bClipHitStaticWorld; // 0xD5C - 0xD5D
   bool m_bCachedPlaneIsValid; // 0xD5D - 0xD5E
   unsigned char pad_D5E[0x2]; // 0xD5E - 0xD60
   C_WeaponCSBase* m_pClippingWeapon; // 0xD60 - 0xD68
   bool m_bHasFemaleVoice; // 0xD68 - 0xD69
   unsigned char pad_D69[0x3]; // 0xD69 - 0xD6C
   CSPlayerState m_previousPlayerState; // 0xD6C - 0xD70
   float m_flLastCollisionCeiling; // 0xD70 - 0xD74
   float m_flLastCollisionCeilingChangeTime; // 0xD74 - 0xD78
   unsigned char pad_D78[0x58]; // 0xD78 - 0xDD0
   bool m_bInLanding; // 0xDD0 - 0xDD1
   unsigned char pad_DD1[0x3]; // 0xDD1 - 0xDD4
   float m_flLandingTime; // 0xDD4 - 0xDD8
   GameTime_t m_grenadeParameterStashTime; // 0xDD8 - 0xDDC
   bool m_bGrenadeParametersStashed; // 0xDDC - 0xDDD
   unsigned char pad_DDD[0x3]; // 0xDDD - 0xDE0
   QAngle m_angStashedShootAngles; // 0xDE0 - 0xDEC
   Vector m_vecStashedGrenadeThrowPosition; // 0xDEC - 0xDF8
   Vector m_vecStashedVelocity; // 0xDF8 - 0xE04
   QAngle m_angShootAngleHistory[2]; // 0xE04 - 0xE1C
   Vector m_vecThrowPositionHistory[2]; // 0xE1C - 0xE34
   Vector m_vecVelocityHistory[2]; // 0xE34 - 0xE4C
   unsigned char pad_E4C[0x4]; // 0xE4C - 0xE50
   QAngle m_thirdPersonHeading; // 0xE50 - 0xE5C
   unsigned char pad_E5C[0xC]; // 0xE5C - 0xE68
   float m_flSlopeDropOffset; // 0xE68 - 0xE6C
   unsigned char pad_E6C[0xC]; // 0xE6C - 0xE78
   float m_flSlopeDropHeight; // 0xE78 - 0xE7C
   unsigned char pad_E7C[0xC]; // 0xE7C - 0xE88
   Vector m_vHeadConstraintOffset; // 0xE88 - 0xE94
   unsigned char pad_E94[0xC]; // 0xE94 - 0xEA0
   bool m_bClientTransparentImmunityAlphaEffectEnabled; // 0xEA0 - 0xEA1
   bool m_bClientDeferDrawToImmunityAlphaPass; // 0xEA1 - 0xEA2
   bool m_bIsScoped; // 0xEA2 - 0xEA3
   bool m_bIsWalking; // 0xEA3 - 0xEA4
   bool m_bResumeZoom; // 0xEA4 - 0xEA5
   unsigned char pad_EA5[0x3]; // 0xEA5 - 0xEA8
   CSPlayerState m_iPlayerState; // 0xEA8 - 0xEAC
   bool m_bIsDefusing; // 0xEAC - 0xEAD
   bool m_bIsGrabbingHostage; // 0xEAD - 0xEAE
   unsigned char pad_EAE[0x2]; // 0xEAE - 0xEB0
   CSPlayerBlockingUseAction_t m_iBlockingUseActionInProgress; // 0xEB0 - 0xEB4
   bool m_bIsRescuing; // 0xEB4 - 0xEB5
   unsigned char pad_EB5[0x3]; // 0xEB5 - 0xEB8
   GameTime_t m_fImmuneToGunGameDamageTime; // 0xEB8 - 0xEBC
   GameTime_t m_fImmuneToGunGameDamageTimeLast; // 0xEBC - 0xEC0
   bool m_bGunGameImmunity; // 0xEC0 - 0xEC1
   bool m_bHasMovedSinceSpawn; // 0xEC1 - 0xEC2
   bool m_bMadeFinalGunGameProgressiveKill; // 0xEC2 - 0xEC3
   unsigned char pad_EC3[0x1]; // 0xEC3 - 0xEC4
   int32_t m_iGunGameProgressiveWeaponIndex; // 0xEC4 - 0xEC8
   int32_t m_iNumGunGameTRKillPoints; // 0xEC8 - 0xECC
   int32_t m_iNumGunGameKillsWithCurrentWeapon; // 0xECC - 0xED0
   uint32_t m_unTotalRoundDamageDealt; // 0xED0 - 0xED4
   float m_fMolotovUseTime; // 0xED4 - 0xED8
   float m_fMolotovDamageTime; // 0xED8 - 0xEDC
   bool m_bInBombZone; // 0xEDC - 0xEDD
   unsigned char pad_EDD[0x3]; // 0xEDD - 0xEE0
   int32_t m_nWhichBombZone; // 0xEE0 - 0xEE4
   bool m_bInBuyZone; // 0xEE4 - 0xEE5
   bool m_bInNoDefuseArea; // 0xEE5 - 0xEE6
   unsigned char pad_EE6[0x2]; // 0xEE6 - 0xEE8
   int32_t m_iThrowGrenadeCounter; // 0xEE8 - 0xEEC
   bool m_bWaitForNoAttack; // 0xEEC - 0xEED
   bool m_bIsRespawningForDMBonus; // 0xEED - 0xEEE
   unsigned char pad_EEE[0x2]; // 0xEEE - 0xEF0
   float m_flGuardianTooFarDistFrac; // 0xEF0 - 0xEF4
   GameTime_t m_flDetectedByEnemySensorTime; // 0xEF4 - 0xEF8
   float m_flNextGuardianTooFarWarning; // 0xEF8 - 0xEFC
   bool m_bSuppressGuardianTooFarWarningAudio; // 0xEFC - 0xEFD
   bool m_bKilledByTaser; // 0xEFD - 0xEFE
   unsigned char pad_EFE[0x2]; // 0xEFE - 0xF00
   int32_t m_iMoveState; // 0xF00 - 0xF04
   bool m_bCanMoveDuringFreezePeriod; // 0xF04 - 0xF05
   bool m_isCurrentGunGameLeader; // 0xF05 - 0xF06
   bool m_isCurrentGunGameTeamLeader; // 0xF06 - 0xF07
   unsigned char pad_F07[0x1]; // 0xF07 - 0xF08
   float m_flLowerBodyYawTarget; // 0xF08 - 0xF0C
   bool m_bStrafing; // 0xF0C - 0xF0D
   char m_szLastPlaceName[18]; // 0xF0D - 0xF1F
   unsigned char pad_F1F[0x1]; // 0xF1F - 0xF20
   float m_flLastExoJumpTime; // 0xF20 - 0xF24
   unsigned char pad_F24[0xC]; // 0xF24 - 0xF30
   GameTime_t m_flLastSpawnTimeIndex; // 0xF30 - 0xF34
   GameTime_t m_flEmitSoundTime; // 0xF34 - 0xF38
   int32_t m_iAddonBits; // 0xF38 - 0xF3C
   int32_t m_iPrimaryAddon; // 0xF3C - 0xF40
   int32_t m_iSecondaryAddon; // 0xF40 - 0xF44
   int32_t m_iProgressBarDuration; // 0xF44 - 0xF48
   float m_flProgressBarStartTime; // 0xF48 - 0xF4C
   float m_flStamina; // 0xF4C - 0xF50
   int32_t m_iDirection; // 0xF50 - 0xF54
   int32_t m_iShotsFired; // 0xF54 - 0xF58
   bool m_bNightVisionOn; // 0xF58 - 0xF59
   bool m_bHasNightVision; // 0xF59 - 0xF5A
   unsigned char pad_F5A[0x2]; // 0xF5A - 0xF5C
   float m_flVelocityModifier; // 0xF5C - 0xF60
   float m_flGroundAccelLinearFracLastTime; // 0xF60 - 0xF64
   int32_t m_iStartAccount; // 0xF64 - 0xF68
   bool m_bIsSpawnRappelling; // 0xF68 - 0xF69
   unsigned char pad_F69[0x3]; // 0xF69 - 0xF6C
   Vector m_vecSpawnRappellingRopeOrigin; // 0xF6C - 0xF78
   float m_flSpawnRappellingFadeOutForClientViewOffset; // 0xF78 - 0xF7C
   int32_t m_nSurvivalTeam; // 0xF7C - 0xF80
   CHandle< C_CSPlayerPawnBase > m_hSurvivalAssassinationTarget; // 0xF80 - 0xF84
   float m_flHealthShotBoostExpirationTime; // 0xF84 - 0xF88
   float m_flLastKnownParachuteScreenEffectAmount; // 0xF88 - 0xF8C
   Vector m_vecIntroStartEyePosition; // 0xF8C - 0xF98
   Vector m_vecIntroStartPlayerForward; // 0xF98 - 0xFA4
   float m_flClientDeathTime; // 0xFA4 - 0xFA8
   unsigned char pad_FA8[0x8]; // 0xFA8 - 0xFB0
   float m_flNightVisionAlpha; // 0xFB0 - 0xFB4
   bool m_bScreenTearFrameCaptured; // 0xFB4 - 0xFB5
   unsigned char pad_FB5[0x3]; // 0xFB5 - 0xFB8
   float m_flFlashBangTime; // 0xFB8 - 0xFBC
   float m_flFlashScreenshotAlpha; // 0xFBC - 0xFC0
   float m_flFlashOverlayAlpha; // 0xFC0 - 0xFC4
   bool m_bFlashBuildUp; // 0xFC4 - 0xFC5
   bool m_bFlashDspHasBeenCleared; // 0xFC5 - 0xFC6
   bool m_bFlashScreenshotHasBeenGrabbed; // 0xFC6 - 0xFC7
   unsigned char pad_FC7[0x1]; // 0xFC7 - 0xFC8
   float m_flFlashMaxAlpha; // 0xFC8 - 0xFCC
   float m_flFlashDuration; // 0xFCC - 0xFD0
   float m_flLastFiredWeaponTime; // 0xFD0 - 0xFD4
   Vector m_lastStandingPos; // 0xFD4 - 0xFE0
   Vector m_vecLastMuzzleFlashPos; // 0xFE0 - 0xFEC
   QAngle m_angLastMuzzleFlashAngle; // 0xFEC - 0xFF8
   CHandle< C_BaseEntity > m_hMuzzleFlashShape; // 0xFF8 - 0xFFC
   int32_t m_iHealthBarRenderMaskIndex; // 0xFFC - 0x1000
   float m_flHealthFadeValue; // 0x1000 - 0x1004
   float m_flHealthFadeAlpha; // 0x1004 - 0x1008
   int32_t m_nMyCollisionGroup; // 0x1008 - 0x100C
   float m_ignoreLadderJumpTime; // 0x100C - 0x1010
   CountdownTimer m_ladderSurpressionTimer; // 0x1010 - 0x1028
   Vector m_lastLadderNormal; // 0x1028 - 0x1034
   Vector m_lastLadderPos; // 0x1034 - 0x1040
   unsigned char pad_1040[0x8]; // 0x1040 - 0x1048
   float m_flDeathCCWeight; // 0x1048 - 0x104C
   bool m_bOldIsScoped; // 0x104C - 0x104D
   unsigned char pad_104D[0x3]; // 0x104D - 0x1050
   float m_flPrevRoundEndTime; // 0x1050 - 0x1054
   float m_flPrevMatchEndTime; // 0x1054 - 0x1058
   uint16_t m_unCurrentEquipmentValue; // 0x1058 - 0x105A
   uint16_t m_unRoundStartEquipmentValue; // 0x105A - 0x105C
   uint16_t m_unFreezetimeEndEquipmentValue; // 0x105C - 0x105E
   bool m_passiveItems[4]; // 0x105E - 0x1062
   unsigned char pad_1062[0x2]; // 0x1062 - 0x1064
   Vector m_vecThirdPersonViewPositionOverride; // 0x1064 - 0x1070
   int32_t m_nHeavyAssaultSuitCooldownRemaining; // 0x1070 - 0x1074
   int32_t m_ArmorValue; // 0x1074 - 0x1078
   QAngle m_angEyeAngles; // 0x1078 - 0x1084
   unsigned char pad_1084[0xC]; // 0x1084 - 0x1090
   bool m_bInHostageRescueZone; // 0x1090 - 0x1091
   unsigned char pad_1091[0x3]; // 0x1091 - 0x1094
   float m_fNextThinkPushAway; // 0x1094 - 0x1098
   bool m_bShouldAutobuyDMWeapons; // 0x1098 - 0x1099
   bool m_bShouldAutobuyNow; // 0x1099 - 0x109A
   bool m_bHud_MiniScoreHidden; // 0x109A - 0x109B
   bool m_bHud_RadarHidden; // 0x109B - 0x109C
   CEntityIndex m_nLastKillerIndex; // 0x109C - 0x10A0
   int32_t m_nLastConcurrentKilled; // 0x10A0 - 0x10A4
   int32_t m_nDeathCamMusic; // 0x10A4 - 0x10A8
   CEntityIndex m_iIDEntIndex; // 0x10A8 - 0x10AC
   unsigned char pad_10AC[0x4]; // 0x10AC - 0x10B0
   CountdownTimer m_delayTargetIDTimer; // 0x10B0 - 0x10C8
   CEntityIndex m_iTargetedWeaponEntIndex; // 0x10C8 - 0x10CC
   CEntityIndex m_iOldIDEntIndex; // 0x10CC - 0x10D0
   CountdownTimer m_holdTargetIDTimer; // 0x10D0 - 0x10E8
   unsigned char pad_10E8[0x4C]; // 0x10E8 - 0x1134
   float m_flCurrentMusicStartTime; // 0x1134 - 0x1138
   float m_flMusicRoundStartTime; // 0x1138 - 0x113C
   int32_t m_cycleLatch; // 0x113C - 0x1140
   float m_serverIntendedCycle; // 0x1140 - 0x1144
   uint32 m_vecPlayerPatchEconIndices[5]; // 0x1144 - 0x1158
   bool m_bClientEconPatchesNeedUpdate; // 0x1158 - 0x1159
   bool m_bHideTargetID; // 0x1159 - 0x115A
   unsigned char pad_115A[0x2]; // 0x115A - 0x115C
   float m_nextTaserShakeTime; // 0x115C - 0x1160
   float m_firstTaserShakeTime; // 0x1160 - 0x1164
   float m_flLastSmokeOverlayAlpha; // 0x1164 - 0x1168
   Vector m_vLastSmokeOverlayColor; // 0x1168 - 0x1174
   ParticleIndex_t m_nPlayerSmokedFx; // 0x1174 - 0x1178
   float m_flLastKnownAccumulatedWeaponEncumbrance; // 0x1178 - 0x117C
   float m_flLastTimeComputedAccumulatedWeaponEncumbrance; // 0x117C - 0x1180
   float m_flNextMagDropTime; // 0x1180 - 0x1184
   int32_t m_nLastMagDropAttachmentIndex; // 0x1184 - 0x1188
   CUtlVector< C_BulletHitModel* > m_vecBulletHitModels; // 0x1188 - 0x11A0
   CUtlVector< C_PickUpModelSlerper* > m_vecPickupModelSlerpers; // 0x11A0 - 0x11B8
   Vector m_vecLastAliveLocalVelocity; // 0x11B8 - 0x11C4
   float m_flLastNearbyItemHighlightCheck; // 0x11C4 - 0x11C8
   bool m_bInSurvivalDangerZone; // 0x11C8 - 0x11C9
   bool m_bNearDangerZone; // 0x11C9 - 0x11CA
   unsigned char pad_11CA[0x36]; // 0x11CA - 0x1200
   EntitySpottedState_t m_entitySpottedState; // 0x1200 - 0x1218
   float m_flTimeOfLastInjury; // 0x1218 - 0x121C
   RelativeDamagedDirection_t m_nRelativeDirectionOfLastInjury; // 0x121C - 0x1220
   int32_t m_nSurvivalTeamNumber; // 0x1220 - 0x1224
   float m_flNextSprayDecalTime; // 0x1224 - 0x1228
   bool m_bPreviouslyInBuyZone; // 0x1228 - 0x1229
   unsigned char pad_1229[0x3]; // 0x1229 - 0x122C
   uint32_t m_unPreviousWeaponHash; // 0x122C - 0x1230
   uint32_t m_unWeaponHash; // 0x1230 - 0x1234
   bool m_bPrevDefuser; // 0x1234 - 0x1235
   bool m_bPrevHelmet; // 0x1235 - 0x1236
   unsigned char pad_1236[0x2]; // 0x1236 - 0x1238
   int32_t m_nPrevArmorVal; // 0x1238 - 0x123C
   bool m_bGuardianShouldSprayCustomXMark; // 0x123C - 0x123D
   unsigned char pad_123D[0x3]; // 0x123D - 0x1240
   QAngle m_aimPunchAngle; // 0x1240 - 0x124C
   QAngle m_aimPunchAngleVel; // 0x124C - 0x1258
   int32_t m_aimPunchTickBase; // 0x1258 - 0x125C
   float m_aimPunchTickFraction; // 0x125C - 0x1260
   CUtlVector< QAngle > m_aimPunchCache; // 0x1260 - 0x1278
   unsigned char pad_1278[0x8]; // 0x1278 - 0x1280
   float m_flOldFallVelocity; // 0x1280 - 0x1284
   bool m_bHasDeathInfo; // 0x1284 - 0x1285
   unsigned char pad_1285[0x3]; // 0x1285 - 0x1288
   float m_flDeathInfoTime; // 0x1288 - 0x128C
   Vector m_vecDeathInfoOrigin; // 0x128C - 0x1298
   bool m_bKilledByHeadshot; // 0x1298 - 0x1299
   unsigned char pad_1299[0x3]; // 0x1299 - 0x129C
   CHandle< CCSPlayerController > m_hOriginalController; // 0x129C - 0x12A0
   unsigned char pad_12A0[0x10]; // 0x12A0 - 0x12B0
   float m_flLandseconds; // 0x12B0 - 0x12B4
   unsigned char pad_12B4[0x4]; // 0x12B4 - 0x12B8
}; // size - 0x12B8


class SpawnPoint /* "server" */ : public CServerOnlyPointEntity /* "server" */
{
public:
   int32_t m_iPriority; // 0x4A0 - 0x4A4
   bool m_bEnabled; // 0x4A4 - 0x4A5
   unsigned char pad_4A5[0x3]; // 0x4A5 - 0x4A8
   int32_t m_nType; // 0x4A8 - 0x4AC
   unsigned char pad_4AC[0x4]; // 0x4AC - 0x4B0
}; // size - 0x4B0


class CSoundOpvarSetPointBase /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x3]; // 0x4A1 - 0x4A4
   CEntityHandle m_hSource; // 0x4A4 - 0x4A8
   unsigned char pad_4A8[0x8]; // 0x4A8 - 0x4B0
   CUtlSymbolLarge m_iszSourceEntityName; // 0x4B0 - 0x4B8
   unsigned char pad_4B8[0x50]; // 0x4B8 - 0x508
   Vector m_vLastPosition; // 0x508 - 0x514
   unsigned char pad_514[0x4]; // 0x514 - 0x518
   CUtlSymbolLarge m_iszStackName; // 0x518 - 0x520
   CUtlSymbolLarge m_iszOperatorName; // 0x520 - 0x528
   CUtlSymbolLarge m_iszOpvarName; // 0x528 - 0x530
   int32_t m_iOpvarIndex; // 0x530 - 0x534
   bool m_bUseAutoCompare; // 0x534 - 0x535
   unsigned char pad_535[0x3]; // 0x535 - 0x538
}; // size - 0x538


class C_CSGO_MapPreviewCameraPath /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   float m_flZFar; // 0x538 - 0x53C
   float m_flZNear; // 0x53C - 0x540
   bool m_bLoop; // 0x540 - 0x541
   bool m_bVerticalFOV; // 0x541 - 0x542
   bool m_bConstantSpeed; // 0x542 - 0x543
   unsigned char pad_543[0x1]; // 0x543 - 0x544
   float m_flDuration; // 0x544 - 0x548
   unsigned char pad_548[0x40]; // 0x548 - 0x588
   float m_flPathLength; // 0x588 - 0x58C
   float m_flPathDuration; // 0x58C - 0x590
   unsigned char pad_590[0x8]; // 0x590 - 0x598
}; // size - 0x598


class C_SoundOpvarSetPointBase /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   CUtlSymbolLarge m_iszStackName; // 0x538 - 0x540
   CUtlSymbolLarge m_iszOperatorName; // 0x540 - 0x548
   CUtlSymbolLarge m_iszOpvarName; // 0x548 - 0x550
   int32_t m_iOpvarIndex; // 0x550 - 0x554
   bool m_bUseAutoCompare; // 0x554 - 0x555
   unsigned char pad_555[0x3]; // 0x555 - 0x558
}; // size - 0x558


class CAnimParameterBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CAnimGraphSymbolWithStorage m_name; // 0x18 - 0x38
   CUtlString m_group; // 0x38 - 0x40
   AnimParamID m_id; // 0x40 - 0x44
   unsigned char pad_44[0x14]; // 0x44 - 0x58
   CUtlString m_componentName; // 0x58 - 0x60
   unsigned char pad_60[0x4]; // 0x60 - 0x64
   AnimParamButton_t m_previewButton; // 0x64 - 0x68
   bool m_bUseMostRecentValue; // 0x68 - 0x69
   bool m_bAutoReset; // 0x69 - 0x6A
   unsigned char pad_6A[0x2]; // 0x6A - 0x6C
   AnimParamNetworkSetting m_eNetworkSetting; // 0x6C - 0x70
   bool m_bGameWritable; // 0x70 - 0x71
   bool m_bGraphWritable; // 0x71 - 0x72
   bool m_bIsReferenced; // 0x72 - 0x73
   bool m_bNetworkingRequested; // 0x73 - 0x74
   unsigned char pad_74[0x4]; // 0x74 - 0x78
}; // size - 0x78


class CBaseCSGrenadeProjectile /* "server" */ : public CBaseGrenade /* "server" */
{
public:
   Vector m_vInitialVelocity; // 0x958 - 0x964
   int32_t m_nBounces; // 0x964 - 0x968
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_nExplodeEffectIndex; // 0x968 - 0x970
   int32_t m_nExplodeEffectTickBegin; // 0x970 - 0x974
   Vector m_vecExplodeEffectOrigin; // 0x974 - 0x980
   uint8_t m_unOGSExtraFlags; // 0x980 - 0x981
   bool m_bDetonationRecorded; // 0x981 - 0x982
   unsigned char pad_982[0x2]; // 0x982 - 0x984
   GameTime_t m_flDetonateTime; // 0x984 - 0x988
   uint16_t m_nItemIndex; // 0x988 - 0x98A
   unsigned char pad_98A[0x2]; // 0x98A - 0x98C
   Vector m_vecOriginalSpawnLocation; // 0x98C - 0x998
   GameTime_t m_flLastBounceSoundTime; // 0x998 - 0x99C
   unsigned char pad_99C[0x4]; // 0x99C - 0x9A0
}; // size - 0x9A0


class CEnvSoundscape /* "server" */ : public CServerOnlyEntity /* "server" */
{
public:
   CEntityIOOutput m_OnPlay; // 0x4A0 - 0x4C8
   float m_flRadius; // 0x4C8 - 0x4CC
   unsigned char pad_4CC[0x4]; // 0x4CC - 0x4D0
   CUtlSymbolLarge m_soundscapeName; // 0x4D0 - 0x4D8
   CUtlSymbolLarge m_soundEventName; // 0x4D8 - 0x4E0
   bool m_bOverrideWithEvent; // 0x4E0 - 0x4E1
   unsigned char pad_4E1[0x3]; // 0x4E1 - 0x4E4
   int32_t m_soundscapeIndex; // 0x4E4 - 0x4E8
   int32_t m_soundscapeEntityListId; // 0x4E8 - 0x4EC
   uint32_t m_soundEventHash; // 0x4EC - 0x4F0
   CUtlSymbolLarge m_positionNames[8]; // 0x4F0 - 0x530
   CHandle< CEnvSoundscape > m_hProxySoundscape; // 0x530 - 0x534
   bool m_bDisabled; // 0x534 - 0x535
   unsigned char pad_535[0x3]; // 0x535 - 0x538
}; // size - 0x538


class CModelPointEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_0[0x6F0]; // 0x0 - 0x6F0
}; // size - 0x6F0


class CTriggerMultiple /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   CEntityIOOutput m_OnTrigger; // 0x898 - 0x8C0
}; // size - 0x8C0


class C_BaseTrigger /* "client" */ : public C_BaseToggle /* "client" */
{
public:
   bool m_bDisabled; // 0x838 - 0x839
   bool m_bClientSidePredicted; // 0x839 - 0x83A
   unsigned char pad_83A[0x6]; // 0x83A - 0x840
}; // size - 0x840


class MaterialParam_t /* "materialsystem2" */
{
public:
   CUtlString m_name; // 0x0 - 0x8
}; // size - 0x8


class CGameRules /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   char m_szQuestName[128]; // 0x8 - 0x88
   int32_t m_nQuestPhase; // 0x88 - 0x8C
   unsigned char pad_8C[0x4]; // 0x8C - 0x90
}; // size - 0x90


class C_GameRules /* "client" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class C_INIT_RemapParticleCountToScalar /* "particles" */ : public CParticleFunctionInitializer /* "particles" */
{
public:
   ParticleAttributeIndex_t m_nFieldOutput; // 0x220 - 0x224
   int32_t m_nInputMin; // 0x224 - 0x228
   int32_t m_nInputMax; // 0x228 - 0x22C
   int32_t m_nScaleControlPoint; // 0x22C - 0x230
   int32_t m_nScaleControlPointField; // 0x230 - 0x234
   float m_flOutputMin; // 0x234 - 0x238
   float m_flOutputMax; // 0x238 - 0x23C
   ParticleSetMethod_t m_nSetMethod; // 0x23C - 0x240
   bool m_bActiveRange; // 0x240 - 0x241
   bool m_bInvert; // 0x241 - 0x242
   bool m_bWrap; // 0x242 - 0x243
   unsigned char pad_243[0x1]; // 0x243 - 0x244
   float m_flRemapBias; // 0x244 - 0x248
   unsigned char pad_248[0x8]; // 0x248 - 0x250
}; // size - 0x250


class CAnimMotorBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlString m_name; // 0x18 - 0x20
   bool m_bDefault; // 0x20 - 0x21
   unsigned char pad_21[0x7]; // 0x21 - 0x28
}; // size - 0x28


class CAnimMotorUpdaterBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlString m_name; // 0x10 - 0x18
   bool m_bDefault; // 0x18 - 0x19
   unsigned char pad_19[0x7]; // 0x19 - 0x20
}; // size - 0x20


class CAnimationGraphVisualizerPrimitiveBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CAnimationGraphVisualizerPrimitiveType m_Type; // 0x8 - 0xC
   AnimNodeID m_OwningAnimNodePaths[11]; // 0xC - 0x38
   int32_t m_nOwningAnimNodePathCount; // 0x38 - 0x3C
   unsigned char pad_3C[0x4]; // 0x3C - 0x40
}; // size - 0x40


class CBaseClientUIEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bEnabled; // 0x6F0 - 0x6F1
   unsigned char pad_6F1[0x7]; // 0x6F1 - 0x6F8
   CUtlSymbolLarge m_DialogXMLName; // 0x6F8 - 0x700
   CUtlSymbolLarge m_PanelClassName; // 0x700 - 0x708
   CUtlSymbolLarge m_PanelID; // 0x708 - 0x710
   CEntityIOOutput m_CustomOutput0; // 0x710 - 0x738
   CEntityIOOutput m_CustomOutput1; // 0x738 - 0x760
   CEntityIOOutput m_CustomOutput2; // 0x760 - 0x788
   CEntityIOOutput m_CustomOutput3; // 0x788 - 0x7B0
   CEntityIOOutput m_CustomOutput4; // 0x7B0 - 0x7D8
   CEntityIOOutput m_CustomOutput5; // 0x7D8 - 0x800
   CEntityIOOutput m_CustomOutput6; // 0x800 - 0x828
   CEntityIOOutput m_CustomOutput7; // 0x828 - 0x850
   CEntityIOOutput m_CustomOutput8; // 0x850 - 0x878
   CEntityIOOutput m_CustomOutput9; // 0x878 - 0x8A0
}; // size - 0x8A0


class CBodyComponent /* "client" */ : public CEntityComponent /* "client" */
{
public:
   CGameSceneNode* m_pSceneNode; // 0x8 - 0x10
   unsigned char pad_10[0x10]; // 0x10 - 0x20
   CNetworkVarChainer __m_pChainEntity; // 0x20 - 0x48
   unsigned char pad_48[0x8]; // 0x48 - 0x50
}; // size - 0x50


class CBodyComponent /* "server" */ : public CEntityComponent /* "server" */
{
public:
   CGameSceneNode* m_pSceneNode; // 0x8 - 0x10
   unsigned char pad_10[0x10]; // 0x10 - 0x20
   CNetworkVarChainer __m_pChainEntity; // 0x20 - 0x48
   unsigned char pad_48[0x8]; // 0x48 - 0x50
}; // size - 0x50


class CPulseCell_BaseValue /* "pulse_runtime_lib" */ : public CPulseCell_Base /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x48]; // 0x0 - 0x48
}; // size - 0x48


class C_DynamicProp /* "client" */ : public C_BreakableProp /* "client" */
{
public:
   bool m_bUseHitboxesForRenderBox; // 0xAE8 - 0xAE9
   bool m_bUseAnimGraph; // 0xAE9 - 0xAEA
   unsigned char pad_AEA[0x6]; // 0xAEA - 0xAF0
   CEntityIOOutput m_pOutputAnimBegun; // 0xAF0 - 0xB18
   CEntityIOOutput m_pOutputAnimOver; // 0xB18 - 0xB40
   CEntityIOOutput m_pOutputAnimLoopCycleOver; // 0xB40 - 0xB68
   CEntityIOOutput m_OnAnimReachedStart; // 0xB68 - 0xB90
   CEntityIOOutput m_OnAnimReachedEnd; // 0xB90 - 0xBB8
   CUtlSymbolLarge m_iszDefaultAnim; // 0xBB8 - 0xBC0
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0xBC0 - 0xBC4
   bool m_bAnimateOnServer; // 0xBC4 - 0xBC5
   bool m_bRandomizeCycle; // 0xBC5 - 0xBC6
   bool m_bStartDisabled; // 0xBC6 - 0xBC7
   bool m_bScriptedMovement; // 0xBC7 - 0xBC8
   bool m_bFiredStartEndOutput; // 0xBC8 - 0xBC9
   bool m_bForceNpcExclude; // 0xBC9 - 0xBCA
   bool m_bCreateNonSolid; // 0xBCA - 0xBCB
   bool m_bIsOverrideProp; // 0xBCB - 0xBCC
   int32_t m_iInitialGlowState; // 0xBCC - 0xBD0
   int32_t m_nGlowRange; // 0xBD0 - 0xBD4
   int32_t m_nGlowRangeMin; // 0xBD4 - 0xBD8
   Color m_glowColor; // 0xBD8 - 0xBDC
   int32_t m_nGlowTeam; // 0xBDC - 0xBE0
   int32_t m_iCachedFrameCount; // 0xBE0 - 0xBE4
   Vector m_vecCachedRenderMins; // 0xBE4 - 0xBF0
   Vector m_vecCachedRenderMaxs; // 0xBF0 - 0xBFC
   unsigned char pad_BFC[0x4]; // 0xBFC - 0xC00
}; // size - 0xC00


class CBasePropDoor /* "server" */ : public CDynamicProp /* "server" */
{
public:
   unsigned char pad_A98[0x10]; // 0xA98 - 0xAA8
   float m_flAutoReturnDelay; // 0xAA8 - 0xAAC
   unsigned char pad_AAC[0x4]; // 0xAAC - 0xAB0
   CUtlVector< CHandle< CBasePropDoor > > m_hDoorList; // 0xAB0 - 0xAC8
   int32_t m_nHardwareType; // 0xAC8 - 0xACC
   bool m_bNeedsHardware; // 0xACC - 0xACD
   unsigned char pad_ACD[0x3]; // 0xACD - 0xAD0
   DoorState_t m_eDoorState; // 0xAD0 - 0xAD4
   bool m_bLocked; // 0xAD4 - 0xAD5
   unsigned char pad_AD5[0x3]; // 0xAD5 - 0xAD8
   Vector m_closedPosition; // 0xAD8 - 0xAE4
   QAngle m_closedAngles; // 0xAE4 - 0xAF0
   CHandle< CBaseEntity > m_hBlocker; // 0xAF0 - 0xAF4
   bool m_bFirstBlocked; // 0xAF4 - 0xAF5
   unsigned char pad_AF5[0x3]; // 0xAF5 - 0xAF8
   locksound_t m_ls; // 0xAF8 - 0xB18
   bool m_bForceClosed; // 0xB18 - 0xB19
   unsigned char pad_B19[0x3]; // 0xB19 - 0xB1C
   Vector m_vecLatchWorldPosition; // 0xB1C - 0xB28
   CHandle< CBaseEntity > m_hActivator; // 0xB28 - 0xB2C
   unsigned char pad_B2C[0x8]; // 0xB2C - 0xB34
   uint32_t m_sndParamAngularSpeed; // 0xB34 - 0xB38
   CUtlSymbolLarge m_SoundMoving; // 0xB38 - 0xB40
   CUtlSymbolLarge m_SoundOpen; // 0xB40 - 0xB48
   CUtlSymbolLarge m_SoundClose; // 0xB48 - 0xB50
   CUtlSymbolLarge m_SoundLock; // 0xB50 - 0xB58
   CUtlSymbolLarge m_SoundUnlock; // 0xB58 - 0xB60
   CUtlSymbolLarge m_SoundLatch; // 0xB60 - 0xB68
   CUtlSymbolLarge m_SoundPound; // 0xB68 - 0xB70
   CUtlSymbolLarge m_SoundJiggle; // 0xB70 - 0xB78
   CUtlSymbolLarge m_SoundLockedAnim; // 0xB78 - 0xB80
   int32_t m_numCloseAttempts; // 0xB80 - 0xB84
   CUtlStringToken m_nPhysicsMaterial; // 0xB84 - 0xB88
   CUtlSymbolLarge m_SlaveName; // 0xB88 - 0xB90
   CHandle< CBasePropDoor > m_hMaster; // 0xB90 - 0xB94
   unsigned char pad_B94[0x4]; // 0xB94 - 0xB98
   CEntityIOOutput m_OnBlockedClosing; // 0xB98 - 0xBC0
   CEntityIOOutput m_OnBlockedOpening; // 0xBC0 - 0xBE8
   CEntityIOOutput m_OnUnblockedClosing; // 0xBE8 - 0xC10
   CEntityIOOutput m_OnUnblockedOpening; // 0xC10 - 0xC38
   CEntityIOOutput m_OnFullyClosed; // 0xC38 - 0xC60
   CEntityIOOutput m_OnFullyOpen; // 0xC60 - 0xC88
   CEntityIOOutput m_OnClose; // 0xC88 - 0xCB0
   CEntityIOOutput m_OnOpen; // 0xCB0 - 0xCD8
   CEntityIOOutput m_OnLockedUse; // 0xCD8 - 0xD00
   CEntityIOOutput m_OnAjarOpen; // 0xD00 - 0xD28
}; // size - 0xD28


class CBasePulseGraphInstance /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0xD0]; // 0x0 - 0xD0
}; // size - 0xD0


class CBaseRendererSource2 /* "particles" */ : public CParticleFunctionRenderer /* "particles" */
{
public:
   CParticleCollectionRendererFloatInput m_flRadiusScale; // 0x260 - 0x3A0
   CParticleCollectionRendererFloatInput m_flAlphaScale; // 0x3A0 - 0x4E0
   CParticleCollectionRendererFloatInput m_flRollScale; // 0x4E0 - 0x620
   ParticleAttributeIndex_t m_nAlpha2Field; // 0x620 - 0x624
   unsigned char pad_624[0x4]; // 0x624 - 0x628
   CParticleCollectionRendererVecInput m_vecColorScale; // 0x628 - 0xC10
   ParticleColorBlendType_t m_nColorBlendType; // 0xC10 - 0xC14
   SpriteCardShaderType_t m_nShaderType; // 0xC14 - 0xC18
   CUtlString m_strShaderOverride; // 0xC18 - 0xC20
   CParticleCollectionRendererFloatInput m_flCenterXOffset; // 0xC20 - 0xD60
   CParticleCollectionRendererFloatInput m_flCenterYOffset; // 0xD60 - 0xEA0
   float m_flBumpStrength; // 0xEA0 - 0xEA4
   ParticleSequenceCropOverride_t m_nCropTextureOverride; // 0xEA4 - 0xEA8
   CUtlVector< TextureGroup_t > m_vecTexturesInput; // 0xEA8 - 0xEC0
   float m_flAnimationRate; // 0xEC0 - 0xEC4
   AnimationType_t m_nAnimationType; // 0xEC4 - 0xEC8
   bool m_bAnimateInFPS; // 0xEC8 - 0xEC9
   unsigned char pad_EC9[0x7]; // 0xEC9 - 0xED0
   CParticleCollectionRendererFloatInput m_flSelfIllumAmount; // 0xED0 - 0x1010
   CParticleCollectionRendererFloatInput m_flDiffuseAmount; // 0x1010 - 0x1150
   int32_t m_nLightingControlPoint; // 0x1150 - 0x1154
   ParticleAttributeIndex_t m_nSelfIllumPerParticle; // 0x1154 - 0x1158
   ParticleOutputBlendMode_t m_nOutputBlendMode; // 0x1158 - 0x115C
   bool m_bGammaCorrectVertexColors; // 0x115C - 0x115D
   bool m_bSaturateColorPreAlphaBlend; // 0x115D - 0x115E
   unsigned char pad_115E[0x2]; // 0x115E - 0x1160
   CParticleCollectionRendererFloatInput m_flAddSelfAmount; // 0x1160 - 0x12A0
   CParticleCollectionRendererFloatInput m_flDesaturation; // 0x12A0 - 0x13E0
   CParticleCollectionRendererFloatInput m_flOverbrightFactor; // 0x13E0 - 0x1520
   int32_t m_nHSVShiftControlPoint; // 0x1520 - 0x1524
   ParticleFogType_t m_nFogType; // 0x1524 - 0x1528
   CParticleCollectionRendererFloatInput m_flFogAmount; // 0x1528 - 0x1668
   bool m_bTintByFOW; // 0x1668 - 0x1669
   bool m_bTintByGlobalLight; // 0x1669 - 0x166A
   unsigned char pad_166A[0x2]; // 0x166A - 0x166C
   SpriteCardPerParticleScale_t m_nPerParticleAlphaReference; // 0x166C - 0x1670
   SpriteCardPerParticleScale_t m_nPerParticleAlphaRefWindow; // 0x1670 - 0x1674
   ParticleAlphaReferenceType_t m_nAlphaReferenceType; // 0x1674 - 0x1678
   CParticleCollectionRendererFloatInput m_flAlphaReferenceSoftness; // 0x1678 - 0x17B8
   CParticleCollectionRendererFloatInput m_flSourceAlphaValueToMapToZero; // 0x17B8 - 0x18F8
   CParticleCollectionRendererFloatInput m_flSourceAlphaValueToMapToOne; // 0x18F8 - 0x1A38
   bool m_bRefract; // 0x1A38 - 0x1A39
   bool m_bRefractSolid; // 0x1A39 - 0x1A3A
   unsigned char pad_1A3A[0x6]; // 0x1A3A - 0x1A40
   CParticleCollectionRendererFloatInput m_flRefractAmount; // 0x1A40 - 0x1B80
   int32_t m_nRefractBlurRadius; // 0x1B80 - 0x1B84
   BlurFilterType_t m_nRefractBlurType; // 0x1B84 - 0x1B88
   bool m_bOnlyRenderInEffectsBloomPass; // 0x1B88 - 0x1B89
   bool m_bOnlyRenderInEffectsWaterPass; // 0x1B89 - 0x1B8A
   bool m_bUseMixedResolutionRendering; // 0x1B8A - 0x1B8B
   bool m_bOnlyRenderInEffecsGameOverlay; // 0x1B8B - 0x1B8C
   char m_stencilTestID[128]; // 0x1B8C - 0x1C0C
   bool m_bStencilTestExclude; // 0x1C0C - 0x1C0D
   char m_stencilWriteID[128]; // 0x1C0D - 0x1C8D
   bool m_bWriteStencilOnDepthPass; // 0x1C8D - 0x1C8E
   bool m_bWriteStencilOnDepthFail; // 0x1C8E - 0x1C8F
   bool m_bReverseZBuffering; // 0x1C8F - 0x1C90
   bool m_bDisableZBuffering; // 0x1C90 - 0x1C91
   unsigned char pad_1C91[0x3]; // 0x1C91 - 0x1C94
   ParticleDepthFeatheringMode_t m_nFeatheringMode; // 0x1C94 - 0x1C98
   CParticleCollectionRendererFloatInput m_flFeatheringMinDist; // 0x1C98 - 0x1DD8
   CParticleCollectionRendererFloatInput m_flFeatheringMaxDist; // 0x1DD8 - 0x1F18
   CParticleCollectionRendererFloatInput m_flFeatheringFilter; // 0x1F18 - 0x2058
   float m_flDepthBias; // 0x2058 - 0x205C
   ParticleSortingChoiceList_t m_nSortMethod; // 0x205C - 0x2060
   bool m_bBlendFramesSeq0; // 0x2060 - 0x2061
   bool m_bMaxLuminanceBlendingSequence0; // 0x2061 - 0x2062
   unsigned char pad_2062[0x20E]; // 0x2062 - 0x2270
}; // size - 0x2270


class CFuncPlat /* "server" */ : public CBasePlatTrain /* "server" */
{
public:
   CUtlSymbolLarge m_sNoise; // 0x798 - 0x7A0
}; // size - 0x7A0


class CLightEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   CLightComponent* m_CLightComponent; // 0x6F0 - 0x6F8
}; // size - 0x6F8


class CMarkupVolumeTagged /* "server" */ : public CMarkupVolume /* "server" */
{
public:
   unsigned char pad_6F8[0x30]; // 0x6F8 - 0x728
   bool m_bIsGroup; // 0x728 - 0x729
   bool m_bGroupByPrefab; // 0x729 - 0x72A
   bool m_bGroupByVolume; // 0x72A - 0x72B
   bool m_bGroupOtherGroups; // 0x72B - 0x72C
   bool m_bIsInGroup; // 0x72C - 0x72D
   unsigned char pad_72D[0x3]; // 0x72D - 0x730
}; // size - 0x730


class CParticleFloatInput /* "particleslib" */
{
public:
   ParticleFloatType_t m_nType; // 0x0 - 0x4
   ParticleFloatMapType_t m_nMapType; // 0x4 - 0x8
   float m_flLiteralValue; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
   CKV3MemberNameWithStorage m_NamedValue; // 0x10 - 0x48
   int32_t m_nControlPoint; // 0x48 - 0x4C
   ParticleAttributeIndex_t m_nScalarAttribute; // 0x4C - 0x50
   ParticleAttributeIndex_t m_nVectorAttribute; // 0x50 - 0x54
   int32_t m_nVectorComponent; // 0x54 - 0x58
   float m_flRandomMin; // 0x58 - 0x5C
   float m_flRandomMax; // 0x5C - 0x60
   bool m_bHasRandomSignFlip; // 0x60 - 0x61
   unsigned char pad_61[0x3]; // 0x61 - 0x64
   ParticleFloatRandomMode_t m_nRandomMode; // 0x64 - 0x68
   unsigned char pad_68[0x4]; // 0x68 - 0x6C
   float m_flLOD0; // 0x6C - 0x70
   float m_flLOD1; // 0x70 - 0x74
   float m_flLOD2; // 0x74 - 0x78
   float m_flLOD3; // 0x78 - 0x7C
   ParticleAttributeIndex_t m_nNoiseInputVectorAttribute; // 0x7C - 0x80
   float m_flNoiseOutputMin; // 0x80 - 0x84
   float m_flNoiseOutputMax; // 0x84 - 0x88
   float m_flNoiseScale; // 0x88 - 0x8C
   Vector m_vecNoiseOffsetRate; // 0x8C - 0x98
   float m_flNoiseOffset; // 0x98 - 0x9C
   int32_t m_nNoiseOctaves; // 0x9C - 0xA0
   PFNoiseTurbulence_t m_nNoiseTurbulence; // 0xA0 - 0xA4
   PFNoiseType_t m_nNoiseType; // 0xA4 - 0xA8
   PFNoiseModifier_t m_nNoiseModifier; // 0xA8 - 0xAC
   float m_flNoiseTurbulenceScale; // 0xAC - 0xB0
   float m_flNoiseTurbulenceMix; // 0xB0 - 0xB4
   float m_flNoiseImgPreviewScale; // 0xB4 - 0xB8
   bool m_bNoiseImgPreviewLive; // 0xB8 - 0xB9
   unsigned char pad_B9[0x8]; // 0xB9 - 0xC1
   bool m_bUseBoundsCenter; // 0xC1 - 0xC2
   unsigned char pad_C2[0x2]; // 0xC2 - 0xC4
   ParticleFloatInputMode_t m_nInputMode; // 0xC4 - 0xC8
   float m_flMultFactor; // 0xC8 - 0xCC
   float m_flInput0; // 0xCC - 0xD0
   float m_flInput1; // 0xD0 - 0xD4
   float m_flOutput0; // 0xD4 - 0xD8
   float m_flOutput1; // 0xD8 - 0xDC
   float m_flNotchedRangeMin; // 0xDC - 0xE0
   float m_flNotchedRangeMax; // 0xE0 - 0xE4
   float m_flNotchedOutputOutside; // 0xE4 - 0xE8
   float m_flNotchedOutputInside; // 0xE8 - 0xEC
   ParticleFloatBiasType_t m_nBiasType; // 0xEC - 0xF0
   float m_flBiasParameter; // 0xF0 - 0xF4
   unsigned char pad_F4[0x4]; // 0xF4 - 0xF8
   CPiecewiseCurve m_Curve; // 0xF8 - 0x138
   unsigned char pad_138[0x8]; // 0x138 - 0x140
}; // size - 0x140


class C_LightEntity /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   CLightComponent* m_CLightComponent; // 0x838 - 0x840
}; // size - 0x840


class CAnimActionBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
}; // size - 0x28


class CAnimActionUpdater /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
}; // size - 0x18


class CBasePlayerPawn /* "server" */ : public CBaseCombatCharacter /* "server" */
{
public:
   CPlayer_WeaponServices* m_pWeaponServices; // 0x968 - 0x970
   CPlayer_ItemServices* m_pItemServices; // 0x970 - 0x978
   CPlayer_AutoaimServices* m_pAutoaimServices; // 0x978 - 0x980
   CPlayer_ObserverServices* m_pObserverServices; // 0x980 - 0x988
   CPlayer_WaterServices* m_pWaterServices; // 0x988 - 0x990
   CPlayer_UseServices* m_pUseServices; // 0x990 - 0x998
   CPlayer_FlashlightServices* m_pFlashlightServices; // 0x998 - 0x9A0
   CPlayer_CameraServices* m_pCameraServices; // 0x9A0 - 0x9A8
   CPlayer_MovementServices* m_pMovementServices; // 0x9A8 - 0x9B0
   unsigned char pad_9B0[0x8]; // 0x9B0 - 0x9B8
   FixAngleSet_t m_fixAngleChangeType; // 0x9B8 - 0x9B9
   unsigned char pad_9B9[0x3]; // 0x9B9 - 0x9BC
   QAngle m_fixAngleChangeAngle; // 0x9BC - 0x9C8
   int32_t m_fixAngleChangeTick; // 0x9C8 - 0x9CC
   QAngle v_angle; // 0x9CC - 0x9D8
   uint32_t m_iHideHUD; // 0x9D8 - 0x9DC
   unsigned char pad_9DC[0x4]; // 0x9DC - 0x9E0
   sky3dparams_t m_skybox3d; // 0x9E0 - 0xA70
   GameTime_t m_fTimeLastHurt; // 0xA70 - 0xA74
   GameTime_t m_flDeathTime; // 0xA74 - 0xA78
   GameTime_t m_fNextSuicideTime; // 0xA78 - 0xA7C
   bool m_fInitHUD; // 0xA7C - 0xA7D
   unsigned char pad_A7D[0x3]; // 0xA7D - 0xA80
   CAI_Expresser* m_pExpresser; // 0xA80 - 0xA88
   CHandle< CBasePlayerController > m_hController; // 0xA88 - 0xA8C
   unsigned char pad_A8C[0x4]; // 0xA8C - 0xA90
   float m_fHltvReplayDelay; // 0xA90 - 0xA94
   float m_fHltvReplayEnd; // 0xA94 - 0xA98
   CEntityIndex m_iHltvReplayEntity; // 0xA98 - 0xA9C
   unsigned char pad_A9C[0x4]; // 0xA9C - 0xAA0
}; // size - 0xAA0


class CParticleFunctionEmitter /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   int32_t m_nEmitterIndex; // 0x210 - 0x214
   unsigned char pad_214[0xC]; // 0x214 - 0x220
}; // size - 0x220


class CPulseCell_Inflow_BaseEntrypoint /* "pulse_runtime_lib" */ : public CPulseCell_BaseFlow /* "pulse_runtime_lib" */
{
public:
   PulseRuntimeChunkIndex_t m_EntryChunk; // 0x48 - 0x4C
   unsigned char pad_4C[0x4]; // 0x4C - 0x50
   PulseRegisterMap_t m_RegisterMap; // 0x50 - 0x70
}; // size - 0x70


class CSprite /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hSpriteMaterial; // 0x6F0 - 0x6F8
   CHandle< CBaseEntity > m_hAttachedToEntity; // 0x6F8 - 0x6FC
   AttachmentHandle_t m_nAttachment; // 0x6FC - 0x6FD
   unsigned char pad_6FD[0x3]; // 0x6FD - 0x700
   float m_flSpriteFramerate; // 0x700 - 0x704
   float m_flFrame; // 0x704 - 0x708
   GameTime_t m_flDieTime; // 0x708 - 0x70C
   unsigned char pad_70C[0xC]; // 0x70C - 0x718
   uint32_t m_nBrightness; // 0x718 - 0x71C
   float m_flBrightnessDuration; // 0x71C - 0x720
   float m_flSpriteScale; // 0x720 - 0x724
   float m_flScaleDuration; // 0x724 - 0x728
   bool m_bWorldSpaceScale; // 0x728 - 0x729
   unsigned char pad_729[0x3]; // 0x729 - 0x72C
   float m_flGlowProxySize; // 0x72C - 0x730
   float m_flHDRColorScale; // 0x730 - 0x734
   GameTime_t m_flLastTime; // 0x734 - 0x738
   float m_flMaxFrame; // 0x738 - 0x73C
   float m_flStartScale; // 0x73C - 0x740
   float m_flDestScale; // 0x740 - 0x744
   GameTime_t m_flScaleTimeStart; // 0x744 - 0x748
   int32_t m_nStartBrightness; // 0x748 - 0x74C
   int32_t m_nDestBrightness; // 0x74C - 0x750
   GameTime_t m_flBrightnessTimeStart; // 0x750 - 0x754
   int32_t m_nSpriteWidth; // 0x754 - 0x758
   int32_t m_nSpriteHeight; // 0x758 - 0x75C
   unsigned char pad_75C[0x4]; // 0x75C - 0x760
}; // size - 0x760


class C_BaseCSGrenadeProjectile /* "client" */ : public C_BaseGrenade /* "client" */
{
public:
   Vector m_vInitialVelocity; // 0xB78 - 0xB84
   int32_t m_nBounces; // 0xB84 - 0xB88
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_nExplodeEffectIndex; // 0xB88 - 0xB90
   int32_t m_nExplodeEffectTickBegin; // 0xB90 - 0xB94
   Vector m_vecExplodeEffectOrigin; // 0xB94 - 0xBA0
   GameTime_t m_flSpawnTime; // 0xBA0 - 0xBA4
   Vector vecLastTrailLinePos; // 0xBA4 - 0xBB0
   GameTime_t flNextTrailLineTime; // 0xBB0 - 0xBB4
   bool m_bExplodeEffectBegan; // 0xBB4 - 0xBB5
   bool m_bCanCreateGrenadeTrail; // 0xBB5 - 0xBB6
   unsigned char pad_BB6[0x2]; // 0xBB6 - 0xBB8
   ParticleIndex_t m_nSnapshotTrajectoryEffectIndex; // 0xBB8 - 0xBBC
   unsigned char pad_BBC[0x4]; // 0xBBC - 0xBC0
   CStrongHandle< InfoForResourceTypeIParticleSnapshot > m_hSnapshotTrajectoryParticleSnapshot; // 0xBC0 - 0xBC8
   CUtlVector< Vector > m_arrTrajectoryTrailPoints; // 0xBC8 - 0xBE0
   CUtlVector< float32 > m_arrTrajectoryTrailPointCreationTimes; // 0xBE0 - 0xBF8
   float m_flTrajectoryTrailEffectCreationTime; // 0xBF8 - 0xBFC
   unsigned char pad_BFC[0x4]; // 0xBFC - 0xC00
}; // size - 0xC00


class C_CSGO_TeamPreviewCamera /* "client" */ : public C_CSGO_MapPreviewCameraPath /* "client" */
{
public:
   bool m_bDofEnabled; // 0x598 - 0x599
   unsigned char pad_599[0x3]; // 0x599 - 0x59C
   float m_flDofNearBlurry; // 0x59C - 0x5A0
   float m_flDofNearCrisp; // 0x5A0 - 0x5A4
   float m_flDofFarCrisp; // 0x5A4 - 0x5A8
   float m_flDofFarBlurry; // 0x5A8 - 0x5AC
   float m_flDofTiltToGround; // 0x5AC - 0x5B0
}; // size - 0x5B0


class C_CSPlayerPawn /* "client" */ : public C_CSPlayerPawnBase /* "client" */
{
public:
   CCSPlayer_BulletServices* m_pBulletServices; // 0x12B8 - 0x12C0
   CCSPlayer_HostageServices* m_pHostageServices; // 0x12C0 - 0x12C8
   CCSPlayer_GlowServices* m_pGlowServices; // 0x12C8 - 0x12D0
   bool m_bIsBuyMenuOpen; // 0x12D0 - 0x12D1
   unsigned char pad_12D1[0xCF]; // 0x12D1 - 0x13A0
   int32_t m_iRetakesOffering; // 0x13A0 - 0x13A4
   int32_t m_iRetakesOfferingCard; // 0x13A4 - 0x13A8
   bool m_bRetakesHasDefuseKit; // 0x13A8 - 0x13A9
   bool m_bRetakesMVPLastRound; // 0x13A9 - 0x13AA
   unsigned char pad_13AA[0x2]; // 0x13AA - 0x13AC
   int32_t m_iRetakesMVPBoostItem; // 0x13AC - 0x13B0
   loadout_positions_t m_RetakesMVPBoostExtraUtility; // 0x13B0 - 0x13B4
   unsigned char pad_13B4[0x10]; // 0x13B4 - 0x13C4
   bool m_bNeedToReApplyGloves; // 0x13C4 - 0x13C5
   unsigned char pad_13C5[0x3]; // 0x13C5 - 0x13C8
   C_EconItemView m_EconGloves; // 0x13C8 - 0x1810
   bool m_bMustSyncRagdollState; // 0x1810 - 0x1811
   unsigned char pad_1811[0x3]; // 0x1811 - 0x1814
   int32_t m_nRagdollDamageBone; // 0x1814 - 0x1818
   Vector m_vRagdollDamageForce; // 0x1818 - 0x1824
   Vector m_vRagdollDamagePosition; // 0x1824 - 0x1830
   char m_szRagdollDamageWeaponName[64]; // 0x1830 - 0x1870
   bool m_bRagdollDamageHeadshot; // 0x1870 - 0x1871
   unsigned char pad_1871[0x127]; // 0x1871 - 0x1998
   bool m_bLastHeadBoneTransformIsValid; // 0x1998 - 0x1999
   unsigned char pad_1999[0x1B]; // 0x1999 - 0x19B4
   QAngle m_qDeathEyeAngles; // 0x19B4 - 0x19C0
}; // size - 0x19C0


class C_PhysicsPropMultiplayer /* "client" */ : public C_PhysicsProp /* "client" */
{
public:
   unsigned char pad_0[0xAF0]; // 0x0 - 0xAF0
}; // size - 0xAF0


class RnShapeDesc_t /* "physicslib" */
{
public:
   uint32_t m_nCollisionAttributeIndex; // 0x0 - 0x4
   uint32_t m_nSurfacePropertyIndex; // 0x4 - 0x8
   CUtlString m_UserFriendlyName; // 0x8 - 0x10
}; // size - 0x10


class CBaseButton /* "server" */ : public CBaseToggle /* "server" */
{
public:
   QAngle m_angMoveEntitySpace; // 0x770 - 0x77C
   bool m_fStayPushed; // 0x77C - 0x77D
   bool m_fRotating; // 0x77D - 0x77E
   unsigned char pad_77E[0x2]; // 0x77E - 0x780
   locksound_t m_ls; // 0x780 - 0x7A0
   CUtlSymbolLarge m_sUseSound; // 0x7A0 - 0x7A8
   CUtlSymbolLarge m_sLockedSound; // 0x7A8 - 0x7B0
   CUtlSymbolLarge m_sUnlockedSound; // 0x7B0 - 0x7B8
   bool m_bLocked; // 0x7B8 - 0x7B9
   bool m_bDisabled; // 0x7B9 - 0x7BA
   unsigned char pad_7BA[0x2]; // 0x7BA - 0x7BC
   GameTime_t m_flUseLockedTime; // 0x7BC - 0x7C0
   bool m_bSolidBsp; // 0x7C0 - 0x7C1
   unsigned char pad_7C1[0x7]; // 0x7C1 - 0x7C8
   CEntityIOOutput m_OnDamaged; // 0x7C8 - 0x7F0
   CEntityIOOutput m_OnPressed; // 0x7F0 - 0x818
   CEntityIOOutput m_OnUseLocked; // 0x818 - 0x840
   CEntityIOOutput m_OnIn; // 0x840 - 0x868
   CEntityIOOutput m_OnOut; // 0x868 - 0x890
   int32_t m_nState; // 0x890 - 0x894
   CEntityHandle m_hConstraint; // 0x894 - 0x898
   CEntityHandle m_hConstraintParent; // 0x898 - 0x89C
   bool m_bForceNpcExclude; // 0x89C - 0x89D
   unsigned char pad_89D[0x3]; // 0x89D - 0x8A0
   CUtlSymbolLarge m_sGlowEntity; // 0x8A0 - 0x8A8
   CHandle< CBaseModelEntity > m_glowEntity; // 0x8A8 - 0x8AC
   bool m_usable; // 0x8AC - 0x8AD
   unsigned char pad_8AD[0x3]; // 0x8AD - 0x8B0
   CUtlSymbolLarge m_szDisplayText; // 0x8B0 - 0x8B8
}; // size - 0x8B8


class CParticleVecInput /* "particleslib" */
{
public:
   ParticleVecType_t m_nType; // 0x0 - 0x4
   Vector m_vLiteralValue; // 0x4 - 0x10
   Color m_LiteralColor; // 0x10 - 0x14
   unsigned char pad_14[0x4]; // 0x14 - 0x18
   CKV3MemberNameWithStorage m_NamedValue; // 0x18 - 0x50
   bool m_bFollowNamedValue; // 0x50 - 0x51
   unsigned char pad_51[0x3]; // 0x51 - 0x54
   ParticleAttributeIndex_t m_nVectorAttribute; // 0x54 - 0x58
   Vector m_vVectorAttributeScale; // 0x58 - 0x64
   int32_t m_nControlPoint; // 0x64 - 0x68
   Vector m_vCPValueScale; // 0x68 - 0x74
   Vector m_vCPRelativePosition; // 0x74 - 0x80
   Vector m_vCPRelativeDir; // 0x80 - 0x8C
   unsigned char pad_8C[0x4]; // 0x8C - 0x90
   CParticleFloatInput m_FloatComponentX; // 0x90 - 0x1D0
   CParticleFloatInput m_FloatComponentY; // 0x1D0 - 0x310
   CParticleFloatInput m_FloatComponentZ; // 0x310 - 0x450
   CParticleFloatInput m_FloatInterp; // 0x450 - 0x590
   float m_flInterpInput0; // 0x590 - 0x594
   float m_flInterpInput1; // 0x594 - 0x598
   Vector m_vInterpOutput0; // 0x598 - 0x5A4
   Vector m_vInterpOutput1; // 0x5A4 - 0x5B0
   CColorGradient m_Gradient; // 0x5B0 - 0x5C8
   Vector m_vRandomMin; // 0x5C8 - 0x5D4
   Vector m_vRandomMax; // 0x5D4 - 0x5E0
   unsigned char pad_5E0[0x8]; // 0x5E0 - 0x5E8
}; // size - 0x5E8


class CSoundOpvarSetPointEntity /* "server" */ : public CSoundOpvarSetPointBase /* "server" */
{
public:
   CEntityIOOutput m_OnEnter; // 0x538 - 0x560
   CEntityIOOutput m_OnExit; // 0x560 - 0x588
   bool m_bAutoDisable; // 0x588 - 0x589
   unsigned char pad_589[0x43]; // 0x589 - 0x5CC
   float m_flDistanceMin; // 0x5CC - 0x5D0
   float m_flDistanceMax; // 0x5D0 - 0x5D4
   float m_flDistanceMapMin; // 0x5D4 - 0x5D8
   float m_flDistanceMapMax; // 0x5D8 - 0x5DC
   float m_flOcclusionRadius; // 0x5DC - 0x5E0
   float m_flOcclusionMin; // 0x5E0 - 0x5E4
   float m_flOcclusionMax; // 0x5E4 - 0x5E8
   float m_flValSetOnDisable; // 0x5E8 - 0x5EC
   bool m_bSetValueOnDisable; // 0x5EC - 0x5ED
   unsigned char pad_5ED[0x3]; // 0x5ED - 0x5F0
   int32_t m_nSimulationMode; // 0x5F0 - 0x5F4
   int32_t m_nVisibilitySamples; // 0x5F4 - 0x5F8
   Vector m_vDynamicProxyPoint; // 0x5F8 - 0x604
   float m_flDynamicMaximumOcclusion; // 0x604 - 0x608
   CEntityHandle m_hDynamicEntity; // 0x608 - 0x60C
   unsigned char pad_60C[0x4]; // 0x60C - 0x610
   CUtlSymbolLarge m_iszDynamicEntityName; // 0x610 - 0x618
   float m_flPathingDistanceNormFactor; // 0x618 - 0x61C
   Vector m_vPathingSourcePos; // 0x61C - 0x628
   Vector m_vPathingListenerPos; // 0x628 - 0x634
   unsigned char pad_634[0x4]; // 0x634 - 0x638
}; // size - 0x638


class C_SoundOpvarSetPointEntity /* "client" */ : public C_SoundOpvarSetPointBase /* "client" */
{
public:
   unsigned char pad_0[0x558]; // 0x0 - 0x558
}; // size - 0x558


class CBinaryUpdateNode /* "animationsystem" */ : public CAnimUpdateNodeBase /* "animationsystem" */
{
public:
   CAnimUpdateNodeRef m_pChild1; // 0x58 - 0x68
   CAnimUpdateNodeRef m_pChild2; // 0x68 - 0x78
   BinaryNodeTiming m_timingBehavior; // 0x78 - 0x7C
   float m_flTimingBlend; // 0x7C - 0x80
   bool m_bResetChild1; // 0x80 - 0x81
   bool m_bResetChild2; // 0x81 - 0x82
   unsigned char pad_82[0x6]; // 0x82 - 0x88
}; // size - 0x88


class CGeneralRandomRotation /* "particles" */ : public CParticleFunctionInitializer /* "particles" */
{
public:
   ParticleAttributeIndex_t m_nFieldOutput; // 0x220 - 0x224
   float m_flDegrees; // 0x224 - 0x228
   float m_flDegreesMin; // 0x228 - 0x22C
   float m_flDegreesMax; // 0x22C - 0x230
   float m_flRotationRandExponent; // 0x230 - 0x234
   bool m_bRandomlyFlipDirection; // 0x234 - 0x235
   unsigned char pad_235[0xB]; // 0x235 - 0x240
}; // size - 0x240


class CGlowOverlay /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   Vector m_vPos; // 0x8 - 0x14
   bool m_bDirectional; // 0x14 - 0x15
   unsigned char pad_15[0x3]; // 0x15 - 0x18
   Vector m_vDirection; // 0x18 - 0x24
   bool m_bInSky; // 0x24 - 0x25
   unsigned char pad_25[0x3]; // 0x25 - 0x28
   float m_skyObstructionScale; // 0x28 - 0x2C
   unsigned char pad_2C[0x4]; // 0x2C - 0x30
   CGlowSprite m_Sprites[4]; // 0x30 - 0xB0
   int32_t m_nSprites; // 0xB0 - 0xB4
   float m_flProxyRadius; // 0xB4 - 0xB8
   float m_flHDRColorScale; // 0xB8 - 0xBC
   float m_flGlowObstructionScale; // 0xBC - 0xC0
   bool m_bCacheGlowObstruction; // 0xC0 - 0xC1
   bool m_bCacheSkyObstruction; // 0xC1 - 0xC2
   int16_t m_bActivated; // 0xC2 - 0xC4
   uint16_t m_ListIndex; // 0xC4 - 0xC6
   unsigned char pad_C6[0x2]; // 0xC6 - 0xC8
   int32_t m_queryHandle; // 0xC8 - 0xCC
   unsigned char pad_CC[0x4]; // 0xCC - 0xD0
}; // size - 0xD0


class CPhysPropLootCrate /* "server" */ : public CBrBaseItem /* "server" */
{
public:
   bool m_bRenderInPSPM; // 0xB28 - 0xB29
   bool m_bRenderInTablet; // 0xB29 - 0xB2A
   unsigned char pad_B2A[0x2]; // 0xB2A - 0xB2C
   GameTime_t m_flSpawnTime; // 0xB2C - 0xB30
   bool m_bTakeDamageFromDangerZone; // 0xB30 - 0xB31
   unsigned char pad_B31[0x7]; // 0xB31 - 0xB38
   char* m_pszCrateName; // 0xB38 - 0xB40
   CHandle< CBasePlayerPawn > m_hCrateOwner; // 0xB40 - 0xB44
   bool m_bOwnedByPlayer; // 0xB44 - 0xB45
   unsigned char pad_B45[0x3]; // 0xB45 - 0xB48
   float m_flDampingOriginalSpeed; // 0xB48 - 0xB4C
   float m_flDampingOriginalRot; // 0xB4C - 0xB50
}; // size - 0xB50


class CPhysPropWeaponUpgradeTablet /* "server" */ : public CPhysPropWeaponUpgrade /* "server" */
{
public:
   unsigned char pad_0[0xB30]; // 0x0 - 0xB30
}; // size - 0xB30


class CRulePointEntity /* "server" */ : public CRuleEntity /* "server" */
{
public:
   int32_t m_Score; // 0x6F8 - 0x6FC
   unsigned char pad_6FC[0x4]; // 0x6FC - 0x700
}; // size - 0x700


class CSoundEventEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bStartOnSpawn; // 0x4A0 - 0x4A1
   bool m_bToLocalPlayer; // 0x4A1 - 0x4A2
   bool m_bStopOnNew; // 0x4A2 - 0x4A3
   bool m_bSaveRestore; // 0x4A3 - 0x4A4
   bool m_bSavedIsPlaying; // 0x4A4 - 0x4A5
   unsigned char pad_4A5[0x3]; // 0x4A5 - 0x4A8
   float m_flSavedElapsedTime; // 0x4A8 - 0x4AC
   unsigned char pad_4AC[0x4]; // 0x4AC - 0x4B0
   CUtlSymbolLarge m_iszSourceEntityName; // 0x4B0 - 0x4B8
   CUtlSymbolLarge m_iszAttachmentName; // 0x4B8 - 0x4C0
   CEntityOutputTemplate< uint64 > m_onGUIDChanged; // 0x4C0 - 0x4E8
   CEntityIOOutput m_onSoundFinished; // 0x4E8 - 0x510
   unsigned char pad_510[0x20]; // 0x510 - 0x530
   CUtlSymbolLarge m_iszSoundName; // 0x530 - 0x538
   unsigned char pad_538[0x8]; // 0x538 - 0x540
   CEntityHandle m_hSource; // 0x540 - 0x544
   unsigned char pad_544[0x4]; // 0x544 - 0x548
}; // size - 0x548


class CStopwatchBase /* "server" */ : public CSimpleSimTimer /* "server" */
{
public:
   bool m_fIsRunning; // 0x8 - 0x9
   unsigned char pad_9[0x3]; // 0x9 - 0xC
}; // size - 0xC


class C_INIT_RandomNamedModelElement /* "particles" */ : public CParticleFunctionInitializer /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x220 - 0x228
   CUtlVector< CUtlString > m_names; // 0x228 - 0x240
   bool m_bShuffle; // 0x240 - 0x241
   bool m_bLinear; // 0x241 - 0x242
   bool m_bModelFromRenderer; // 0x242 - 0x243
   unsigned char pad_243[0x1]; // 0x243 - 0x244
   ParticleAttributeIndex_t m_nFieldOutput; // 0x244 - 0x248
   unsigned char pad_248[0x8]; // 0x248 - 0x250
}; // size - 0x250


class C_INIT_RemapNamedModelElementToScalar /* "particles" */ : public CParticleFunctionInitializer /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x220 - 0x228
   CUtlVector< CUtlString > m_names; // 0x228 - 0x240
   CUtlVector< float32 > m_values; // 0x240 - 0x258
   ParticleAttributeIndex_t m_nFieldInput; // 0x258 - 0x25C
   ParticleAttributeIndex_t m_nFieldOutput; // 0x25C - 0x260
   ParticleSetMethod_t m_nSetMethod; // 0x260 - 0x264
   bool m_bModelFromRenderer; // 0x264 - 0x265
   unsigned char pad_265[0xB]; // 0x265 - 0x270
}; // size - 0x270


class C_INIT_RemapParticleCountToNamedModelElementScalar /* "particles" */ : public C_INIT_RemapParticleCountToScalar /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x250 - 0x258
   CUtlString m_outputMinName; // 0x258 - 0x260
   CUtlString m_outputMaxName; // 0x260 - 0x268
   bool m_bModelFromRenderer; // 0x268 - 0x269
   unsigned char pad_269[0x7]; // 0x269 - 0x270
}; // size - 0x270


class C_ModelPointEntity /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_0[0x838]; // 0x0 - 0x838
}; // size - 0x838


class C_OP_RemapNamedModelElementEndCap /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x210 - 0x218
   CUtlVector< CUtlString > m_inNames; // 0x218 - 0x230
   CUtlVector< CUtlString > m_outNames; // 0x230 - 0x248
   CUtlVector< CUtlString > m_fallbackNames; // 0x248 - 0x260
   bool m_bModelFromRenderer; // 0x260 - 0x261
   unsigned char pad_261[0x3]; // 0x261 - 0x264
   ParticleAttributeIndex_t m_nFieldInput; // 0x264 - 0x268
   ParticleAttributeIndex_t m_nFieldOutput; // 0x268 - 0x26C
   unsigned char pad_26C[0x4]; // 0x26C - 0x270
}; // size - 0x270


class C_OP_RemapNamedModelElementOnceTimed /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x210 - 0x218
   CUtlVector< CUtlString > m_inNames; // 0x218 - 0x230
   CUtlVector< CUtlString > m_outNames; // 0x230 - 0x248
   CUtlVector< CUtlString > m_fallbackNames; // 0x248 - 0x260
   bool m_bModelFromRenderer; // 0x260 - 0x261
   bool m_bProportional; // 0x261 - 0x262
   unsigned char pad_262[0x2]; // 0x262 - 0x264
   ParticleAttributeIndex_t m_nFieldInput; // 0x264 - 0x268
   ParticleAttributeIndex_t m_nFieldOutput; // 0x268 - 0x26C
   float m_flRemapTime; // 0x26C - 0x270
}; // size - 0x270


class C_PointClientUIWorldPanel /* "client" */ : public C_BaseClientUIEntity /* "client" */
{
public:
   unsigned char pad_868[0x8]; // 0x868 - 0x870
   bool m_bForceRecreateNextUpdate; // 0x870 - 0x871
   bool m_bMoveViewToPlayerNextThink; // 0x871 - 0x872
   bool m_bCheckCSSClasses; // 0x872 - 0x873
   unsigned char pad_873[0xD]; // 0x873 - 0x880
   CTransform m_anchorDeltaTransform; // 0x880 - 0x8A0
   unsigned char pad_8A0[0x180]; // 0x8A0 - 0xA20
   CPointOffScreenIndicatorUi* m_pOffScreenIndicator; // 0xA20 - 0xA28
   unsigned char pad_A28[0x20]; // 0xA28 - 0xA48
   bool m_bIgnoreInput; // 0xA48 - 0xA49
   bool m_bLit; // 0xA49 - 0xA4A
   bool m_bFollowPlayerAcrossTeleport; // 0xA4A - 0xA4B
   unsigned char pad_A4B[0x1]; // 0xA4B - 0xA4C
   float m_flWidth; // 0xA4C - 0xA50
   float m_flHeight; // 0xA50 - 0xA54
   float m_flDPI; // 0xA54 - 0xA58
   float m_flInteractDistance; // 0xA58 - 0xA5C
   float m_flDepthOffset; // 0xA5C - 0xA60
   uint32_t m_unOwnerContext; // 0xA60 - 0xA64
   uint32_t m_unHorizontalAlign; // 0xA64 - 0xA68
   uint32_t m_unVerticalAlign; // 0xA68 - 0xA6C
   uint32_t m_unOrientation; // 0xA6C - 0xA70
   bool m_bAllowInteractionFromAllSceneWorlds; // 0xA70 - 0xA71
   unsigned char pad_A71[0x7]; // 0xA71 - 0xA78
   C_NetworkUtlVectorBase< CUtlSymbolLarge > m_vecCSSClasses; // 0xA78 - 0xA90
   bool m_bOpaque; // 0xA90 - 0xA91
   bool m_bNoDepth; // 0xA91 - 0xA92
   bool m_bRenderBackface; // 0xA92 - 0xA93
   bool m_bUseOffScreenIndicator; // 0xA93 - 0xA94
   bool m_bExcludeFromSaveGames; // 0xA94 - 0xA95
   bool m_bGrabbable; // 0xA95 - 0xA96
   bool m_bOnlyRenderToTexture; // 0xA96 - 0xA97
   bool m_bDisableMipGen; // 0xA97 - 0xA98
   int32_t m_nExplicitImageLayout; // 0xA98 - 0xA9C
   unsigned char pad_A9C[0x4]; // 0xA9C - 0xAA0
}; // size - 0xAA0


class C_Sprite /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_838[0x18]; // 0x838 - 0x850
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hSpriteMaterial; // 0x850 - 0x858
   CHandle< C_BaseEntity > m_hAttachedToEntity; // 0x858 - 0x85C
   AttachmentHandle_t m_nAttachment; // 0x85C - 0x85D
   unsigned char pad_85D[0x3]; // 0x85D - 0x860
   float m_flSpriteFramerate; // 0x860 - 0x864
   float m_flFrame; // 0x864 - 0x868
   GameTime_t m_flDieTime; // 0x868 - 0x86C
   unsigned char pad_86C[0xC]; // 0x86C - 0x878
   uint32_t m_nBrightness; // 0x878 - 0x87C
   float m_flBrightnessDuration; // 0x87C - 0x880
   float m_flSpriteScale; // 0x880 - 0x884
   float m_flScaleDuration; // 0x884 - 0x888
   bool m_bWorldSpaceScale; // 0x888 - 0x889
   unsigned char pad_889[0x3]; // 0x889 - 0x88C
   float m_flGlowProxySize; // 0x88C - 0x890
   float m_flHDRColorScale; // 0x890 - 0x894
   GameTime_t m_flLastTime; // 0x894 - 0x898
   float m_flMaxFrame; // 0x898 - 0x89C
   float m_flStartScale; // 0x89C - 0x8A0
   float m_flDestScale; // 0x8A0 - 0x8A4
   GameTime_t m_flScaleTimeStart; // 0x8A4 - 0x8A8
   int32_t m_nStartBrightness; // 0x8A8 - 0x8AC
   int32_t m_nDestBrightness; // 0x8AC - 0x8B0
   GameTime_t m_flBrightnessTimeStart; // 0x8B0 - 0x8B4
   unsigned char pad_8B4[0x4]; // 0x8B4 - 0x8B8
   CWeakHandle< InfoForResourceTypeIMaterial2 > m_hOldSpriteMaterial; // 0x8B8 - 0x8C0
   unsigned char pad_8C0[0xA0]; // 0x8C0 - 0x960
   int32_t m_nSpriteWidth; // 0x960 - 0x964
   int32_t m_nSpriteHeight; // 0x964 - 0x968
}; // size - 0x968


class CAI_Expresser /* "server" */
{
public:
   unsigned char pad_0[0x38]; // 0x0 - 0x38
   GameTime_t m_flStopTalkTime; // 0x38 - 0x3C
   GameTime_t m_flStopTalkTimeWithoutDelay; // 0x3C - 0x40
   GameTime_t m_flBlockedTalkTime; // 0x40 - 0x44
   int32_t m_voicePitch; // 0x44 - 0x48
   GameTime_t m_flLastTimeAcceptedSpeak; // 0x48 - 0x4C
   bool m_bAllowSpeakingInterrupts; // 0x4C - 0x4D
   bool m_bConsiderSceneInvolvementAsSpeech; // 0x4D - 0x4E
   unsigned char pad_4E[0x2]; // 0x4E - 0x50
   int32_t m_nLastSpokenPriority; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
   CBaseFlex* m_pOuter; // 0x58 - 0x60
}; // size - 0x60


class CBaseViewModel /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   unsigned char pad_820[0x8]; // 0x820 - 0x828
   Vector m_vecLastFacing; // 0x828 - 0x834
   uint32_t m_nViewModelIndex; // 0x834 - 0x838
   uint32_t m_nAnimationParity; // 0x838 - 0x83C
   float m_flAnimationStartTime; // 0x83C - 0x840
   CHandle< CBasePlayerWeapon > m_hWeapon; // 0x840 - 0x844
   unsigned char pad_844[0x4]; // 0x844 - 0x848
   CUtlSymbolLarge m_sVMName; // 0x848 - 0x850
   CUtlSymbolLarge m_sAnimationPrefix; // 0x850 - 0x858
   HSequence m_hOldLayerSequence; // 0x858 - 0x85C
   int32_t m_oldLayer; // 0x85C - 0x860
   float m_oldLayerStartTime; // 0x860 - 0x864
   CEntityHandle m_hControlPanel; // 0x864 - 0x868
}; // size - 0x868


class CBtNodeDecorator /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_0[0x58]; // 0x0 - 0x58
}; // size - 0x58


class CFuncPlatRot /* "server" */ : public CFuncPlat /* "server" */
{
public:
   QAngle m_end; // 0x7A0 - 0x7AC
   QAngle m_start; // 0x7AC - 0x7B8
}; // size - 0x7B8


class CHostageExpresserShim /* "server" */ : public CBaseCombatCharacter /* "server" */
{
public:
   CAI_Expresser* m_pExpresser; // 0x968 - 0x970
}; // size - 0x970


class CLogicNPCCounter /* "server" */ : public CBaseEntity /* "server" */
{
public:
   CEntityIOOutput m_OnMinCountAll; // 0x4A0 - 0x4C8
   CEntityIOOutput m_OnMaxCountAll; // 0x4C8 - 0x4F0
   CEntityOutputTemplate< float32 > m_OnFactorAll; // 0x4F0 - 0x518
   CEntityOutputTemplate< float32 > m_OnMinPlayerDistAll; // 0x518 - 0x540
   CEntityIOOutput m_OnMinCount_1; // 0x540 - 0x568
   CEntityIOOutput m_OnMaxCount_1; // 0x568 - 0x590
   CEntityOutputTemplate< float32 > m_OnFactor_1; // 0x590 - 0x5B8
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_1; // 0x5B8 - 0x5E0
   CEntityIOOutput m_OnMinCount_2; // 0x5E0 - 0x608
   CEntityIOOutput m_OnMaxCount_2; // 0x608 - 0x630
   CEntityOutputTemplate< float32 > m_OnFactor_2; // 0x630 - 0x658
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_2; // 0x658 - 0x680
   CEntityIOOutput m_OnMinCount_3; // 0x680 - 0x6A8
   CEntityIOOutput m_OnMaxCount_3; // 0x6A8 - 0x6D0
   CEntityOutputTemplate< float32 > m_OnFactor_3; // 0x6D0 - 0x6F8
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_3; // 0x6F8 - 0x720
   CEntityHandle m_hSource; // 0x720 - 0x724
   unsigned char pad_724[0x4]; // 0x724 - 0x728
   CUtlSymbolLarge m_iszSourceEntityName; // 0x728 - 0x730
   float m_flDistanceMax; // 0x730 - 0x734
   bool m_bDisabled; // 0x734 - 0x735
   unsigned char pad_735[0x3]; // 0x735 - 0x738
   int32_t m_nMinCountAll; // 0x738 - 0x73C
   int32_t m_nMaxCountAll; // 0x73C - 0x740
   int32_t m_nMinFactorAll; // 0x740 - 0x744
   int32_t m_nMaxFactorAll; // 0x744 - 0x748
   unsigned char pad_748[0x8]; // 0x748 - 0x750
   CUtlSymbolLarge m_iszNPCClassname_1; // 0x750 - 0x758
   int32_t m_nNPCState_1; // 0x758 - 0x75C
   bool m_bInvertState_1; // 0x75C - 0x75D
   unsigned char pad_75D[0x3]; // 0x75D - 0x760
   int32_t m_nMinCount_1; // 0x760 - 0x764
   int32_t m_nMaxCount_1; // 0x764 - 0x768
   int32_t m_nMinFactor_1; // 0x768 - 0x76C
   int32_t m_nMaxFactor_1; // 0x76C - 0x770
   unsigned char pad_770[0x4]; // 0x770 - 0x774
   float m_flDefaultDist_1; // 0x774 - 0x778
   CUtlSymbolLarge m_iszNPCClassname_2; // 0x778 - 0x780
   int32_t m_nNPCState_2; // 0x780 - 0x784
   bool m_bInvertState_2; // 0x784 - 0x785
   unsigned char pad_785[0x3]; // 0x785 - 0x788
   int32_t m_nMinCount_2; // 0x788 - 0x78C
   int32_t m_nMaxCount_2; // 0x78C - 0x790
   int32_t m_nMinFactor_2; // 0x790 - 0x794
   int32_t m_nMaxFactor_2; // 0x794 - 0x798
   unsigned char pad_798[0x4]; // 0x798 - 0x79C
   float m_flDefaultDist_2; // 0x79C - 0x7A0
   CUtlSymbolLarge m_iszNPCClassname_3; // 0x7A0 - 0x7A8
   int32_t m_nNPCState_3; // 0x7A8 - 0x7AC
   bool m_bInvertState_3; // 0x7AC - 0x7AD
   unsigned char pad_7AD[0x3]; // 0x7AD - 0x7B0
   int32_t m_nMinCount_3; // 0x7B0 - 0x7B4
   int32_t m_nMaxCount_3; // 0x7B4 - 0x7B8
   int32_t m_nMinFactor_3; // 0x7B8 - 0x7BC
   int32_t m_nMaxFactor_3; // 0x7BC - 0x7C0
   unsigned char pad_7C0[0x4]; // 0x7C0 - 0x7C4
   float m_flDefaultDist_3; // 0x7C4 - 0x7C8
   unsigned char pad_7C8[0x18]; // 0x7C8 - 0x7E0
}; // size - 0x7E0


class CMultiplayRules /* "server" */ : public CGameRules /* "server" */
{
public:
   unsigned char pad_0[0x90]; // 0x0 - 0x90
}; // size - 0x90


class CPlayer_MovementServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   int32_t m_nImpulse; // 0x40 - 0x44
   unsigned char pad_44[0x4]; // 0x44 - 0x48
   CInButtonState m_nButtons; // 0x48 - 0x68
   uint64_t m_nQueuedButtonDownMask; // 0x68 - 0x70
   uint64_t m_nQueuedButtonChangeMask; // 0x70 - 0x78
   uint64_t m_nButtonDoublePressed; // 0x78 - 0x80
   uint32 m_pButtonPressedCmdNumber[64]; // 0x80 - 0x180
   uint32_t m_nLastCommandNumberProcessed; // 0x180 - 0x184
   unsigned char pad_184[0x4]; // 0x184 - 0x188
   uint64_t m_nToggleButtonDownMask; // 0x188 - 0x190
   float m_flMaxspeed; // 0x190 - 0x194
   float m_flForceSubtickMoveWhen; // 0x194 - 0x198
   float m_flForwardMove; // 0x198 - 0x19C
   float m_flLeftMove; // 0x19C - 0x1A0
   float m_flUpMove; // 0x1A0 - 0x1A4
   QAngle m_vecOldViewAngles; // 0x1A4 - 0x1B0
   unsigned char pad_1B0[0x8]; // 0x1B0 - 0x1B8
}; // size - 0x1B8


class CPlayer_MovementServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   int32_t m_nImpulse; // 0x40 - 0x44
   unsigned char pad_44[0x4]; // 0x44 - 0x48
   CInButtonState m_nButtons; // 0x48 - 0x68
   uint64_t m_nQueuedButtonDownMask; // 0x68 - 0x70
   uint64_t m_nQueuedButtonChangeMask; // 0x70 - 0x78
   uint64_t m_nButtonDoublePressed; // 0x78 - 0x80
   uint32 m_pButtonPressedCmdNumber[64]; // 0x80 - 0x180
   uint32_t m_nLastCommandNumberProcessed; // 0x180 - 0x184
   unsigned char pad_184[0x4]; // 0x184 - 0x188
   uint64_t m_nToggleButtonDownMask; // 0x188 - 0x190
   float m_flMaxspeed; // 0x190 - 0x194
   float m_flForceSubtickMoveWhen; // 0x194 - 0x198
   float m_flForwardMove; // 0x198 - 0x19C
   float m_flLeftMove; // 0x19C - 0x1A0
   float m_flUpMove; // 0x1A0 - 0x1A4
   QAngle m_vecOldViewAngles; // 0x1A4 - 0x1B0
   unsigned char pad_1B0[0x8]; // 0x1B0 - 0x1B8
}; // size - 0x1B8


class CPropDoorRotating /* "server" */ : public CBasePropDoor /* "server" */
{
public:
   Vector m_vecAxis; // 0xD28 - 0xD34
   float m_flDistance; // 0xD34 - 0xD38
   PropDoorRotatingSpawnPos_t m_eSpawnPosition; // 0xD38 - 0xD3C
   PropDoorRotatingOpenDirection_e m_eOpenDirection; // 0xD3C - 0xD40
   PropDoorRotatingOpenDirection_e m_eCurrentOpenDirection; // 0xD40 - 0xD44
   float m_flAjarAngle; // 0xD44 - 0xD48
   QAngle m_angRotationAjarDeprecated; // 0xD48 - 0xD54
   QAngle m_angRotationClosed; // 0xD54 - 0xD60
   QAngle m_angRotationOpenForward; // 0xD60 - 0xD6C
   QAngle m_angRotationOpenBack; // 0xD6C - 0xD78
   QAngle m_angGoal; // 0xD78 - 0xD84
   Vector m_vecForwardBoundsMin; // 0xD84 - 0xD90
   Vector m_vecForwardBoundsMax; // 0xD90 - 0xD9C
   Vector m_vecBackBoundsMin; // 0xD9C - 0xDA8
   Vector m_vecBackBoundsMax; // 0xDA8 - 0xDB4
   CHandle< CEntityBlocker > m_hEntityBlocker; // 0xDB4 - 0xDB8
}; // size - 0xDB8


class C_BaseViewModel /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   unsigned char pad_998[0x8]; // 0x998 - 0x9A0
   Vector m_vecLastFacing; // 0x9A0 - 0x9AC
   uint32_t m_nViewModelIndex; // 0x9AC - 0x9B0
   uint32_t m_nAnimationParity; // 0x9B0 - 0x9B4
   float m_flAnimationStartTime; // 0x9B4 - 0x9B8
   CHandle< C_BasePlayerWeapon > m_hWeapon; // 0x9B8 - 0x9BC
   unsigned char pad_9BC[0x4]; // 0x9BC - 0x9C0
   CUtlSymbolLarge m_sVMName; // 0x9C0 - 0x9C8
   CUtlSymbolLarge m_sAnimationPrefix; // 0x9C8 - 0x9D0
   CHandle< C_ViewmodelWeapon > m_hWeaponModel; // 0x9D0 - 0x9D4
   AttachmentHandle_t m_iCameraAttachment; // 0x9D4 - 0x9D5
   unsigned char pad_9D5[0x3]; // 0x9D5 - 0x9D8
   QAngle m_vecLastCameraAngles; // 0x9D8 - 0x9E4
   float m_previousElapsedDuration; // 0x9E4 - 0x9E8
   float m_previousCycle; // 0x9E8 - 0x9EC
   int32_t m_nOldAnimationParity; // 0x9EC - 0x9F0
   HSequence m_hOldLayerSequence; // 0x9F0 - 0x9F4
   int32_t m_oldLayer; // 0x9F4 - 0x9F8
   float m_oldLayerStartTime; // 0x9F8 - 0x9FC
   CEntityHandle m_hControlPanel; // 0x9FC - 0xA00
}; // size - 0xA00


class C_MultiplayRules /* "client" */ : public C_GameRules /* "client" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class BaseSceneObjectOverride_t /* "worldrenderer" */
{
public:
   uint32_t m_nSceneObjectIndex; // 0x0 - 0x4
}; // size - 0x4


class CAnimState /* "animationsystem" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
   CUtlVector< CSmartPtr< CAnimStateTransition > > m_transitions; // 0x28 - 0x40
   CUtlVector< CStateAction > m_actions; // 0x40 - 0x58
   CUtlString m_name; // 0x58 - 0x60
   AnimStateID m_stateID; // 0x60 - 0x64
   Vector2D m_position; // 0x64 - 0x6C
   bool m_bIsStartState; // 0x6C - 0x6D
   bool m_bIsEndtState; // 0x6D - 0x6E
   bool m_bIsPassthrough; // 0x6E - 0x6F
   unsigned char pad_6F[0x1]; // 0x6F - 0x70
}; // size - 0x70


class CAnimStateTransition /* "animationsystem" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
   CConditionContainer m_conditionList; // 0x28 - 0x60
   AnimStateID m_srcState; // 0x60 - 0x64
   AnimStateID m_destState; // 0x64 - 0x68
   bool m_bDisabled; // 0x68 - 0x69
   unsigned char pad_69[0x7]; // 0x69 - 0x70
}; // size - 0x70


class CBarnLight /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bEnabled; // 0x6F0 - 0x6F1
   unsigned char pad_6F1[0x3]; // 0x6F1 - 0x6F4
   int32_t m_nColorMode; // 0x6F4 - 0x6F8
   Color m_Color; // 0x6F8 - 0x6FC
   float m_flColorTemperature; // 0x6FC - 0x700
   float m_flBrightness; // 0x700 - 0x704
   float m_flBrightnessScale; // 0x704 - 0x708
   int32_t m_nDirectLight; // 0x708 - 0x70C
   int32_t m_nBakedShadowIndex; // 0x70C - 0x710
   int32_t m_nLuminaireShape; // 0x710 - 0x714
   float m_flLuminaireSize; // 0x714 - 0x718
   float m_flLuminaireAnisotropy; // 0x718 - 0x71C
   unsigned char pad_71C[0x4]; // 0x71C - 0x720
   CUtlString m_LightStyleString; // 0x720 - 0x728
   GameTime_t m_flLightStyleStartTime; // 0x728 - 0x72C
   unsigned char pad_72C[0x4]; // 0x72C - 0x730
   CNetworkUtlVectorBase< CUtlString > m_QueuedLightStyleStrings; // 0x730 - 0x748
   CNetworkUtlVectorBase< CUtlString > m_LightStyleEvents; // 0x748 - 0x760
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_LightStyleTargets; // 0x760 - 0x778
   CEntityIOOutput m_StyleEvent[4]; // 0x778 - 0x818
   CUtlString m_StyleRadianceVar; // 0x818 - 0x820
   CUtlString m_StyleVar; // 0x820 - 0x828
   unsigned char pad_828[0x20]; // 0x828 - 0x848
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; // 0x848 - 0x850
   float m_flShape; // 0x850 - 0x854
   float m_flSoftX; // 0x854 - 0x858
   float m_flSoftY; // 0x858 - 0x85C
   float m_flSkirt; // 0x85C - 0x860
   float m_flSkirtNear; // 0x860 - 0x864
   Vector m_vSizeParams; // 0x864 - 0x870
   float m_flRange; // 0x870 - 0x874
   Vector m_vShear; // 0x874 - 0x880
   int32_t m_nBakeSpecularToCubemaps; // 0x880 - 0x884
   Vector m_vBakeSpecularToCubemapsSize; // 0x884 - 0x890
   int32_t m_nCastShadows; // 0x890 - 0x894
   int32_t m_nShadowMapSize; // 0x894 - 0x898
   int32_t m_nShadowPriority; // 0x898 - 0x89C
   bool m_bContactShadow; // 0x89C - 0x89D
   unsigned char pad_89D[0x3]; // 0x89D - 0x8A0
   int32_t m_nBounceLight; // 0x8A0 - 0x8A4
   float m_flBounceScale; // 0x8A4 - 0x8A8
   float m_flMinRoughness; // 0x8A8 - 0x8AC
   int32_t m_nFog; // 0x8AC - 0x8B0
   float m_flFogStrength; // 0x8B0 - 0x8B4
   int32_t m_nFogShadows; // 0x8B4 - 0x8B8
   float m_flFogScale; // 0x8B8 - 0x8BC
   float m_flFadeSizeStart; // 0x8BC - 0x8C0
   float m_flFadeSizeEnd; // 0x8C0 - 0x8C4
   float m_flShadowFadeSizeStart; // 0x8C4 - 0x8C8
   float m_flShadowFadeSizeEnd; // 0x8C8 - 0x8CC
   bool m_bPrecomputedFieldsValid; // 0x8CC - 0x8CD
   unsigned char pad_8CD[0x3]; // 0x8CD - 0x8D0
   Vector m_vPrecomputedBoundsMins; // 0x8D0 - 0x8DC
   Vector m_vPrecomputedBoundsMaxs; // 0x8DC - 0x8E8
   Vector m_vPrecomputedOBBOrigin; // 0x8E8 - 0x8F4
   QAngle m_vPrecomputedOBBAngles; // 0x8F4 - 0x900
   Vector m_vPrecomputedOBBExtent; // 0x900 - 0x90C
   bool m_bPvsModifyEntity; // 0x90C - 0x90D
   unsigned char pad_90D[0xB]; // 0x90D - 0x918
}; // size - 0x918


class CBaseDoor /* "server" */ : public CBaseToggle /* "server" */
{
public:
   unsigned char pad_770[0x10]; // 0x770 - 0x780
   QAngle m_angMoveEntitySpace; // 0x780 - 0x78C
   Vector m_vecMoveDirParentSpace; // 0x78C - 0x798
   locksound_t m_ls; // 0x798 - 0x7B8
   bool m_bForceClosed; // 0x7B8 - 0x7B9
   bool m_bDoorGroup; // 0x7B9 - 0x7BA
   bool m_bLocked; // 0x7BA - 0x7BB
   bool m_bIgnoreDebris; // 0x7BB - 0x7BC
   FuncDoorSpawnPos_t m_eSpawnPosition; // 0x7BC - 0x7C0
   float m_flBlockDamage; // 0x7C0 - 0x7C4
   unsigned char pad_7C4[0x4]; // 0x7C4 - 0x7C8
   CUtlSymbolLarge m_NoiseMoving; // 0x7C8 - 0x7D0
   CUtlSymbolLarge m_NoiseArrived; // 0x7D0 - 0x7D8
   CUtlSymbolLarge m_NoiseMovingClosed; // 0x7D8 - 0x7E0
   CUtlSymbolLarge m_NoiseArrivedClosed; // 0x7E0 - 0x7E8
   CUtlSymbolLarge m_ChainTarget; // 0x7E8 - 0x7F0
   CEntityIOOutput m_OnBlockedClosing; // 0x7F0 - 0x818
   CEntityIOOutput m_OnBlockedOpening; // 0x818 - 0x840
   CEntityIOOutput m_OnUnblockedClosing; // 0x840 - 0x868
   CEntityIOOutput m_OnUnblockedOpening; // 0x868 - 0x890
   CEntityIOOutput m_OnFullyClosed; // 0x890 - 0x8B8
   CEntityIOOutput m_OnFullyOpen; // 0x8B8 - 0x8E0
   CEntityIOOutput m_OnClose; // 0x8E0 - 0x908
   CEntityIOOutput m_OnOpen; // 0x908 - 0x930
   CEntityIOOutput m_OnLockedUse; // 0x930 - 0x958
   bool m_bLoopMoveSound; // 0x958 - 0x959
   unsigned char pad_959[0x17]; // 0x959 - 0x970
   bool m_bCreateNavObstacle; // 0x970 - 0x971
   bool m_isChaining; // 0x971 - 0x972
   bool m_bIsUsable; // 0x972 - 0x973
   unsigned char pad_973[0x5]; // 0x973 - 0x978
}; // size - 0x978


class CBeam /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   float m_flFrameRate; // 0x6F0 - 0x6F4
   float m_flHDRColorScale; // 0x6F4 - 0x6F8
   GameTime_t m_flFireTime; // 0x6F8 - 0x6FC
   float m_flDamage; // 0x6FC - 0x700
   uint8_t m_nNumBeamEnts; // 0x700 - 0x701
   unsigned char pad_701[0x7]; // 0x701 - 0x708
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hBaseMaterial; // 0x708 - 0x710
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_nHaloIndex; // 0x710 - 0x718
   BeamType_t m_nBeamType; // 0x718 - 0x71C
   uint32_t m_nBeamFlags; // 0x71C - 0x720
   CHandle< CBaseEntity > m_hAttachEntity[10]; // 0x720 - 0x748
   AttachmentHandle_t m_nAttachIndex[10]; // 0x748 - 0x752
   unsigned char pad_752[0x2]; // 0x752 - 0x754
   float m_fWidth; // 0x754 - 0x758
   float m_fEndWidth; // 0x758 - 0x75C
   float m_fFadeLength; // 0x75C - 0x760
   float m_fHaloScale; // 0x760 - 0x764
   float m_fAmplitude; // 0x764 - 0x768
   float m_fStartFrame; // 0x768 - 0x76C
   float m_fSpeed; // 0x76C - 0x770
   float m_flFrame; // 0x770 - 0x774
   BeamClipStyle_t m_nClipStyle; // 0x774 - 0x778
   bool m_bTurnedOff; // 0x778 - 0x779
   unsigned char pad_779[0x3]; // 0x779 - 0x77C
   Vector m_vecEndPos; // 0x77C - 0x788
   CHandle< CBaseEntity > m_hEndEntity; // 0x788 - 0x78C
   int32_t m_nDissolveType; // 0x78C - 0x790
}; // size - 0x790


class CBlend2DItemBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   Vector2D m_blendValue; // 0x18 - 0x20
   unsigned char pad_20[0x8]; // 0x20 - 0x28
   bool m_bUseCustomDuration; // 0x28 - 0x29
   unsigned char pad_29[0x3]; // 0x29 - 0x2C
   float m_flCustomDuration; // 0x2C - 0x30
}; // size - 0x30


class CBodyComponentSkeletonInstance /* "server" */ : public CBodyComponent /* "server" */
{
public:
   CSkeletonInstance m_skeletonInstance; // 0x50 - 0x440
   CNetworkVarChainer __m_pChainEntity; // 0x440 - 0x468
   unsigned char pad_468[0x8]; // 0x468 - 0x470
}; // size - 0x470


class CBodyComponentSkeletonInstance /* "client" */ : public CBodyComponent /* "client" */
{
public:
   CSkeletonInstance m_skeletonInstance; // 0x50 - 0x440
   CNetworkVarChainer __m_pChainEntity; // 0x440 - 0x468
   unsigned char pad_468[0x8]; // 0x468 - 0x470
}; // size - 0x470


class CBreakable /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_6F0[0x10]; // 0x6F0 - 0x700
   Materials m_Material; // 0x700 - 0x704
   CHandle< CBaseEntity > m_hBreaker; // 0x704 - 0x708
   Explosions m_Explosion; // 0x708 - 0x70C
   unsigned char pad_70C[0x4]; // 0x70C - 0x710
   CUtlSymbolLarge m_iszSpawnObject; // 0x710 - 0x718
   float m_flPressureDelay; // 0x718 - 0x71C
   int32_t m_iMinHealthDmg; // 0x71C - 0x720
   CUtlSymbolLarge m_iszPropData; // 0x720 - 0x728
   float m_impactEnergyScale; // 0x728 - 0x72C
   EOverrideBlockLOS_t m_nOverrideBlockLOS; // 0x72C - 0x730
   CEntityIOOutput m_OnBreak; // 0x730 - 0x758
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0x758 - 0x780
   float m_flDmgModBullet; // 0x780 - 0x784
   float m_flDmgModClub; // 0x784 - 0x788
   float m_flDmgModExplosive; // 0x788 - 0x78C
   float m_flDmgModFire; // 0x78C - 0x790
   CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0x790 - 0x798
   CUtlSymbolLarge m_iszBasePropData; // 0x798 - 0x7A0
   int32_t m_iInteractions; // 0x7A0 - 0x7A4
   PerformanceMode_t m_PerformanceMode; // 0x7A4 - 0x7A8
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x7A8 - 0x7AC
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x7AC - 0x7B0
}; // size - 0x7B0


class CCSGO_TeamIntroCharacterPosition /* "server" */ : public CCSGO_TeamPreviewCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0x730]; // 0x0 - 0x730
}; // size - 0x730


class CCSGO_TeamSelectCharacterPosition /* "server" */ : public CCSGO_TeamPreviewCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0x730]; // 0x0 - 0x730
}; // size - 0x730


class CCSPlayerPawnBase /* "server" */ : public CBasePlayerPawn /* "server" */
{
public:
   unsigned char pad_AA0[0x10]; // 0xAA0 - 0xAB0
   CTouchExpansionComponent m_CTouchExpansionComponent; // 0xAB0 - 0xAD0
   CCSPlayer_ActionTrackingServices* m_pActionTrackingServices; // 0xAD0 - 0xAD8
   CCSPlayer_ViewModelServices* m_pViewModelServices; // 0xAD8 - 0xAE0
   uint32_t m_iDisplayHistoryBits; // 0xAE0 - 0xAE4
   float m_flLastAttackedTeammate; // 0xAE4 - 0xAE8
   CHandle< CCSPlayerController > m_hOriginalController; // 0xAE8 - 0xAEC
   GameTime_t m_blindUntilTime; // 0xAEC - 0xAF0
   GameTime_t m_blindStartTime; // 0xAF0 - 0xAF4
   GameTime_t m_allowAutoFollowTime; // 0xAF4 - 0xAF8
   bool m_bHasFemaleVoice; // 0xAF8 - 0xAF9
   unsigned char pad_AF9[0x7]; // 0xAF9 - 0xB00
   EntitySpottedState_t m_entitySpottedState; // 0xB00 - 0xB18
   int32_t m_nSpotRules; // 0xB18 - 0xB1C
   float m_flTimeOfLastInjury; // 0xB1C - 0xB20
   RelativeDamagedDirection_t m_nRelativeDirectionOfLastInjury; // 0xB20 - 0xB24
   CSPlayerState m_iPlayerState; // 0xB24 - 0xB28
   unsigned char pad_B28[0x8]; // 0xB28 - 0xB30
   CountdownTimer m_chickenIdleSoundTimer; // 0xB30 - 0xB48
   CountdownTimer m_chickenJumpSoundTimer; // 0xB48 - 0xB60
   unsigned char pad_B60[0xA0]; // 0xB60 - 0xC00
   Vector m_vecLastBookmarkedPosition; // 0xC00 - 0xC0C
   float m_flLastDistanceTraveledNotice; // 0xC0C - 0xC10
   float m_flAccumulatedDistanceTraveled; // 0xC10 - 0xC14
   float m_flLastFriendlyFireDamageReductionRatio; // 0xC14 - 0xC18
   bool m_bRespawning; // 0xC18 - 0xC19
   unsigned char pad_C19[0x3]; // 0xC19 - 0xC1C
   int32_t m_iNumGunGameTRBombTotalPoints; // 0xC1C - 0xC20
   bool m_bShouldProgressGunGameTRBombModeWeapon; // 0xC20 - 0xC21
   unsigned char pad_C21[0x3]; // 0xC21 - 0xC24
   int32_t m_nLastPickupPriority; // 0xC24 - 0xC28
   float m_flLastPickupPriorityTime; // 0xC28 - 0xC2C
   bool m_passiveItems[4]; // 0xC2C - 0xC30
   bool m_bIsScoped; // 0xC30 - 0xC31
   bool m_bIsWalking; // 0xC31 - 0xC32
   bool m_bResumeZoom; // 0xC32 - 0xC33
   bool m_bIsDefusing; // 0xC33 - 0xC34
   bool m_bIsGrabbingHostage; // 0xC34 - 0xC35
   unsigned char pad_C35[0x3]; // 0xC35 - 0xC38
   CSPlayerBlockingUseAction_t m_iBlockingUseActionInProgress; // 0xC38 - 0xC3C
   GameTime_t m_fImmuneToGunGameDamageTime; // 0xC3C - 0xC40
   bool m_bGunGameImmunity; // 0xC40 - 0xC41
   bool m_bMadeFinalGunGameProgressiveKill; // 0xC41 - 0xC42
   unsigned char pad_C42[0x2]; // 0xC42 - 0xC44
   int32_t m_iGunGameProgressiveWeaponIndex; // 0xC44 - 0xC48
   int32_t m_iNumGunGameTRKillPoints; // 0xC48 - 0xC4C
   int32_t m_iNumGunGameKillsWithCurrentWeapon; // 0xC4C - 0xC50
   uint32_t m_unTotalRoundDamageDealt; // 0xC50 - 0xC54
   float m_fMolotovDamageTime; // 0xC54 - 0xC58
   bool m_bHasMovedSinceSpawn; // 0xC58 - 0xC59
   bool m_bCanMoveDuringFreezePeriod; // 0xC59 - 0xC5A
   bool m_isCurrentGunGameLeader; // 0xC5A - 0xC5B
   bool m_isCurrentGunGameTeamLeader; // 0xC5B - 0xC5C
   float m_flGuardianTooFarDistFrac; // 0xC5C - 0xC60
   float m_flNextGuardianTooFarHurtTime; // 0xC60 - 0xC64
   GameTime_t m_flDetectedByEnemySensorTime; // 0xC64 - 0xC68
   bool m_bIsSpawnRappelling; // 0xC68 - 0xC69
   unsigned char pad_C69[0x3]; // 0xC69 - 0xC6C
   Vector m_vecSpawnRappellingRopeOrigin; // 0xC6C - 0xC78
   int32_t m_nSurvivalTeam; // 0xC78 - 0xC7C
   CHandle< CCSPlayerPawnBase > m_hSurvivalAssassinationTarget; // 0xC7C - 0xC80
   int32_t m_nCompletedSurvivalAssassinations; // 0xC80 - 0xC84
   float m_flDealtDamageToEnemyMostRecentTimestamp; // 0xC84 - 0xC88
   float m_flHealthShotBoostExpirationTime; // 0xC88 - 0xC8C
   GameTime_t m_flLastEquippedHelmetTime; // 0xC8C - 0xC90
   GameTime_t m_flLastEquippedArmorTime; // 0xC90 - 0xC94
   int32_t m_nHeavyAssaultSuitCooldownRemaining; // 0xC94 - 0xC98
   bool m_bResetArmorNextSpawn; // 0xC98 - 0xC99
   unsigned char pad_C99[0x3]; // 0xC99 - 0xC9C
   float m_flLastExoJumpTime; // 0xC9C - 0xCA0
   GameTime_t m_flLastBumpMineBumpTime; // 0xCA0 - 0xCA4
   unsigned char pad_CA4[0xC]; // 0xCA4 - 0xCB0
   GameTime_t m_flEmitSoundTime; // 0xCB0 - 0xCB4
   bool m_bEscaped; // 0xCB4 - 0xCB5
   bool m_bIsVIP; // 0xCB5 - 0xCB6
   unsigned char pad_CB6[0x2]; // 0xCB6 - 0xCB8
   int32_t m_iNumSpawns; // 0xCB8 - 0xCBC
   int32_t m_iShouldHaveCash; // 0xCBC - 0xCC0
   bool m_bJustKilledTeammate; // 0xCC0 - 0xCC1
   bool m_bPunishedForTK; // 0xCC1 - 0xCC2
   bool m_bInvalidSteamLogonDelayed; // 0xCC2 - 0xCC3
   unsigned char pad_CC3[0x1]; // 0xCC3 - 0xCC4
   int32_t m_iTeamKills; // 0xCC4 - 0xCC8
   GameTime_t m_flLastAction; // 0xCC8 - 0xCCC
   float32 m_flNameChangeHistory[5]; // 0xCCC - 0xCE0
   float m_fLastGivenDefuserTime; // 0xCE0 - 0xCE4
   float m_fLastGivenBombTime; // 0xCE4 - 0xCE8
   bool m_bHasNightVision; // 0xCE8 - 0xCE9
   bool m_bNightVisionOn; // 0xCE9 - 0xCEA
   unsigned char pad_CEA[0x2]; // 0xCEA - 0xCEC
   float m_fNextRadarUpdateTime; // 0xCEC - 0xCF0
   float m_flLastMoneyUpdateTime; // 0xCF0 - 0xCF4
   char m_MenuStringBuffer[1024]; // 0xCF4 - 0x10F4
   CHandle< CBaseEntity > m_pIntroCamera; // 0x10F4 - 0x10F8
   float m_fIntroCamTime; // 0x10F8 - 0x10FC
   int32_t m_nMyCollisionGroup; // 0x10FC - 0x1100
   bool m_bInBombZone; // 0x1100 - 0x1101
   bool m_bInBuyZone; // 0x1101 - 0x1102
   bool m_bInNoDefuseArea; // 0x1102 - 0x1103
   bool m_bKilledByTaser; // 0x1103 - 0x1104
   int32_t m_iMoveState; // 0x1104 - 0x1108
   CStrongHandle< InfoForResourceTypeCModel > m_nPreviousModelIndex; // 0x1108 - 0x1110
   GameTime_t m_grenadeParameterStashTime; // 0x1110 - 0x1114
   bool m_bGrenadeParametersStashed; // 0x1114 - 0x1115
   unsigned char pad_1115[0x3]; // 0x1115 - 0x1118
   QAngle m_angStashedShootAngles; // 0x1118 - 0x1124
   Vector m_vecStashedGrenadeThrowPosition; // 0x1124 - 0x1130
   Vector m_vecStashedVelocity; // 0x1130 - 0x113C
   QAngle m_angShootAngleHistory[2]; // 0x113C - 0x1154
   Vector m_vecThrowPositionHistory[2]; // 0x1154 - 0x116C
   Vector m_vecVelocityHistory[2]; // 0x116C - 0x1184
   uint16_t m_nCharacterDefIndex; // 0x1184 - 0x1186
   bool m_bDiedAirborne; // 0x1186 - 0x1187
   unsigned char pad_1187[0x1]; // 0x1187 - 0x1188
   CEntityIndex m_iBombSiteIndex; // 0x1188 - 0x118C
   int32_t m_nWhichBombZone; // 0x118C - 0x1190
   bool m_bInBombZoneTrigger; // 0x1190 - 0x1191
   bool m_bWasInBombZoneTrigger; // 0x1191 - 0x1192
   bool m_bWasInHostageRescueZone; // 0x1192 - 0x1193
   bool m_bWasInBuyZone; // 0x1193 - 0x1194
   bool m_bInHostageRescueZone; // 0x1194 - 0x1195
   unsigned char pad_1195[0x3]; // 0x1195 - 0x1198
   float m_flStamina; // 0x1198 - 0x119C
   int32_t m_iDirection; // 0x119C - 0x11A0
   int32_t m_iShotsFired; // 0x11A0 - 0x11A4
   int32_t m_ArmorValue; // 0x11A4 - 0x11A8
   float m_flFlinchStack; // 0x11A8 - 0x11AC
   float m_flVelocityModifier; // 0x11AC - 0x11B0
   float m_flGroundAccelLinearFracLastTime; // 0x11B0 - 0x11B4
   int32_t m_iHostagesKilled; // 0x11B4 - 0x11B8
   Vector m_vecTotalBulletForce; // 0x11B8 - 0x11C4
   float m_flFlashDuration; // 0x11C4 - 0x11C8
   float m_flFlashMaxAlpha; // 0x11C8 - 0x11CC
   float m_flProgressBarStartTime; // 0x11CC - 0x11D0
   int32_t m_iProgressBarDuration; // 0x11D0 - 0x11D4
   bool m_bWaitForNoAttack; // 0x11D4 - 0x11D5
   bool m_bIsRespawningForDMBonus; // 0x11D5 - 0x11D6
   unsigned char pad_11D6[0x2]; // 0x11D6 - 0x11D8
   float m_flLowerBodyYawTarget; // 0x11D8 - 0x11DC
   bool m_bStrafing; // 0x11DC - 0x11DD
   unsigned char pad_11DD[0x3]; // 0x11DD - 0x11E0
   Vector m_lastStandingPos; // 0x11E0 - 0x11EC
   float m_ignoreLadderJumpTime; // 0x11EC - 0x11F0
   CountdownTimer m_ladderSurpressionTimer; // 0x11F0 - 0x1208
   Vector m_lastLadderNormal; // 0x1208 - 0x1214
   Vector m_lastLadderPos; // 0x1214 - 0x1220
   QAngle m_thirdPersonHeading; // 0x1220 - 0x122C
   float m_flSlopeDropOffset; // 0x122C - 0x1230
   float m_flSlopeDropHeight; // 0x1230 - 0x1234
   Vector m_vHeadConstraintOffset; // 0x1234 - 0x1240
   unsigned char pad_1240[0x8]; // 0x1240 - 0x1248
   int32_t m_iLastWeaponFireUsercmd; // 0x1248 - 0x124C
   QAngle m_angEyeAngles; // 0x124C - 0x1258
   bool m_bVCollisionInitted; // 0x1258 - 0x1259
   unsigned char pad_1259[0x3]; // 0x1259 - 0x125C
   Vector m_storedSpawnPosition; // 0x125C - 0x1268
   QAngle m_storedSpawnAngle; // 0x1268 - 0x1274
   bool m_bIsSpawning; // 0x1274 - 0x1275
   bool m_bHideTargetID; // 0x1275 - 0x1276
   unsigned char pad_1276[0x2]; // 0x1276 - 0x1278
   int32_t m_nNumDangerZoneDamageHits; // 0x1278 - 0x127C
   bool m_bHud_MiniScoreHidden; // 0x127C - 0x127D
   bool m_bHud_RadarHidden; // 0x127D - 0x127E
   unsigned char pad_127E[0x2]; // 0x127E - 0x1280
   CEntityIndex m_nLastKillerIndex; // 0x1280 - 0x1284
   int32_t m_nLastConcurrentKilled; // 0x1284 - 0x1288
   int32_t m_nDeathCamMusic; // 0x1288 - 0x128C
   int32_t m_iAddonBits; // 0x128C - 0x1290
   int32_t m_iPrimaryAddon; // 0x1290 - 0x1294
   int32_t m_iSecondaryAddon; // 0x1294 - 0x1298
   int32_t m_nTeamDamageGivenForMatch; // 0x1298 - 0x129C
   bool m_bTDGaveProtectionWarning; // 0x129C - 0x129D
   bool m_bTDGaveProtectionWarningThisRound; // 0x129D - 0x129E
   unsigned char pad_129E[0x2]; // 0x129E - 0x12A0
   float m_flLastTHWarningTime; // 0x12A0 - 0x12A4
   CUtlStringToken m_currentDeafnessFilter; // 0x12A4 - 0x12A8
   CUtlVector< CHandle< CCSPlayerPawnBase > > m_enemyPlayersKilledThisRound; // 0x12A8 - 0x12C0
   int32_t m_NumEnemiesKilledThisSpawn; // 0x12C0 - 0x12C4
   int32_t m_maxNumEnemiesKillStreak; // 0x12C4 - 0x12C8
   int32_t m_NumEnemiesKilledThisRound; // 0x12C8 - 0x12CC
   int32_t m_NumEnemiesAtRoundStart; // 0x12CC - 0x12D0
   int32_t m_iRoundsWon; // 0x12D0 - 0x12D4
   bool m_bHasUsedDMBonusRespawn; // 0x12D4 - 0x12D5
   unsigned char pad_12D5[0x3]; // 0x12D5 - 0x12D8
   int32_t m_lastRoundResult; // 0x12D8 - 0x12DC
   bool m_wasNotKilledNaturally; // 0x12DC - 0x12DD
   unsigned char pad_12DD[0x3]; // 0x12DD - 0x12E0
   uint32 m_vecPlayerPatchEconIndices[5]; // 0x12E0 - 0x12F4
   int32_t m_iDeathFlags; // 0x12F4 - 0x12F8
   CHandle< CChicken > m_hPet; // 0x12F8 - 0x12FC
   float m_flLastKnownAccumulatedWeaponEncumbrance; // 0x12FC - 0x1300
   float m_flLastTimeComputedAccumulatedWeaponEncumbrance; // 0x1300 - 0x1304
   unsigned char pad_1304[0x1CC]; // 0x1304 - 0x14D0
   uint16_t m_unCurrentEquipmentValue; // 0x14D0 - 0x14D2
   uint16_t m_unRoundStartEquipmentValue; // 0x14D2 - 0x14D4
   uint16_t m_unFreezetimeEndEquipmentValue; // 0x14D4 - 0x14D6
   char m_szLastPlaceName[18]; // 0x14D6 - 0x14E8
   int32_t m_nSuicides; // 0x14E8 - 0x14EC
   int32_t m_nSurvivalTeamNumber; // 0x14EC - 0x14F0
   QAngle m_aimPunchAngle; // 0x14F0 - 0x14FC
   QAngle m_aimPunchAngleVel; // 0x14FC - 0x1508
   int32_t m_aimPunchTickBase; // 0x1508 - 0x150C
   float m_aimPunchTickFraction; // 0x150C - 0x1510
   CUtlVector< QAngle > m_aimPunchCache; // 0x1510 - 0x1528
   bool m_bHasDeathInfo; // 0x1528 - 0x1529
   unsigned char pad_1529[0x3]; // 0x1529 - 0x152C
   float m_flDeathInfoTime; // 0x152C - 0x1530
   Vector m_vecDeathInfoOrigin; // 0x1530 - 0x153C
   bool m_bKilledByHeadshot; // 0x153C - 0x153D
   unsigned char pad_153D[0x3]; // 0x153D - 0x1540
   int32_t m_LastHitBox; // 0x1540 - 0x1544
   int32_t m_LastHealth; // 0x1544 - 0x1548
   float m_flLastCollisionCeiling; // 0x1548 - 0x154C
   float m_flLastCollisionCeilingChangeTime; // 0x154C - 0x1550
   CUtlString m_strVOPrefix; // 0x1550 - 0x1558
   float m_flLandseconds; // 0x1558 - 0x155C
   unsigned char pad_155C[0x4]; // 0x155C - 0x1560
   CCSBot* m_pBot; // 0x1560 - 0x1568
   bool m_bBotAllowActive; // 0x1568 - 0x1569
   bool m_bCommittingSuicideOnTeamChange; // 0x1569 - 0x156A
   unsigned char pad_156A[0x6]; // 0x156A - 0x1570
}; // size - 0x1570


class CContainerAnimNodeBase /* "animationsystem" */ : public CAnimNodeBase /* "animationsystem" */
{
public:
   unsigned char pad_38[0x10]; // 0x38 - 0x48
   AnimNodeID m_inputNodeID; // 0x48 - 0x4C
   AnimNodeID m_outputNodeID; // 0x4C - 0x50
   CUtlHashtable< AnimNodeOutputID, CAnimNodeConnection > m_inputConnectionMap; // 0x50 - 0x70
}; // size - 0x70


class CCycleBase /* "modellib" */
{
public:
   float m_flCycle; // 0x0 - 0x4
}; // size - 0x4


class CExampleSchemaVData_PolymorphicBase /* "resourcefile" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   int32_t m_nBase; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
}; // size - 0x10


class CFuncBrush /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   BrushSolidities_e m_iSolidity; // 0x6F0 - 0x6F4
   int32_t m_iDisabled; // 0x6F4 - 0x6F8
   bool m_bSolidBsp; // 0x6F8 - 0x6F9
   unsigned char pad_6F9[0x7]; // 0x6F9 - 0x700
   CUtlSymbolLarge m_iszExcludedClass; // 0x700 - 0x708
   bool m_bInvertExclusion; // 0x708 - 0x709
   bool m_bScriptedMovement; // 0x709 - 0x70A
   unsigned char pad_70A[0x6]; // 0x70A - 0x710
}; // size - 0x710


class CFuncMoveLinear /* "server" */ : public CBaseToggle /* "server" */
{
public:
   MoveLinearAuthoredPos_t m_authoredPosition; // 0x770 - 0x774
   QAngle m_angMoveEntitySpace; // 0x774 - 0x780
   Vector m_vecMoveDirParentSpace; // 0x780 - 0x78C
   unsigned char pad_78C[0x4]; // 0x78C - 0x790
   CUtlSymbolLarge m_soundStart; // 0x790 - 0x798
   CUtlSymbolLarge m_soundStop; // 0x798 - 0x7A0
   CUtlSymbolLarge m_currentSound; // 0x7A0 - 0x7A8
   float m_flBlockDamage; // 0x7A8 - 0x7AC
   float m_flStartPosition; // 0x7AC - 0x7B0
   float m_flMoveDistance; // 0x7B0 - 0x7B4
   unsigned char pad_7B4[0xC]; // 0x7B4 - 0x7C0
   CEntityIOOutput m_OnFullyOpen; // 0x7C0 - 0x7E8
   CEntityIOOutput m_OnFullyClosed; // 0x7E8 - 0x810
   bool m_bCreateNavObstacle; // 0x810 - 0x811
   unsigned char pad_811[0xF]; // 0x811 - 0x820
}; // size - 0x820


class CGeneralSpin /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   int32_t m_nSpinRateDegrees; // 0x210 - 0x214
   int32_t m_nSpinRateMinDegrees; // 0x214 - 0x218
   unsigned char pad_218[0x4]; // 0x218 - 0x21C
   float m_fSpinRateStopTime; // 0x21C - 0x220
   unsigned char pad_220[0x10]; // 0x220 - 0x230
}; // size - 0x230


class CLogicalEntity /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x538]; // 0x0 - 0x538
}; // size - 0x538


class CMotionItem /* "animationsystem" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
   CMotionParameterManager m_paramManager; // 0x28 - 0x50
   CUtlVector< CSmartPtr< CAnimTagSpan > > m_blockSpans; // 0x50 - 0x68
   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x68 - 0x80
   CUtlVector< CSmartPtr< CAnimParamSpan > > m_paramSpans; // 0x80 - 0x98
   unsigned char pad_98[0x8]; // 0x98 - 0xA0
   bool m_bLoop; // 0xA0 - 0xA1
   unsigned char pad_A1[0x7]; // 0xA1 - 0xA8
}; // size - 0xA8


class CMotionNode /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlString m_name; // 0x18 - 0x20
   AnimNodeID m_id; // 0x20 - 0x24
   unsigned char pad_24[0x4]; // 0x24 - 0x28
}; // size - 0x28


class CPathAnimMotorBase /* "animationsystem" */ : public CAnimMotorBase /* "animationsystem" */
{
public:
   bool m_bLockToPath; // 0x28 - 0x29
   unsigned char pad_29[0x7]; // 0x29 - 0x30
}; // size - 0x30


class CPathAnimMotorUpdaterBase /* "animationsystem" */ : public CAnimMotorUpdaterBase /* "animationsystem" */
{
public:
   bool m_bLockToPath; // 0x20 - 0x21
   unsigned char pad_21[0x7]; // 0x21 - 0x28
}; // size - 0x28


class CPhysForce /* "server" */ : public CPointEntity /* "server" */
{
public:
   unsigned char pad_4A0[0x8]; // 0x4A0 - 0x4A8
   CUtlSymbolLarge m_nameAttach; // 0x4A8 - 0x4B0
   float m_force; // 0x4B0 - 0x4B4
   float m_forceTime; // 0x4B4 - 0x4B8
   CHandle< CBaseEntity > m_attachedObject; // 0x4B8 - 0x4BC
   bool m_wasRestored; // 0x4BC - 0x4BD
   unsigned char pad_4BD[0x3]; // 0x4BD - 0x4C0
   CConstantForceController m_integrator; // 0x4C0 - 0x500
}; // size - 0x500


class CPointClientUIWorldPanel /* "server" */ : public CBaseClientUIEntity /* "server" */
{
public:
   bool m_bIgnoreInput; // 0x8A0 - 0x8A1
   bool m_bLit; // 0x8A1 - 0x8A2
   bool m_bFollowPlayerAcrossTeleport; // 0x8A2 - 0x8A3
   unsigned char pad_8A3[0x1]; // 0x8A3 - 0x8A4
   float m_flWidth; // 0x8A4 - 0x8A8
   float m_flHeight; // 0x8A8 - 0x8AC
   float m_flDPI; // 0x8AC - 0x8B0
   float m_flInteractDistance; // 0x8B0 - 0x8B4
   float m_flDepthOffset; // 0x8B4 - 0x8B8
   uint32_t m_unOwnerContext; // 0x8B8 - 0x8BC
   uint32_t m_unHorizontalAlign; // 0x8BC - 0x8C0
   uint32_t m_unVerticalAlign; // 0x8C0 - 0x8C4
   uint32_t m_unOrientation; // 0x8C4 - 0x8C8
   bool m_bAllowInteractionFromAllSceneWorlds; // 0x8C8 - 0x8C9
   unsigned char pad_8C9[0x7]; // 0x8C9 - 0x8D0
   CNetworkUtlVectorBase< CUtlSymbolLarge > m_vecCSSClasses; // 0x8D0 - 0x8E8
   bool m_bOpaque; // 0x8E8 - 0x8E9
   bool m_bNoDepth; // 0x8E9 - 0x8EA
   bool m_bRenderBackface; // 0x8EA - 0x8EB
   bool m_bUseOffScreenIndicator; // 0x8EB - 0x8EC
   bool m_bExcludeFromSaveGames; // 0x8EC - 0x8ED
   bool m_bGrabbable; // 0x8ED - 0x8EE
   bool m_bOnlyRenderToTexture; // 0x8EE - 0x8EF
   bool m_bDisableMipGen; // 0x8EF - 0x8F0
   int32_t m_nExplicitImageLayout; // 0x8F0 - 0x8F4
   unsigned char pad_8F4[0x4]; // 0x8F4 - 0x8F8
}; // size - 0x8F8


class CProxyAnimNodeBase /* "animationsystem" */ : public CAnimNodeBase /* "animationsystem" */
{
public:
   unsigned char pad_38[0x8]; // 0x38 - 0x40
   CUtlVector< CConnectionProxyItem > m_proxyItems; // 0x40 - 0x58
}; // size - 0x58


class CPulseCell_BaseYieldingInflow /* "pulse_runtime_lib" */ : public CPulseCell_BaseFlow /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x48]; // 0x0 - 0x48
}; // size - 0x48


class CPulseCell_Step_BaseCallMethod /* "pulse_runtime_lib" */ : public CPulseCell_BaseFlow /* "pulse_runtime_lib" */
{
public:
   CUtlSymbolLarge m_MethodName; // 0x48 - 0x50
   CKV3MemberNameWithStorage m_Arg0Name; // 0x50 - 0x88
   CKV3MemberNameWithStorage m_Arg1Name; // 0x88 - 0xC0
}; // size - 0xC0


class CRagdollProp /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   unsigned char pad_820[0x8]; // 0x820 - 0x828
   ragdoll_t m_ragdoll; // 0x828 - 0x860
   bool m_bStartDisabled; // 0x860 - 0x861
   unsigned char pad_861[0x7]; // 0x861 - 0x868
   CNetworkUtlVectorBase< Vector > m_ragPos; // 0x868 - 0x880
   CNetworkUtlVectorBase< QAngle > m_ragAngles; // 0x880 - 0x898
   CHandle< CBaseEntity > m_hRagdollSource; // 0x898 - 0x89C
   uint32_t m_lastUpdateTickCount; // 0x89C - 0x8A0
   bool m_allAsleep; // 0x8A0 - 0x8A1
   bool m_bFirstCollisionAfterLaunch; // 0x8A1 - 0x8A2
   unsigned char pad_8A2[0x2]; // 0x8A2 - 0x8A4
   CHandle< CBaseEntity > m_hDamageEntity; // 0x8A4 - 0x8A8
   CHandle< CBaseEntity > m_hKiller; // 0x8A8 - 0x8AC
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x8AC - 0x8B0
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x8B0 - 0x8B4
   GameTime_t m_flFadeOutStartTime; // 0x8B4 - 0x8B8
   float m_flFadeTime; // 0x8B8 - 0x8BC
   Vector m_vecLastOrigin; // 0x8BC - 0x8C8
   GameTime_t m_flAwakeTime; // 0x8C8 - 0x8CC
   GameTime_t m_flLastOriginChangeTime; // 0x8CC - 0x8D0
   int32_t m_nBloodColor; // 0x8D0 - 0x8D4
   unsigned char pad_8D4[0x4]; // 0x8D4 - 0x8D8
   CUtlSymbolLarge m_strOriginClassName; // 0x8D8 - 0x8E0
   CUtlSymbolLarge m_strSourceClassName; // 0x8E0 - 0x8E8
   bool m_bHasBeenPhysgunned; // 0x8E8 - 0x8E9
   bool m_bShouldTeleportPhysics; // 0x8E9 - 0x8EA
   unsigned char pad_8EA[0x2]; // 0x8EA - 0x8EC
   float m_flBlendWeight; // 0x8EC - 0x8F0
   float m_flDefaultFadeScale; // 0x8F0 - 0x8F4
   unsigned char pad_8F4[0x4]; // 0x8F4 - 0x8F8
   CUtlVector< Vector > m_ragdollMins; // 0x8F8 - 0x910
   CUtlVector< Vector > m_ragdollMaxs; // 0x910 - 0x928
   bool m_bShouldDeleteActivationRecord; // 0x928 - 0x929
   unsigned char pad_929[0x5F]; // 0x929 - 0x988
   bool m_bValidatePoweredRagdollPose; // 0x988 - 0x989
   unsigned char pad_989[0x3F]; // 0x989 - 0x9C8
}; // size - 0x9C8


class CSSDSMsg_LayerBase /* "scenesystem" */
{
public:
   SceneViewId_t m_viewId; // 0x0 - 0x10
   CUtlString m_ViewName; // 0x10 - 0x18
   int32_t m_nLayerIndex; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
   uint64_t m_nLayerId; // 0x20 - 0x28
   CUtlString m_LayerName; // 0x28 - 0x30
   CUtlString m_displayText; // 0x30 - 0x38
}; // size - 0x38


class CSceneEntity /* "server" */ : public CPointEntity /* "server" */
{
public:
   unsigned char pad_4A0[0x8]; // 0x4A0 - 0x4A8
   CUtlSymbolLarge m_iszSceneFile; // 0x4A8 - 0x4B0
   CUtlSymbolLarge m_iszResumeSceneFile; // 0x4B0 - 0x4B8
   CUtlSymbolLarge m_iszTarget1; // 0x4B8 - 0x4C0
   CUtlSymbolLarge m_iszTarget2; // 0x4C0 - 0x4C8
   CUtlSymbolLarge m_iszTarget3; // 0x4C8 - 0x4D0
   CUtlSymbolLarge m_iszTarget4; // 0x4D0 - 0x4D8
   CUtlSymbolLarge m_iszTarget5; // 0x4D8 - 0x4E0
   CUtlSymbolLarge m_iszTarget6; // 0x4E0 - 0x4E8
   CUtlSymbolLarge m_iszTarget7; // 0x4E8 - 0x4F0
   CUtlSymbolLarge m_iszTarget8; // 0x4F0 - 0x4F8
   CHandle< CBaseEntity > m_hTarget1; // 0x4F8 - 0x4FC
   CHandle< CBaseEntity > m_hTarget2; // 0x4FC - 0x500
   CHandle< CBaseEntity > m_hTarget3; // 0x500 - 0x504
   CHandle< CBaseEntity > m_hTarget4; // 0x504 - 0x508
   CHandle< CBaseEntity > m_hTarget5; // 0x508 - 0x50C
   CHandle< CBaseEntity > m_hTarget6; // 0x50C - 0x510
   CHandle< CBaseEntity > m_hTarget7; // 0x510 - 0x514
   CHandle< CBaseEntity > m_hTarget8; // 0x514 - 0x518
   bool m_bIsPlayingBack; // 0x518 - 0x519
   bool m_bPaused; // 0x519 - 0x51A
   bool m_bMultiplayer; // 0x51A - 0x51B
   bool m_bAutogenerated; // 0x51B - 0x51C
   float m_flForceClientTime; // 0x51C - 0x520
   float m_flCurrentTime; // 0x520 - 0x524
   float m_flFrameTime; // 0x524 - 0x528
   bool m_bCancelAtNextInterrupt; // 0x528 - 0x529
   unsigned char pad_529[0x3]; // 0x529 - 0x52C
   float m_fPitch; // 0x52C - 0x530
   bool m_bAutomated; // 0x530 - 0x531
   unsigned char pad_531[0x3]; // 0x531 - 0x534
   int32_t m_nAutomatedAction; // 0x534 - 0x538
   float m_flAutomationDelay; // 0x538 - 0x53C
   float m_flAutomationTime; // 0x53C - 0x540
   CHandle< CBaseEntity > m_hWaitingForThisResumeScene; // 0x540 - 0x544
   bool m_bWaitingForResumeScene; // 0x544 - 0x545
   bool m_bPausedViaInput; // 0x545 - 0x546
   bool m_bPauseAtNextInterrupt; // 0x546 - 0x547
   bool m_bWaitingForActor; // 0x547 - 0x548
   bool m_bWaitingForInterrupt; // 0x548 - 0x549
   bool m_bInterruptedActorsScenes; // 0x549 - 0x54A
   bool m_bBreakOnNonIdle; // 0x54A - 0x54B
   unsigned char pad_54B[0x5]; // 0x54B - 0x550
   CNetworkUtlVectorBase< CHandle< CBaseFlex > > m_hActorList; // 0x550 - 0x568
   CUtlVector< CHandle< CBaseEntity > > m_hRemoveActorList; // 0x568 - 0x580
   unsigned char pad_580[0x10]; // 0x580 - 0x590
   int32_t m_nSceneFlushCounter; // 0x590 - 0x594
   uint16_t m_nSceneStringIndex; // 0x594 - 0x596
   unsigned char pad_596[0x2]; // 0x596 - 0x598
   CEntityIOOutput m_OnStart; // 0x598 - 0x5C0
   CEntityIOOutput m_OnCompletion; // 0x5C0 - 0x5E8
   CEntityIOOutput m_OnCanceled; // 0x5E8 - 0x610
   CEntityIOOutput m_OnPaused; // 0x610 - 0x638
   CEntityIOOutput m_OnResumed; // 0x638 - 0x660
   CEntityIOOutput m_OnTrigger[16]; // 0x660 - 0x8E0
   unsigned char pad_8E0[0x90]; // 0x8E0 - 0x970
   CHandle< CSceneEntity > m_hInterruptScene; // 0x970 - 0x974
   int32_t m_nInterruptCount; // 0x974 - 0x978
   bool m_bSceneMissing; // 0x978 - 0x979
   bool m_bInterrupted; // 0x979 - 0x97A
   bool m_bCompletedEarly; // 0x97A - 0x97B
   bool m_bInterruptSceneFinished; // 0x97B - 0x97C
   bool m_bRestoring; // 0x97C - 0x97D
   unsigned char pad_97D[0x3]; // 0x97D - 0x980
   CUtlVector< CHandle< CSceneEntity > > m_hNotifySceneCompletion; // 0x980 - 0x998
   CUtlVector< CHandle< CSceneListManager > > m_hListManagers; // 0x998 - 0x9B0
   unsigned char pad_9B0[0x28]; // 0x9B0 - 0x9D8
   CUtlSymbolLarge m_iszSoundName; // 0x9D8 - 0x9E0
   CHandle< CBaseFlex > m_hActor; // 0x9E0 - 0x9E4
   CHandle< CBaseEntity > m_hActivator; // 0x9E4 - 0x9E8
   CHandle< CBaseEntity > m_hCamera; // 0x9E8 - 0x9EC
   int32_t m_BusyActor; // 0x9EC - 0x9F0
   SceneOnPlayerDeath_t m_iPlayerDeathBehavior; // 0x9F0 - 0x9F4
   unsigned char pad_9F4[0xC]; // 0x9F4 - 0xA00
}; // size - 0xA00


class CServerOnlyModelEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_0[0x6F0]; // 0x0 - 0x6F0
}; // size - 0x6F0


class CSkeletonAnimationController /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CSkeletonInstance* m_pSkeletonInstance; // 0x8 - 0x10
}; // size - 0x10


class CSosGroupActionSchema /* "soundsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlString m_name; // 0x8 - 0x10
   ActionType_t m_actionType; // 0x10 - 0x14
   ActionType_t m_actionInstanceType; // 0x14 - 0x18
}; // size - 0x18


class CSoundAreaEntityBase /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x7]; // 0x4A1 - 0x4A8
   CUtlSymbolLarge m_iszSoundAreaType; // 0x4A8 - 0x4B0
   Vector m_vPos; // 0x4B0 - 0x4BC
   unsigned char pad_4BC[0x4]; // 0x4BC - 0x4C0
}; // size - 0x4C0


class CTriggerHurt /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   float m_flOriginalDamage; // 0x898 - 0x89C
   float m_flDamage; // 0x89C - 0x8A0
   float m_flDamageCap; // 0x8A0 - 0x8A4
   GameTime_t m_flLastDmgTime; // 0x8A4 - 0x8A8
   float m_flForgivenessDelay; // 0x8A8 - 0x8AC
   int32_t m_bitsDamageInflict; // 0x8AC - 0x8B0
   int32_t m_damageModel; // 0x8B0 - 0x8B4
   bool m_bNoDmgForce; // 0x8B4 - 0x8B5
   unsigned char pad_8B5[0x3]; // 0x8B5 - 0x8B8
   Vector m_vDamageForce; // 0x8B8 - 0x8C4
   bool m_thinkAlways; // 0x8C4 - 0x8C5
   unsigned char pad_8C5[0x3]; // 0x8C5 - 0x8C8
   float m_hurtThinkPeriod; // 0x8C8 - 0x8CC
   unsigned char pad_8CC[0x4]; // 0x8CC - 0x8D0
   CEntityIOOutput m_OnHurt; // 0x8D0 - 0x8F8
   CEntityIOOutput m_OnHurtPlayer; // 0x8F8 - 0x920
   CUtlVector< CHandle< CBaseEntity > > m_hurtEntities; // 0x920 - 0x938
}; // size - 0x938


class CTriggerOnce /* "server" */ : public CTriggerMultiple /* "server" */
{
public:
   unsigned char pad_0[0x8C0]; // 0x0 - 0x8C0
}; // size - 0x8C0


class C_BarnLight /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   bool m_bEnabled; // 0x838 - 0x839
   unsigned char pad_839[0x3]; // 0x839 - 0x83C
   int32_t m_nColorMode; // 0x83C - 0x840
   Color m_Color; // 0x840 - 0x844
   float m_flColorTemperature; // 0x844 - 0x848
   float m_flBrightness; // 0x848 - 0x84C
   float m_flBrightnessScale; // 0x84C - 0x850
   int32_t m_nDirectLight; // 0x850 - 0x854
   int32_t m_nBakedShadowIndex; // 0x854 - 0x858
   int32_t m_nLuminaireShape; // 0x858 - 0x85C
   float m_flLuminaireSize; // 0x85C - 0x860
   float m_flLuminaireAnisotropy; // 0x860 - 0x864
   unsigned char pad_864[0x4]; // 0x864 - 0x868
   CUtlString m_LightStyleString; // 0x868 - 0x870
   GameTime_t m_flLightStyleStartTime; // 0x870 - 0x874
   unsigned char pad_874[0x4]; // 0x874 - 0x878
   C_NetworkUtlVectorBase< CUtlString > m_QueuedLightStyleStrings; // 0x878 - 0x890
   C_NetworkUtlVectorBase< CUtlString > m_LightStyleEvents; // 0x890 - 0x8A8
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_LightStyleTargets; // 0x8A8 - 0x8C0
   CEntityIOOutput m_StyleEvent[4]; // 0x8C0 - 0x960
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; // 0x960 - 0x968
   float m_flShape; // 0x968 - 0x96C
   float m_flSoftX; // 0x96C - 0x970
   float m_flSoftY; // 0x970 - 0x974
   float m_flSkirt; // 0x974 - 0x978
   float m_flSkirtNear; // 0x978 - 0x97C
   Vector m_vSizeParams; // 0x97C - 0x988
   float m_flRange; // 0x988 - 0x98C
   Vector m_vShear; // 0x98C - 0x998
   int32_t m_nBakeSpecularToCubemaps; // 0x998 - 0x99C
   Vector m_vBakeSpecularToCubemapsSize; // 0x99C - 0x9A8
   int32_t m_nCastShadows; // 0x9A8 - 0x9AC
   int32_t m_nShadowMapSize; // 0x9AC - 0x9B0
   int32_t m_nShadowPriority; // 0x9B0 - 0x9B4
   bool m_bContactShadow; // 0x9B4 - 0x9B5
   unsigned char pad_9B5[0x3]; // 0x9B5 - 0x9B8
   int32_t m_nBounceLight; // 0x9B8 - 0x9BC
   float m_flBounceScale; // 0x9BC - 0x9C0
   float m_flMinRoughness; // 0x9C0 - 0x9C4
   int32_t m_nFog; // 0x9C4 - 0x9C8
   float m_flFogStrength; // 0x9C8 - 0x9CC
   int32_t m_nFogShadows; // 0x9CC - 0x9D0
   float m_flFogScale; // 0x9D0 - 0x9D4
   float m_flFadeSizeStart; // 0x9D4 - 0x9D8
   float m_flFadeSizeEnd; // 0x9D8 - 0x9DC
   float m_flShadowFadeSizeStart; // 0x9DC - 0x9E0
   float m_flShadowFadeSizeEnd; // 0x9E0 - 0x9E4
   bool m_bPrecomputedFieldsValid; // 0x9E4 - 0x9E5
   unsigned char pad_9E5[0x3]; // 0x9E5 - 0x9E8
   Vector m_vPrecomputedBoundsMins; // 0x9E8 - 0x9F4
   Vector m_vPrecomputedBoundsMaxs; // 0x9F4 - 0xA00
   Vector m_vPrecomputedOBBOrigin; // 0xA00 - 0xA0C
   QAngle m_vPrecomputedOBBAngles; // 0xA0C - 0xA18
   Vector m_vPrecomputedOBBExtent; // 0xA18 - 0xA24
   unsigned char pad_A24[0x4C]; // 0xA24 - 0xA70
}; // size - 0xA70


class C_CSGO_EndOfMatchLineupEndpoint /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x538]; // 0x0 - 0x538
}; // size - 0x538


class C_CSGO_PreviewPlayer /* "client" */ : public C_CSPlayerPawn /* "client" */
{
public:
   CUtlString m_animgraph; // 0x19C0 - 0x19C8
   CUtlString m_animgraphCharacterModeString; // 0x19C8 - 0x19D0
   float m_flInitialModelScale; // 0x19D0 - 0x19D4
   unsigned char pad_19D4[0x74]; // 0x19D4 - 0x1A48
}; // size - 0x1A48


class C_CSGO_TeamIntroCharacterPosition /* "client" */ : public C_CSGO_TeamPreviewCharacterPosition /* "client" */
{
public:
   unsigned char pad_0[0x9D0]; // 0x0 - 0x9D0
}; // size - 0x9D0


class C_CSGO_TeamSelectCharacterPosition /* "client" */ : public C_CSGO_TeamPreviewCharacterPosition /* "client" */
{
public:
   unsigned char pad_0[0x9D0]; // 0x0 - 0x9D0
}; // size - 0x9D0


class C_FuncBrush /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_0[0x838]; // 0x0 - 0x838
}; // size - 0x838


class C_Item /* "client" */ : public C_EconEntity /* "client" */
{
public:
   bool m_bShouldGlow; // 0x1070 - 0x1071
   char m_pReticleHintTextName[256]; // 0x1071 - 0x1171
   unsigned char pad_1171[0x7]; // 0x1171 - 0x1178
}; // size - 0x1178


class C_OP_RemapDistanceToLineSegmentBase /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   int32_t m_nCP0; // 0x210 - 0x214
   int32_t m_nCP1; // 0x214 - 0x218
   float m_flMinInputValue; // 0x218 - 0x21C
   float m_flMaxInputValue; // 0x21C - 0x220
   bool m_bInfiniteLine; // 0x220 - 0x221
   unsigned char pad_221[0xF]; // 0x221 - 0x230
}; // size - 0x230


class C_ParticleSystem /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   char m_szSnapshotFileName[512]; // 0x838 - 0xA38
   bool m_bActive; // 0xA38 - 0xA39
   bool m_bFrozen; // 0xA39 - 0xA3A
   unsigned char pad_A3A[0x2]; // 0xA3A - 0xA3C
   float m_flFreezeTransitionDuration; // 0xA3C - 0xA40
   int32_t m_nStopType; // 0xA40 - 0xA44
   bool m_bAnimateDuringGameplayPause; // 0xA44 - 0xA45
   unsigned char pad_A45[0x3]; // 0xA45 - 0xA48
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0xA48 - 0xA50
   GameTime_t m_flStartTime; // 0xA50 - 0xA54
   float m_flPreSimTime; // 0xA54 - 0xA58
   Vector m_vServerControlPoints[4]; // 0xA58 - 0xA88
   uint8 m_iServerControlPointAssignments[4]; // 0xA88 - 0xA8C
   CHandle< C_BaseEntity > m_hControlPointEnts[64]; // 0xA8C - 0xB8C
   bool m_bNoSave; // 0xB8C - 0xB8D
   bool m_bNoFreeze; // 0xB8D - 0xB8E
   bool m_bStartActive; // 0xB8E - 0xB8F
   unsigned char pad_B8F[0x1]; // 0xB8F - 0xB90
   CUtlSymbolLarge m_iszEffectName; // 0xB90 - 0xB98
   CUtlSymbolLarge m_iszControlPointNames[64]; // 0xB98 - 0xD98
   int32_t m_nDataCP; // 0xD98 - 0xD9C
   Vector m_vecDataCPValue; // 0xD9C - 0xDA8
   int32_t m_nTintCP; // 0xDA8 - 0xDAC
   Color m_clrTint; // 0xDAC - 0xDB0
   unsigned char pad_DB0[0x20]; // 0xDB0 - 0xDD0
   bool m_bOldActive; // 0xDD0 - 0xDD1
   bool m_bOldFrozen; // 0xDD1 - 0xDD2
   unsigned char pad_DD2[0x16]; // 0xDD2 - 0xDE8
}; // size - 0xDE8


class C_SoundAreaEntityBase /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   bool m_bDisabled; // 0x538 - 0x539
   unsigned char pad_539[0x7]; // 0x539 - 0x540
   bool m_bWasEnabled; // 0x540 - 0x541
   unsigned char pad_541[0x7]; // 0x541 - 0x548
   CUtlSymbolLarge m_iszSoundAreaType; // 0x548 - 0x550
   Vector m_vPos; // 0x550 - 0x55C
   unsigned char pad_55C[0x4]; // 0x55C - 0x560
}; // size - 0x560


class EventAdvanceTick_t /* "engine2" */ : public EventSimulate_t /* "engine2" */
{
public:
   int32_t m_nCurrentTick; // 0x30 - 0x34
   int32_t m_nCurrentTickThisFrame; // 0x34 - 0x38
   int32_t m_nTotalTicksThisFrame; // 0x38 - 0x3C
   int32_t m_nTotalTicks; // 0x3C - 0x40
}; // size - 0x40


class EventPostAdvanceTick_t /* "engine2" */ : public EventSimulate_t /* "engine2" */
{
public:
   int32_t m_nCurrentTick; // 0x30 - 0x34
   int32_t m_nCurrentTickThisFrame; // 0x34 - 0x38
   int32_t m_nTotalTicksThisFrame; // 0x38 - 0x3C
   int32_t m_nTotalTicks; // 0x3C - 0x40
}; // size - 0x40


class IEconItemInterface /* "server" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class AmmoTypeInfo_t /* "server" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   int32_t m_nMaxCarry; // 0x10 - 0x14
   unsigned char pad_14[0x8]; // 0x14 - 0x1C
   CRangeInt m_nSplashSize; // 0x1C - 0x24
   AmmoFlags_t m_nFlags; // 0x24 - 0x28
   float m_flMass; // 0x28 - 0x2C
   CRangeFloat m_flSpeed; // 0x2C - 0x34
   unsigned char pad_34[0x4]; // 0x34 - 0x38
}; // size - 0x38


class AnimationSnapshotBase_t /* "animationsystem" */
{
public:
   float m_flRealTime; // 0x0 - 0x4
   unsigned char pad_4[0xC]; // 0x4 - 0x10
   matrix3x4a_t m_rootToWorld; // 0x10 - 0x40
   bool m_bBonesInWorldSpace; // 0x40 - 0x41
   unsigned char pad_41[0x7]; // 0x41 - 0x48
   CUtlVector< uint32 > m_boneSetupMask; // 0x48 - 0x60
   CUtlVector< matrix3x4a_t > m_boneTransforms; // 0x60 - 0x78
   CUtlVector< float32 > m_flexControllers; // 0x78 - 0x90
   AnimationSnapshotType_t m_SnapshotType; // 0x90 - 0x94
   bool m_bHasDecodeDump; // 0x94 - 0x95
   unsigned char pad_95[0x3]; // 0x95 - 0x98
   AnimationDecodeDebugDumpElement_t m_DecodeDump; // 0x98 - 0x108
   unsigned char pad_108[0x8]; // 0x108 - 0x110
}; // size - 0x110


class CAI_ExpresserWithFollowup /* "server" */ : public CAI_Expresser /* "server" */
{
public:
   ResponseFollowup* m_pPostponedFollowup; // 0x60 - 0x68
   unsigned char pad_68[0x8]; // 0x68 - 0x70
}; // size - 0x70


class CAnimGraphSettingsGroup /* "animationsystem" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
}; // size - 0x20


class CAnimNodeManager /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlHashtable< AnimNodeID, CSmartPtr< CAnimNodeBase > > m_nodes; // 0x8 - 0x28
   unsigned char pad_28[0x20]; // 0x28 - 0x48
}; // size - 0x48


class CAnimationSubGraph /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CAnimNodeManager m_nodeManager; // 0x8 - 0x50
   CAnimComponentManager m_componentManager; // 0x50 - 0x78
   CUtlVector< CSmartPtr< CAnimParameterBase > > m_localParameters; // 0x78 - 0x90
   CUtlVector< CSmartPtr< CAnimTagBase > > m_localTags; // 0x90 - 0xA8
   CUtlVector< CUtlString > m_referencedParamGroups; // 0xA8 - 0xC0
   CUtlVector< CUtlString > m_referencedTagGroups; // 0xC0 - 0xD8
   unsigned char pad_D8[0x8]; // 0xD8 - 0xE0
}; // size - 0xE0


class CAttributeManager /* "server" */
{
public:
   class cached_attribute_float_t /* "server" */
   {
   public:
      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4]; // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14
      unsigned char pad_14[0x4]; // 0x14 - 0x18
   }; // size - 0x18

   class cached_attribute_float_t /* "client" */
   {
   public:
      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4]; // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14
      unsigned char pad_14[0x4]; // 0x14 - 0x18
   }; // size - 0x18

   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVector< CHandle< CBaseEntity > > m_Providers; // 0x8 - 0x20
   int32_t m_iReapplyProvisionParity; // 0x20 - 0x24
   CHandle< CBaseEntity > m_hOuter; // 0x24 - 0x28
   bool m_bPreventLoopback; // 0x28 - 0x29
   unsigned char pad_29[0x3]; // 0x29 - 0x2C
   attributeprovidertypes_t m_ProviderType; // 0x2C - 0x30
   CUtlVector< CAttributeManager::cached_attribute_float_t > m_CachedResults; // 0x30 - 0x48
   unsigned char pad_48[0x8]; // 0x48 - 0x50
}; // size - 0x50


class CAttributeManager /* "client" */
{
public:
   class cached_attribute_float_t /* "server" */
   {
   public:
      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4]; // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14
      unsigned char pad_14[0x4]; // 0x14 - 0x18
   }; // size - 0x18

   class cached_attribute_float_t /* "client" */
   {
   public:
      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4]; // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14
      unsigned char pad_14[0x4]; // 0x14 - 0x18
   }; // size - 0x18

   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVector< CHandle< C_BaseEntity > > m_Providers; // 0x8 - 0x20
   int32_t m_iReapplyProvisionParity; // 0x20 - 0x24
   CHandle< C_BaseEntity > m_hOuter; // 0x24 - 0x28
   bool m_bPreventLoopback; // 0x28 - 0x29
   unsigned char pad_29[0x3]; // 0x29 - 0x2C
   attributeprovidertypes_t m_ProviderType; // 0x2C - 0x30
   CUtlVector< CAttributeManager::cached_attribute_float_t > m_CachedResults; // 0x30 - 0x48
   unsigned char pad_48[0x8]; // 0x48 - 0x50
}; // size - 0x50


class CBaseFire /* "server" */ : public CBaseEntity /* "server" */
{
public:
   float m_flScale; // 0x4A0 - 0x4A4
   float m_flStartScale; // 0x4A4 - 0x4A8
   float m_flScaleTime; // 0x4A8 - 0x4AC
   uint32_t m_nFlags; // 0x4AC - 0x4B0
}; // size - 0x4B0


class CBasePlayerController /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_4A0[0x8]; // 0x4A0 - 0x4A8
   uint64_t m_nInButtonsWhichAreToggles; // 0x4A8 - 0x4B0
   uint32_t m_nTickBase; // 0x4B0 - 0x4B4
   unsigned char pad_4B4[0x2C]; // 0x4B4 - 0x4E0
   CHandle< CBasePlayerPawn > m_hPawn; // 0x4E0 - 0x4E4
   CSplitScreenSlot m_nSplitScreenSlot; // 0x4E4 - 0x4E8
   CHandle< CBasePlayerController > m_hSplitOwner; // 0x4E8 - 0x4EC
   unsigned char pad_4EC[0x4]; // 0x4EC - 0x4F0
   CUtlVector< CHandle< CBasePlayerController > > m_hSplitScreenPlayers; // 0x4F0 - 0x508
   bool m_bIsHLTV; // 0x508 - 0x509
   unsigned char pad_509[0x3]; // 0x509 - 0x50C
   PlayerConnectedState m_iConnected; // 0x50C - 0x510
   char m_iszPlayerName[128]; // 0x510 - 0x590
   CUtlString m_szNetworkIDString; // 0x590 - 0x598
   float m_fLerpTime; // 0x598 - 0x59C
   bool m_bLagCompensation; // 0x59C - 0x59D
   bool m_bPredict; // 0x59D - 0x59E
   bool m_bAutoKickDisabled; // 0x59E - 0x59F
   bool m_bIsLowViolence; // 0x59F - 0x5A0
   bool m_bGamePaused; // 0x5A0 - 0x5A1
   unsigned char pad_5A1[0x77]; // 0x5A1 - 0x618
   int32_t m_nHighestCommandNumberReceived; // 0x618 - 0x61C
   unsigned char pad_61C[0x4]; // 0x61C - 0x620
   int64_t m_nUsecTimestampLastUserCmdReceived; // 0x620 - 0x628
   unsigned char pad_628[0x10]; // 0x628 - 0x638
   ChatIgnoreType_t m_iIgnoreGlobalChat; // 0x638 - 0x63C
   float m_flLastPlayerTalkTime; // 0x63C - 0x640
   float m_flLastEntitySteadyState; // 0x640 - 0x644
   int32_t m_nAvailableEntitySteadyState; // 0x644 - 0x648
   bool m_bHasAnySteadyStateEnts; // 0x648 - 0x649
   unsigned char pad_649[0xF]; // 0x649 - 0x658
   uint64_t m_steamID; // 0x658 - 0x660
   uint32_t m_iDesiredFOV; // 0x660 - 0x664
   unsigned char pad_664[0x4]; // 0x664 - 0x668
}; // size - 0x668


class CBasePlayerController /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_538[0x8]; // 0x538 - 0x540
   int32_t m_nFinalPredictedTick; // 0x540 - 0x544
   unsigned char pad_544[0x4]; // 0x544 - 0x548
   C_CommandContext m_CommandContext; // 0x548 - 0x5C8
   uint64_t m_nInButtonsWhichAreToggles; // 0x5C8 - 0x5D0
   uint32_t m_nTickBase; // 0x5D0 - 0x5D4
   CHandle< C_BasePlayerPawn > m_hPawn; // 0x5D4 - 0x5D8
   CHandle< C_BasePlayerPawn > m_hPredictedPawn; // 0x5D8 - 0x5DC
   CSplitScreenSlot m_nSplitScreenSlot; // 0x5DC - 0x5E0
   CHandle< CBasePlayerController > m_hSplitOwner; // 0x5E0 - 0x5E4
   unsigned char pad_5E4[0x4]; // 0x5E4 - 0x5E8
   CUtlVector< CHandle< CBasePlayerController > > m_hSplitScreenPlayers; // 0x5E8 - 0x600
   bool m_bIsHLTV; // 0x600 - 0x601
   unsigned char pad_601[0x3]; // 0x601 - 0x604
   PlayerConnectedState m_iConnected; // 0x604 - 0x608
   char m_iszPlayerName[128]; // 0x608 - 0x688
   unsigned char pad_688[0x8]; // 0x688 - 0x690
   uint64_t m_steamID; // 0x690 - 0x698
   bool m_bIsLocalPlayerController; // 0x698 - 0x699
   unsigned char pad_699[0x3]; // 0x699 - 0x69C
   uint32_t m_iDesiredFOV; // 0x69C - 0x6A0
}; // size - 0x6A0


class CBasePlayerWeaponVData /* "client" */ : public CEntitySubclassVDataBase /* "client" */
{
public:
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_szWorldModel; // 0x28 - 0x108
   bool m_bBuiltRightHanded; // 0x108 - 0x109
   bool m_bAllowFlipping; // 0x109 - 0x10A
   bool m_bIsFullAuto; // 0x10A - 0x10B
   unsigned char pad_10B[0x1]; // 0x10B - 0x10C
   int32_t m_nNumBullets; // 0x10C - 0x110
   CUtlString m_sMuzzleAttachment; // 0x110 - 0x118
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szMuzzleFlashParticle; // 0x118 - 0x1F8
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szTracerParticle; // 0x1F8 - 0x2D8
   ItemFlagTypes_t m_iFlags; // 0x2D8 - 0x2D9
   AmmoIndex_t m_nPrimaryAmmoType; // 0x2D9 - 0x2DA
   AmmoIndex_t m_nSecondaryAmmoType; // 0x2DA - 0x2DB
   unsigned char pad_2DB[0x1]; // 0x2DB - 0x2DC
   int32_t m_iMaxClip1; // 0x2DC - 0x2E0
   int32_t m_iMaxClip2; // 0x2E0 - 0x2E4
   int32_t m_iDefaultClip1; // 0x2E4 - 0x2E8
   int32_t m_iDefaultClip2; // 0x2E8 - 0x2EC
   int32_t m_iWeight; // 0x2EC - 0x2F0
   bool m_bAutoSwitchTo; // 0x2F0 - 0x2F1
   bool m_bAutoSwitchFrom; // 0x2F1 - 0x2F2
   unsigned char pad_2F2[0x2]; // 0x2F2 - 0x2F4
   RumbleEffect_t m_iRumbleEffect; // 0x2F4 - 0x2F8
   CUtlMap< WeaponSound_t, CSoundEventName > m_aShootSounds; // 0x2F8 - 0x318
   int32_t m_iSlot; // 0x318 - 0x31C
   int32_t m_iPosition; // 0x31C - 0x320
}; // size - 0x320


class CBasePlayerWeaponVData /* "server" */ : public CEntitySubclassVDataBase /* "server" */
{
public:
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_szWorldModel; // 0x28 - 0x108
   bool m_bBuiltRightHanded; // 0x108 - 0x109
   bool m_bAllowFlipping; // 0x109 - 0x10A
   bool m_bIsFullAuto; // 0x10A - 0x10B
   unsigned char pad_10B[0x1]; // 0x10B - 0x10C
   int32_t m_nNumBullets; // 0x10C - 0x110
   CUtlString m_sMuzzleAttachment; // 0x110 - 0x118
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szMuzzleFlashParticle; // 0x118 - 0x1F8
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szTracerParticle; // 0x1F8 - 0x2D8
   ItemFlagTypes_t m_iFlags; // 0x2D8 - 0x2D9
   AmmoIndex_t m_nPrimaryAmmoType; // 0x2D9 - 0x2DA
   AmmoIndex_t m_nSecondaryAmmoType; // 0x2DA - 0x2DB
   unsigned char pad_2DB[0x1]; // 0x2DB - 0x2DC
   int32_t m_iMaxClip1; // 0x2DC - 0x2E0
   int32_t m_iMaxClip2; // 0x2E0 - 0x2E4
   int32_t m_iDefaultClip1; // 0x2E4 - 0x2E8
   int32_t m_iDefaultClip2; // 0x2E8 - 0x2EC
   int32_t m_iWeight; // 0x2EC - 0x2F0
   bool m_bAutoSwitchTo; // 0x2F0 - 0x2F1
   bool m_bAutoSwitchFrom; // 0x2F1 - 0x2F2
   unsigned char pad_2F2[0x2]; // 0x2F2 - 0x2F4
   RumbleEffect_t m_iRumbleEffect; // 0x2F4 - 0x2F8
   CUtlMap< WeaponSound_t, CSoundEventName > m_aShootSounds; // 0x2F8 - 0x318
   int32_t m_iSlot; // 0x318 - 0x31C
   int32_t m_iPosition; // 0x31C - 0x320
}; // size - 0x320


class CBaseTrailRenderer /* "particles" */ : public CBaseRendererSource2 /* "particles" */
{
public:
   ParticleOrientationChoiceList_t m_nOrientationType; // 0x2270 - 0x2274
   int32_t m_nOrientationControlPoint; // 0x2274 - 0x2278
   float m_flMinSize; // 0x2278 - 0x227C
   float m_flMaxSize; // 0x227C - 0x2280
   CParticleCollectionRendererFloatInput m_flStartFadeSize; // 0x2280 - 0x23C0
   CParticleCollectionRendererFloatInput m_flEndFadeSize; // 0x23C0 - 0x2500
   bool m_bClampV; // 0x2500 - 0x2501
   unsigned char pad_2501[0xF]; // 0x2501 - 0x2510
}; // size - 0x2510


class CBot /* "server" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CCSPlayerPawnBase* m_pPlayer; // 0x10 - 0x18
   bool m_bHasSpawned; // 0x18 - 0x19
   unsigned char pad_19[0x3]; // 0x19 - 0x1C
   uint32_t m_id; // 0x1C - 0x20
   unsigned char pad_20[0x70]; // 0x20 - 0x90
   bool m_isRunning; // 0x90 - 0x91
   bool m_isCrouching; // 0x91 - 0x92
   unsigned char pad_92[0x2]; // 0x92 - 0x94
   float m_forwardSpeed; // 0x94 - 0x98
   float m_leftSpeed; // 0x98 - 0x9C
   float m_verticalSpeed; // 0x9C - 0xA0
   uint64_t m_buttonFlags; // 0xA0 - 0xA8
   float m_jumpTimestamp; // 0xA8 - 0xAC
   Vector m_viewForward; // 0xAC - 0xB8
   unsigned char pad_B8[0x10]; // 0xB8 - 0xC8
   int32_t m_postureStackIndex; // 0xC8 - 0xCC
   unsigned char pad_CC[0x4]; // 0xCC - 0xD0
}; // size - 0xD0


class CBtNodeCondition /* "server" */ : public CBtNodeDecorator /* "server" */
{
public:
   bool m_bNegated; // 0x58 - 0x59
   unsigned char pad_59[0x7]; // 0x59 - 0x60
}; // size - 0x60


class CEnvCubemap /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_4A0[0xF0]; // 0x4A0 - 0x590
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hCubemapTexture; // 0x590 - 0x598
   bool m_bCustomCubemapTexture; // 0x598 - 0x599
   unsigned char pad_599[0x3]; // 0x599 - 0x59C
   float m_flInfluenceRadius; // 0x59C - 0x5A0
   Vector m_vBoxProjectMins; // 0x5A0 - 0x5AC
   Vector m_vBoxProjectMaxs; // 0x5AC - 0x5B8
   CUtlSymbolLarge m_LightGroups; // 0x5B8 - 0x5C0
   bool m_bMoveable; // 0x5C0 - 0x5C1
   unsigned char pad_5C1[0x3]; // 0x5C1 - 0x5C4
   int32_t m_nHandshake; // 0x5C4 - 0x5C8
   int32_t m_nEnvCubeMapArrayIndex; // 0x5C8 - 0x5CC
   int32_t m_nPriority; // 0x5CC - 0x5D0
   float m_flEdgeFadeDist; // 0x5D0 - 0x5D4
   Vector m_vEdgeFadeDists; // 0x5D4 - 0x5E0
   float m_flDiffuseScale; // 0x5E0 - 0x5E4
   bool m_bStartDisabled; // 0x5E4 - 0x5E5
   bool m_bDefaultEnvMap; // 0x5E5 - 0x5E6
   bool m_bDefaultSpecEnvMap; // 0x5E6 - 0x5E7
   bool m_bIndoorCubeMap; // 0x5E7 - 0x5E8
   bool m_bCopyDiffuseFromDefaultCubemap; // 0x5E8 - 0x5E9
   unsigned char pad_5E9[0xF]; // 0x5E9 - 0x5F8
   bool m_bEnabled; // 0x5F8 - 0x5F9
   unsigned char pad_5F9[0x7]; // 0x5F9 - 0x600
}; // size - 0x600


class CEnvSoundscapeProxy /* "server" */ : public CEnvSoundscape /* "server" */
{
public:
   CUtlSymbolLarge m_MainSoundscapeName; // 0x538 - 0x540
}; // size - 0x540


class CEnvSoundscapeTriggerable /* "server" */ : public CEnvSoundscape /* "server" */
{
public:
   unsigned char pad_0[0x538]; // 0x0 - 0x538
}; // size - 0x538


class CFuncLadder /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   Vector m_vecLadderDir; // 0x6F0 - 0x6FC
   unsigned char pad_6FC[0x4]; // 0x6FC - 0x700
   CUtlVector< CHandle< CInfoLadderDismount > > m_Dismounts; // 0x700 - 0x718
   Vector m_vecLocalTop; // 0x718 - 0x724
   Vector m_vecPlayerMountPositionTop; // 0x724 - 0x730
   Vector m_vecPlayerMountPositionBottom; // 0x730 - 0x73C
   float m_flAutoRideSpeed; // 0x73C - 0x740
   bool m_bDisabled; // 0x740 - 0x741
   bool m_bFakeLadder; // 0x741 - 0x742
   bool m_bHasSlack; // 0x742 - 0x743
   unsigned char pad_743[0x5]; // 0x743 - 0x748
   CUtlSymbolLarge m_surfacePropName; // 0x748 - 0x750
   CEntityIOOutput m_OnPlayerGotOnLadder; // 0x750 - 0x778
   CEntityIOOutput m_OnPlayerGotOffLadder; // 0x778 - 0x7A0
}; // size - 0x7A0


class CFuncNavBlocker /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x6F0 - 0x6F1
   unsigned char pad_6F1[0x3]; // 0x6F1 - 0x6F4
   int32_t m_nBlockedTeamNumber; // 0x6F4 - 0x6F8
   unsigned char pad_6F8[0x8]; // 0x6F8 - 0x700
}; // size - 0x700


class CFuncTrackChange /* "server" */ : public CFuncPlatRot /* "server" */
{
public:
   CPathTrack* m_trackTop; // 0x7B8 - 0x7C0
   CPathTrack* m_trackBottom; // 0x7C0 - 0x7C8
   CFuncTrackTrain* m_train; // 0x7C8 - 0x7D0
   CUtlSymbolLarge m_trackTopName; // 0x7D0 - 0x7D8
   CUtlSymbolLarge m_trackBottomName; // 0x7D8 - 0x7E0
   CUtlSymbolLarge m_trainName; // 0x7E0 - 0x7E8
   TRAIN_CODE m_code; // 0x7E8 - 0x7EC
   int32_t m_targetState; // 0x7EC - 0x7F0
   int32_t m_use; // 0x7F0 - 0x7F4
   unsigned char pad_7F4[0x4]; // 0x7F4 - 0x7F8
}; // size - 0x7F8


class CFuncTrackTrain /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   CHandle< CPathTrack > m_ppath; // 0x6F0 - 0x6F4
   float m_length; // 0x6F4 - 0x6F8
   Vector m_controlMins; // 0x6F8 - 0x704
   Vector m_controlMaxs; // 0x704 - 0x710
   Vector m_lastBlockPos; // 0x710 - 0x71C
   int32_t m_lastBlockTick; // 0x71C - 0x720
   float m_flVolume; // 0x720 - 0x724
   float m_flBank; // 0x724 - 0x728
   float m_oldSpeed; // 0x728 - 0x72C
   float m_flBlockDamage; // 0x72C - 0x730
   float m_height; // 0x730 - 0x734
   float m_maxSpeed; // 0x734 - 0x738
   float m_dir; // 0x738 - 0x73C
   unsigned char pad_73C[0x4]; // 0x73C - 0x740
   CUtlSymbolLarge m_iszSoundMove; // 0x740 - 0x748
   CUtlSymbolLarge m_iszSoundMovePing; // 0x748 - 0x750
   CUtlSymbolLarge m_iszSoundStart; // 0x750 - 0x758
   CUtlSymbolLarge m_iszSoundStop; // 0x758 - 0x760
   CUtlSymbolLarge m_strPathTarget; // 0x760 - 0x768
   float m_flMoveSoundMinDuration; // 0x768 - 0x76C
   float m_flMoveSoundMaxDuration; // 0x76C - 0x770
   GameTime_t m_flNextMoveSoundTime; // 0x770 - 0x774
   float m_flMoveSoundMinPitch; // 0x774 - 0x778
   float m_flMoveSoundMaxPitch; // 0x778 - 0x77C
   TrainOrientationType_t m_eOrientationType; // 0x77C - 0x780
   TrainVelocityType_t m_eVelocityType; // 0x780 - 0x784
   unsigned char pad_784[0xC]; // 0x784 - 0x790
   CEntityIOOutput m_OnStart; // 0x790 - 0x7B8
   CEntityIOOutput m_OnNext; // 0x7B8 - 0x7E0
   CEntityIOOutput m_OnArrivedAtDestinationNode; // 0x7E0 - 0x808
   bool m_bManualSpeedChanges; // 0x808 - 0x809
   unsigned char pad_809[0x3]; // 0x809 - 0x80C
   float m_flDesiredSpeed; // 0x80C - 0x810
   GameTime_t m_flSpeedChangeTime; // 0x810 - 0x814
   float m_flAccelSpeed; // 0x814 - 0x818
   float m_flDecelSpeed; // 0x818 - 0x81C
   bool m_bAccelToSpeed; // 0x81C - 0x81D
   unsigned char pad_81D[0x3]; // 0x81D - 0x820
   float m_flTimeScale; // 0x820 - 0x824
   GameTime_t m_flNextMPSoundTime; // 0x824 - 0x828
}; // size - 0x828


class CFuncWall /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   int32_t m_nState; // 0x6F0 - 0x6F4
   unsigned char pad_6F4[0x4]; // 0x6F4 - 0x6F8
}; // size - 0x6F8


class CGameRulesProxy /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_0[0x4A0]; // 0x0 - 0x4A0
}; // size - 0x4A0


class CGameSceneNode /* "server" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CTransform m_nodeToWorld; // 0x10 - 0x30
   CEntityInstance* m_pOwner; // 0x30 - 0x38
   CGameSceneNode* m_pParent; // 0x38 - 0x40
   CGameSceneNode* m_pChild; // 0x40 - 0x48
   CGameSceneNode* m_pNextSibling; // 0x48 - 0x50
   unsigned char pad_50[0x20]; // 0x50 - 0x70
   CGameSceneNodeHandle m_hParent; // 0x70 - 0x80
   CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x80 - 0xB0
   unsigned char pad_B0[0x8]; // 0xB0 - 0xB8
   QAngle m_angRotation; // 0xB8 - 0xC4
   float m_flScale; // 0xC4 - 0xC8
   Vector m_vecAbsOrigin; // 0xC8 - 0xD4
   QAngle m_angAbsRotation; // 0xD4 - 0xE0
   float m_flAbsScale; // 0xE0 - 0xE4
   int16_t m_nParentAttachmentOrBone; // 0xE4 - 0xE6
   bool m_bDebugAbsOriginChanges; // 0xE6 - 0xE7
   bool m_bDormant; // 0xE7 - 0xE8
   bool m_bForceParentToBeNetworked; // 0xE8 - 0xE9
   unsigned char m_bDirtyHierarchy : 1; // 0xE9 - 0xEA
   unsigned char m_bDirtyBoneMergeInfo : 1; // 0xE9 - 0xEA
   unsigned char m_bNetworkedPositionChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bNetworkedAnglesChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bNetworkedScaleChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bWillBeCallingPostDataUpdate : 1; // 0xE9 - 0xEA
   unsigned char m_bNotifyBoneTransformsChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bBoneMergeFlex : 1; // 0xE9 - 0xEA
   unsigned char m_nLatchAbsOrigin : 2; // 0xEA - 0xEB
   unsigned char m_bDirtyBoneMergeBoneToRoot : 1; // 0xEA - 0xEB
   uint8_t m_nHierarchicalDepth; // 0xEB - 0xEC
   uint8_t m_nHierarchyType; // 0xEC - 0xED
   uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0xED - 0xEE
   unsigned char pad_EE[0x2]; // 0xEE - 0xF0
   CUtlStringToken m_name; // 0xF0 - 0xF4
   unsigned char pad_F4[0x3C]; // 0xF4 - 0x130
   CUtlStringToken m_hierarchyAttachName; // 0x130 - 0x134
   float m_flZOffset; // 0x134 - 0x138
   Vector m_vRenderOrigin; // 0x138 - 0x144
   unsigned char pad_144[0xC]; // 0x144 - 0x150
}; // size - 0x150


class CGameSceneNode /* "client" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CTransform m_nodeToWorld; // 0x10 - 0x30
   CEntityInstance* m_pOwner; // 0x30 - 0x38
   CGameSceneNode* m_pParent; // 0x38 - 0x40
   CGameSceneNode* m_pChild; // 0x40 - 0x48
   CGameSceneNode* m_pNextSibling; // 0x48 - 0x50
   unsigned char pad_50[0x20]; // 0x50 - 0x70
   CGameSceneNodeHandle m_hParent; // 0x70 - 0x80
   CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x80 - 0xB0
   unsigned char pad_B0[0x8]; // 0xB0 - 0xB8
   QAngle m_angRotation; // 0xB8 - 0xC4
   float m_flScale; // 0xC4 - 0xC8
   Vector m_vecAbsOrigin; // 0xC8 - 0xD4
   QAngle m_angAbsRotation; // 0xD4 - 0xE0
   float m_flAbsScale; // 0xE0 - 0xE4
   int16_t m_nParentAttachmentOrBone; // 0xE4 - 0xE6
   bool m_bDebugAbsOriginChanges; // 0xE6 - 0xE7
   bool m_bDormant; // 0xE7 - 0xE8
   bool m_bForceParentToBeNetworked; // 0xE8 - 0xE9
   unsigned char m_bDirtyHierarchy : 1; // 0xE9 - 0xEA
   unsigned char m_bDirtyBoneMergeInfo : 1; // 0xE9 - 0xEA
   unsigned char m_bNetworkedPositionChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bNetworkedAnglesChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bNetworkedScaleChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bWillBeCallingPostDataUpdate : 1; // 0xE9 - 0xEA
   unsigned char m_bNotifyBoneTransformsChanged : 1; // 0xE9 - 0xEA
   unsigned char m_bBoneMergeFlex : 1; // 0xE9 - 0xEA
   unsigned char m_nLatchAbsOrigin : 2; // 0xEA - 0xEB
   unsigned char m_bDirtyBoneMergeBoneToRoot : 1; // 0xEA - 0xEB
   uint8_t m_nHierarchicalDepth; // 0xEB - 0xEC
   uint8_t m_nHierarchyType; // 0xEC - 0xED
   uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0xED - 0xEE
   unsigned char pad_EE[0x2]; // 0xEE - 0xF0
   CUtlStringToken m_name; // 0xF0 - 0xF4
   unsigned char pad_F4[0x3C]; // 0xF4 - 0x130
   CUtlStringToken m_hierarchyAttachName; // 0x130 - 0x134
   float m_flZOffset; // 0x134 - 0x138
   Vector m_vRenderOrigin; // 0x138 - 0x144
   unsigned char pad_144[0xC]; // 0x144 - 0x150
}; // size - 0x150


class CHostage /* "server" */ : public CHostageExpresserShim /* "server" */
{
public:
   unsigned char pad_970[0x10]; // 0x970 - 0x980
   CEntityIOOutput m_OnHostageBeginGrab; // 0x980 - 0x9A8
   CEntityIOOutput m_OnFirstPickedUp; // 0x9A8 - 0x9D0
   CEntityIOOutput m_OnDroppedNotRescued; // 0x9D0 - 0x9F8
   CEntityIOOutput m_OnRescued; // 0x9F8 - 0xA20
   EntitySpottedState_t m_entitySpottedState; // 0xA20 - 0xA38
   int32_t m_nSpotRules; // 0xA38 - 0xA3C
   uint32_t m_uiHostageSpawnExclusionGroupMask; // 0xA3C - 0xA40
   uint32_t m_nHostageSpawnRandomFactor; // 0xA40 - 0xA44
   bool m_bRemove; // 0xA44 - 0xA45
   unsigned char pad_A45[0x3]; // 0xA45 - 0xA48
   Vector m_vel; // 0xA48 - 0xA54
   bool m_isRescued; // 0xA54 - 0xA55
   bool m_jumpedThisFrame; // 0xA55 - 0xA56
   unsigned char pad_A56[0x2]; // 0xA56 - 0xA58
   int32_t m_nHostageState; // 0xA58 - 0xA5C
   CHandle< CBaseEntity > m_leader; // 0xA5C - 0xA60
   CHandle< CCSPlayerPawnBase > m_lastLeader; // 0xA60 - 0xA64
   unsigned char pad_A64[0x4]; // 0xA64 - 0xA68
   CountdownTimer m_reuseTimer; // 0xA68 - 0xA80
   bool m_hasBeenUsed; // 0xA80 - 0xA81
   unsigned char pad_A81[0x3]; // 0xA81 - 0xA84
   Vector m_accel; // 0xA84 - 0xA90
   bool m_isRunning; // 0xA90 - 0xA91
   bool m_isCrouching; // 0xA91 - 0xA92
   unsigned char pad_A92[0x6]; // 0xA92 - 0xA98
   CountdownTimer m_jumpTimer; // 0xA98 - 0xAB0
   bool m_isWaitingForLeader; // 0xAB0 - 0xAB1
   unsigned char pad_AB1[0x200F]; // 0xAB1 - 0x2AC0
   CountdownTimer m_repathTimer; // 0x2AC0 - 0x2AD8
   CountdownTimer m_inhibitDoorTimer; // 0x2AD8 - 0x2AF0
   unsigned char pad_2AF0[0x78]; // 0x2AF0 - 0x2B68
   CountdownTimer m_inhibitObstacleAvoidanceTimer; // 0x2B68 - 0x2B80
   unsigned char pad_2B80[0x8]; // 0x2B80 - 0x2B88
   CountdownTimer m_wiggleTimer; // 0x2B88 - 0x2BA0
   unsigned char pad_2BA0[0x4]; // 0x2BA0 - 0x2BA4
   bool m_isAdjusted; // 0x2BA4 - 0x2BA5
   bool m_bHandsHaveBeenCut; // 0x2BA5 - 0x2BA6
   unsigned char pad_2BA6[0x2]; // 0x2BA6 - 0x2BA8
   CHandle< CCSPlayerPawn > m_pHostageGrabber; // 0x2BA8 - 0x2BAC
   GameTime_t m_fLastGrabTime; // 0x2BAC - 0x2BB0
   float m_flGrabbingLength; // 0x2BB0 - 0x2BB4
   Vector m_vecPositionWhenStartedDroppingToGround; // 0x2BB4 - 0x2BC0
   Vector m_vecGrabbedPos; // 0x2BC0 - 0x2BCC
   GameTime_t m_flRescueStartTime; // 0x2BCC - 0x2BD0
   GameTime_t m_flGrabSuccessTime; // 0x2BD0 - 0x2BD4
   GameTime_t m_flDropStartTime; // 0x2BD4 - 0x2BD8
   int32_t m_nApproachRewardPayouts; // 0x2BD8 - 0x2BDC
   int32_t m_nPickupEventCount; // 0x2BDC - 0x2BE0
   Vector m_vecSpawnGroundPos; // 0x2BE0 - 0x2BEC
   unsigned char pad_2BEC[0x14]; // 0x2BEC - 0x2C00
}; // size - 0x2C00


class CHostageRescueZoneShim /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   unsigned char pad_0[0x898]; // 0x0 - 0x898
}; // size - 0x898


class CInferno /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_6F0[0x10]; // 0x6F0 - 0x700
   int32 m_fireXDelta[64]; // 0x700 - 0x800
   int32 m_fireYDelta[64]; // 0x800 - 0x900
   int32 m_fireZDelta[64]; // 0x900 - 0xA00
   int32 m_fireParentXDelta[64]; // 0xA00 - 0xB00
   int32 m_fireParentYDelta[64]; // 0xB00 - 0xC00
   int32 m_fireParentZDelta[64]; // 0xC00 - 0xD00
   bool m_bFireIsBurning[64]; // 0xD00 - 0xD40
   Vector m_BurnNormal[64]; // 0xD40 - 0x1040
   int32_t m_fireCount; // 0x1040 - 0x1044
   int32_t m_nInfernoType; // 0x1044 - 0x1048
   int32_t m_nFireEffectTickBegin; // 0x1048 - 0x104C
   float m_nFireLifetime; // 0x104C - 0x1050
   bool m_bInPostEffectTime; // 0x1050 - 0x1051
   unsigned char pad_1051[0x3]; // 0x1051 - 0x1054
   int32_t m_nFiresExtinguishCount; // 0x1054 - 0x1058
   bool m_bWasCreatedInSmoke; // 0x1058 - 0x1059
   unsigned char pad_1059[0x207]; // 0x1059 - 0x1260
   Extent m_extent; // 0x1260 - 0x1278
   CountdownTimer m_damageTimer; // 0x1278 - 0x1290
   CountdownTimer m_damageRampTimer; // 0x1290 - 0x12A8
   Vector m_splashVelocity; // 0x12A8 - 0x12B4
   Vector m_InitialSplashVelocity; // 0x12B4 - 0x12C0
   Vector m_startPos; // 0x12C0 - 0x12CC
   Vector m_vecOriginalSpawnLocation; // 0x12CC - 0x12D8
   IntervalTimer m_activeTimer; // 0x12D8 - 0x12E8
   int32_t m_fireSpawnOffset; // 0x12E8 - 0x12EC
   int32_t m_nMaxFlames; // 0x12EC - 0x12F0
   CountdownTimer m_BookkeepingTimer; // 0x12F0 - 0x1308
   CountdownTimer m_NextSpreadTimer; // 0x1308 - 0x1320
   uint16_t m_nSourceItemDefIndex; // 0x1320 - 0x1322
   unsigned char pad_1322[0x56]; // 0x1322 - 0x1378
}; // size - 0x1378


class CInfoDynamicShadowHint /* "client" */ : public C_PointEntity /* "client" */
{
public:
   bool m_bDisabled; // 0x538 - 0x539
   unsigned char pad_539[0x3]; // 0x539 - 0x53C
   float m_flRange; // 0x53C - 0x540
   int32_t m_nImportance; // 0x540 - 0x544
   int32_t m_nLightChoice; // 0x544 - 0x548
   CHandle< C_BaseEntity > m_hLight; // 0x548 - 0x54C
   unsigned char pad_54C[0x4]; // 0x54C - 0x550
}; // size - 0x550


class CInfoDynamicShadowHint /* "server" */ : public CPointEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x3]; // 0x4A1 - 0x4A4
   float m_flRange; // 0x4A4 - 0x4A8
   int32_t m_nImportance; // 0x4A8 - 0x4AC
   int32_t m_nLightChoice; // 0x4AC - 0x4B0
   CHandle< CBaseEntity > m_hLight; // 0x4B0 - 0x4B4
   unsigned char pad_4B4[0x4]; // 0x4B4 - 0x4B8
}; // size - 0x4B8


class CItemAssaultSuit /* "server" */ : public CItem /* "server" */
{
public:
   unsigned char pad_0[0x8F8]; // 0x0 - 0x8F8
}; // size - 0x8F8


class CItemDefuser /* "server" */ : public CItem /* "server" */
{
public:
   EntitySpottedState_t m_entitySpottedState; // 0x8F8 - 0x910
   int32_t m_nSpotRules; // 0x910 - 0x914
   unsigned char pad_914[0x4]; // 0x914 - 0x918
}; // size - 0x918


class CKnife /* "server" */ : public CWeaponCSBase /* "server" */
{
public:
   unsigned char pad_0[0xD50]; // 0x0 - 0xD50
}; // size - 0xD50


class CLightDirectionalEntity /* "server" */ : public CLightEntity /* "server" */
{
public:
   unsigned char pad_0[0x6F8]; // 0x0 - 0x6F8
}; // size - 0x6F8


class CLogicAutosave /* "server" */ : public CLogicalEntity /* "server" */
{
public:
   bool m_bForceNewLevelUnit; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x3]; // 0x4A1 - 0x4A4
   int32_t m_minHitPoints; // 0x4A4 - 0x4A8
   int32_t m_minHitPointsToCommit; // 0x4A8 - 0x4AC
   unsigned char pad_4AC[0x4]; // 0x4AC - 0x4B0
}; // size - 0x4B0


class CLogicNPCCounterAABB /* "server" */ : public CLogicNPCCounter /* "server" */
{
public:
   Vector m_vDistanceOuterMins; // 0x7E0 - 0x7EC
   Vector m_vDistanceOuterMaxs; // 0x7EC - 0x7F8
   Vector m_vOuterMins; // 0x7F8 - 0x804
   Vector m_vOuterMaxs; // 0x804 - 0x810
}; // size - 0x810


class CMarkupVolumeWithRef /* "server" */ : public CMarkupVolumeTagged /* "server" */
{
public:
   bool m_bUseRef; // 0x730 - 0x731
   unsigned char pad_731[0x3]; // 0x731 - 0x734
   Vector m_vRefPos; // 0x734 - 0x740
   float m_flRefDot; // 0x740 - 0x744
   unsigned char pad_744[0x4]; // 0x744 - 0x748
}; // size - 0x748


class CMolotovGrenade /* "server" */ : public CBaseCSGrenade /* "server" */
{
public:
   unsigned char pad_0[0xD90]; // 0x0 - 0xD90
}; // size - 0xD90


class CMotionGraph /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CParamSpanUpdater m_paramSpans; // 0x10 - 0x28
   CUtlVector< TagSpan_t > m_tags; // 0x28 - 0x40
   CSmartPtr< CMotionNode > m_pRootNode; // 0x40 - 0x48
   int32_t m_nParameterCount; // 0x48 - 0x4C
   int32_t m_nConfigStartIndex; // 0x4C - 0x50
   int32_t m_nConfigCount; // 0x50 - 0x54
   bool m_bLoop; // 0x54 - 0x55
   unsigned char pad_55[0x3]; // 0x55 - 0x58
}; // size - 0x58


class CNavVolumeCalculatedVector /* "server" */ : public CNavVolume /* "server" */
{
public:
   unsigned char pad_0[0x98]; // 0x0 - 0x98
}; // size - 0x98


class CNavVolumeSphere /* "navlib" */ : public CNavVolume /* "navlib" */
{
public:
   Vector m_vCenter; // 0x70 - 0x7C
   float m_flRadius; // 0x7C - 0x80
}; // size - 0x80


class CNavVolumeVector /* "navlib" */ : public CNavVolume /* "navlib" */
{
public:
   unsigned char pad_70[0x8]; // 0x70 - 0x78
   bool m_bHasBeenPreFiltered; // 0x78 - 0x79
   unsigned char pad_79[0x1F]; // 0x79 - 0x98
}; // size - 0x98


class CParticleCollectionFloatInput /* "particleslib" */ : public CParticleFloatInput /* "particleslib" */
{
public:
   unsigned char pad_0[0x140]; // 0x0 - 0x140
}; // size - 0x140


class CParticleCollectionVecInput /* "particleslib" */ : public CParticleVecInput /* "particleslib" */
{
public:
   unsigned char pad_0[0x5E8]; // 0x0 - 0x5E8
}; // size - 0x5E8


class CParticleSystem /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   char m_szSnapshotFileName[512]; // 0x6F0 - 0x8F0
   bool m_bActive; // 0x8F0 - 0x8F1
   bool m_bFrozen; // 0x8F1 - 0x8F2
   unsigned char pad_8F2[0x2]; // 0x8F2 - 0x8F4
   float m_flFreezeTransitionDuration; // 0x8F4 - 0x8F8
   int32_t m_nStopType; // 0x8F8 - 0x8FC
   bool m_bAnimateDuringGameplayPause; // 0x8FC - 0x8FD
   unsigned char pad_8FD[0x3]; // 0x8FD - 0x900
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x900 - 0x908
   GameTime_t m_flStartTime; // 0x908 - 0x90C
   float m_flPreSimTime; // 0x90C - 0x910
   Vector m_vServerControlPoints[4]; // 0x910 - 0x940
   uint8 m_iServerControlPointAssignments[4]; // 0x940 - 0x944
   CHandle< CBaseEntity > m_hControlPointEnts[64]; // 0x944 - 0xA44
   bool m_bNoSave; // 0xA44 - 0xA45
   bool m_bNoFreeze; // 0xA45 - 0xA46
   bool m_bStartActive; // 0xA46 - 0xA47
   unsigned char pad_A47[0x1]; // 0xA47 - 0xA48
   CUtlSymbolLarge m_iszEffectName; // 0xA48 - 0xA50
   CUtlSymbolLarge m_iszControlPointNames[64]; // 0xA50 - 0xC50
   int32_t m_nDataCP; // 0xC50 - 0xC54
   Vector m_vecDataCPValue; // 0xC54 - 0xC60
   int32_t m_nTintCP; // 0xC60 - 0xC64
   Color m_clrTint; // 0xC64 - 0xC68
}; // size - 0xC68


class CPathCorner /* "server" */ : public CPointEntity /* "server" */
{
public:
   float m_flWait; // 0x4A0 - 0x4A4
   float m_flRadius; // 0x4A4 - 0x4A8
   CEntityIOOutput m_OnPass; // 0x4A8 - 0x4D0
}; // size - 0x4D0


class CPathKeyFrame /* "server" */ : public CLogicalEntity /* "server" */
{
public:
   Vector m_Origin; // 0x4A0 - 0x4AC
   QAngle m_Angles; // 0x4AC - 0x4B8
   unsigned char pad_4B8[0x8]; // 0x4B8 - 0x4C0
   Quaternion m_qAngle; // 0x4C0 - 0x4D0
   CUtlSymbolLarge m_iNextKey; // 0x4D0 - 0x4D8
   float m_flNextTime; // 0x4D8 - 0x4DC
   unsigned char pad_4DC[0x4]; // 0x4DC - 0x4E0
   CPathKeyFrame* m_pNextKey; // 0x4E0 - 0x4E8
   CPathKeyFrame* m_pPrevKey; // 0x4E8 - 0x4F0
   float m_flSpeed; // 0x4F0 - 0x4F4
   unsigned char pad_4F4[0xC]; // 0x4F4 - 0x500
}; // size - 0x500


class CPathParticleRope /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bStartActive; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x3]; // 0x4A1 - 0x4A4
   float m_flMaxSimulationTime; // 0x4A4 - 0x4A8
   CUtlSymbolLarge m_iszEffectName; // 0x4A8 - 0x4B0
   CUtlVector< CUtlSymbolLarge > m_PathNodes_Name; // 0x4B0 - 0x4C8
   float m_flParticleSpacing; // 0x4C8 - 0x4CC
   float m_flSlack; // 0x4CC - 0x4D0
   float m_flRadius; // 0x4D0 - 0x4D4
   Color m_ColorTint; // 0x4D4 - 0x4D8
   int32_t m_nEffectState; // 0x4D8 - 0x4DC
   unsigned char pad_4DC[0x4]; // 0x4DC - 0x4E0
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x4E0 - 0x4E8
   CNetworkUtlVectorBase< Vector > m_PathNodes_Position; // 0x4E8 - 0x500
   CNetworkUtlVectorBase< Vector > m_PathNodes_TangentIn; // 0x500 - 0x518
   CNetworkUtlVectorBase< Vector > m_PathNodes_TangentOut; // 0x518 - 0x530
   CNetworkUtlVectorBase< Vector > m_PathNodes_Color; // 0x530 - 0x548
   CNetworkUtlVectorBase< bool > m_PathNodes_PinEnabled; // 0x548 - 0x560
   CNetworkUtlVectorBase< float32 > m_PathNodes_RadiusScale; // 0x560 - 0x578
   unsigned char pad_578[0x8]; // 0x578 - 0x580
}; // size - 0x580


class CPhysHinge /* "server" */ : public CPhysConstraint /* "server" */
{
public:
   unsigned char pad_4F8[0x8]; // 0x4F8 - 0x500
   ConstraintSoundInfo m_soundInfo; // 0x500 - 0x588
   CEntityIOOutput m_NotifyMinLimitReached; // 0x588 - 0x5B0
   CEntityIOOutput m_NotifyMaxLimitReached; // 0x5B0 - 0x5D8
   bool m_bAtMinLimit; // 0x5D8 - 0x5D9
   bool m_bAtMaxLimit; // 0x5D9 - 0x5DA
   unsigned char pad_5DA[0x2]; // 0x5DA - 0x5DC
   constraint_hingeparams_t m_hinge; // 0x5DC - 0x61C
   float m_hingeFriction; // 0x61C - 0x620
   float m_systemLoadScale; // 0x620 - 0x624
   bool m_bIsAxisLocal; // 0x624 - 0x625
   unsigned char pad_625[0x3]; // 0x625 - 0x628
   float m_flMinRotation; // 0x628 - 0x62C
   float m_flMaxRotation; // 0x62C - 0x630
   float m_flInitialRotation; // 0x630 - 0x634
   float m_flMotorFrequency; // 0x634 - 0x638
   float m_flMotorDampingRatio; // 0x638 - 0x63C
   float m_flAngleSpeed; // 0x63C - 0x640
   float m_flAngleSpeedThreshold; // 0x640 - 0x644
   unsigned char pad_644[0x4]; // 0x644 - 0x648
   CEntityIOOutput m_OnStartMoving; // 0x648 - 0x670
   CEntityIOOutput m_OnStopMoving; // 0x670 - 0x698
}; // size - 0x698


class CPlantedC4 /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   bool m_bPlantedAtQuestTarget; // 0x820 - 0x821
   bool m_bBombTicking; // 0x821 - 0x822
   unsigned char pad_822[0x2]; // 0x822 - 0x824
   GameTime_t m_flC4Blow; // 0x824 - 0x828
   int32_t m_nBombSite; // 0x828 - 0x82C
   int32_t m_nSourceSoundscapeHash; // 0x82C - 0x830
   CEntityIOOutput m_OnBombDefused; // 0x830 - 0x858
   CEntityIOOutput m_OnBombBeginDefuse; // 0x858 - 0x880
   CEntityIOOutput m_OnBombDefuseAborted; // 0x880 - 0x8A8
   bool m_bCannotBeDefused; // 0x8A8 - 0x8A9
   unsigned char pad_8A9[0x7]; // 0x8A9 - 0x8B0
   EntitySpottedState_t m_entitySpottedState; // 0x8B0 - 0x8C8
   int32_t m_nSpotRules; // 0x8C8 - 0x8CC
   bool m_bTrainingPlacedByPlayer; // 0x8CC - 0x8CD
   bool m_bHasExploded; // 0x8CD - 0x8CE
   unsigned char pad_8CE[0x2]; // 0x8CE - 0x8D0
   float m_flTimerLength; // 0x8D0 - 0x8D4
   bool m_bBeingDefused; // 0x8D4 - 0x8D5
   unsigned char pad_8D5[0x7]; // 0x8D5 - 0x8DC
   GameTime_t m_fLastDefuseTime; // 0x8DC - 0x8E0
   unsigned char pad_8E0[0x4]; // 0x8E0 - 0x8E4
   float m_flDefuseLength; // 0x8E4 - 0x8E8
   GameTime_t m_flDefuseCountDown; // 0x8E8 - 0x8EC
   bool m_bBombDefused; // 0x8EC - 0x8ED
   unsigned char pad_8ED[0x3]; // 0x8ED - 0x8F0
   CHandle< CCSPlayerPawnBase > m_hBombDefuser; // 0x8F0 - 0x8F4
   CEntityHandle m_hControlPanel; // 0x8F4 - 0x8F8
   int32_t m_iProgressBarTime; // 0x8F8 - 0x8FC
   bool m_bVoiceAlertFired; // 0x8FC - 0x8FD
   bool m_bVoiceAlertPlayed[4]; // 0x8FD - 0x901
   unsigned char pad_901[0x3]; // 0x901 - 0x904
   GameTime_t m_flNextBotBeepTime; // 0x904 - 0x908
   unsigned char pad_908[0x4]; // 0x908 - 0x90C
   bool m_bPlantedAfterPickup; // 0x90C - 0x90D
   unsigned char pad_90D[0x3]; // 0x90D - 0x910
   QAngle m_angCatchUpToPlayerEye; // 0x910 - 0x91C
   GameTime_t m_flLastSpinDetectionTime; // 0x91C - 0x920
}; // size - 0x920


class CPlayer_CameraServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   uint32_t m_iFOV; // 0x40 - 0x44
   uint32_t m_iFOVStart; // 0x44 - 0x48
   GameTime_t m_flFOVTime; // 0x48 - 0x4C
   float m_flFOVRate; // 0x4C - 0x50
   QAngle m_vecPunchAngle; // 0x50 - 0x5C
   QAngle m_vecPunchAngleVel; // 0x5C - 0x68
   GameTick_t m_nPunchAngleJoltTick; // 0x68 - 0x6C
   CHandle< CBaseEntity > m_hZoomOwner; // 0x6C - 0x70
   fogplayerparams_t m_PlayerFog; // 0x70 - 0xB0
   CHandle< CColorCorrection > m_hColorCorrectionCtrl; // 0xB0 - 0xB4
   CHandle< CBaseEntity > m_hViewEntity; // 0xB4 - 0xB8
   CHandle< CTonemapController2 > m_hTonemapController; // 0xB8 - 0xBC
   unsigned char pad_BC[0x4]; // 0xBC - 0xC0
   audioparams_t m_audio; // 0xC0 - 0x138
   CNetworkUtlVectorBase< CHandle< CPostProcessingVolume > > m_PostProcessingVolumes; // 0x138 - 0x150
   float m_flOldPlayerZ; // 0x150 - 0x154
   float m_flOldPlayerViewOffsetZ; // 0x154 - 0x158
   unsigned char pad_158[0x18]; // 0x158 - 0x170
   CUtlVector< CHandle< CEnvSoundscapeTriggerable > > m_hTriggerSoundscapeList; // 0x170 - 0x188
}; // size - 0x188


class CPlayer_CameraServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   uint32_t m_iFOV; // 0x40 - 0x44
   uint32_t m_iFOVStart; // 0x44 - 0x48
   GameTime_t m_flFOVTime; // 0x48 - 0x4C
   float m_flFOVRate; // 0x4C - 0x50
   QAngle m_vecPunchAngle; // 0x50 - 0x5C
   unsigned char pad_5C[0xC]; // 0x5C - 0x68
   QAngle m_vecPunchAngleVel; // 0x68 - 0x74
   unsigned char pad_74[0xC]; // 0x74 - 0x80
   GameTick_t m_nPunchAngleJoltTickClientSide; // 0x80 - 0x84
   GameTick_t m_nPunchAngleJoltTick; // 0x84 - 0x88
   CHandle< C_BaseEntity > m_hZoomOwner; // 0x88 - 0x8C
   unsigned char pad_8C[0x4]; // 0x8C - 0x90
   C_fogplayerparams_t m_PlayerFog; // 0x90 - 0xD0
   CHandle< C_ColorCorrection > m_hColorCorrectionCtrl; // 0xD0 - 0xD4
   CHandle< C_BaseEntity > m_hViewEntity; // 0xD4 - 0xD8
   CHandle< C_TonemapController2 > m_hTonemapController; // 0xD8 - 0xDC
   unsigned char pad_DC[0x4]; // 0xDC - 0xE0
   audioparams_t m_audio; // 0xE0 - 0x158
   C_NetworkUtlVectorBase< CHandle< C_PostProcessingVolume > > m_PostProcessingVolumes; // 0x158 - 0x170
   float m_flOldPlayerZ; // 0x170 - 0x174
   float m_flOldPlayerViewOffsetZ; // 0x174 - 0x178
   fogparams_t m_CurrentFog; // 0x178 - 0x1E0
   CHandle< C_FogController > m_hOldFogController; // 0x1E0 - 0x1E4
   bool m_bOverrideFogColor[5]; // 0x1E4 - 0x1E9
   Color m_OverrideFogColor[5]; // 0x1E9 - 0x1FD
   bool m_bOverrideFogStartEnd[5]; // 0x1FD - 0x202
   unsigned char pad_202[0x2]; // 0x202 - 0x204
   float32 m_fOverrideFogStart[5]; // 0x204 - 0x218
   float32 m_fOverrideFogEnd[5]; // 0x218 - 0x22C
   CHandle< C_PostProcessingVolume > m_hActivePostProcessingVolume; // 0x22C - 0x230
   QAngle m_angDemoViewAngles; // 0x230 - 0x23C
   unsigned char pad_23C[0xC]; // 0x23C - 0x248
}; // size - 0x248


class CPlayer_ItemServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_ItemServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_MovementServices_Humanoid /* "client" */ : public CPlayer_MovementServices /* "client" */
{
public:
   float m_flStepSoundTime; // 0x1B8 - 0x1BC
   float m_flFallVelocity; // 0x1BC - 0x1C0
   bool m_bInCrouch; // 0x1C0 - 0x1C1
   unsigned char pad_1C1[0x3]; // 0x1C1 - 0x1C4
   uint32_t m_nCrouchState; // 0x1C4 - 0x1C8
   GameTime_t m_flCrouchTransitionStartTime; // 0x1C8 - 0x1CC
   bool m_bDucked; // 0x1CC - 0x1CD
   bool m_bDucking; // 0x1CD - 0x1CE
   bool m_bInDuckJump; // 0x1CE - 0x1CF
   unsigned char pad_1CF[0x1]; // 0x1CF - 0x1D0
   Vector m_groundNormal; // 0x1D0 - 0x1DC
   float m_flSurfaceFriction; // 0x1DC - 0x1E0
   CUtlStringToken m_surfaceProps; // 0x1E0 - 0x1E4
   unsigned char pad_1E4[0xC]; // 0x1E4 - 0x1F0
   int32_t m_nStepside; // 0x1F0 - 0x1F4
   unsigned char pad_1F4[0x4]; // 0x1F4 - 0x1F8
}; // size - 0x1F8


class CPlayer_MovementServices_Humanoid /* "server" */ : public CPlayer_MovementServices /* "server" */
{
public:
   float m_flStepSoundTime; // 0x1B8 - 0x1BC
   float m_flFallVelocity; // 0x1BC - 0x1C0
   bool m_bInCrouch; // 0x1C0 - 0x1C1
   unsigned char pad_1C1[0x3]; // 0x1C1 - 0x1C4
   uint32_t m_nCrouchState; // 0x1C4 - 0x1C8
   GameTime_t m_flCrouchTransitionStartTime; // 0x1C8 - 0x1CC
   bool m_bDucked; // 0x1CC - 0x1CD
   bool m_bDucking; // 0x1CD - 0x1CE
   bool m_bInDuckJump; // 0x1CE - 0x1CF
   unsigned char pad_1CF[0x1]; // 0x1CF - 0x1D0
   Vector m_groundNormal; // 0x1D0 - 0x1DC
   float m_flSurfaceFriction; // 0x1DC - 0x1E0
   CUtlStringToken m_surfaceProps; // 0x1E0 - 0x1E4
   unsigned char pad_1E4[0xC]; // 0x1E4 - 0x1F0
   int32_t m_nStepside; // 0x1F0 - 0x1F4
   int32_t m_iTargetVolume; // 0x1F4 - 0x1F8
   Vector m_vecSmoothedVelocity; // 0x1F8 - 0x204
   unsigned char pad_204[0x4]; // 0x204 - 0x208
}; // size - 0x208


class CPlayer_ObserverServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   uint8_t m_iObserverMode; // 0x40 - 0x41
   unsigned char pad_41[0x3]; // 0x41 - 0x44
   CHandle< C_BaseEntity > m_hObserverTarget; // 0x44 - 0x48
   ObserverMode_t m_iObserverLastMode; // 0x48 - 0x4C
   bool m_bForcedObserverMode; // 0x4C - 0x4D
   unsigned char pad_4D[0x3]; // 0x4D - 0x50
   float m_flObserverChaseDistance; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
}; // size - 0x58


class CPlayer_ObserverServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   uint8_t m_iObserverMode; // 0x40 - 0x41
   unsigned char pad_41[0x3]; // 0x41 - 0x44
   CHandle< CBaseEntity > m_hObserverTarget; // 0x44 - 0x48
   ObserverMode_t m_iObserverLastMode; // 0x48 - 0x4C
   bool m_bForcedObserverMode; // 0x4C - 0x4D
   unsigned char pad_4D[0x3]; // 0x4D - 0x50
}; // size - 0x50


class CPlayer_UseServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_UseServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_WaterServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_WaterServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_WeaponServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   bool m_bAllowSwitchToNoWeapon; // 0x40 - 0x41
   unsigned char pad_41[0x7]; // 0x41 - 0x48
   CNetworkUtlVectorBase< CHandle< CBasePlayerWeapon > > m_hMyWeapons; // 0x48 - 0x60
   CHandle< CBasePlayerWeapon > m_hActiveWeapon; // 0x60 - 0x64
   CHandle< CBasePlayerWeapon > m_hLastWeapon; // 0x64 - 0x68
   uint16 m_iAmmo[32]; // 0x68 - 0xA8
   bool m_bPreventWeaponPickup; // 0xA8 - 0xA9
   unsigned char pad_A9[0x7]; // 0xA9 - 0xB0
}; // size - 0xB0


class CPlayer_WeaponServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   bool m_bAllowSwitchToNoWeapon; // 0x40 - 0x41
   unsigned char pad_41[0x7]; // 0x41 - 0x48
   C_NetworkUtlVectorBase< CHandle< C_BasePlayerWeapon > > m_hMyWeapons; // 0x48 - 0x60
   CHandle< C_BasePlayerWeapon > m_hActiveWeapon; // 0x60 - 0x64
   CHandle< C_BasePlayerWeapon > m_hLastWeapon; // 0x64 - 0x68
   uint16 m_iAmmo[32]; // 0x68 - 0xA8
}; // size - 0xA8


class CPointCamera /* "server" */ : public CBaseEntity /* "server" */
{
public:
   float m_FOV; // 0x4A0 - 0x4A4
   float m_Resolution; // 0x4A4 - 0x4A8
   bool m_bFogEnable; // 0x4A8 - 0x4A9
   Color m_FogColor; // 0x4A9 - 0x4AD
   unsigned char pad_4AD[0x3]; // 0x4AD - 0x4B0
   float m_flFogStart; // 0x4B0 - 0x4B4
   float m_flFogEnd; // 0x4B4 - 0x4B8
   float m_flFogMaxDensity; // 0x4B8 - 0x4BC
   bool m_bActive; // 0x4BC - 0x4BD
   bool m_bUseScreenAspectRatio; // 0x4BD - 0x4BE
   unsigned char pad_4BE[0x2]; // 0x4BE - 0x4C0
   float m_flAspectRatio; // 0x4C0 - 0x4C4
   bool m_bNoSky; // 0x4C4 - 0x4C5
   unsigned char pad_4C5[0x3]; // 0x4C5 - 0x4C8
   float m_fBrightness; // 0x4C8 - 0x4CC
   float m_flZFar; // 0x4CC - 0x4D0
   float m_flZNear; // 0x4D0 - 0x4D4
   bool m_bDofEnabled; // 0x4D4 - 0x4D5
   unsigned char pad_4D5[0x3]; // 0x4D5 - 0x4D8
   float m_flDofNearBlurry; // 0x4D8 - 0x4DC
   float m_flDofNearCrisp; // 0x4DC - 0x4E0
   float m_flDofFarCrisp; // 0x4E0 - 0x4E4
   float m_flDofFarBlurry; // 0x4E4 - 0x4E8
   float m_flDofTiltToGround; // 0x4E8 - 0x4EC
   float m_TargetFOV; // 0x4EC - 0x4F0
   float m_DegreesPerSecond; // 0x4F0 - 0x4F4
   bool m_bIsOn; // 0x4F4 - 0x4F5
   unsigned char pad_4F5[0x3]; // 0x4F5 - 0x4F8
   CPointCamera* m_pNext; // 0x4F8 - 0x500
}; // size - 0x500


class CPointDZItemSpawn /* "server" */ : public CServerOnlyPointEntity /* "server" */
{
public:
   unsigned char pad_0[0x4A8]; // 0x0 - 0x4A8
}; // size - 0x4A8


class CPointDZItemSpawnGroup /* "server" */ : public CServerOnlyPointEntity /* "server" */
{
public:
   float m_flRadius; // 0x4A0 - 0x4A4
   unsigned char pad_4A4[0x1C]; // 0x4A4 - 0x4C0
}; // size - 0x4C0


class CPointHMDAnchor /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x3]; // 0x4A1 - 0x4A4
   GameTime_t m_flEnableTime; // 0x4A4 - 0x4A8
   int32_t m_nPlayerIndex; // 0x4A8 - 0x4AC
   unsigned char pad_4AC[0x4]; // 0x4AC - 0x4B0
}; // size - 0x4B0


class CPredictedViewModel /* "server" */ : public CBaseViewModel /* "server" */
{
public:
   unsigned char pad_0[0x868]; // 0x0 - 0x868
}; // size - 0x868


class CPropDoorRotatingBreakable /* "server" */ : public CPropDoorRotating /* "server" */
{
public:
   bool m_bBreakable; // 0xDB8 - 0xDB9
   bool m_isAbleToCloseAreaPortals; // 0xDB9 - 0xDBA
   unsigned char pad_DBA[0x2]; // 0xDBA - 0xDBC
   int32_t m_currentDamageState; // 0xDBC - 0xDC0
   CUtlVector< CUtlSymbolLarge > m_damageStates; // 0xDC0 - 0xDD8
}; // size - 0xDD8


class CPulseGraphInstance_TestDomain /* "pulse_runtime_lib" */ : public CBasePulseGraphInstance /* "pulse_runtime_lib" */
{
public:
   bool m_bIsRunningUnitTests; // 0xD0 - 0xD1
   bool m_bExplicitTimeStepping; // 0xD1 - 0xD2
   bool m_bExpectingToDestroyWithYieldedCursors; // 0xD2 - 0xD3
   unsigned char pad_D3[0x1]; // 0xD3 - 0xD4
   int32_t m_nNextValidateIndex; // 0xD4 - 0xD8
   CUtlVector< CUtlString > m_Tracepoints; // 0xD8 - 0xF0
   unsigned char pad_F0[0x18]; // 0xF0 - 0x108
}; // size - 0x108


class CPulse_OutflowConnection /* "pulse_runtime_lib" */
{
public:
   CUtlSymbolLarge m_SourceOutflowName; // 0x0 - 0x8
   PulseRuntimeChunkIndex_t m_nDestChunk; // 0x8 - 0xC
   PulseCursorFlow_t m_nJumpType; // 0xC - 0x10
   int32_t m_nInstruction; // 0x10 - 0x14
   unsigned char pad_14[0x4]; // 0x14 - 0x18
}; // size - 0x18


class CRopeKeyframe /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_6F0[0x8]; // 0x6F0 - 0x6F8
   uint16_t m_RopeFlags; // 0x6F8 - 0x6FA
   unsigned char pad_6FA[0x6]; // 0x6FA - 0x700
   CUtlSymbolLarge m_iNextLinkName; // 0x700 - 0x708
   int16_t m_Slack; // 0x708 - 0x70A
   unsigned char pad_70A[0x2]; // 0x70A - 0x70C
   float m_Width; // 0x70C - 0x710
   float m_TextureScale; // 0x710 - 0x714
   uint8_t m_nSegments; // 0x714 - 0x715
   bool m_bConstrainBetweenEndpoints; // 0x715 - 0x716
   unsigned char pad_716[0x2]; // 0x716 - 0x718
   CUtlSymbolLarge m_strRopeMaterialModel; // 0x718 - 0x720
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_iRopeMaterialModelIndex; // 0x720 - 0x728
   uint8_t m_Subdiv; // 0x728 - 0x729
   uint8_t m_nChangeCount; // 0x729 - 0x72A
   int16_t m_RopeLength; // 0x72A - 0x72C
   uint8_t m_fLockedPoints; // 0x72C - 0x72D
   bool m_bCreatedFromMapFile; // 0x72D - 0x72E
   unsigned char pad_72E[0x2]; // 0x72E - 0x730
   float m_flScrollSpeed; // 0x730 - 0x734
   bool m_bStartPointValid; // 0x734 - 0x735
   bool m_bEndPointValid; // 0x735 - 0x736
   unsigned char pad_736[0x2]; // 0x736 - 0x738
   CHandle< CBaseEntity > m_hStartPoint; // 0x738 - 0x73C
   CHandle< CBaseEntity > m_hEndPoint; // 0x73C - 0x740
   AttachmentHandle_t m_iStartAttachment; // 0x740 - 0x741
   AttachmentHandle_t m_iEndAttachment; // 0x741 - 0x742
   unsigned char pad_742[0x6]; // 0x742 - 0x748
}; // size - 0x748


class CRotButton /* "server" */ : public CBaseButton /* "server" */
{
public:
   unsigned char pad_0[0x8B8]; // 0x0 - 0x8B8
}; // size - 0x8B8


class CRuleBrushEntity /* "server" */ : public CRuleEntity /* "server" */
{
public:
   unsigned char pad_0[0x6F8]; // 0x0 - 0x6F8
}; // size - 0x6F8


class CSAdditionalPerRoundStats_t /* "server" */
{
public:
   int32_t m_numChickensKilled; // 0x0 - 0x4
   int32_t m_killsWhileBlind; // 0x4 - 0x8
   int32_t m_bombCarrierkills; // 0x8 - 0xC
   int32_t m_iBurnDamageInflicted; // 0xC - 0x10
   int32_t m_iDinks; // 0x10 - 0x14
}; // size - 0x14


class CSPerRoundStats_t /* "client" */
{
public:
   unsigned char pad_0[0x30]; // 0x0 - 0x30
   int32_t m_iKills; // 0x30 - 0x34
   int32_t m_iDeaths; // 0x34 - 0x38
   int32_t m_iAssists; // 0x38 - 0x3C
   int32_t m_iDamage; // 0x3C - 0x40
   int32_t m_iEquipmentValue; // 0x40 - 0x44
   int32_t m_iMoneySaved; // 0x44 - 0x48
   int32_t m_iKillReward; // 0x48 - 0x4C
   int32_t m_iLiveTime; // 0x4C - 0x50
   int32_t m_iHeadShotKills; // 0x50 - 0x54
   int32_t m_iObjective; // 0x54 - 0x58
   int32_t m_iCashEarned; // 0x58 - 0x5C
   int32_t m_iUtilityDamage; // 0x5C - 0x60
   int32_t m_iEnemiesFlashed; // 0x60 - 0x64
   unsigned char pad_64[0x4]; // 0x64 - 0x68
}; // size - 0x68


class CSPerRoundStats_t /* "server" */
{
public:
   unsigned char pad_0[0x30]; // 0x0 - 0x30
   int32_t m_iKills; // 0x30 - 0x34
   int32_t m_iDeaths; // 0x34 - 0x38
   int32_t m_iAssists; // 0x38 - 0x3C
   int32_t m_iDamage; // 0x3C - 0x40
   int32_t m_iEquipmentValue; // 0x40 - 0x44
   int32_t m_iMoneySaved; // 0x44 - 0x48
   int32_t m_iKillReward; // 0x48 - 0x4C
   int32_t m_iLiveTime; // 0x4C - 0x50
   int32_t m_iHeadShotKills; // 0x50 - 0x54
   int32_t m_iObjective; // 0x54 - 0x58
   int32_t m_iCashEarned; // 0x58 - 0x5C
   int32_t m_iUtilityDamage; // 0x5C - 0x60
   int32_t m_iEnemiesFlashed; // 0x60 - 0x64
   unsigned char pad_64[0x4]; // 0x64 - 0x68
}; // size - 0x68


class CSequenceAnimNode /* "animationsystem" */ : public CAnimNodeBase /* "animationsystem" */
{
public:
   unsigned char pad_38[0x30]; // 0x38 - 0x68
   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x68 - 0x80
   CUtlVector< CSmartPtr< CAnimParamSpan > > m_paramSpans; // 0x80 - 0x98
   CUtlString m_sequenceName; // 0x98 - 0xA0
   float m_playbackSpeed; // 0xA0 - 0xA4
   bool m_bLoop; // 0xA4 - 0xA5
   unsigned char pad_A5[0x3]; // 0xA5 - 0xA8
}; // size - 0xA8


class CSequenceUpdateNode /* "animationsystem" */ : public CLeafUpdateNode /* "animationsystem" */
{
public:
   unsigned char pad_58[0x8]; // 0x58 - 0x60
   CParamSpanUpdater m_paramSpans; // 0x60 - 0x78
   CUtlVector< TagSpan_t > m_tags; // 0x78 - 0x90
   unsigned char pad_90[0x4]; // 0x90 - 0x94
   HSequence m_hSequence; // 0x94 - 0x98
   float m_playbackSpeed; // 0x98 - 0x9C
   float m_duration; // 0x9C - 0xA0
   bool m_bLoop; // 0xA0 - 0xA1
   unsigned char pad_A1[0x7]; // 0xA1 - 0xA8
}; // size - 0xA8


class CSosGroupBranchPattern /* "soundsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   bool m_bMatchEventName; // 0x8 - 0x9
   bool m_bMatchEventSubString; // 0x9 - 0xA
   bool m_bMatchEntIndex; // 0xA - 0xB
   bool m_bMatchOpvar; // 0xB - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
}; // size - 0x10


class CSoundOpvarSetAABBEntity /* "server" */ : public CSoundOpvarSetPointEntity /* "server" */
{
public:
   Vector m_vDistanceInnerMins; // 0x638 - 0x644
   Vector m_vDistanceInnerMaxs; // 0x644 - 0x650
   Vector m_vDistanceOuterMins; // 0x650 - 0x65C
   Vector m_vDistanceOuterMaxs; // 0x65C - 0x668
   int32_t m_nAABBDirection; // 0x668 - 0x66C
   Vector m_vInnerMins; // 0x66C - 0x678
   Vector m_vInnerMaxs; // 0x678 - 0x684
   Vector m_vOuterMins; // 0x684 - 0x690
   Vector m_vOuterMaxs; // 0x690 - 0x69C
   unsigned char pad_69C[0x4]; // 0x69C - 0x6A0
}; // size - 0x6A0


class CSpinUpdateBase /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   unsigned char pad_0[0x210]; // 0x0 - 0x210
}; // size - 0x210


class CStaticPoseCache /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CCachedPose > m_poses; // 0x10 - 0x28
   int32_t m_nBoneCount; // 0x28 - 0x2C
   int32_t m_nMorphCount; // 0x2C - 0x30
}; // size - 0x30


class CTabletBlockerShim /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   unsigned char pad_0[0x898]; // 0x0 - 0x898
}; // size - 0x898


class CTeam /* "server" */ : public CBaseEntity /* "server" */
{
public:
   CNetworkUtlVectorBase< CHandle< CBasePlayerController > > m_aPlayerControllers; // 0x4A0 - 0x4B8
   CNetworkUtlVectorBase< CHandle< CBasePlayerPawn > > m_aPlayers; // 0x4B8 - 0x4D0
   int32_t m_iScore; // 0x4D0 - 0x4D4
   char m_szTeamname[129]; // 0x4D4 - 0x555
   unsigned char pad_555[0x3]; // 0x555 - 0x558
}; // size - 0x558


class CTeamplayRules /* "server" */ : public CMultiplayRules /* "server" */
{
public:
   unsigned char pad_0[0x90]; // 0x0 - 0x90
}; // size - 0x90


class CTonemapController2 /* "server" */ : public CBaseEntity /* "server" */
{
public:
   float m_flAutoExposureMin; // 0x4A0 - 0x4A4
   float m_flAutoExposureMax; // 0x4A4 - 0x4A8
   float m_flTonemapPercentTarget; // 0x4A8 - 0x4AC
   float m_flTonemapPercentBrightPixels; // 0x4AC - 0x4B0
   float m_flTonemapMinAvgLum; // 0x4B0 - 0x4B4
   float m_flExposureAdaptationSpeedUp; // 0x4B4 - 0x4B8
   float m_flExposureAdaptationSpeedDown; // 0x4B8 - 0x4BC
   float m_flTonemapEVSmoothingRange; // 0x4BC - 0x4C0
   unsigned char pad_4C0[0x8]; // 0x4C0 - 0x4C8
}; // size - 0x4C8


class CTriggerCustomBounds /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   unsigned char pad_0[0x898]; // 0x0 - 0x898
}; // size - 0x898


class CTriggerPush /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   QAngle m_angPushEntitySpace; // 0x898 - 0x8A4
   Vector m_vecPushDirEntitySpace; // 0x8A4 - 0x8B0
   bool m_bTriggerOnStartTouch; // 0x8B0 - 0x8B1
   unsigned char pad_8B1[0x3]; // 0x8B1 - 0x8B4
   float m_flAlternateTicksFix; // 0x8B4 - 0x8B8
   float m_flPushSpeed; // 0x8B8 - 0x8BC
   unsigned char pad_8BC[0x4]; // 0x8BC - 0x8C0
}; // size - 0x8C0


class CWeaponBaseItem /* "server" */ : public CWeaponCSBase /* "server" */
{
public:
   CountdownTimer m_SequenceCompleteTimer; // 0xD50 - 0xD68
   bool m_bRedraw; // 0xD68 - 0xD69
   unsigned char pad_D69[0x7]; // 0xD69 - 0xD70
}; // size - 0xD70


class C_BaseFire /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   float m_flScale; // 0x538 - 0x53C
   float m_flStartScale; // 0x53C - 0x540
   float m_flScaleTime; // 0x540 - 0x544
   uint32_t m_nFlags; // 0x544 - 0x548
}; // size - 0x548


class C_Breakable /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_0[0x838]; // 0x0 - 0x838
}; // size - 0x838


class C_CSGO_PreviewModel /* "client" */ : public C_BaseFlex /* "client" */
{
public:
   CUtlString m_animgraph; // 0xB28 - 0xB30
   CUtlString m_animgraphCharacterModeString; // 0xB30 - 0xB38
   CUtlString m_defaultAnim; // 0xB38 - 0xB40
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0xB40 - 0xB44
   float m_flInitialModelScale; // 0xB44 - 0xB48
   unsigned char pad_B48[0xA8]; // 0xB48 - 0xBF0
}; // size - 0xBF0


class C_EnvCubemap /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_538[0xF0]; // 0x538 - 0x628
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hCubemapTexture; // 0x628 - 0x630
   bool m_bCustomCubemapTexture; // 0x630 - 0x631
   unsigned char pad_631[0x3]; // 0x631 - 0x634
   float m_flInfluenceRadius; // 0x634 - 0x638
   Vector m_vBoxProjectMins; // 0x638 - 0x644
   Vector m_vBoxProjectMaxs; // 0x644 - 0x650
   CUtlSymbolLarge m_LightGroups; // 0x650 - 0x658
   bool m_bMoveable; // 0x658 - 0x659
   unsigned char pad_659[0x3]; // 0x659 - 0x65C
   int32_t m_nHandshake; // 0x65C - 0x660
   int32_t m_nEnvCubeMapArrayIndex; // 0x660 - 0x664
   int32_t m_nPriority; // 0x664 - 0x668
   float m_flEdgeFadeDist; // 0x668 - 0x66C
   Vector m_vEdgeFadeDists; // 0x66C - 0x678
   float m_flDiffuseScale; // 0x678 - 0x67C
   bool m_bStartDisabled; // 0x67C - 0x67D
   bool m_bDefaultEnvMap; // 0x67D - 0x67E
   bool m_bDefaultSpecEnvMap; // 0x67E - 0x67F
   bool m_bIndoorCubeMap; // 0x67F - 0x680
   bool m_bCopyDiffuseFromDefaultCubemap; // 0x680 - 0x681
   unsigned char pad_681[0xF]; // 0x681 - 0x690
   bool m_bEnabled; // 0x690 - 0x691
   unsigned char pad_691[0x7]; // 0x691 - 0x698
}; // size - 0x698


class C_GameRulesProxy /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x538]; // 0x0 - 0x538
}; // size - 0x538


class C_Inferno /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_838[0x40]; // 0x838 - 0x878
   ParticleIndex_t m_nfxFireDamageEffect; // 0x878 - 0x87C
   int32 m_fireXDelta[64]; // 0x87C - 0x97C
   int32 m_fireYDelta[64]; // 0x97C - 0xA7C
   int32 m_fireZDelta[64]; // 0xA7C - 0xB7C
   int32 m_fireParentXDelta[64]; // 0xB7C - 0xC7C
   int32 m_fireParentYDelta[64]; // 0xC7C - 0xD7C
   int32 m_fireParentZDelta[64]; // 0xD7C - 0xE7C
   bool m_bFireIsBurning[64]; // 0xE7C - 0xEBC
   Vector m_BurnNormal[64]; // 0xEBC - 0x11BC
   int32_t m_fireCount; // 0x11BC - 0x11C0
   int32_t m_nInfernoType; // 0x11C0 - 0x11C4
   float m_nFireLifetime; // 0x11C4 - 0x11C8
   bool m_bInPostEffectTime; // 0x11C8 - 0x11C9
   unsigned char pad_11C9[0x3]; // 0x11C9 - 0x11CC
   int32_t m_lastFireCount; // 0x11CC - 0x11D0
   int32_t m_nFireEffectTickBegin; // 0x11D0 - 0x11D4
   unsigned char pad_11D4[0x6C0C]; // 0x11D4 - 0x7DE0
   int32_t m_drawableCount; // 0x7DE0 - 0x7DE4
   bool m_blosCheck; // 0x7DE4 - 0x7DE5
   unsigned char pad_7DE5[0x3]; // 0x7DE5 - 0x7DE8
   int32_t m_nlosperiod; // 0x7DE8 - 0x7DEC
   float m_maxFireHalfWidth; // 0x7DEC - 0x7DF0
   float m_maxFireHeight; // 0x7DF0 - 0x7DF4
   Vector m_minBounds; // 0x7DF4 - 0x7E00
   Vector m_maxBounds; // 0x7E00 - 0x7E0C
   float m_flLastGrassBurnThink; // 0x7E0C - 0x7E10
   unsigned char pad_7E10[0x10]; // 0x7E10 - 0x7E20
}; // size - 0x7E20


class C_Knife /* "client" */ : public C_WeaponCSBase /* "client" */
{
public:
   unsigned char pad_0[0x13D0]; // 0x0 - 0x13D0
}; // size - 0x13D0


class C_LightDirectionalEntity /* "client" */ : public C_LightEntity /* "client" */
{
public:
   unsigned char pad_0[0x840]; // 0x0 - 0x840
}; // size - 0x840


class C_MolotovGrenade /* "client" */ : public C_BaseCSGrenade /* "client" */
{
public:
   unsigned char pad_0[0x1430]; // 0x0 - 0x1430
}; // size - 0x1430


class C_OP_RenderPoints /* "particles" */ : public CParticleFunctionRenderer /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x260 - 0x268
   unsigned char pad_268[0x8]; // 0x268 - 0x270
}; // size - 0x270


class C_PathParticleRope /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   bool m_bStartActive; // 0x538 - 0x539
   unsigned char pad_539[0x3]; // 0x539 - 0x53C
   float m_flMaxSimulationTime; // 0x53C - 0x540
   CUtlSymbolLarge m_iszEffectName; // 0x540 - 0x548
   CUtlVector< CUtlSymbolLarge > m_PathNodes_Name; // 0x548 - 0x560
   float m_flParticleSpacing; // 0x560 - 0x564
   float m_flSlack; // 0x564 - 0x568
   float m_flRadius; // 0x568 - 0x56C
   Color m_ColorTint; // 0x56C - 0x570
   int32_t m_nEffectState; // 0x570 - 0x574
   unsigned char pad_574[0x4]; // 0x574 - 0x578
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x578 - 0x580
   C_NetworkUtlVectorBase< Vector > m_PathNodes_Position; // 0x580 - 0x598
   C_NetworkUtlVectorBase< Vector > m_PathNodes_TangentIn; // 0x598 - 0x5B0
   C_NetworkUtlVectorBase< Vector > m_PathNodes_TangentOut; // 0x5B0 - 0x5C8
   C_NetworkUtlVectorBase< Vector > m_PathNodes_Color; // 0x5C8 - 0x5E0
   C_NetworkUtlVectorBase< bool > m_PathNodes_PinEnabled; // 0x5E0 - 0x5F8
   C_NetworkUtlVectorBase< float32 > m_PathNodes_RadiusScale; // 0x5F8 - 0x610
   unsigned char pad_610[0x30]; // 0x610 - 0x640
}; // size - 0x640


class C_PlantedC4 /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   bool m_bBombTicking; // 0x998 - 0x999
   unsigned char pad_999[0x3]; // 0x999 - 0x99C
   int32_t m_nBombSite; // 0x99C - 0x9A0
   int32_t m_nSourceSoundscapeHash; // 0x9A0 - 0x9A4
   unsigned char pad_9A4[0x4]; // 0x9A4 - 0x9A8
   EntitySpottedState_t m_entitySpottedState; // 0x9A8 - 0x9C0
   GameTime_t m_flNextGlow; // 0x9C0 - 0x9C4
   GameTime_t m_flNextBeep; // 0x9C4 - 0x9C8
   GameTime_t m_flC4Blow; // 0x9C8 - 0x9CC
   float m_flTimerLength; // 0x9CC - 0x9D0
   float m_bTenSecWarning; // 0x9D0 - 0x9D4
   float m_bTriggerWarning; // 0x9D4 - 0x9D8
   float m_bExplodeWarning; // 0x9D8 - 0x9DC
   bool m_bLocalBRMusicPlayed; // 0x9DC - 0x9DD
   unsigned char pad_9DD[0x3]; // 0x9DD - 0x9E0
   float m_flDefuseLength; // 0x9E0 - 0x9E4
   GameTime_t m_flDefuseCountDown; // 0x9E4 - 0x9E8
   bool m_bBombDefused; // 0x9E8 - 0x9E9
   unsigned char pad_9E9[0x3]; // 0x9E9 - 0x9EC
   CHandle< C_CSPlayerPawnBase > m_hBombDefuser; // 0x9EC - 0x9F0
   CEntityHandle m_hControlPanel; // 0x9F0 - 0x9F4
   CHandle< C_Multimeter > m_hDefuserMultimeter; // 0x9F4 - 0x9F8
   GameTime_t m_flNextRadarFlashTime; // 0x9F8 - 0x9FC
   bool m_bRadarFlash; // 0x9FC - 0x9FD
   unsigned char pad_9FD[0x3]; // 0x9FD - 0xA00
   CHandle< C_CSPlayerPawnBase > m_hLocalDefusingPlayerHandle; // 0xA00 - 0xA04
   unsigned char pad_A04[0x4]; // 0xA04 - 0xA08
}; // size - 0xA08


class C_PointCamera /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   float m_FOV; // 0x538 - 0x53C
   float m_Resolution; // 0x53C - 0x540
   bool m_bFogEnable; // 0x540 - 0x541
   Color m_FogColor; // 0x541 - 0x545
   unsigned char pad_545[0x3]; // 0x545 - 0x548
   float m_flFogStart; // 0x548 - 0x54C
   float m_flFogEnd; // 0x54C - 0x550
   float m_flFogMaxDensity; // 0x550 - 0x554
   bool m_bActive; // 0x554 - 0x555
   bool m_bUseScreenAspectRatio; // 0x555 - 0x556
   unsigned char pad_556[0x2]; // 0x556 - 0x558
   float m_flAspectRatio; // 0x558 - 0x55C
   bool m_bNoSky; // 0x55C - 0x55D
   unsigned char pad_55D[0x3]; // 0x55D - 0x560
   float m_fBrightness; // 0x560 - 0x564
   float m_flZFar; // 0x564 - 0x568
   float m_flZNear; // 0x568 - 0x56C
   bool m_bDofEnabled; // 0x56C - 0x56D
   unsigned char pad_56D[0x3]; // 0x56D - 0x570
   float m_flDofNearBlurry; // 0x570 - 0x574
   float m_flDofNearCrisp; // 0x574 - 0x578
   float m_flDofFarCrisp; // 0x578 - 0x57C
   float m_flDofFarBlurry; // 0x57C - 0x580
   float m_flDofTiltToGround; // 0x580 - 0x584
   float m_TargetFOV; // 0x584 - 0x588
   float m_DegreesPerSecond; // 0x588 - 0x58C
   bool m_bIsOn; // 0x58C - 0x58D
   unsigned char pad_58D[0x3]; // 0x58D - 0x590
   C_PointCamera* m_pNext; // 0x590 - 0x598
}; // size - 0x598


class C_PointHMDAnchor /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   bool m_bDisabled; // 0x538 - 0x539
   unsigned char pad_539[0x3]; // 0x539 - 0x53C
   GameTime_t m_flEnableTime; // 0x53C - 0x540
   int32_t m_nPlayerIndex; // 0x540 - 0x544
   int32_t m_nLastSimulateFrame; // 0x544 - 0x548
}; // size - 0x548


class C_PredictedViewModel /* "client" */ : public C_BaseViewModel /* "client" */
{
public:
   QAngle m_LagAnglesHistory; // 0xA00 - 0xA0C
   unsigned char pad_A0C[0xC]; // 0xA0C - 0xA18
   Vector m_vPredictedOffset; // 0xA18 - 0xA24
   unsigned char pad_A24[0x4]; // 0xA24 - 0xA28
}; // size - 0xA28


class C_RagdollProp /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   unsigned char pad_998[0x8]; // 0x998 - 0x9A0
   C_NetworkUtlVectorBase< Vector > m_ragPos; // 0x9A0 - 0x9B8
   C_NetworkUtlVectorBase< QAngle > m_ragAngles; // 0x9B8 - 0x9D0
   float m_flBlendWeight; // 0x9D0 - 0x9D4
   CHandle< C_BaseEntity > m_hRagdollSource; // 0x9D4 - 0x9D8
   AttachmentHandle_t m_iEyeAttachment; // 0x9D8 - 0x9D9
   unsigned char pad_9D9[0x3]; // 0x9D9 - 0x9DC
   float m_flBlendWeightCurrent; // 0x9DC - 0x9E0
   CUtlVector< int32 > m_parentPhysicsBoneIndices; // 0x9E0 - 0x9F8
   CUtlVector< int32 > m_worldSpaceBoneComputationOrder; // 0x9F8 - 0xA10
}; // size - 0xA10


class C_SoundOpvarSetAABBEntity /* "client" */ : public C_SoundOpvarSetPointEntity /* "client" */
{
public:
   unsigned char pad_0[0x558]; // 0x0 - 0x558
}; // size - 0x558


class C_Team /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   C_NetworkUtlVectorBase< CHandle< CBasePlayerController > > m_aPlayerControllers; // 0x538 - 0x550
   C_NetworkUtlVectorBase< CHandle< C_BasePlayerPawn > > m_aPlayers; // 0x550 - 0x568
   int32_t m_iScore; // 0x568 - 0x56C
   char m_szTeamname[129]; // 0x56C - 0x5ED
   unsigned char pad_5ED[0x3]; // 0x5ED - 0x5F0
}; // size - 0x5F0


class C_TeamplayRules /* "client" */ : public C_MultiplayRules /* "client" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class C_TonemapController2 /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   float m_flAutoExposureMin; // 0x538 - 0x53C
   float m_flAutoExposureMax; // 0x53C - 0x540
   float m_flTonemapPercentTarget; // 0x540 - 0x544
   float m_flTonemapPercentBrightPixels; // 0x544 - 0x548
   float m_flTonemapMinAvgLum; // 0x548 - 0x54C
   float m_flExposureAdaptationSpeedUp; // 0x54C - 0x550
   float m_flExposureAdaptationSpeedDown; // 0x550 - 0x554
   float m_flTonemapEVSmoothingRange; // 0x554 - 0x558
   unsigned char pad_558[0x8]; // 0x558 - 0x560
}; // size - 0x560


class C_WeaponBaseItem /* "client" */ : public C_WeaponCSBase /* "client" */
{
public:
   CountdownTimer m_SequenceCompleteTimer; // 0x13D0 - 0x13E8
   bool m_bRedraw; // 0x13E8 - 0x13E9
   unsigned char pad_13E9[0x7]; // 0x13E9 - 0x13F0
}; // size - 0x13F0


class FeBoxRigid_t /* "physicslib" */
{
public:
   CTransform tmFrame2; // 0x0 - 0x20
   uint16_t nNode; // 0x20 - 0x22
   uint16_t nCollisionMask; // 0x22 - 0x24
   Vector vSize; // 0x24 - 0x30
   float flStickiness; // 0x30 - 0x34
   uint16_t nVertexMapIndex; // 0x34 - 0x36
   uint16_t nFlags; // 0x36 - 0x38
   float32 flReserved[2]; // 0x38 - 0x40
}; // size - 0x40


class FeSphereRigid_t /* "physicslib" */
{
public:
   fltx4 vSphere; // 0x0 - 0x10
   float flStickiness; // 0x10 - 0x14
   uint16_t nNode; // 0x14 - 0x16
   uint16_t nCollisionMask; // 0x16 - 0x18
   uint16_t nVertexMapIndex; // 0x18 - 0x1A
   uint16_t nFlags; // 0x1A - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
}; // size - 0x20


class FeTaperedCapsuleRigid_t /* "physicslib" */
{
public:
   fltx4 vSphere[2]; // 0x0 - 0x20
   float flStickiness; // 0x20 - 0x24
   uint16_t nNode; // 0x24 - 0x26
   uint16_t nCollisionMask; // 0x26 - 0x28
   uint16_t nVertexMapIndex; // 0x28 - 0x2A
   uint16_t nFlags; // 0x2A - 0x2C
   unsigned char pad_2C[0x4]; // 0x2C - 0x30
}; // size - 0x30


class IChoreoServices /* "server" */
{
public:

   enum class ScriptState_t : std::uint32_t
   {
      SCRIPT_PLAYING = 0,
      SCRIPT_WAIT = 1,
      SCRIPT_POST_IDLE = 2,
      SCRIPT_CLEANUP = 3,
      SCRIPT_WALK_TO_MARK = 4,
      SCRIPT_RUN_TO_MARK = 5,
      SCRIPT_CUSTOM_MOVE_TO_MARK = 6
   };

   enum class ChoreoState_t : std::uint32_t
   {
      STATE_PRE_SCRIPT = 0,
      STATE_WAIT_FOR_SCRIPT = 1,
      STATE_WALK_TO_MARK = 2,
      STATE_SYNCHRONIZE_SCRIPT = 3,
      STATE_PLAY_SCRIPT = 4,
      STATE_PLAY_SCRIPT_POST_IDLE = 5,
      STATE_PLAY_SCRIPT_POST_IDLE_DONE = 6
   };
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class IClientAlphaProperty /* "client" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class IParticleEffect /* "particleslib" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class IParticleSystemDefinition /* "particles" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class IRagdoll /* "server" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class IntervalTimer /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   GameTime_t m_timestamp; // 0x8 - 0xC
   WorldGroupId_t m_nWorldGroupId; // 0xC - 0x10
}; // size - 0x10


class IntervalTimer /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   GameTime_t m_timestamp; // 0x8 - 0xC
   WorldGroupId_t m_nWorldGroupId; // 0xC - 0x10
}; // size - 0x10


class PointDefinition_t /* "particles" */
{
public:
   int32_t m_nControlPoint; // 0x0 - 0x4
   bool m_bLocalCoords; // 0x4 - 0x5
   unsigned char pad_5[0x3]; // 0x5 - 0x8
   Vector m_vOffset; // 0x8 - 0x14
}; // size - 0x14


class Relationship_t /* "server" */
{
public:
   Disposition_t disposition; // 0x0 - 0x4
   int32_t priority; // 0x4 - 0x8
}; // size - 0x8


class SpawnPointCoopEnemy /* "server" */ : public SpawnPoint /* "server" */
{
public:

   enum class BotDefaultBehavior_t : std::uint32_t
   {
      DEFEND_AREA = 0,
      HUNT = 1,
      CHARGE_ENEMY = 2,
      DEFEND_INVESTIGATE = 3
   };
   CUtlSymbolLarge m_szWeaponsToGive; // 0x4B0 - 0x4B8
   CUtlSymbolLarge m_szPlayerModelToUse; // 0x4B8 - 0x4C0
   int32_t m_nArmorToSpawnWith; // 0x4C0 - 0x4C4
   SpawnPointCoopEnemy::BotDefaultBehavior_t m_nDefaultBehavior; // 0x4C4 - 0x4C8
   int32_t m_nBotDifficulty; // 0x4C8 - 0x4CC
   bool m_bIsAgressive; // 0x4CC - 0x4CD
   bool m_bStartAsleep; // 0x4CD - 0x4CE
   unsigned char pad_4CE[0x2]; // 0x4CE - 0x4D0
   float m_flHideRadius; // 0x4D0 - 0x4D4
   unsigned char pad_4D4[0xC]; // 0x4D4 - 0x4E0
   CUtlSymbolLarge m_szBehaviorTreeFile; // 0x4E0 - 0x4E8
}; // size - 0x4E8


class dynpitchvol_base_t /* "server" */
{
public:
   int32_t preset; // 0x0 - 0x4
   int32_t pitchrun; // 0x4 - 0x8
   int32_t pitchstart; // 0x8 - 0xC
   int32_t spinup; // 0xC - 0x10
   int32_t spindown; // 0x10 - 0x14
   int32_t volrun; // 0x14 - 0x18
   int32_t volstart; // 0x18 - 0x1C
   int32_t fadein; // 0x1C - 0x20
   int32_t fadeout; // 0x20 - 0x24
   int32_t lfotype; // 0x24 - 0x28
   int32_t lforate; // 0x28 - 0x2C
   int32_t lfomodpitch; // 0x2C - 0x30
   int32_t lfomodvol; // 0x30 - 0x34
   int32_t cspinup; // 0x34 - 0x38
   int32_t cspincount; // 0x38 - 0x3C
   int32_t pitch; // 0x3C - 0x40
   int32_t spinupsav; // 0x40 - 0x44
   int32_t spindownsav; // 0x44 - 0x48
   int32_t pitchfrac; // 0x48 - 0x4C
   int32_t vol; // 0x4C - 0x50
   int32_t fadeinsav; // 0x50 - 0x54
   int32_t fadeoutsav; // 0x54 - 0x58
   int32_t volfrac; // 0x58 - 0x5C
   int32_t lfofrac; // 0x5C - 0x60
   int32_t lfomult; // 0x60 - 0x64
}; // size - 0x64


class AABB_t /* "mathlib_extended" */
{
public:
   Vector m_vMinBounds; // 0x0 - 0xC
   Vector m_vMaxBounds; // 0xC - 0x18
}; // size - 0x18


class ActiveModelConfig_t /* "client" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
   ModelConfigHandle_t m_Handle; // 0x28 - 0x2C
   unsigned char pad_2C[0x4]; // 0x2C - 0x30
   CUtlSymbolLarge m_Name; // 0x30 - 0x38
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_AssociatedEntities; // 0x38 - 0x50
   C_NetworkUtlVectorBase< CUtlSymbolLarge > m_AssociatedEntityNames; // 0x50 - 0x68
}; // size - 0x68


class ActiveModelConfig_t /* "server" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
   ModelConfigHandle_t m_Handle; // 0x28 - 0x2C
   unsigned char pad_2C[0x4]; // 0x2C - 0x30
   CUtlSymbolLarge m_Name; // 0x30 - 0x38
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_AssociatedEntities; // 0x38 - 0x50
   CNetworkUtlVectorBase< CUtlSymbolLarge > m_AssociatedEntityNames; // 0x50 - 0x68
}; // size - 0x68


class AggregateLODSetup_t /* "worldrenderer" */
{
public:
   Vector m_vLODOrigin; // 0x0 - 0xC
   float m_fMaxObjectScale; // 0xC - 0x10
   uint8_t m_nLODMask; // 0x10 - 0x11
   unsigned char pad_11[0x7]; // 0x11 - 0x18
   CUtlVectorFixedGrowable< float32 > m_fSwitchDistances; // 0x18 - 0x40
}; // size - 0x40


class AggregateMeshInfo_t /* "worldrenderer" */
{
public:
   uint32_t m_nVisClusterMemberOffset; // 0x0 - 0x4
   uint8_t m_nVisClusterMemberCount; // 0x4 - 0x5
   bool m_bHasTransform; // 0x5 - 0x6
   int16_t m_nDrawCallIndex; // 0x6 - 0x8
   int16_t m_nLODSetupIndex; // 0x8 - 0xA
   uint8_t m_nLODGroupMask; // 0xA - 0xB
   Color m_vTintColor; // 0xB - 0xF
   unsigned char pad_F[0x1]; // 0xF - 0x10
   ObjectTypeFlags_t m_objectFlags; // 0x10 - 0x14
   int32_t m_nLightProbeVolumePrecomputedHandshake; // 0x14 - 0x18
   Vector m_vLODOrigin; // 0x18 - 0x24
   float m_fLODStartDrawDistance; // 0x24 - 0x28
   float m_fLODEndDrawDistance; // 0x28 - 0x2C
   float m_fMaxObjectScale; // 0x2C - 0x30
}; // size - 0x30


class AggregateSceneObject_t /* "worldrenderer" */
{
public:
   ObjectTypeFlags_t m_allFlags; // 0x0 - 0x4
   ObjectTypeFlags_t m_anyFlags; // 0x4 - 0x8
   int16_t m_nLayer; // 0x8 - 0xA
   unsigned char pad_A[0x6]; // 0xA - 0x10
   CUtlVector< AggregateMeshInfo_t > m_aggregateMeshes; // 0x10 - 0x28
   CUtlVector< AggregateLODSetup_t > m_lodSetups; // 0x28 - 0x40
   CUtlVector< uint16 > m_visClusterMembership; // 0x40 - 0x58
   CUtlVector< matrix3x4_t > m_fragmentTransforms; // 0x58 - 0x70
   CStrongHandle< InfoForResourceTypeCModel > m_renderableModel; // 0x70 - 0x78
}; // size - 0x78


class AimMatrixOpFixedSettings_t /* "animationsystem" */
{
public:
   CAnimAttachment m_attachment; // 0x0 - 0xFFFFFFFF
   CAnimInputDamping m_damping; // 0x80 - 0x90
   CPoseHandle m_poseCacheHandles[10]; // 0x90 - 0xB8
   AimMatrixBlendMode m_eBlendMode; // 0xB8 - 0xBC
   float m_fAngleIncrement; // 0xBC - 0xC0
   int32_t m_nSequenceMaxFrame; // 0xC0 - 0xC4
   int32_t m_nBoneMaskIndex; // 0xC4 - 0xC8
   bool m_bTargetIsPosition; // 0xC8 - 0xC9
   unsigned char pad_C9[0x7]; // 0xC9 - 0xD0
}; // size - 0xD0


class AmmoIndex_t /* "server" */
{
public:
   int8_t m_Value; // 0x0 - 0x1
}; // size - 0x1


class AnimComponentID /* "animationsystem" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimNodeID /* "animationsystem" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimNodeOutputID /* "animationsystem" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimParamID /* "animationsystem" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimScriptHandle /* "animationsystem" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimStateID /* "animationsystem" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimTagID /* "animationsystem" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimationDecodeDebugDumpElement_t /* "animationsystem" */
{
public:
   int32_t m_nEntityIndex; // 0x0 - 0x4
   unsigned char pad_4[0x4]; // 0x4 - 0x8
   CUtlString m_modelName; // 0x8 - 0x10
   CUtlVector< CUtlString > m_poseParams; // 0x10 - 0x28
   CUtlVector< CUtlString > m_decodeOps; // 0x28 - 0x40
   CUtlVector< CUtlString > m_internalOps; // 0x40 - 0x58
   CUtlVector< CUtlString > m_decodedAnims; // 0x58 - 0x70
}; // size - 0x70


class AnimationDecodeDebugDump_t /* "animationsystem" */
{
public:
   AnimationProcessingType_t m_processingType; // 0x0 - 0x4
   unsigned char pad_4[0x4]; // 0x4 - 0x8
   CUtlVector< AnimationDecodeDebugDumpElement_t > m_elems; // 0x8 - 0x20
}; // size - 0x20


class AnimationSnapshot_t /* "animationsystem" */ : public AnimationSnapshotBase_t /* "animationsystem" */
{
public:
   int32_t m_nEntIndex; // 0x110 - 0x114
   unsigned char pad_114[0x4]; // 0x114 - 0x118
   CUtlString m_modelName; // 0x118 - 0x120
}; // size - 0x120


class AnimationUpdateListHandle_t /* "server" */
{
public:
   uint32_t m_Value; // 0x0 - 0x4
}; // size - 0x4


class AttachmentHandle_t /* "modellib" */
{
public:
   uint8_t m_Value; // 0x0 - 0x1
}; // size - 0x1


class BakedLightingInfo_t /* "worldrenderer" */
{
public:
   uint32_t m_nLightmapVersionNumber; // 0x0 - 0x4
   uint32_t m_nLightmapGameVersionNumber; // 0x4 - 0x8
   Vector2D m_vLightmapUvScale; // 0x8 - 0x10
   bool m_bHasLightmaps; // 0x10 - 0x11
   unsigned char pad_11[0x7]; // 0x11 - 0x18
   CUtlVector< CStrongHandle< InfoForResourceTypeCTextureBase > > m_lightMaps; // 0x18 - 0x30
}; // size - 0x30


class BlendItem_t /* "animationsystem" */
{
public:
   CUtlVector< TagSpan_t > m_tags; // 0x0 - 0x18
   CAnimUpdateNodeRef m_pChild; // 0x18 - 0x28
   HSequence m_hSequence; // 0x28 - 0x2C
   Vector2D m_vPos; // 0x2C - 0x34
   float m_flDuration; // 0x34 - 0x38
   bool m_bUseCustomDuration; // 0x38 - 0x39
   unsigned char pad_39[0x7]; // 0x39 - 0x40
}; // size - 0x40


class CAISound /* "server" */ : public CPointEntity /* "server" */
{
public:
   int32_t m_iSoundType; // 0x4A0 - 0x4A4
   int32_t m_iSoundContext; // 0x4A4 - 0x4A8
   int32_t m_iVolume; // 0x4A8 - 0x4AC
   int32_t m_iSoundIndex; // 0x4AC - 0x4B0
   float m_flDuration; // 0x4B0 - 0x4B4
   unsigned char pad_4B4[0x4]; // 0x4B4 - 0x4B8
   CUtlSymbolLarge m_iszProxyEntityName; // 0x4B8 - 0x4C0
}; // size - 0x4C0


class CAI_ChangeHintGroup /* "server" */ : public CBaseEntity /* "server" */
{
public:
   int32_t m_iSearchType; // 0x4A0 - 0x4A4
   unsigned char pad_4A4[0x4]; // 0x4A4 - 0x4A8
   CUtlSymbolLarge m_strSearchName; // 0x4A8 - 0x4B0
   CUtlSymbolLarge m_strNewHintGroup; // 0x4B0 - 0x4B8
   float m_flRadius; // 0x4B8 - 0x4BC
   unsigned char pad_4BC[0x4]; // 0x4BC - 0x4C0
}; // size - 0x4C0


class CAI_ChangeTarget /* "server" */ : public CBaseEntity /* "server" */
{
public:
   CUtlSymbolLarge m_iszNewTarget; // 0x4A0 - 0x4A8
}; // size - 0x4A8


class CAK47 /* "server" */ : public CWeaponCSBaseGun /* "server" */
{
public:
   unsigned char pad_0[0xD70]; // 0x0 - 0xD70
}; // size - 0xD70


class CActionComponent /* "animationsystem" */ : public CAnimComponentBase /* "animationsystem" */
{
public:
   CUtlVector< CSmartPtr< CAnimActionBase > > m_actions; // 0x38 - 0x50
   CUtlString m_sName; // 0x50 - 0x58
}; // size - 0x58


class CActionComponentUpdater /* "animationsystem" */ : public CAnimComponentUpdater /* "animationsystem" */
{
public:
   CUtlVector< CSmartPtr< CAnimActionUpdater > > m_actions; // 0x30 - 0x48
}; // size - 0x48


class CAddAnimNode /* "animationsystem" */ : public CAnimNodeBase /* "animationsystem" */
{
public:
   CAnimNodeConnection m_baseInput; // 0x38 - 0x40
   CAnimNodeConnection m_additiveInput; // 0x40 - 0x48
   BinaryNodeTiming m_timingBehavior; // 0x48 - 0x4C
   float m_flTimingBlend; // 0x4C - 0x50
   BinaryNodeChildOption m_footMotionTiming; // 0x50 - 0x54
   bool m_bApplyToFootMotion; // 0x54 - 0x55
   bool m_bResetBase; // 0x55 - 0x56
   bool m_bResetAdditive; // 0x56 - 0x57
   bool m_bApplyChannelsSeparately; // 0x57 - 0x58
   bool m_bUseModelSpace; // 0x58 - 0x59
   unsigned char pad_59[0x7]; // 0x59 - 0x60
}; // size - 0x60


class CAddUpdateNode /* "animationsystem" */ : public CBinaryUpdateNode /* "animationsystem" */
{
public:
   unsigned char pad_88[0x4]; // 0x88 - 0x8C
   BinaryNodeChildOption m_footMotionTiming; // 0x8C - 0x90
   bool m_bApplyToFootMotion; // 0x90 - 0x91
   bool m_bApplyChannelsSeparately; // 0x91 - 0x92
   bool m_bUseModelSpace; // 0x92 - 0x93
   unsigned char pad_93[0x5]; // 0x93 - 0x98
}; // size - 0x98


class CAimConstraint /* "modellib" */ : public CBaseConstraint /* "modellib" */
{
public:
   Quaternion m_qAimOffset; // 0x70 - 0x80
   uint32_t m_nUpType; // 0x80 - 0x84
   unsigned char pad_84[0xC]; // 0x84 - 0x90
}; // size - 0x90


class CAimMatrixAnimNode /* "animationsystem" */ : public CAnimNodeBase /* "animationsystem" */
{
public:
   unsigned char pad_38[0x8]; // 0x38 - 0x40
   CAnimNodeConnection m_inputConnection; // 0x40 - 0x48
   CUtlString m_sequenceName; // 0x48 - 0x50
   float m_fAngleIncrement; // 0x50 - 0x54
   AnimVectorSource m_target; // 0x54 - 0x58
   AnimParamID m_param; // 0x58 - 0x5C
   unsigned char pad_5C[0x4]; // 0x5C - 0x60
   CUtlString m_attachmentName; // 0x60 - 0x68
   AimMatrixBlendMode m_blendMode; // 0x68 - 0x6C
   unsigned char pad_6C[0x4]; // 0x6C - 0x70
   CUtlString m_boneMaskName; // 0x70 - 0x78
   bool m_bResetBase; // 0x78 - 0x79
   bool m_bLockWhenWaning; // 0x79 - 0x7A
   unsigned char pad_7A[0x6]; // 0x7A - 0x80
   CAnimInputDamping m_damping; // 0x80 - 0x90
}; // size - 0x90


class CAimMatrixUpdateNode /* "animationsystem" */ : public CUnaryUpdateNode /* "animationsystem" */
{
public:
   unsigned char pad_68[0x8]; // 0x68 - 0x70
   AimMatrixOpFixedSettings_t m_opFixedSettings; // 0x70 - 0x140
   unsigned char pad_140[0x8]; // 0x140 - 0x148
   AnimVectorSource m_target; // 0x148 - 0x14C
   CAnimParamHandle m_paramIndex; // 0x14C - 0x14E
   unsigned char pad_14E[0x2]; // 0x14E - 0x150
   HSequence m_hSequence; // 0x150 - 0x154
   bool m_bResetChild; // 0x154 - 0x155
   bool m_bLockWhenWaning; // 0x155 - 0x156
   unsigned char pad_156[0xA]; // 0x156 - 0x160
}; // size - 0x160


class CAmbientGeneric /* "server" */ : public CPointEntity /* "server" */
{
public:
   float m_radius; // 0x4A0 - 0x4A4
   float m_flMaxRadius; // 0x4A4 - 0x4A8
   soundlevel_t m_iSoundLevel; // 0x4A8 - 0x4AC
   dynpitchvol_t m_dpv; // 0x4AC - 0x510
   bool m_fActive; // 0x510 - 0x511
   bool m_fLooping; // 0x511 - 0x512
   unsigned char pad_512[0x6]; // 0x512 - 0x518
   CUtlSymbolLarge m_iszSound; // 0x518 - 0x520
   CUtlSymbolLarge m_sSourceEntName; // 0x520 - 0x528
   CHandle< CBaseEntity > m_hSoundSource; // 0x528 - 0x52C
   CEntityIndex m_nSoundSourceEntIndex; // 0x52C - 0x530
   unsigned char pad_530[0x8]; // 0x530 - 0x538
}; // size - 0x538


class CAndCondition /* "animationsystem" */ : public CConditionBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x60]; // 0x0 - 0x60
}; // size - 0x60


class CAnimActivity /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   int32_t m_nActivity; // 0x10 - 0x14
   int32_t m_nFlags; // 0x14 - 0x18
   int32_t m_nWeight; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
}; // size - 0x20


class CAnimAnimEvent /* "animationsystem" */
{
public:
   int32_t m_nFrame; // 0x0 - 0x4
   float m_flCycle; // 0x4 - 0x8
   KeyValues3 m_EventData; // 0x8 - 0x18
   CBufferString m_sLegacyOptions; // 0x18 - 0x28
   CBufferString m_sEventName; // 0x28 - 0x38
}; // size - 0x38


class CAnimBone /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   int32_t m_parent; // 0x10 - 0x14
   Vector m_pos; // 0x14 - 0x20
   QuaternionStorage m_quat; // 0x20 - 0x30
   float m_scale; // 0x30 - 0x34
   QuaternionStorage m_qAlignment; // 0x34 - 0x44
   int32_t m_flags; // 0x44 - 0x48
}; // size - 0x48


class CAnimBoneDifference /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   CBufferString m_parent; // 0x10 - 0x20
   Vector m_posError; // 0x20 - 0x2C
   bool m_bHasRotation; // 0x2C - 0x2D
   bool m_bHasMovement; // 0x2D - 0x2E
   unsigned char pad_2E[0x2]; // 0x2E - 0x30
}; // size - 0x30


class CAnimClipData /* "animationsystem" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x20 - 0x38
   CUtlString m_clipName; // 0x38 - 0x40
   unsigned char pad_40[0x8]; // 0x40 - 0x48
}; // size - 0x48


class CAnimClipDataManager /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlHashtable< CUtlString, CSmartPtr< CAnimClipData > > m_itemTable; // 0x18 - 0x38
}; // size - 0x38


class CAnimComponentManager /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVector< CSmartPtr< CAnimComponentBase > > m_components; // 0x8 - 0x20
   unsigned char pad_20[0x8]; // 0x20 - 0x28
}; // size - 0x28


class CAnimComponentState /* "animationsystem" */ : public CAnimState /* "animationsystem" */
{
public:
   unsigned char pad_0[0x70]; // 0x0 - 0x70
}; // size - 0x70


class CAnimComponentStateTransition /* "animationsystem" */ : public CAnimStateTransition /* "animationsystem" */
{
public:
   unsigned char pad_0[0x70]; // 0x0 - 0x70
}; // size - 0x70


class CAnimCycle /* "modellib" */ : public CCycleBase /* "modellib" */
{
public:
   unsigned char pad_0[0x4]; // 0x0 - 0x4
}; // size - 0x4


class CAnimData /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CBufferString m_name; // 0x10 - 0x20
   CUtlVector< CAnimDesc > m_animArray; // 0x20 - 0x38
   CUtlVector< CAnimDecoder > m_decoderArray; // 0x38 - 0x50
   int32_t m_nMaxUniqueFrameIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
   CUtlVector< CAnimFrameSegment > m_segmentArray; // 0x58 - 0x70
}; // size - 0x70


class CAnimDataChannelDesc /* "animationsystem" */
{
public:
   CBufferString m_szChannelClass; // 0x0 - 0x10
   CBufferString m_szVariableName; // 0x10 - 0x20
   int32_t m_nFlags; // 0x20 - 0x24
   int32_t m_nType; // 0x24 - 0x28
   CBufferString m_szGrouping; // 0x28 - 0x38
   CBufferString m_szDescription; // 0x38 - 0x48
   CUtlVector< CBufferString > m_szElementNameArray; // 0x48 - 0x60
   CUtlVector< int32 > m_nElementIndexArray; // 0x60 - 0x78
   CUtlVector< uint32 > m_nElementMaskArray; // 0x78 - 0x90
}; // size - 0x90


class CAnimDecoder /* "animationsystem" */
{
public:
   CBufferString m_szName; // 0x0 - 0x10
   int32_t m_nVersion; // 0x10 - 0x14
   int32_t m_nType; // 0x14 - 0x18
}; // size - 0x18


class CAnimDesc /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   CAnimDesc_Flag m_flags; // 0x10 - 0x18
   float fps; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
   CAnimEncodedFrames m_Data; // 0x20 - 0xF8
   CUtlVector< CAnimMovement > m_movementArray; // 0xF8 - 0x110
   CUtlVector< CAnimAnimEvent > m_eventArray; // 0x110 - 0x128
   CUtlVector< CAnimActivity > m_activityArray; // 0x128 - 0x140
   CUtlVector< CAnimLocalHierarchy > m_hierarchyArray; // 0x140 - 0x158
   float framestalltime; // 0x158 - 0x15C
   Vector m_vecRootMin; // 0x15C - 0x168
   Vector m_vecRootMax; // 0x168 - 0x174
   unsigned char pad_174[0x4]; // 0x174 - 0x178
   CUtlVector< Vector > m_vecBoneWorldMin; // 0x178 - 0x190
   CUtlVector< Vector > m_vecBoneWorldMax; // 0x190 - 0x1A8
   CAnimSequenceParams m_sequenceParams; // 0x1A8 - 0x1B0
}; // size - 0x1B0


class CAnimDesc_Flag /* "animationsystem" */
{
public:
   bool m_bLooping; // 0x0 - 0x1
   bool m_bAllZeros; // 0x1 - 0x2
   bool m_bHidden; // 0x2 - 0x3
   bool m_bDelta; // 0x3 - 0x4
   bool m_bLegacyWorldspace; // 0x4 - 0x5
   bool m_bModelDoc; // 0x5 - 0x6
   bool m_bImplicitSeqIgnoreDelta; // 0x6 - 0x7
   bool m_bAnimGraphAdditive; // 0x7 - 0x8
}; // size - 0x8


class CAnimEncodeDifference /* "animationsystem" */
{
public:
   CUtlVector< CAnimBoneDifference > m_boneArray; // 0x0 - 0x18
   CUtlVector< CAnimMorphDifference > m_morphArray; // 0x18 - 0x30
   CUtlVector< CAnimUserDifference > m_userArray; // 0x30 - 0x48
   CUtlVector< uint8 > m_bHasRotationBitArray; // 0x48 - 0x60
   CUtlVector< uint8 > m_bHasMovementBitArray; // 0x60 - 0x78
   CUtlVector< uint8 > m_bHasMorphBitArray; // 0x78 - 0x90
   CUtlVector< uint8 > m_bHasUserBitArray; // 0x90 - 0xA8
}; // size - 0xA8


class CAnimEncodedFrames /* "animationsystem" */
{
public:
   CBufferString m_fileName; // 0x0 - 0x10
   int32_t m_nFrames; // 0x10 - 0x14
   int32_t m_nFramesPerBlock; // 0x14 - 0x18
   CUtlVector< CAnimFrameBlockAnim > m_frameblockArray; // 0x18 - 0x30
   CAnimEncodeDifference m_usageDifferences; // 0x30 - 0xD8
}; // size - 0xD8


class CAnimEnum /* "animationsystem" */
{
public:
   uint8_t m_value; // 0x0 - 0x1
}; // size - 0x1


class CAnimFoot /* "modellib" */
{
public:
   CUtlString m_name; // 0x0 - 0x8
   Vector m_vBallOffset; // 0x8 - 0x14
   Vector m_vHeelOffset; // 0x14 - 0x20
   int32_t m_ankleBoneIndex; // 0x20 - 0x24
   int32_t m_toeBoneIndex; // 0x24 - 0x28
}; // size - 0x28


class CAnimFrameBlockAnim /* "animationsystem" */
{
public:
   int32_t m_nStartFrame; // 0x0 - 0x4
   int32_t m_nEndFrame; // 0x4 - 0x8
   CUtlVector< int32 > m_segmentIndexArray; // 0x8 - 0x20
}; // size - 0x20


class CAnimFrameSegment /* "animationsystem" */
{
public:
   int32_t m_nUniqueFrameIndex; // 0x0 - 0x4
   uint32_t m_nLocalElementMasks; // 0x4 - 0x8
   int32_t m_nLocalChannel; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
   CUtlBinaryBlock m_container; // 0x10 - 0x28
}; // size - 0x28


class CAnimGraphDebugReplay /* "animationsystem" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
   CUtlString m_animGraphFileName; // 0x40 - 0x48
   CUtlVector< CSmartPtr< CAnimReplayFrame > > m_frameList; // 0x48 - 0x60
   int32_t m_startIndex; // 0x60 - 0x64
   int32_t m_writeIndex; // 0x64 - 0x68
   int32_t m_frameCount; // 0x68 - 0x6C
   unsigned char pad_6C[0x4]; // 0x6C - 0x70
}; // size - 0x70


class CAnimGraphModelBinding /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlString m_modelName; // 0x8 - 0x10
   CSmartPtr< CAnimUpdateSharedData > m_pSharedData; // 0x10 - 0x18
   unsigned char pad_18[0x10]; // 0x18 - 0x28
}; // size - 0x28


class CAnimGraphNetworkSettings /* "animationsystem" */ : public CAnimGraphSettingsGroup /* "animationsystem" */
{
public:
   bool m_bNetworkingEnabled; // 0x20 - 0x21
   unsigned char pad_21[0x7]; // 0x21 - 0x28
}; // size - 0x28


class CAnimGraphNetworkedVariables /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkUtlVectorBase< uint32 > m_PredNetBoolVariables; // 0x8 - 0x20
   CNetworkUtlVectorBase< uint8 > m_PredNetByteVariables; // 0x20 - 0x38
   CNetworkUtlVectorBase< uint16 > m_PredNetUInt16Variables; // 0x38 - 0x50
   CNetworkUtlVectorBase< int32 > m_PredNetIntVariables; // 0x50 - 0x68
   CNetworkUtlVectorBase< uint32 > m_PredNetUInt32Variables; // 0x68 - 0x80
   CNetworkUtlVectorBase< float32 > m_PredNetFloatVariables; // 0x80 - 0x98
   CNetworkUtlVectorBase< Vector > m_PredNetVectorVariables; // 0x98 - 0xB0
   CNetworkUtlVectorBase< Quaternion > m_PredNetQuaternionVariables; // 0xB0 - 0xC8
   CNetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetBoolVariables; // 0xC8 - 0xE0
   CNetworkUtlVectorBase< uint8 > m_OwnerOnlyPredNetByteVariables; // 0xE0 - 0xF8
   CNetworkUtlVectorBase< uint16 > m_OwnerOnlyPredNetUInt16Variables; // 0xF8 - 0x110
   CNetworkUtlVectorBase< int32 > m_OwnerOnlyPredNetIntVariables; // 0x110 - 0x128
   CNetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetUInt32Variables; // 0x128 - 0x140
   CNetworkUtlVectorBase< float32 > m_OwnerOnlyPredNetFloatVariables; // 0x140 - 0x158
   CNetworkUtlVectorBase< Vector > m_OwnerOnlyPredNetVectorVariables; // 0x158 - 0x170
   CNetworkUtlVectorBase< Quaternion > m_OwnerOnlyPredNetQuaternionVariables; // 0x170 - 0x188
   int32_t m_nBoolVariablesCount; // 0x188 - 0x18C
   int32_t m_nOwnerOnlyBoolVariablesCount; // 0x18C - 0x190
   int32_t m_nRandomSeedOffset; // 0x190 - 0x194
   float m_flLastTeleportTime; // 0x194 - 0x198
   unsigned char pad_198[0x10]; // 0x198 - 0x1A8
}; // size - 0x1A8


class CAnimGraphNetworkedVariables /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   C_NetworkUtlVectorBase< uint32 > m_PredNetBoolVariables; // 0x8 - 0x20
   C_NetworkUtlVectorBase< uint8 > m_PredNetByteVariables; // 0x20 - 0x38
   C_NetworkUtlVectorBase< uint16 > m_PredNetUInt16Variables; // 0x38 - 0x50
   C_NetworkUtlVectorBase< int32 > m_PredNetIntVariables; // 0x50 - 0x68
   C_NetworkUtlVectorBase< uint32 > m_PredNetUInt32Variables; // 0x68 - 0x80
   C_NetworkUtlVectorBase< float32 > m_PredNetFloatVariables; // 0x80 - 0x98
   C_NetworkUtlVectorBase< Vector > m_PredNetVectorVariables; // 0x98 - 0xB0
   C_NetworkUtlVectorBase< Quaternion > m_PredNetQuaternionVariables; // 0xB0 - 0xC8
   C_NetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetBoolVariables; // 0xC8 - 0xE0
   C_NetworkUtlVectorBase< uint8 > m_OwnerOnlyPredNetByteVariables; // 0xE0 - 0xF8
   C_NetworkUtlVectorBase< uint16 > m_OwnerOnlyPredNetUInt16Variables; // 0xF8 - 0x110
   C_NetworkUtlVectorBase< int32 > m_OwnerOnlyPredNetIntVariables; // 0x110 - 0x128
   C_NetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetUInt32Variables; // 0x128 - 0x140
   C_NetworkUtlVectorBase< float32 > m_OwnerOnlyPredNetFloatVariables; // 0x140 - 0x158
   C_NetworkUtlVectorBase< Vector > m_OwnerOnlyPredNetVectorVariables; // 0x158 - 0x170
   C_NetworkUtlVectorBase< Quaternion > m_OwnerOnlyPredNetQuaternionVariables; // 0x170 - 0x188
   int32_t m_nBoolVariablesCount; // 0x188 - 0x18C
   int32_t m_nOwnerOnlyBoolVariablesCount; // 0x18C - 0x190
   int32_t m_nRandomSeedOffset; // 0x190 - 0x194
   unsigned char pad_194[0xF8C]; // 0x194 - 0x1120
   float m_flLastTeleportTime; // 0x1120 - 0x1124
   unsigned char pad_1124[0x14]; // 0x1124 - 0x1138
}; // size - 0x1138


class CAnimGraphSettingsManager /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< CSmartPtr< CAnimGraphSettingsGroup > > m_settingsGroups; // 0x18 - 0x30
}; // size - 0x30


class CAnimInputDamping /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   DampingSpeedFunction m_speedFunction; // 0x8 - 0xC
   float m_fSpeedScale; // 0xC - 0x10
}; // size - 0x10


class CAnimKeyData /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   CUtlVector< CAnimBone > m_boneArray; // 0x10 - 0x28
   CUtlVector< CAnimUser > m_userArray; // 0x28 - 0x40
   CUtlVector< CBufferString > m_morphArray; // 0x40 - 0x58
   int32_t m_nChannelElements; // 0x58 - 0x5C
   unsigned char pad_5C[0x4]; // 0x5C - 0x60
   CUtlVector< CAnimDataChannelDesc > m_dataChannelArray; // 0x60 - 0x78
}; // size - 0x78


class CAnimLocalHierarchy /* "animationsystem" */
{
public:
   CBufferString m_sBone; // 0x0 - 0x10
   CBufferString m_sNewParent; // 0x10 - 0x20
   int32_t m_nStartFrame; // 0x20 - 0x24
   int32_t m_nPeakFrame; // 0x24 - 0x28
   int32_t m_nTailFrame; // 0x28 - 0x2C
   int32_t m_nEndFrame; // 0x2C - 0x30
}; // size - 0x30


class CAnimMorphDifference /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
}; // size - 0x10


class CAnimMovement /* "animationsystem" */
{
public:
   int32_t endframe; // 0x0 - 0x4
   int32_t motionflags; // 0x4 - 0x8
   float v0; // 0x8 - 0xC
   float v1; // 0xC - 0x10
   float angle; // 0x10 - 0x14
   Vector vector; // 0x14 - 0x20
   Vector position; // 0x20 - 0x2C
}; // size - 0x2C


class CAnimNodeConnection /* "animationsystem" */
{
public:
   AnimNodeID m_nodeID; // 0x0 - 0x4
   AnimNodeOutputID m_outputID; // 0x4 - 0x8
}; // size - 0x8


class CAnimNodeList /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CAnimNodeBase* > m_nodes; // 0x10 - 0x28
}; // size - 0x28


class CAnimNodePath /* "animationsystem" */
{
public:
   AnimNodeID m_path[11]; // 0x0 - 0x2C
   int32_t m_nCount; // 0x2C - 0x30
}; // size - 0x30


class CAnimNodeState /* "animationsystem" */ : public CAnimState /* "animationsystem" */
{
public:
   CAnimNodeConnection m_inputConnection; // 0x70 - 0x78
   bool m_bIsRootMotionExclusive; // 0x78 - 0x79
   unsigned char pad_79[0x7]; // 0x79 - 0x80
}; // size - 0x80


class CAnimNodeStateTransition /* "animationsystem" */ : public CAnimStateTransition /* "animationsystem" */
{
public:
   unsigned char pad_70[0x8]; // 0x70 - 0x78
   CFloatAnimValue m_blendDuration; // 0x78 - 0x90
   bool m_bReset; // 0x90 - 0x91
   unsigned char pad_91[0x3]; // 0x91 - 0x94
   ResetCycleOption m_resetCycleOption; // 0x94 - 0x98
   CFloatAnimValue m_flFixedCycleValue; // 0x98 - 0xB0
   CBlendCurve m_blendCurve; // 0xB0 - 0xB8
}; // size - 0xB8


class CAnimParamHandle /* "animationsystem" */
{
public:
   AnimParamType_t m_type; // 0x0 - 0x1
   uint8_t m_index; // 0x1 - 0x2
}; // size - 0x2


class CAnimParamHandleMap /* "animationsystem" */
{
public:
   CUtlHashtable< uint16, int16 > m_list; // 0x0 - 0x20
}; // size - 0x20


class CAnimParamSpan /* "animationsystem" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
   CUtlVector< CAnimParamSpanSample > m_samples; // 0x20 - 0x38
   AnimParamID m_id; // 0x38 - 0x3C
   float m_flStartCycle; // 0x3C - 0x40
   float m_flEndCycle; // 0x40 - 0x44
   unsigned char pad_44[0x4]; // 0x44 - 0x48
}; // size - 0x48


class CAnimParamSpanSample /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CAnimVariant m_value; // 0x8 - 0x19
   unsigned char pad_19[0x3]; // 0x19 - 0x1C
   float m_flCycle; // 0x1C - 0x20
}; // size - 0x20


class CAnimParameterList /* "animationsystem" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
   CUtlVector< CSmartPtr< CAnimParameterBase > > m_Parameters; // 0x20 - 0x38
   unsigned char pad_38[0x20]; // 0x38 - 0x58
}; // size - 0x58


class CAnimParameterListUpdater /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< CSmartPtr< CAnimParameterBase > > m_parameters; // 0x18 - 0x30
   CUtlHashtable< AnimParamID, int32 > m_idToIndexMap; // 0x30 - 0x50
   CUtlHashtable< CUtlString, int32 > m_nameToIndexMap; // 0x50 - 0x70
   CUtlVector< CAnimParamHandle > m_indexToHandle; // 0x70 - 0x88
   CUtlVector< CUtlPair< CAnimParamHandle, CAnimVariant > > m_autoResetParams; // 0x88 - 0xA0
   CUtlHashtable< CAnimParamHandle, int16 > m_autoResetMap; // 0xA0 - 0xC0
   unsigned char pad_C0[0x40]; // 0xC0 - 0x100
}; // size - 0x100


class CAnimReplayFrame /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CUtlBinaryBlock > m_inputDataBlocks; // 0x10 - 0x28
   CUtlBinaryBlock m_instanceData; // 0x28 - 0x40
   CTransform m_startingLocalToWorldTransform; // 0x40 - 0x60
   CTransform m_localToWorldTransform; // 0x60 - 0x80
   float m_timeStamp; // 0x80 - 0x84
   unsigned char pad_84[0xC]; // 0x84 - 0x90
}; // size - 0x90


class CAnimScriptComponent /* "animationsystem" */ : public CAnimComponentBase /* "animationsystem" */
{
public:
   unsigned char pad_38[0x8]; // 0x38 - 0x40
   CUtlString m_sName; // 0x40 - 0x48
   CUtlString m_scriptFilename; // 0x48 - 0x50
   unsigned char pad_50[0x8]; // 0x50 - 0x58
}; // size - 0x58


class CAnimScriptComponentUpdater /* "animationsystem" */ : public CAnimComponentUpdater /* "animationsystem" */
{
public:
   AnimScriptHandle m_hScript; // 0x30 - 0x34
   unsigned char pad_34[0x4]; // 0x34 - 0x38
}; // size - 0x38


class CAnimScriptManager /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< ScriptInfo_t > m_scriptInfo; // 0x10 - 0x28
   unsigned char pad_28[0xE8]; // 0x28 - 0x110
}; // size - 0x110


class CAnimSequenceParams /* "animationsystem" */
{
public:
   float m_flFadeInTime; // 0x0 - 0x4
   float m_flFadeOutTime; // 0x4 - 0x8
}; // size - 0x8


class CAnimSkeleton /* "modellib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CTransform > m_localSpaceTransforms; // 0x10 - 0x28
   CUtlVector< CTransform > m_modelSpaceTransforms; // 0x28 - 0x40
   CUtlVector< CUtlString > m_boneNames; // 0x40 - 0x58
   CUtlVector< CUtlVector< int32 > > m_children; // 0x58 - 0x70
   CUtlVector< int32 > m_parents; // 0x70 - 0x88
   CUtlVector< CAnimFoot > m_feet; // 0x88 - 0xA0
   CUtlVector< CUtlString > m_morphNames; // 0xA0 - 0xB8
   CUtlVector< int32 > m_lodBoneCounts; // 0xB8 - 0xD0
}; // size - 0xD0


class CAnimStateList /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CAnimState* > m_states; // 0x10 - 0x28
}; // size - 0x28


class CAnimStateMachine /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVector< CSmartPtr< CAnimState > > m_states; // 0x8 - 0x20
   unsigned char pad_20[0x8]; // 0x20 - 0x28
}; // size - 0x28


class CAnimStateMachineUpdater /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVector< CStateUpdateData > m_states; // 0x8 - 0x20
   CUtlVector< CTransitionUpdateData > m_transitions; // 0x20 - 0x38
   unsigned char pad_38[0x18]; // 0x38 - 0x50
   int32_t m_startStateIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
}; // size - 0x58


class CAnimTagManager /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< CSmartPtr< CAnimTagBase > > m_tags; // 0x18 - 0x30
   unsigned char pad_30[0x28]; // 0x30 - 0x58
}; // size - 0x58


class CAnimTagManagerUpdater /* "animationsystem" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< CSmartPtr< CAnimTagBase > > m_tags; // 0x18 - 0x30
   unsigned char pad_30[0x8]; // 0x30 - 0x38
}; // size - 0x38


class CAnimTagSpan /* "animationsystem" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
   AnimTagID m_id; // 0x20 - 0x24
   float m_fStartCycle; // 0x24 - 0x28
   float m_fDuration; // 0x28 - 0x2C
   unsigned char pad_2C[0x4]; // 0x2C - 0x30
}; // size - 0x30


class CAnimUpdateNodeRef /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   int32_t m_nodeIndex; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
}; // size - 0x10


class CAnimUpdateSharedData /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CSmartPtr< CAnimUpdateNodeBase > > m_nodes; // 0x10 - 0x28
   CUtlHashtable< CAnimNodePath, int32 > m_nodeIndexMap; // 0x28 - 0x48
   CUtlVector< CSmartPtr< CAnimComponentUpdater > > m_components; // 0x48 - 0x60
   CSmartPtr< CAnimParameterListUpdater > m_pParamListUpdater; // 0x60 - 0x68
   CSmartPtr< CAnimTagManagerUpdater > m_pTagManagerUpdater; // 0x68 - 0x70
   CSmartPtr< CAnimScriptManager > m_scriptManager; // 0x70 - 0x78
   CAnimGraphSettingsManager m_settings; // 0x78 - 0xA8
   CSmartPtr< CStaticPoseCacheBuilder > m_pStaticPoseCache; // 0xA8 - 0xB0
   CSmartPtr< CAnimSkeleton > m_pSkeleton; // 0xB0 - 0xB8
   CAnimNodePath m_rootNodePath; // 0xB8 - 0xE8
   unsigned char pad_E8[0x18]; // 0xE8 - 0x100
}; // size - 0x100


class CAnimUser /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   int32_t m_nType; // 0x10 - 0x14
   unsigned char pad_14[0x4]; // 0x14 - 0x18
}; // size - 0x18


class CAnimUserDifference /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   int32_t m_nType; // 0x10 - 0x14
   unsigned char pad_14[0x4]; // 0x14 - 0x18
}; // size - 0x18


class CAnimationGraph /* "animationsystem" */ : public CAnimationSubGraph /* "animationsystem" */
{
public:
   unsigned char pad_E0[0x8]; // 0xE0 - 0xE8
   CSmartPtr< CAnimGraphSettingsManager > m_pSettingsManager; // 0xE8 - 0xF0
   unsigned char pad_F0[0x8]; // 0xF0 - 0xF8
   CAnimClipDataManager m_clipDataManager; // 0xF8 - 0x130
   unsigned char pad_130[0x10]; // 0x130 - 0x140
   CUtlString m_modelName; // 0x140 - 0x148
   CUtlString m_previewModelName; // 0x148 - 0x150
}; // size - 0x150


class CAnimationGraphVisualizerAxis /* "animationsystem" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animationsystem" */
{
public:
   CTransform m_xWsTransform; // 0x40 - 0x60
   float m_flAxisSize; // 0x60 - 0x64
   unsigned char pad_64[0xC]; // 0x64 - 0x70
}; // size - 0x70


class CAnimationGraphVisualizerLine /* "animationsystem" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animationsystem" */
{
public:
   VectorAligned m_vWsPositionStart; // 0x40 - 0x50
   VectorAligned m_vWsPositionEnd; // 0x50 - 0x60
   Color m_Color; // 0x60 - 0x64
   unsigned char pad_64[0xC]; // 0x64 - 0x70
}; // size - 0x70


class CAnimationGraphVisualizerPie /* "animationsystem" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animationsystem" */
{
public:
   VectorAligned m_vWsCenter; // 0x40 - 0x50
   VectorAligned m_vWsStart; // 0x50 - 0x60
   VectorAligned m_vWsEnd; // 0x60 - 0x70
   Color m_Color; // 0x70 - 0x74
   unsigned char pad_74[0xC]; // 0x74 - 0x80
}; // size - 0x80


class CAnimationGraphVisualizerSphere /* "animationsystem" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animationsystem" */
{
public:
   VectorAligned m_vWsPosition; // 0x40 - 0x50
   float m_flRadius; // 0x50 - 0x54
   Color m_Color; // 0x54 - 0x58
   unsigned char pad_58[0x8]; // 0x58 - 0x60
}; // size - 0x60


class CAnimationGraphVisualizerText /* "animationsystem" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animationsystem" */
{
public:
   VectorAligned m_vWsPosition; // 0x40 - 0x50
   Color m_Color; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
   CUtlString m_Text; // 0x58 - 0x60
}; // size - 0x60


class CAnimationGroup /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   uint32_t m_nFlags; // 0x10 - 0x14
   unsigned char pad_14[0x4]; // 0x14 - 0x18
   CBufferString m_name; // 0x18 - 0x28
   unsigned char pad_28[0x38]; // 0x28 - 0x60
   CUtlVector< CStrongHandle< InfoForResourceTypeCAnimData > > m_localHAnimArray_Handle; // 0x60 - 0x78
   CUtlVector< CStrongHandle< InfoForResourceTypeCAnimationGroup > > m_includedGroupArray_Handle; // 0x78 - 0x90
   CStrongHandle< InfoForResourceTypeCSequenceGroupData > m_directHSeqGroup_Handle; // 0x90 - 0x98
   CAnimKeyData m_decodeKey; // 0x98 - 0x110
   CUtlVector< CBufferString > m_szScripts; // 0x110 - 0x128
   unsigned char pad_128[0x8]; // 0x128 - 0x130
}; // size - 0x130


class CAttachment /* "modellib" */
{
public:
   CUtlString m_name; // 0x0 - 0x8
   CUtlString m_influenceNames[3]; // 0x8 - 0x20
   Quaternion m_vInfluenceRotations[3]; // 0x20 - 0x50
   Vector m_vInfluenceOffsets[3]; // 0x50 - 0x74
   float32 m_influenceWeights[3]; // 0x74 - 0x80
   bool m_bInfluenceRootTransform[3]; // 0x80 - 0x83
   uint8_t m_nInfluences; // 0x83 - 0x84
   bool m_bIgnoreRotation; // 0x84 - 0x85
   unsigned char pad_85[0xB]; // 0x85 - 0x90
}; // size - 0x90


class CAttributeContainer /* "server" */ : public CAttributeManager /* "server" */
{
public:
   CEconItemView m_Item; // 0x50 - 0x2C8
}; // size - 0x2C8


class CAttributeList /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVectorEmbeddedNetworkVar< CEconItemAttribute > m_Attributes; // 0x8 - 0x58
   CAttributeManager* m_pManager; // 0x58 - 0x60
}; // size - 0x60


class CAttributeList /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   C_UtlVectorEmbeddedNetworkVar< CEconItemAttribute > m_Attributes; // 0x8 - 0x58
   CAttributeManager* m_pManager; // 0x58 - 0x60
}; // size - 0x60




class CAudioAnimTag /* "animationsystem" */ : public CAnimTagBase /* "animationsystem" */
{
public:
   unsigned char pad_38[0x8]; // 0x38 - 0x40
   CUtlString m_clipName; // 0x40 - 0x48
   CUtlString m_attachmentName; // 0x48 - 0x50
   float m_flVolume; // 0x50 - 0x54
   bool m_bStopWhenTagEnds; // 0x54 - 0x55
   bool m_bStopWhenGraphEnds; // 0x55 - 0x56
   bool m_bPlayOnServer; // 0x56 - 0x57
   bool m_bPlayOnClient; // 0x57 - 0x58
}; // size - 0x58


class CBRC4Target /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   unsigned char pad_820[0x28]; // 0x820 - 0x848
   CHandle< CBaseEntity > m_hPlayerThatActivatedMe; // 0x848 - 0x84C
   bool m_bBrokenOpen; // 0x84C - 0x84D
   unsigned char pad_84D[0x3]; // 0x84D - 0x850
   float m_flRadius; // 0x850 - 0x854
   unsigned char pad_854[0x4]; // 0x854 - 0x858
}; // size - 0x858


class CBaseAnimGraphController /* "server" */ : public CSkeletonAnimationController /* "server" */
{
public:
   unsigned char pad_10[0x8]; // 0x10 - 0x18
   CNetworkedSequenceOperation m_baseLayer; // 0x18 - 0x40
   CAnimGraphNetworkedVariables m_animGraphNetworkedVars; // 0x40 - 0x1E8
   unsigned char pad_1E8[0x8]; // 0x1E8 - 0x1F0
   bool m_bSequenceFinished; // 0x1F0 - 0x1F1
   unsigned char pad_1F1[0x3]; // 0x1F1 - 0x1F4
   float m_flLastEventCycle; // 0x1F4 - 0x1F8
   float m_flLastEventAnimTime; // 0x1F8 - 0x1FC
   CNetworkedQuantizedFloat m_flPlaybackRate; // 0x1FC - 0x204
   float m_flPrevAnimTime; // 0x204 - 0x208
   bool m_bClientSideAnimation; // 0x208 - 0x209
   bool m_bNetworkedAnimationInputsChanged; // 0x209 - 0x20A
   unsigned char pad_20A[0x2]; // 0x20A - 0x20C
   int32_t m_nNewSequenceParity; // 0x20C - 0x210
   int32_t m_nResetEventsParity; // 0x210 - 0x214
   AnimLoopMode_t m_nAnimLoopMode; // 0x214 - 0x218
   unsigned char pad_218[0x94]; // 0x218 - 0x2AC
   AnimationUpdateListHandle_t m_hAnimationUpdate; // 0x2AC - 0x2B0
}; // size - 0x2B0


class CBaseAnimGraphController /* "client" */ : public CSkeletonAnimationController /* "client" */
{
public:
   unsigned char pad_10[0x8]; // 0x10 - 0x18
   CNetworkedSequenceOperation m_baseLayer; // 0x18 - 0x40
   CAnimGraphNetworkedVariables m_animGraphNetworkedVars; // 0x40 - 0x1178
   unsigned char pad_1178[0x8]; // 0x1178 - 0x1180
   bool m_bSequenceFinished; // 0x1180 - 0x1181
   unsigned char pad_1181[0x3]; // 0x1181 - 0x1184
   float m_flLastEventCycle; // 0x1184 - 0x1188
   float m_flLastEventAnimTime; // 0x1188 - 0x118C
   CNetworkedQuantizedFloat m_flPlaybackRate; // 0x118C - 0x1194
   float m_flPrevAnimTime; // 0x1194 - 0x1198
   bool m_bClientSideAnimation; // 0x1198 - 0x1199
   bool m_bNetworkedAnimationInputsChanged; // 0x1199 - 0x119A
   uint8_t m_nPrevNewSequenceParity; // 0x119A - 0x119B
   uint8_t m_nPrevResetEventsParity; // 0x119B - 0x119C
   int32_t m_nNewSequenceParity; // 0x119C - 0x11A0
   int32_t m_nResetEventsParity; // 0x11A0 - 0x11A4
   AnimLoopMode_t m_nAnimLoopMode; // 0x11A4 - 0x11A8
   unsigned char pad_11A8[0x94]; // 0x11A8 - 0x123C
   AnimationUpdateListHandle_t m_hAnimationUpdate; // 0x123C - 0x1240
   HSequence m_hLastAnimEventSequence; // 0x1240 - 0x1244
   unsigned char pad_1244[0x54]; // 0x1244 - 0x1298
}; // size - 0x1298


class CBaseDMStart /* "server" */ : public CPointEntity /* "server" */
{
public:
   CUtlSymbolLarge m_Master; // 0x4A0 - 0x4A8
}; // size - 0x4A8


class CBaseFlexAlias_funCBaseFlex /* "server" */ : public CBaseFlex /* "server" */
{
public:
   unsigned char pad_0[0x8B0]; // 0x0 - 0x8B0
}; // size - 0x8B0


class CBaseIssue /* "server" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
   char m_szTypeString[64]; // 0x20 - 0x60
   char m_szDetailsString[260]; // 0x60 - 0x164
   int32_t m_iNumYesVotes; // 0x164 - 0x168
   int32_t m_iNumNoVotes; // 0x168 - 0x16C
   int32_t m_iNumPotentialVotes; // 0x16C - 0x170
   CVoteController* m_pVoteController; // 0x170 - 0x178
}; // size - 0x178


class CBaseMoveBehavior /* "server" */ : public CPathKeyFrame /* "server" */
{
public:
   int32_t m_iPositionInterpolator; // 0x500 - 0x504
   int32_t m_iRotationInterpolator; // 0x504 - 0x508
   float m_flAnimStartTime; // 0x508 - 0x50C
   float m_flAnimEndTime; // 0x50C - 0x510
   float m_flAverageSpeedAcrossFrame; // 0x510 - 0x514
   unsigned char pad_514[0x4]; // 0x514 - 0x518
   CPathKeyFrame* m_pCurrentKeyFrame; // 0x518 - 0x520
   CPathKeyFrame* m_pTargetKeyFrame; // 0x520 - 0x528
   CPathKeyFrame* m_pPreKeyFrame; // 0x528 - 0x530
   CPathKeyFrame* m_pPostKeyFrame; // 0x530 - 0x538
   float m_flTimeIntoFrame; // 0x538 - 0x53C
   int32_t m_iDirection; // 0x53C - 0x540
}; // size - 0x540


class CBasePlayerVData /* "client" */ : public CEntitySubclassVDataBase /* "client" */
{
public:
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_sModelName; // 0x28 - 0x108
   CSkillFloat m_flHeadDamageMultiplier; // 0x108 - 0x118
   CSkillFloat m_flChestDamageMultiplier; // 0x118 - 0x128
   CSkillFloat m_flStomachDamageMultiplier; // 0x128 - 0x138
   CSkillFloat m_flArmDamageMultiplier; // 0x138 - 0x148
   CSkillFloat m_flLegDamageMultiplier; // 0x148 - 0x158
   float m_flHoldBreathTime; // 0x158 - 0x15C
   float m_flDrowningDamageInterval; // 0x15C - 0x160
   int32_t m_nDrowningDamageInitial; // 0x160 - 0x164
   int32_t m_nDrowningDamageMax; // 0x164 - 0x168
   int32_t m_nWaterSpeed; // 0x168 - 0x16C
   float m_flUseRange; // 0x16C - 0x170
   float m_flUseAngleTolerance; // 0x170 - 0x174
   float m_flCrouchTime; // 0x174 - 0x178
}; // size - 0x178


class CBasePlayerVData /* "server" */ : public CEntitySubclassVDataBase /* "server" */
{
public:
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_sModelName; // 0x28 - 0x108
   CSkillFloat m_flHeadDamageMultiplier; // 0x108 - 0x118
   CSkillFloat m_flChestDamageMultiplier; // 0x118 - 0x128
   CSkillFloat m_flStomachDamageMultiplier; // 0x128 - 0x138
   CSkillFloat m_flArmDamageMultiplier; // 0x138 - 0x148
   CSkillFloat m_flLegDamageMultiplier; // 0x148 - 0x158
   float m_flHoldBreathTime; // 0x158 - 0x15C
   float m_flDrowningDamageInterval; // 0x15C - 0x160
   int32_t m_nDrowningDamageInitial; // 0x160 - 0x164
   int32_t m_nDrowningDamageMax; // 0x164 - 0x168
   int32_t m_nWaterSpeed; // 0x168 - 0x16C
   float m_flUseRange; // 0x16C - 0x170
   float m_flUseAngleTolerance; // 0x170 - 0x174
   float m_flCrouchTime; // 0x174 - 0x178
}; // size - 0x178


class CBindPoseAnimNode /* "animationsystem" */ : public CAnimNodeBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x38]; // 0x0 - 0x38
}; // size - 0x38


class CBindPoseUpdateNode /* "animationsystem" */ : public CLeafUpdateNode /* "animationsystem" */
{
public:
   unsigned char pad_0[0x60]; // 0x0 - 0x60
}; // size - 0x60


class CBlend2DAnimNode /* "animationsystem" */ : public CAnimNodeBase /* "animationsystem" */
{
public:
   unsigned char pad_38[0x18]; // 0x38 - 0x50
   CUtlVector< CSmartPtr< CBlend2DItemBase > > m_items; // 0x50 - 0x68
   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x68 - 0x80
   CUtlVector< CSmartPtr< CAnimParamSpan > > m_paramSpans; // 0x80 - 0x98
   AnimValueSource m_blendSourceX; // 0x98 - 0x9C
   AnimParamID m_paramX; // 0x9C - 0xA0
   AnimValueSource m_blendSourceY; // 0xA0 - 0xA4
   AnimParamID m_paramY; // 0xA4 - 0xA8
   bool m_bLoop; // 0xA8 - 0xA9
   bool m_bLockBlendOnReset; // 0xA9 - 0xAA
   bool m_bLockWhenWaning; // 0xAA - 0xAB
   unsigned char pad_AB[0x1]; // 0xAB - 0xAC
   float m_playbackSpeed; // 0xAC - 0xB0
   CAnimInputDamping m_damping; // 0xB0 - 0xC0
   bool m_bAnimEventsAndTagsOnMostWeightedOnly; // 0xC0 - 0xC1
   unsigned char pad_C1[0x7]; // 0xC1 - 0xC8
}; // size - 0xC8


class CBlend2DUpdateNode /* "animationsystem" */ : public CAnimUpdateNodeBase /* "animationsystem" */
{
public:
   unsigned char pad_58[0x8]; // 0x58 - 0x60
   CUtlVector< BlendItem_t > m_items; // 0x60 - 0x78
   CUtlVector< TagSpan_t > m_tags; // 0x78 - 0x90
   CParamSpanUpdater m_paramSpans; // 0x90 - 0xA8
   CUtlVector< int32 > m_nodeItemIndices; // 0xA8 - 0xC0
   CAnimInputDamping m_damping; // 0xC0 - 0xD0
   AnimValueSource m_blendSourceX; // 0xD0 - 0xD4
   CAnimParamHandle m_paramX; // 0xD4 - 0xD6
   unsigned char pad_D6[0x2]; // 0xD6 - 0xD8
   AnimValueSource m_blendSourceY; // 0xD8 - 0xDC
   CAnimParamHandle m_paramY; // 0xDC - 0xDE
   unsigned char pad_DE[0x2]; // 0xDE - 0xE0
   Blend2DMode m_eBlendMode; // 0xE0 - 0xE4
   float m_playbackSpeed; // 0xE4 - 0xE8
   bool m_bLoop; // 0xE8 - 0xE9
   bool m_bLockBlendOnReset; // 0xE9 - 0xEA
   bool m_bLockWhenWaning; // 0xEA - 0xEB
   bool m_bAnimEventsAndTagsOnMostWeightedOnly; // 0xEB - 0xEC
   unsigned char pad_EC[0x4]; // 0xEC - 0xF0
}; // size - 0xF0


class CBlendAnimNode /* "animationsystem" */ : public CAnimNodeBase /* "animationsystem" */
{
public:
   unsigned char pad_38[0x10]; // 0x38 - 0x48
   CUtlVector< CBlendNodeChild > m_children; // 0x48 - 0x60
   AnimValueSource m_blendValueSource; // 0x60 - 0x64
   AnimParamID m_param; // 0x64 - 0x68
   BlendKeyType m_blendKeyType; // 0x68 - 0x6C
   bool m_bLockBlendOnReset; // 0x6C - 0x6D
   bool m_bSyncCycles; // 0x6D - 0x6E
   bool m_bLoop; // 0x6E - 0x6F
   bool m_bLockWhenWaning; // 0x6F - 0x70
   CAnimInputDamping m_damping; // 0x70 - 0x80
}; // size - 0x80


class CBlendCurve /* "animationsystem" */
{
public:
   float m_flControlPoint1; // 0x0 - 0x4
   float m_flControlPoint2; // 0x4 - 0x8
}; // size - 0x8


class CBlendNodeChild /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CAnimNodeConnection m_inputConnection; // 0x8 - 0x10
   CUtlString m_name; // 0x10 - 0x18
   float m_blendValue; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
}; // size - 0x20


class CBlendUpdateNode /* "animationsystem" */ : public CAnimUpdateNodeBase /* "animationsystem" */
{
public:
   unsigned char pad_58[0x8]; // 0x58 - 0x60
   CUtlVector< CAnimUpdateNodeRef > m_children; // 0x60 - 0x78
   CUtlVector< uint8 > m_sortedOrder; // 0x78 - 0x90
   CUtlVector< float32 > m_targetValues; // 0x90 - 0xA8
   unsigned char pad_A8[0x4]; // 0xA8 - 0xAC
   AnimValueSource m_blendValueSource; // 0xAC - 0xB0
   CAnimParamHandle m_paramIndex; // 0xB0 - 0xB2
   unsigned char pad_B2[0x6]; // 0xB2 - 0xB8
   CAnimInputDamping m_damping; // 0xB8 - 0xC8
   BlendKeyType m_blendKeyType; // 0xC8 - 0xCC
   bool m_bLockBlendOnReset; // 0xCC - 0xCD
   bool m_bSyncCycles; // 0xCD - 0xCE
   bool m_bLoop; // 0xCE - 0xCF
   bool m_bLockWhenWaning; // 0xCF - 0xD0
}; // size - 0xD0


class CBlockSelectionMetric /* "animationsystem" */ : public CMotionMetricBase /* "animationsystem" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
}; // size - 0x28


class CBlockSelectionMetricEvaluator /* "animationsystem" */ : public CMotionMetricEvaluator /* "animationsystem" */
{
public:
   unsigned char pad_0[0x50]; // 0x0 - 0x50
}; // size - 0x50


class CBlood /* "server" */ : public CPointEntity /* "server" */
{
public:
   QAngle m_vecSprayAngles; // 0x4A0 - 0x4AC
   Vector m_vecSprayDir; // 0x4AC - 0x4B8
   float m_flAmount; // 0x4B8 - 0x4BC
   int32_t m_Color; // 0x4BC - 0x4C0
}; // size - 0x4C0


class CBodyComponentBaseAnimGraph /* "client" */ : public CBodyComponentSkeletonInstance /* "client" */
{
public:
   CBaseAnimGraphController m_animationController; // 0x470 - 0x1708
   CNetworkVarChainer __m_pChainEntity; // 0x1708 - 0x1730
}; // size - 0x1730


class CBodyComponentBaseAnimGraph /* "server" */ : public CBodyComponentSkeletonInstance /* "server" */
{
public:
   CBaseAnimGraphController m_animationController; // 0x470 - 0x720
   CNetworkVarChainer __m_pChainEntity; // 0x720 - 0x748
   unsigned char pad_748[0x8]; // 0x748 - 0x750
}; // size - 0x750


class CBodyComponentBaseModelEntity /* "client" */ : public CBodyComponentSkeletonInstance /* "client" */
{
public:
   CNetworkVarChainer __m_pChainEntity; // 0x470 - 0x498
   unsigned char pad_498[0x8]; // 0x498 - 0x4A0
}; // size - 0x4A0


class CBodyComponentBaseModelEntity /* "server" */ : public CBodyComponentSkeletonInstance /* "server" */
{
public:
   CNetworkVarChainer __m_pChainEntity; // 0x470 - 0x498
   unsigned char pad_498[0x8]; // 0x498 - 0x4A0
}; // size - 0x4A0


class CBodyComponentPoint /* "server" */ : public CBodyComponent /* "server" */
{
public:
   CGameSceneNode m_sceneNode; // 0x50 - 0x1A0
   CNetworkVarChainer __m_pChainEntity; // 0x1A0 - 0x1C8
   unsigned char pad_1C8[0x8]; // 0x1C8 - 0x1D0
}; // size - 0x1D0


class CBodyComponentPoint /* "client" */ : public CBodyComponent /* "client" */
{
public:
   CGameSceneNode m_sceneNode; // 0x50 - 0x1A0
   CNetworkVarChainer __m_pChainEntity; // 0x1A0 - 0x1C8
   unsigned char pad_1C8[0x8]; // 0x1C8 - 0x1D0
}; // size - 0x1D0


class CBodyGroupAnimTag /* "animationsystem" */ : public CAnimTagBase /* "animationsystem" */
{
public:
   unsigned char pad_38[0x8]; // 0x38 - 0x40
   int32_t m_nPriority; // 0x40 - 0x44
   unsigned char pad_44[0x4]; // 0x44 - 0x48
   CUtlVector< CBodyGroupSetting > m_bodyGroupSettings; // 0x48 - 0x60
}; // size - 0x60


class CBodyGroupSetting /* "animationsystem" */
{
public:
   CUtlString m_BodyGroupName; // 0x0 - 0x8
   int32_t m_nBodyGroupOption; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
}; // size - 0x10


class CBombTarget /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   CEntityIOOutput m_OnBombExplode; // 0x898 - 0x8C0
   CEntityIOOutput m_OnBombPlanted; // 0x8C0 - 0x8E8
   CEntityIOOutput m_OnBombDefused; // 0x8E8 - 0x910
   bool m_bIsBombSiteB; // 0x910 - 0x911
   bool m_bIsHeistBombTarget; // 0x911 - 0x912
   bool m_bBombPlantedHere; // 0x912 - 0x913
   unsigned char pad_913[0x5]; // 0x913 - 0x918
   CUtlSymbolLarge m_szMountTarget; // 0x918 - 0x920
   CHandle< CBaseEntity > m_hInstructorHint; // 0x920 - 0x924
   unsigned char pad_924[0x4]; // 0x924 - 0x928
}; // size - 0x928


class CBoneConstraintPoseSpaceBone /* "modellib" */ : public CBaseConstraint /* "modellib" */
{
public:
   class Input_t /* "modellib" */
   {
   public:
      Vector m_inputValue; // 0x0 - 0xC
      unsigned char pad_C[0x4]; // 0xC - 0x10
      CUtlVector< CTransform > m_outputTransformList; // 0x10 - 0x28
   }; // size - 0x28

   CUtlVector< CBoneConstraintPoseSpaceBone::Input_t > m_inputList; // 0x70 - 0x88
   unsigned char pad_88[0x10]; // 0x88 - 0x98
}; // size - 0x98



class CBoneConstraintPoseSpaceMorph /* "modellib" */ : public CBoneConstraintBase /* "modellib" */
{
public:
   class Input_t /* "modellib" */
   {
   public:
      Vector m_inputValue; // 0x0 - 0xC
      unsigned char pad_C[0x4]; // 0xC - 0x10
      CUtlVector< float32 > m_outputWeightList; // 0x10 - 0x28
   }; // size - 0x28

   CUtlString m_sBoneName; // 0x28 - 0x30
   CUtlString m_sAttachmentName; // 0x30 - 0x38
   CUtlVector< CUtlString > m_outputMorph; // 0x38 - 0x50
   CUtlVector< CBoneConstraintPoseSpaceMorph::Input_t > m_inputList; // 0x50 - 0x68
   bool m_bClamp; // 0x68 - 0x69
   unsigned char pad_69[0x3F]; // 0x69 - 0xA8
}; // size - 0xA8



class CBoneMaskAnimNode /* "animationsystem" */ : public CAnimNodeBase /* "animationsystem" */
{
public:
   CUtlString m_weightListName; // 0x38 - 0x40
   CAnimNodeConnection m_inputConnection1; // 0x40 - 0x48
   CAnimNodeConnection m_inputConnection2; // 0x48 - 0x50
   BoneMaskBlendSpace m_blendSpace; // 0x50 - 0x54
   bool m_bUseBlendScale; // 0x54 - 0x55
   unsigned char pad_55[0x3]; // 0x55 - 0x58
   AnimValueSource m_blendValueSource; // 0x58 - 0x5C
   AnimParamID m_blendParameter; // 0x5C - 0x60
   BinaryNodeTiming m_timingBehavior; // 0x60 - 0x64
   float m_flTimingBlend; // 0x64 - 0x68
   float m_flRootMotionBlend; // 0x68 - 0x6C
   BinaryNodeChildOption m_footMotionTiming; // 0x6C - 0x70
   bool m_bResetChild1; // 0x70 - 0x71
   bool m_bResetChild2; // 0x71 - 0x72
   unsigned char pad_72[0x6]; // 0x72 - 0x78
}; // size - 0x78


class CBoneMaskUpdateNode /* "animationsystem" */ : public CBinaryUpdateNode /* "animationsystem" */
{
public:
   unsigned char pad_88[0x4]; // 0x88 - 0x8C
   int32_t m_nWeightListIndex; // 0x8C - 0x90
   float m_flRootMotionBlend; // 0x90 - 0x94
   BoneMaskBlendSpace m_blendSpace; // 0x94 - 0x98
   BinaryNodeChildOption m_footMotionTiming; // 0x98 - 0x9C
   bool m_bUseBlendScale; // 0x9C - 0x9D
   unsigned char pad_9D[0x3]; // 0x9D - 0xA0
   AnimValueSource m_blendValueSource; // 0xA0 - 0xA4
   CAnimParamHandle m_hBlendParameter; // 0xA4 - 0xA6
   unsigned char pad_A6[0x2]; // 0xA6 - 0xA8
}; // size - 0xA8


class CBonePositionMetric /* "animationsystem" */ : public CMotionMetricBase /* "animationsystem" */
{
public:
   CUtlString m_boneName; // 0x28 - 0x30
}; // size - 0x30


class CBonePositionMetricEvaluator /* "animationsystem" */ : public CMotionMetricEvaluator /* "animationsystem" */
{
public:
   int32_t m_nBoneIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
}; // size - 0x58


class CBoneVelocityMetric /* "animationsystem" */ : public CMotionMetricBase /* "animationsystem" */
{
public:
   CUtlString m_boneName; // 0x28 - 0x30
}; // size - 0x30


class CBoneVelocityMetricEvaluator /* "animationsystem" */ : public CMotionMetricEvaluator /* "animationsystem" */
{
public:
   int32_t m_nBoneIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
}; // size - 0x58


class CBoolAnimParameter /* "animationsystem" */ : public CAnimParameterBase /* "animationsystem" */
{
public:
   bool m_bDefaultValue; // 0x78 - 0x79
   unsigned char pad_79[0x7]; // 0x79 - 0x80
}; // size - 0x80


class CBreachCharge /* "server" */ : public CWeaponCSBase /* "server" */
{
public:
   unsigned char pad_0[0xD50]; // 0x0 - 0xD50
}; // size - 0xD50


class CBreachChargeProjectile /* "server" */ : public CBaseGrenade /* "server" */
{
public:
   bool m_bShouldExplode; // 0x958 - 0x959
   unsigned char pad_959[0x3]; // 0x959 - 0x95C
   CHandle< CBaseEntity > m_weaponThatThrewMe; // 0x95C - 0x960
   int32_t m_nParentBoneIndex; // 0x960 - 0x964
   Vector m_vecParentBonePos; // 0x964 - 0x970
   bool m_bDefused; // 0x970 - 0x971
   bool m_bUnstuckFromPlayer; // 0x971 - 0x972
   bool m_bResolvedParent; // 0x972 - 0x973
   unsigned char pad_973[0x1]; // 0x973 - 0x974
   Vector m_vecLastKnownValidPos; // 0x974 - 0x980
   CEntityHandle m_hDesiredParent; // 0x980 - 0x984
   unsigned char pad_984[0x4]; // 0x984 - 0x988
}; // size - 0x988


class CBtActionAim /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_58[0x10]; // 0x58 - 0x68
   CUtlString m_szSensorInputKey; // 0x68 - 0x70
   unsigned char pad_70[0x10]; // 0x70 - 0x80
   CUtlString m_szAimReadyKey; // 0x80 - 0x88
   float m_flZoomCooldownTimestamp; // 0x88 - 0x8C
   bool m_bDoneAiming; // 0x8C - 0x8D
   unsigned char pad_8D[0x3]; // 0x8D - 0x90
   float m_flLerpStartTime; // 0x90 - 0x94
   float m_flNextLookTargetLerpTime; // 0x94 - 0x98
   float m_flPenaltyReductionRatio; // 0x98 - 0x9C
   QAngle m_NextLookTarget; // 0x9C - 0xA8
   CountdownTimer m_AimTimer; // 0xA8 - 0xC0
   CountdownTimer m_SniperHoldTimer; // 0xC0 - 0xD8
   CountdownTimer m_FocusIntervalTimer; // 0xD8 - 0xF0
   bool m_bAcquired; // 0xF0 - 0xF1
   unsigned char pad_F1[0x7]; // 0xF1 - 0xF8
}; // size - 0xF8


class CBtActionCombatPositioning /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_58[0x10]; // 0x58 - 0x68
   CUtlString m_szSensorInputKey; // 0x68 - 0x70
   unsigned char pad_70[0x10]; // 0x70 - 0x80
   CUtlString m_szIsAttackingKey; // 0x80 - 0x88
   CountdownTimer m_ActionTimer; // 0x88 - 0xA0
   bool m_bCrouching; // 0xA0 - 0xA1
   unsigned char pad_A1[0xF]; // 0xA1 - 0xB0
}; // size - 0xB0


class CBtActionMoveTo /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_58[0x8]; // 0x58 - 0x60
   CUtlString m_szDestinationInputKey; // 0x60 - 0x68
   CUtlString m_szHidingSpotInputKey; // 0x68 - 0x70
   CUtlString m_szThreatInputKey; // 0x70 - 0x78
   Vector m_vecDestination; // 0x78 - 0x84
   bool m_bAutoLookAdjust; // 0x84 - 0x85
   bool m_bComputePath; // 0x85 - 0x86
   unsigned char pad_86[0x2]; // 0x86 - 0x88
   float m_flDamagingAreasPenaltyCost; // 0x88 - 0x8C
   unsigned char pad_8C[0x4]; // 0x8C - 0x90
   CountdownTimer m_CheckApproximateCornersTimer; // 0x90 - 0xA8
   CountdownTimer m_CheckHighPriorityItem; // 0xA8 - 0xC0
   CountdownTimer m_RepathTimer; // 0xC0 - 0xD8
   float m_flArrivalEpsilon; // 0xD8 - 0xDC
   float m_flAdditionalArrivalEpsilon2D; // 0xDC - 0xE0
   float m_flHidingSpotCheckDistanceThreshold; // 0xE0 - 0xE4
   float m_flNearestAreaDistanceThreshold; // 0xE4 - 0xE8
}; // size - 0xE8


class CBtActionParachutePositioning /* "server" */ : public CBtNode /* "server" */
{
public:
   CountdownTimer m_ActionTimer; // 0x58 - 0x70
   unsigned char pad_70[0x8]; // 0x70 - 0x78
}; // size - 0x78


class CBtNodeComposite /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_0[0x58]; // 0x0 - 0x58
}; // size - 0x58


class CBtNodeConditionInactive /* "server" */ : public CBtNodeCondition /* "server" */
{
public:
   unsigned char pad_60[0x18]; // 0x60 - 0x78
   float m_flRoundStartThresholdSeconds; // 0x78 - 0x7C
   float m_flSensorInactivityThresholdSeconds; // 0x7C - 0x80
   CountdownTimer m_SensorInactivityTimer; // 0x80 - 0x98
}; // size - 0x98


class CBubbling /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   int32_t m_density; // 0x6F0 - 0x6F4
   int32_t m_frequency; // 0x6F4 - 0x6F8
   int32_t m_state; // 0x6F8 - 0x6FC
   unsigned char pad_6FC[0x4]; // 0x6FC - 0x700
}; // size - 0x700


class CBumpMine /* "server" */ : public CWeaponCSBase /* "server" */
{
public:
   unsigned char pad_0[0xD50]; // 0x0 - 0xD50
}; // size - 0xD50


class CBumpMineProjectile /* "server" */ : public CBaseGrenade /* "server" */
{
public:
   bool m_bShouldExplode; // 0x958 - 0x959
   unsigned char pad_959[0x3]; // 0x959 - 0x95C
   int32_t m_nParentBoneIndex; // 0x95C - 0x960
   Vector m_vecParentBonePos; // 0x960 - 0x96C
   bool m_bArmed; // 0x96C - 0x96D
   bool m_bDefused; // 0x96D - 0x96E
   bool m_bUnstuckFromPlayer; // 0x96E - 0x96F
   unsigned char pad_96F[0x1]; // 0x96F - 0x970
   CUtlVector< CHandle< CBaseEntity > > m_vecTargetedObjects; // 0x970 - 0x988
   unsigned char pad_988[0x28]; // 0x988 - 0x9B0
   bool m_bResolvedParent; // 0x9B0 - 0x9B1
   unsigned char pad_9B1[0x3]; // 0x9B1 - 0x9B4
   Vector m_vecLastKnownValidPos; // 0x9B4 - 0x9C0
   CEntityHandle m_hDesiredParent; // 0x9C0 - 0x9C4
   bool m_bBeingUsed; // 0x9C4 - 0x9C5
   unsigned char pad_9C5[0x3]; // 0x9C5 - 0x9C8
}; // size - 0x9C8


class CBuoyancyHelper /* "client" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   float m_flFluidDensity; // 0x18 - 0x1C
   float m_flDisplacementFromObjects; // 0x1C - 0x20
   unsigned char pad_20[0x28]; // 0x20 - 0x48
}; // size - 0x48


class CBuoyancyHelper /* "server" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   float m_flFluidDensity; // 0x18 - 0x1C
   float m_flDisplacementFromObjects; // 0x1C - 0x20
   unsigned char pad_20[0x28]; // 0x20 - 0x48
}; // size - 0x48


class CBuyZone /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   int32_t m_LegacyTeamNum; // 0x898 - 0x89C
   unsigned char pad_89C[0x4]; // 0x89C - 0x8A0
}; // size - 0x8A0


class CC4 /* "server" */ : public CWeaponCSBase /* "server" */
{
public:
   Vector m_vecLastValidPlayerHeldPosition; // 0xD50 - 0xD5C
   Vector m_vecLastValidDroppedPosition; // 0xD5C - 0xD68
   bool m_bDoValidDroppedPositionCheck; // 0xD68 - 0xD69
   bool m_bStartedArming; // 0xD69 - 0xD6A
   unsigned char pad_D6A[0x2]; // 0xD6A - 0xD6C
   GameTime_t m_fArmedTime; // 0xD6C - 0xD70
   bool m_bBombPlacedAnimation; // 0xD70 - 0xD71
   bool m_bShowC4LED; // 0xD71 - 0xD72
   bool m_bIsPlantingViaUse; // 0xD72 - 0xD73
   unsigned char pad_D73[0x5]; // 0xD73 - 0xD78
   EntitySpottedState_t m_entitySpottedState; // 0xD78 - 0xD90
   int32_t m_nSpotRules; // 0xD90 - 0xD94
   bool m_bPlayedArmingBeeps[7]; // 0xD94 - 0xD9B
   bool m_bBombPlanted; // 0xD9B - 0xD9C
   bool m_bDroppedFromDeath; // 0xD9C - 0xD9D
   unsigned char pad_D9D[0x3]; // 0xD9D - 0xDA0
}; // size - 0xDA0


class CCPPScriptComponent /* "animationsystem" */ : public CAnimComponentBase /* "animationsystem" */
{
public:
   unsigned char pad_38[0x8]; // 0x38 - 0x40
   CUtlVector< CUtlString > m_scriptsToRun; // 0x40 - 0x58
}; // size - 0x58


class CCPPScriptComponentUpdater /* "animationsystem" */ : public CAnimComponentUpdater /* "animationsystem" */
{
public:
   CUtlVector< CUtlString > m_scriptsToRun; // 0x30 - 0x48
   unsigned char pad_48[0x70]; // 0x48 - 0xB8
}; // size - 0xB8


class CCSBot /* "server" */ : public CBot /* "server" */
{
public:
   CHandle< SpawnPointCoopEnemy > m_lastCoopSpawnPoint; // 0xD0 - 0xD4
   unsigned char pad_D4[0xC]; // 0xD4 - 0xE0
   Vector m_eyePosition; // 0xE0 - 0xEC
   char m_name[64]; // 0xEC - 0x12C
   float m_combatRange; // 0x12C - 0x130
   bool m_isRogue; // 0x130 - 0x131
   unsigned char pad_131[0x7]; // 0x131 - 0x138
   CountdownTimer m_rogueTimer; // 0x138 - 0x150
   unsigned char pad_150[0x4]; // 0x150 - 0x154
   bool m_diedLastRound; // 0x154 - 0x155
   unsigned char pad_155[0x3]; // 0x155 - 0x158
   float m_safeTime; // 0x158 - 0x15C
   bool m_wasSafe; // 0x15C - 0x15D
