#pragma once

#include "SDK.hpp"

class IHandleEntity
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class CEntityInstance : public IHandleEntity
{
public:

   CUtlSymbolLarge m_iszPrivateVScripts; // 0x8 - 0x8
   CEntityIdentity* m_pEntity; // 0x10 - 0x10
   CScriptComponent* m_CScriptComponent; // 0x28 - 0x28

}; // size - 0x30


class CBaseEntity : public CEntityInstance
{
public:

   CBodyComponent* m_CBodyComponent; // 0x30 - 0x30
   CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x38 - 0x38
   CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x218 - 0x218
   std::int32_t m_iCurrentThinkContext; // 0x230 - 0x230
   GameTick_t m_nLastThinkTick; // 0x234 - 0x234
   CBitVec< 64 > m_isSteadyState; // 0x240 - 0x240
   std::float_t m_lastNetworkChange; // 0x248 - 0x248
   CUtlVector< ResponseContext_t > m_ResponseContexts; // 0x258 - 0x258
   CUtlSymbolLarge m_iszResponseContext; // 0x270 - 0x270
   std::int32_t m_iHealth; // 0x298 - 0x298
   std::int32_t m_iMaxHealth; // 0x29C - 0x29C
   std::uint8_t m_lifeState; // 0x2A0 - 0x2A0
   std::float_t m_flDamageAccumulator; // 0x2A4 - 0x2A4
   bool m_bTakesDamage; // 0x2A8 - 0x2A8
   TakeDamageFlags_t m_nTakeDamageFlags; // 0x2AC - 0x2AC
   MoveCollide_t m_MoveCollide; // 0x2B1 - 0x2B1
   MoveType_t m_MoveType; // 0x2B2 - 0x2B2
   std::uint8_t m_nWaterTouch; // 0x2B3 - 0x2B3
   std::uint8_t m_nSlimeTouch; // 0x2B4 - 0x2B4
   bool m_bRestoreInHierarchy; // 0x2B5 - 0x2B5
   CUtlSymbolLarge m_target; // 0x2B8 - 0x2B8
   std::float_t m_flMoveDoneTime; // 0x2C0 - 0x2C0
   CHandle< CBaseFilter > m_hDamageFilter; // 0x2C4 - 0x2C4
   CUtlSymbolLarge m_iszDamageFilterName; // 0x2C8 - 0x2C8
   CUtlStringToken m_nSubclassID; // 0x2D0 - 0x2D0
   std::float_t m_flAnimTime; // 0x2E0 - 0x2E0
   std::float_t m_flSimulationTime; // 0x2E4 - 0x2E4
   GameTime_t m_flCreateTime; // 0x2E8 - 0x2E8
   bool m_bClientSideRagdoll; // 0x2EC - 0x2EC
   std::uint8_t m_ubInterpolationFrame; // 0x2ED - 0x2ED
   Vector m_vPrevVPhysicsUpdatePos; // 0x2F0 - 0x2F0
   std::uint8_t m_iTeamNum; // 0x2FC - 0x2FC
   CUtlSymbolLarge m_iGlobalname; // 0x300 - 0x300
   std::int32_t m_iSentToClients; // 0x308 - 0x308
   std::float_t m_flSpeed; // 0x30C - 0x30C
   CUtlString m_sUniqueHammerID; // 0x310 - 0x310
   std::uint32_t m_spawnflags; // 0x318 - 0x318
   GameTick_t m_nNextThinkTick; // 0x31C - 0x31C
   std::int32_t m_nSimulationTick; // 0x320 - 0x320
   CEntityIOOutput m_OnKilled; // 0x328 - 0x328
   std::uint32_t m_fFlags; // 0x350 - 0x350
   Vector m_vecAbsVelocity; // 0x354 - 0x354
   CNetworkVelocityVector m_vecVelocity; // 0x360 - 0x360
   Vector m_vecBaseVelocity; // 0x390 - 0x390
   std::int32_t m_nPushEnumCount; // 0x39C - 0x39C
   CCollisionProperty* m_pCollision; // 0x3A0 - 0x3A0
   CHandle< CBaseEntity > m_hEffectEntity; // 0x3A8 - 0x3A8
   CHandle< CBaseEntity > m_hOwnerEntity; // 0x3AC - 0x3AC
   std::uint32_t m_fEffects; // 0x3B0 - 0x3B0
   CHandle< CBaseEntity > m_hGroundEntity; // 0x3B4 - 0x3B4
   std::float_t m_flFriction; // 0x3B8 - 0x3B8
   std::float_t m_flElasticity; // 0x3BC - 0x3BC
   std::float_t m_flGravityScale; // 0x3C0 - 0x3C0
   std::float_t m_flTimeScale; // 0x3C4 - 0x3C4
   std::float_t m_flWaterLevel; // 0x3C8 - 0x3C8
   bool m_bSimulatedEveryTick; // 0x3CC - 0x3CC
   bool m_bAnimatedEveryTick; // 0x3CD - 0x3CD
   std::uint8_t m_nMinCPULevel; // 0x3CE - 0x3CE
   std::uint8_t m_nMaxCPULevel; // 0x3CF - 0x3CF
   std::uint8_t m_nMinGPULevel; // 0x3D0 - 0x3D0
   std::uint8_t m_nMaxGPULevel; // 0x3D1 - 0x3D1
   bool m_bDisableLowViolence; // 0x3D2 - 0x3D2
   std::uint8_t m_nWaterType; // 0x3D3 - 0x3D3
   std::int32_t m_iEFlags; // 0x3D4 - 0x3D4
   CEntityIOOutput m_OnUser1; // 0x3D8 - 0x3D8
   CEntityIOOutput m_OnUser2; // 0x400 - 0x400
   CEntityIOOutput m_OnUser3; // 0x428 - 0x428
   CEntityIOOutput m_OnUser4; // 0x450 - 0x450
   std::int32_t m_iInitialTeamNum; // 0x478 - 0x478
   GameTime_t m_flNavIgnoreUntilTime; // 0x47C - 0x47C
   QAngle m_vecAngVelocity; // 0x480 - 0x480
   bool m_bNetworkQuantizeOriginAndAngles; // 0x48C - 0x48C
   bool m_bLagCompensate; // 0x48D - 0x48D
   std::float_t m_flOverriddenFriction; // 0x490 - 0x490
   CHandle< CBaseEntity > m_pBlocker; // 0x494 - 0x494
   std::float_t m_flLocalTime; // 0x498 - 0x498
   std::float_t m_flVPhysicsUpdateLocalTime; // 0x49C - 0x49C

}; // size - 0x4A0


class CEntityInstance : public IHandleEntity
{
public:

   CUtlSymbolLarge m_iszPrivateVScripts; // 0x8 - 0x8
   CEntityIdentity* m_pEntity; // 0x10 - 0x10
   CScriptComponent* m_CScriptComponent; // 0x28 - 0x28

}; // size - 0x30


class CBaseModelEntity : public CBaseEntity
{
public:

   CRenderComponent* m_CRenderComponent; // 0x4A0 - 0x4A0
   CHitboxComponent m_CHitboxComponent; // 0x4A8 - 0x4A8
   GameTime_t m_flDissolveStartTime; // 0x4D0 - 0x4D0
   CEntityIOOutput m_OnIgnite; // 0x4D8 - 0x4D8
   RenderMode_t m_nRenderMode; // 0x500 - 0x500
   RenderFx_t m_nRenderFX; // 0x501 - 0x501
   bool m_bAllowFadeInView; // 0x502 - 0x502
   Color m_clrRender; // 0x503 - 0x503
   CUtlVectorEmbeddedNetworkVar< EntityRenderAttribute_t > m_vecRenderAttributes; // 0x508 - 0x508
   CUtlStringToken m_LightGroup; // 0x558 - 0x558
   bool m_bRenderToCubemaps; // 0x55C - 0x55C
   CCollisionProperty m_Collision; // 0x560 - 0x560
   CGlowProperty m_Glow; // 0x610 - 0x610
   std::float_t m_flGlowBackfaceMult; // 0x668 - 0x668
   std::float_t m_fadeMinDist; // 0x66C - 0x66C
   std::float_t m_fadeMaxDist; // 0x670 - 0x670
   std::float_t m_flFadeScale; // 0x674 - 0x674
   std::float_t m_flShadowStrength; // 0x678 - 0x678
   std::uint8_t m_nObjectCulling; // 0x67C - 0x67C
   std::int32_t m_nAddDecal; // 0x680 - 0x680
   Vector m_vDecalPosition; // 0x684 - 0x684
   Vector m_vDecalForwardAxis; // 0x690 - 0x690
   std::float_t m_flDecalHealBloodRate; // 0x69C - 0x69C
   std::float_t m_flDecalHealHeightRate; // 0x6A0 - 0x6A0
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_ConfigEntitiesToPropagateMaterialDecalsTo; // 0x6A8 - 0x6A8
   CNetworkViewOffsetVector m_vecViewOffset; // 0x6C0 - 0x6C0

}; // size - 0x6F0


class C_BaseEntity : public CEntityInstance
{
public:

   CBodyComponent* m_CBodyComponent; // 0x30 - 0x30
   CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x38 - 0x38
   GameTick_t m_nLastThinkTick; // 0x2F8 - 0x2F8
   CGameSceneNode* m_pGameSceneNode; // 0x300 - 0x300
   CRenderComponent* m_pRenderComponent; // 0x308 - 0x308
   CCollisionProperty* m_pCollision; // 0x310 - 0x310
   std::int32_t m_iMaxHealth; // 0x318 - 0x318
   std::int32_t m_iHealth; // 0x31C - 0x31C
   std::uint8_t m_lifeState; // 0x320 - 0x320
   bool m_bTakesDamage; // 0x321 - 0x321
   TakeDamageFlags_t m_nTakeDamageFlags; // 0x324 - 0x324
   std::uint8_t m_ubInterpolationFrame; // 0x328 - 0x328
   CHandle< C_BaseEntity > m_hSceneObjectController; // 0x32C - 0x32C
   std::int32_t m_nNoInterpolationTick; // 0x330 - 0x330
   std::int32_t m_nVisibilityNoInterpolationTick; // 0x334 - 0x334
   std::float_t m_flProxyRandomValue; // 0x338 - 0x338
   std::int32_t m_iEFlags; // 0x33C - 0x33C
   std::uint8_t m_nWaterType; // 0x340 - 0x340
   bool m_bInterpolateEvenWithNoModel; // 0x341 - 0x341
   bool m_bPredictionEligible; // 0x342 - 0x342
   bool m_bApplyLayerMatchIDToModel; // 0x343 - 0x343
   CUtlStringToken m_tokLayerMatchID; // 0x344 - 0x344
   CUtlStringToken m_nSubclassID; // 0x348 - 0x348
   std::int32_t m_nSimulationTick; // 0x358 - 0x358
   std::int32_t m_iCurrentThinkContext; // 0x35C - 0x35C
   CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x360 - 0x360
   std::float_t m_flAnimTime; // 0x378 - 0x378
   std::float_t m_flSimulationTime; // 0x37C - 0x37C
   std::uint8_t m_nSceneObjectOverrideFlags; // 0x380 - 0x380
   bool m_bHasSuccessfullyInterpolated; // 0x381 - 0x381
   bool m_bHasAddedVarsToInterpolation; // 0x382 - 0x382
   bool m_bRenderEvenWhenNotSuccessfullyInterpolated; // 0x383 - 0x383
   int32 m_nInterpolationLatchDirtyFlags[2]; // 0x384 - 0x384
   uint16 m_ListEntry[11]; // 0x38C - 0x38C
   GameTime_t m_flCreateTime; // 0x3A4 - 0x3A4
   std::float_t m_flSpeed; // 0x3A8 - 0x3A8
   std::uint16_t m_EntClientFlags; // 0x3AC - 0x3AC
   bool m_bClientSideRagdoll; // 0x3AE - 0x3AE
   std::uint8_t m_iTeamNum; // 0x3AF - 0x3AF
   std::uint32_t m_spawnflags; // 0x3B0 - 0x3B0
   GameTick_t m_nNextThinkTick; // 0x3B4 - 0x3B4
   std::uint32_t m_fFlags; // 0x3B8 - 0x3B8
   Vector m_vecAbsVelocity; // 0x3BC - 0x3BC
   CNetworkVelocityVector m_vecVelocity; // 0x3C8 - 0x3C8
   Vector m_vecBaseVelocity; // 0x3F8 - 0x3F8
   CHandle< C_BaseEntity > m_hEffectEntity; // 0x404 - 0x404
   CHandle< C_BaseEntity > m_hOwnerEntity; // 0x408 - 0x408
   MoveCollide_t m_MoveCollide; // 0x40C - 0x40C
   MoveType_t m_MoveType; // 0x40D - 0x40D
   std::float_t m_flWaterLevel; // 0x410 - 0x410
   std::uint32_t m_fEffects; // 0x414 - 0x414
   CHandle< C_BaseEntity > m_hGroundEntity; // 0x418 - 0x418
   std::float_t m_flFriction; // 0x41C - 0x41C
   std::float_t m_flElasticity; // 0x420 - 0x420
   std::float_t m_flGravityScale; // 0x424 - 0x424
   std::float_t m_flTimeScale; // 0x428 - 0x428
   bool m_bSimulatedEveryTick; // 0x42C - 0x42C
   bool m_bAnimatedEveryTick; // 0x42D - 0x42D
   std::uint8_t m_nMinCPULevel; // 0x42E - 0x42E
   std::uint8_t m_nMaxCPULevel; // 0x42F - 0x42F
   std::uint8_t m_nMinGPULevel; // 0x430 - 0x430
   std::uint8_t m_nMaxGPULevel; // 0x431 - 0x431
   GameTime_t m_flNavIgnoreUntilTime; // 0x434 - 0x434
   std::uint16_t m_hThink; // 0x438 - 0x438
   std::uint8_t m_fBBoxVisFlags; // 0x448 - 0x448
   bool m_bPredictable; // 0x449 - 0x449
   bool m_bRenderWithViewModels; // 0x44A - 0x44A
   CSplitScreenSlot m_nSplitUserPlayerPredictionSlot; // 0x44C - 0x44C
   std::int32_t m_nFirstPredictableCommand; // 0x450 - 0x450
   std::int32_t m_nLastPredictableCommand; // 0x454 - 0x454
   CHandle< C_BaseEntity > m_hOldMoveParent; // 0x458 - 0x458
   CParticleProperty m_Particles; // 0x460 - 0x460
   CUtlVector< float32 > m_vecPredictedScriptFloats; // 0x488 - 0x488
   CUtlVector< int32 > m_vecPredictedScriptFloatIDs; // 0x4A0 - 0x4A0
   std::int32_t m_nNextScriptVarRecordID; // 0x4D0 - 0x4D0
   QAngle m_vecAngVelocity; // 0x4E0 - 0x4E0
   std::int32_t m_DataChangeEventRef; // 0x4EC - 0x4EC
   CUtlVector< CEntityHandle > m_dependencies; // 0x4F0 - 0x4F0
   std::int32_t m_nCreationTick; // 0x508 - 0x508
   bool m_bAnimTimeChanged; // 0x521 - 0x521
   bool m_bSimulationTimeChanged; // 0x522 - 0x522
   CUtlString m_sUniqueHammerID; // 0x530 - 0x530

}; // size - 0x538


class CParticleFunction
{
public:

   CParticleCollectionFloatInput m_flOpStrength; // 0x8 - 0x8
   ParticleEndcapMode_t m_nOpEndCapState; // 0x140 - 0x140
   std::float_t m_flOpStartFadeInTime; // 0x144 - 0x144
   std::float_t m_flOpEndFadeInTime; // 0x148 - 0x148
   std::float_t m_flOpStartFadeOutTime; // 0x14C - 0x14C
   std::float_t m_flOpEndFadeOutTime; // 0x150 - 0x150
   std::float_t m_flOpFadeOscillatePeriod; // 0x154 - 0x154
   bool m_bNormalizeToStopTime; // 0x158 - 0x158
   std::float_t m_flOpTimeOffsetMin; // 0x15C - 0x15C
   std::float_t m_flOpTimeOffsetMax; // 0x160 - 0x160
   std::int32_t m_nOpTimeOffsetSeed; // 0x164 - 0x164
   std::int32_t m_nOpTimeScaleSeed; // 0x168 - 0x168
   std::float_t m_flOpTimeScaleMin; // 0x16C - 0x16C
   std::float_t m_flOpTimeScaleMax; // 0x170 - 0x170
   bool m_bDisableOperator; // 0x175 - 0x175
   CUtlString m_Notes; // 0x178 - 0x178

}; // size - 0x1F0


class C_BaseModelEntity : public C_BaseEntity
{
public:

   CRenderComponent* m_CRenderComponent; // 0x588 - 0x588
   CHitboxComponent m_CHitboxComponent; // 0x590 - 0x590
   bool m_bInitModelEffects; // 0x5D8 - 0x5D8
   bool m_bIsStaticProp; // 0x5D9 - 0x5D9
   std::int32_t m_nLastAddDecal; // 0x5DC - 0x5DC
   std::int32_t m_nDecalsAdded; // 0x5E0 - 0x5E0
   std::int32_t m_iOldHealth; // 0x5E4 - 0x5E4
   RenderMode_t m_nRenderMode; // 0x5E8 - 0x5E8
   RenderFx_t m_nRenderFX; // 0x5E9 - 0x5E9
   bool m_bAllowFadeInView; // 0x5EA - 0x5EA
   Color m_clrRender; // 0x5EB - 0x5EB
   C_UtlVectorEmbeddedNetworkVar< EntityRenderAttribute_t > m_vecRenderAttributes; // 0x5F0 - 0x5F0
   CUtlStringToken m_LightGroup; // 0x658 - 0x658
   bool m_bRenderToCubemaps; // 0x65C - 0x65C
   CCollisionProperty m_Collision; // 0x660 - 0x660
   CGlowProperty m_Glow; // 0x710 - 0x710
   std::float_t m_flGlowBackfaceMult; // 0x768 - 0x768
   std::float_t m_fadeMinDist; // 0x76C - 0x76C
   std::float_t m_fadeMaxDist; // 0x770 - 0x770
   std::float_t m_flFadeScale; // 0x774 - 0x774
   std::float_t m_flShadowStrength; // 0x778 - 0x778
   std::uint8_t m_nObjectCulling; // 0x77C - 0x77C
   std::int32_t m_nAddDecal; // 0x780 - 0x780
   Vector m_vDecalPosition; // 0x784 - 0x784
   Vector m_vDecalForwardAxis; // 0x790 - 0x790
   std::float_t m_flDecalHealBloodRate; // 0x79C - 0x79C
   std::float_t m_flDecalHealHeightRate; // 0x7A0 - 0x7A0
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_ConfigEntitiesToPropagateMaterialDecalsTo; // 0x7A8 - 0x7A8
   CNetworkViewOffsetVector m_vecViewOffset; // 0x7C0 - 0x7C0
   CClientAlphaProperty* m_pClientAlphaProperty; // 0x7F0 - 0x7F0
   Color m_ClientOverrideTint; // 0x7F8 - 0x7F8
   bool m_bUseClientOverrideTint; // 0x7FC - 0x7FC

}; // size - 0x838


class CBaseAnimGraph : public CBaseModelEntity
{
public:

   PhysicsRagdollPose_t* m_pRagdollPose; // 0x700 - 0x700
   bool m_bClientRagdoll; // 0x708 - 0x708
   Vector m_vecForce; // 0x70C - 0x70C
   std::int32_t m_nForceBone; // 0x718 - 0x718
   bool m_bShouldAnimateDuringGameplayPause; // 0x71C - 0x71C
   bool m_bAnimGraphUpdateEnabled; // 0x71D - 0x71D
   bool m_bInitiallyPopulateInterpHistory; // 0x71E - 0x71E
   std::float_t m_flMaxSlopeDistance; // 0x720 - 0x720
   Vector m_vLastSlopeCheckPos; // 0x724 - 0x724
   IChoreoServices* m_pChoreoServices; // 0x730 - 0x730
   bool m_bAnimGraphDirty; // 0x738 - 0x738

}; // size - 0x820


class CBaseAnimGraph : public C_BaseModelEntity
{
public:

   PhysicsRagdollPose_t* m_pRagdollPose; // 0x848 - 0x848
   bool m_bClientRagdoll; // 0x850 - 0x850
   Vector m_vecForce; // 0x854 - 0x854
   std::int32_t m_nForceBone; // 0x860 - 0x860
   bool m_bShouldAnimateDuringGameplayPause; // 0x864 - 0x864
   bool m_bAnimGraphUpdateEnabled; // 0x865 - 0x865
   bool m_bInitiallyPopulateInterpHistory; // 0x866 - 0x866
   std::float_t m_flMaxSlopeDistance; // 0x868 - 0x868
   Vector m_vLastSlopeCheckPos; // 0x86C - 0x86C
   bool m_bHasAnimatedMaterialAttributes; // 0x878 - 0x878
   CBaseAnimGraph* m_pClientsideRagdoll; // 0x880 - 0x880
   bool m_builtRagdoll; // 0x888 - 0x888
   bool m_bSuppressAnimEventSounds; // 0x898 - 0x898

}; // size - 0x998


class CParticleFunctionOperator : public CParticleFunction
{
public:


}; // size - 0x1F0


class C_BaseFlex : public CBaseAnimGraph
{
public:

   class Emphasized_Phoneme
   {
   public:

      CUtlString m_sClassName; // 0x0 - 0x0
      std::float_t m_flAmount; // 0x18 - 0x18
      bool m_bRequired; // 0x1C - 0x1C
      bool m_bBasechecked; // 0x1D - 0x1D
      bool m_bValid; // 0x1E - 0x1E

   }; // size - 0x20

   C_NetworkUtlVectorBase< float32 > m_flexWeight; // 0x9A0 - 0x9A0
   bool m_blinktoggle; // 0x9B8 - 0x9B8
   Vector m_vLookTargetPosition; // 0x9C0 - 0x9C0
   std::int32_t m_nLastFlexUpdateFrameCount; // 0xA30 - 0xA30
   Vector m_CachedViewTarget; // 0xA34 - 0xA34
   std::uint32_t m_nNextSceneEventId; // 0xA40 - 0xA40
   std::int32_t m_iBlink; // 0xA44 - 0xA44
   std::float_t m_blinktime; // 0xA48 - 0xA48
   bool m_prevblinktoggle; // 0xA4C - 0xA4C
   std::int32_t m_iJawOpen; // 0xA50 - 0xA50
   std::float_t m_flJawOpenAmount; // 0xA54 - 0xA54
   std::float_t m_flBlinkAmount; // 0xA58 - 0xA58
   AttachmentHandle_t m_iMouthAttachment; // 0xA5C - 0xA5C
   AttachmentHandle_t m_iEyeAttachment; // 0xA5D - 0xA5D
   bool m_bResetFlexWeightsOnModelChange; // 0xA5E - 0xA5E
   std::int32_t m_nEyeOcclusionRendererBone; // 0xA78 - 0xA78
   matrix3x4_t m_mEyeOcclusionRendererCameraToBoneTransform; // 0xA7C - 0xA7C
   Vector m_vEyeOcclusionRendererHalfExtent; // 0xAAC - 0xAAC
   C_BaseFlex::Emphasized_Phoneme m_PhonemeClasses[3]; // 0xAC8 - 0xAC8

}; // size - 0xB28


class CBaseFlex : public CBaseAnimGraph
{
public:

   CNetworkUtlVectorBase< float32 > m_flexWeight; // 0x820 - 0x820
   Vector m_vLookTargetPosition; // 0x838 - 0x838
   bool m_blinktoggle; // 0x844 - 0x844
   GameTime_t m_flAllowResponsesEndTime; // 0x898 - 0x898
   GameTime_t m_flLastFlexAnimationTime; // 0x89C - 0x89C
   std::uint32_t m_nNextSceneEventId; // 0x8A0 - 0x8A0
   bool m_bUpdateLayerPriorities; // 0x8A4 - 0x8A4

}; // size - 0x8B0


class CServerOnlyEntity : public CBaseEntity
{
public:


}; // size - 0x4A0


class C_EconEntity : public C_BaseFlex
{
public:

   class AttachedModelData_t
   {
   public:

      std::int32_t m_iModelDisplayFlags; // 0x0 - 0x0

   }; // size - 0x4

   std::float_t m_flFlexDelayTime; // 0xB38 - 0xB38
   float32* m_flFlexDelayedWeight; // 0xB40 - 0xB40
   bool m_bAttributesInitialized; // 0xB48 - 0xB48
   C_AttributeContainer m_AttributeManager; // 0xB50 - 0xB50
   std::uint32_t m_OriginalOwnerXuidLow; // 0xFF8 - 0xFF8
   std::uint32_t m_OriginalOwnerXuidHigh; // 0xFFC - 0xFFC
   std::int32_t m_nFallbackPaintKit; // 0x1000 - 0x1000
   std::int32_t m_nFallbackSeed; // 0x1004 - 0x1004
   std::float_t m_flFallbackWear; // 0x1008 - 0x1008
   std::int32_t m_nFallbackStatTrak; // 0x100C - 0x100C
   bool m_bClientside; // 0x1010 - 0x1010
   bool m_bParticleSystemsCreated; // 0x1011 - 0x1011
   CUtlVector< int32 > m_vecAttachedParticles; // 0x1018 - 0x1018
   CHandle< CBaseAnimGraph > m_hViewmodelAttachment; // 0x1030 - 0x1030
   std::int32_t m_iOldTeam; // 0x1034 - 0x1034
   bool m_bAttachmentDirty; // 0x1038 - 0x1038
   std::int32_t m_nUnloadedModelIndex; // 0x103C - 0x103C
   std::int32_t m_iNumOwnerValidationRetries; // 0x1040 - 0x1040
   CHandle< C_BaseEntity > m_hOldProvidee; // 0x1050 - 0x1050
   CUtlVector< C_EconEntity::AttachedModelData_t > m_vecAttachedModels; // 0x1058 - 0x1058

}; // size - 0x1070


class CEconEntity : public CBaseFlex
{
public:

   CAttributeContainer m_AttributeManager; // 0x8C0 - 0x8C0
   std::uint32_t m_OriginalOwnerXuidLow; // 0xB88 - 0xB88
   std::uint32_t m_OriginalOwnerXuidHigh; // 0xB8C - 0xB8C
   std::int32_t m_nFallbackPaintKit; // 0xB90 - 0xB90
   std::int32_t m_nFallbackSeed; // 0xB94 - 0xB94
   std::float_t m_flFallbackWear; // 0xB98 - 0xB98
   std::int32_t m_nFallbackStatTrak; // 0xB9C - 0xB9C
   CHandle< CBaseEntity > m_hOldProvidee; // 0xBA0 - 0xBA0
   std::int32_t m_iOldOwnerClass; // 0xBA4 - 0xBA4

}; // size - 0xBA8


class CParticleFunctionInitializer : public CParticleFunction
{
public:

   std::int32_t m_nAssociatedEmitterIndex; // 0x1E8 - 0x1E8

}; // size - 0x1F0


class CBaseProp : public CBaseAnimGraph
{
public:

   bool m_bModelOverrodeBlockLOS; // 0x820 - 0x820
   std::int32_t m_iShapeType; // 0x824 - 0x824
   bool m_bConformToCollisionBounds; // 0x828 - 0x828
   matrix3x4_t m_mPreferredCatchTransform; // 0x82C - 0x82C

}; // size - 0x860


class CBaseToggle : public CBaseModelEntity
{
public:

   TOGGLE_STATE m_toggle_state; // 0x6F0 - 0x6F0
   std::float_t m_flMoveDistance; // 0x6F4 - 0x6F4
   std::float_t m_flWait; // 0x6F8 - 0x6F8
   std::float_t m_flLip; // 0x6FC - 0x6FC
   bool m_bAlwaysFireBlockedOutputs; // 0x700 - 0x700
   Vector m_vecPosition1; // 0x704 - 0x704
   Vector m_vecPosition2; // 0x710 - 0x710
   QAngle m_vecMoveAng; // 0x71C - 0x71C
   QAngle m_vecAngle1; // 0x728 - 0x728
   QAngle m_vecAngle2; // 0x734 - 0x734
   std::float_t m_flHeight; // 0x740 - 0x740
   CHandle< CBaseEntity > m_hActivator; // 0x744 - 0x744
   Vector m_vecFinalDest; // 0x748 - 0x748
   QAngle m_vecFinalAngle; // 0x754 - 0x754
   std::int32_t m_movementType; // 0x760 - 0x760
   CUtlSymbolLarge m_sMaster; // 0x768 - 0x768

}; // size - 0x770


class CBasePlayerWeapon : public CEconEntity
{
public:

   WeaponState_t m_iState; // 0xBA8 - 0xBA8
   bool m_bRemoveable; // 0xBAC - 0xBAC
   GameTick_t m_nNextPrimaryAttackTick; // 0xBB0 - 0xBB0
   std::float_t m_flNextPrimaryAttackTickRatio; // 0xBB4 - 0xBB4
   GameTick_t m_nNextSecondaryAttackTick; // 0xBB8 - 0xBB8
   std::float_t m_flNextSecondaryAttackTickRatio; // 0xBBC - 0xBBC
   std::int32_t m_iClip1; // 0xBC0 - 0xBC0
   std::int32_t m_iClip2; // 0xBC4 - 0xBC4
   int32 m_pReserveAmmo[2]; // 0xBC8 - 0xBC8
   CEntityIOOutput m_OnPlayerUse; // 0xBD0 - 0xBD0

}; // size - 0xBF8


class C_BasePlayerWeapon : public C_EconEntity
{
public:

   WeaponState_t m_iState; // 0x1070 - 0x1070
   WeaponState_t m_iOldState; // 0x1074 - 0x1074
   bool m_bRemoveable; // 0x1078 - 0x1078
   GameTick_t m_nNextPrimaryAttackTick; // 0x107C - 0x107C
   std::float_t m_flNextPrimaryAttackTickRatio; // 0x1080 - 0x1080
   GameTick_t m_nNextSecondaryAttackTick; // 0x1084 - 0x1084
   std::float_t m_flNextSecondaryAttackTickRatio; // 0x1088 - 0x1088
   std::int32_t m_iClip1; // 0x108C - 0x108C
   std::int32_t m_iClip2; // 0x1090 - 0x1090
   int32 m_pReserveAmmo[2]; // 0x1094 - 0x1094

}; // size - 0x10A0


class CBreakableProp : public CBaseProp
{
public:

   CEntityIOOutput m_OnBreak; // 0x870 - 0x870
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0x898 - 0x898
   CEntityIOOutput m_OnTakeDamage; // 0x8C0 - 0x8C0
   std::float_t m_impactEnergyScale; // 0x8E8 - 0x8E8
   std::int32_t m_iMinHealthDmg; // 0x8EC - 0x8EC
   QAngle m_preferredCarryAngles; // 0x8F0 - 0x8F0
   std::float_t m_flPressureDelay; // 0x8FC - 0x8FC
   CHandle< CBaseEntity > m_hBreaker; // 0x900 - 0x900
   PerformanceMode_t m_PerformanceMode; // 0x904 - 0x904
   std::float_t m_flDmgModBullet; // 0x908 - 0x908
   std::float_t m_flDmgModClub; // 0x90C - 0x90C
   std::float_t m_flDmgModExplosive; // 0x910 - 0x910
   std::float_t m_flDmgModFire; // 0x914 - 0x914
   CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0x918 - 0x918
   CUtlSymbolLarge m_iszBasePropData; // 0x920 - 0x920
   std::int32_t m_iInteractions; // 0x928 - 0x928
   GameTime_t m_flPreventDamageBeforeTime; // 0x92C - 0x92C
   bool m_bHasBreakPiecesOrCommands; // 0x930 - 0x930
   std::float_t m_explodeDamage; // 0x934 - 0x934
   std::float_t m_explodeRadius; // 0x938 - 0x938
   std::float_t m_explosionDelay; // 0x940 - 0x940
   CUtlSymbolLarge m_explosionBuildupSound; // 0x948 - 0x948
   CUtlSymbolLarge m_explosionCustomEffect; // 0x950 - 0x950
   CUtlSymbolLarge m_explosionCustomSound; // 0x958 - 0x958
   CUtlSymbolLarge m_explosionModifier; // 0x960 - 0x960
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x968 - 0x968
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x96C - 0x96C
   bool m_bOriginalBlockLOS; // 0x970 - 0x970
   std::float_t m_flDefaultFadeScale; // 0x974 - 0x974
   CHandle< CBaseEntity > m_hLastAttacker; // 0x978 - 0x978
   CHandle< CBaseEntity > m_hFlareEnt; // 0x97C - 0x97C
   bool m_bUsePuntSound; // 0x980 - 0x980
   CUtlSymbolLarge m_iszPuntSound; // 0x988 - 0x988
   bool m_noGhostCollision; // 0x990 - 0x990

}; // size - 0x998


class CPointEntity : public CBaseEntity
{
public:


}; // size - 0x4A0


class CLogicalEntity : public CServerOnlyEntity
{
public:


}; // size - 0x4A0


class CWeaponCSBase : public CBasePlayerWeapon
{
public:

   std::float_t m_flFireSequenceStartTime; // 0xC20 - 0xC20
   std::int32_t m_nFireSequenceStartTimeChange; // 0xC24 - 0xC24
   std::int32_t m_nFireSequenceStartTimeAck; // 0xC28 - 0xC28
   bool m_bPlayerFireEventIsPrimary; // 0xC2C - 0xC2C
   HSequence m_seqIdle; // 0xC30 - 0xC30
   HSequence m_seqFirePrimary; // 0xC34 - 0xC34
   HSequence m_seqFireSecondary; // 0xC38 - 0xC38
   bool m_bPlayerAmmoStockOnPickup; // 0xC48 - 0xC48
   bool m_bRequireUseToTouch; // 0xC49 - 0xC49
   GameTime_t m_flLastTimeInAir; // 0xC4C - 0xC4C
   GameTime_t m_flLastDeployTime; // 0xC50 - 0xC50
   std::uint32_t m_nViewModelIndex; // 0xC54 - 0xC54
   bool m_bReloadsWithClips; // 0xC58 - 0xC58
   GameTime_t m_flTimeWeaponIdle; // 0xC5C - 0xC5C
   bool m_bFireOnEmpty; // 0xC60 - 0xC60
   CEntityIOOutput m_OnPlayerPickup; // 0xC68 - 0xC68
   CSWeaponMode m_weaponMode; // 0xC90 - 0xC90
   std::float_t m_flTurningInaccuracyDelta; // 0xC94 - 0xC94
   Vector m_vecTurningInaccuracyEyeDirLast; // 0xC98 - 0xC98
   std::float_t m_flTurningInaccuracy; // 0xCA4 - 0xCA4
   std::float_t m_fAccuracyPenalty; // 0xCA8 - 0xCA8
   GameTime_t m_flLastAccuracyUpdateTime; // 0xCAC - 0xCAC
   std::float_t m_fAccuracySmoothedForZoom; // 0xCB0 - 0xCB0
   GameTime_t m_fScopeZoomEndTime; // 0xCB4 - 0xCB4
   std::int32_t m_iRecoilIndex; // 0xCB8 - 0xCB8
   std::float_t m_flRecoilIndex; // 0xCBC - 0xCBC
   bool m_bBurstMode; // 0xCC0 - 0xCC0
   GameTime_t m_flPostponeFireReadyTime; // 0xCC4 - 0xCC4
   bool m_bInReload; // 0xCC8 - 0xCC8
   bool m_bReloadVisuallyComplete; // 0xCC9 - 0xCC9
   GameTime_t m_flDroppedAtTime; // 0xCCC - 0xCCC
   bool m_bIsHauledBack; // 0xCD0 - 0xCD0
   bool m_bSilencerOn; // 0xCD1 - 0xCD1
   GameTime_t m_flTimeSilencerSwitchComplete; // 0xCD4 - 0xCD4
   std::int32_t m_iOriginalTeamNumber; // 0xCD8 - 0xCD8
   std::float_t m_flNextAttackRenderTimeOffset; // 0xCDC - 0xCDC
   bool m_bCanBePickedUp; // 0xCE8 - 0xCE8
   bool m_bUseCanOverrideNextOwnerTouchTime; // 0xCE9 - 0xCE9
   GameTime_t m_nextOwnerTouchTime; // 0xCEC - 0xCEC
   GameTime_t m_nextPrevOwnerTouchTime; // 0xCF0 - 0xCF0
   CHandle< CCSPlayerPawnBase > m_hPrevOwner; // 0xCF4 - 0xCF4
   bool m_donated; // 0xD14 - 0xD14
   GameTime_t m_fLastShotTime; // 0xD18 - 0xD18
   bool m_bWasOwnedByCT; // 0xD1C - 0xD1C
   bool m_bWasOwnedByTerrorist; // 0xD1D - 0xD1D
   bool m_bFiredOutOfAmmoEvent; // 0xD1E - 0xD1E
   std::int32_t m_numRemoveUnownedWeaponThink; // 0xD20 - 0xD20
   CIronSightController m_IronSightController; // 0xD28 - 0xD28
   std::int32_t m_iIronSightMode; // 0xD40 - 0xD40
   GameTime_t m_flLastLOSTraceFailureTime; // 0xD44 - 0xD44
   std::int32_t m_iNumEmptyAttacks; // 0xD48 - 0xD48

}; // size - 0xD50


class C_WeaponCSBase : public C_BasePlayerWeapon
{
public:

   std::float_t m_flFireSequenceStartTime; // 0x10D8 - 0x10D8
   std::int32_t m_nFireSequenceStartTimeChange; // 0x10DC - 0x10DC
   std::int32_t m_nFireSequenceStartTimeAck; // 0x10E0 - 0x10E0
   bool m_bPlayerFireEventIsPrimary; // 0x10E4 - 0x10E4
   HSequence m_seqIdle; // 0x10E8 - 0x10E8
   HSequence m_seqFirePrimary; // 0x10EC - 0x10EC
   HSequence m_seqFireSecondary; // 0x10F0 - 0x10F0
   std::float_t m_flCrosshairDistance; // 0x1108 - 0x1108
   std::int32_t m_iAmmoLastCheck; // 0x110C - 0x110C
   std::int32_t m_iAlpha; // 0x1110 - 0x1110
   std::int32_t m_iScopeTextureID; // 0x1114 - 0x1114
   std::int32_t m_iCrosshairTextureID; // 0x1118 - 0x1118
   std::float_t m_flGunAccuracyPosition; // 0x111C - 0x111C
   std::uint32_t m_nViewModelIndex; // 0x1120 - 0x1120
   bool m_bReloadsWithClips; // 0x1124 - 0x1124
   GameTime_t m_flTimeWeaponIdle; // 0x1128 - 0x1128
   bool m_bFireOnEmpty; // 0x112C - 0x112C
   CEntityIOOutput m_OnPlayerPickup; // 0x1130 - 0x1130
   CSWeaponMode m_weaponMode; // 0x1158 - 0x1158
   std::float_t m_flTurningInaccuracyDelta; // 0x115C - 0x115C
   Vector m_vecTurningInaccuracyEyeDirLast; // 0x1160 - 0x1160
   std::float_t m_flTurningInaccuracy; // 0x116C - 0x116C
   std::float_t m_fAccuracyPenalty; // 0x1170 - 0x1170
   GameTime_t m_flLastAccuracyUpdateTime; // 0x1174 - 0x1174
   std::float_t m_fAccuracySmoothedForZoom; // 0x1178 - 0x1178
   GameTime_t m_fScopeZoomEndTime; // 0x117C - 0x117C
   std::int32_t m_iRecoilIndex; // 0x1180 - 0x1180
   std::float_t m_flRecoilIndex; // 0x1184 - 0x1184
   bool m_bBurstMode; // 0x1188 - 0x1188
   GameTime_t m_flPostponeFireReadyTime; // 0x118C - 0x118C
   bool m_bInReload; // 0x1190 - 0x1190
   bool m_bReloadVisuallyComplete; // 0x1191 - 0x1191
   GameTime_t m_flDroppedAtTime; // 0x1194 - 0x1194
   bool m_bIsHauledBack; // 0x1198 - 0x1198
   bool m_bSilencerOn; // 0x1199 - 0x1199
   GameTime_t m_flTimeSilencerSwitchComplete; // 0x119C - 0x119C
   std::int32_t m_iOriginalTeamNumber; // 0x11A0 - 0x11A0
   std::float_t m_flNextAttackRenderTimeOffset; // 0x11A4 - 0x11A4
   bool m_bVisualsDataSet; // 0x1230 - 0x1230
   bool m_bOldFirstPersonSpectatedState; // 0x1231 - 0x1231
   CHandle< C_BaseEntity > m_hOurPing; // 0x1234 - 0x1234
   CEntityIndex m_nOurPingIndex; // 0x1238 - 0x1238
   Vector m_vecOurPingPos; // 0x123C - 0x123C
   bool m_bGlowForPing; // 0x1248 - 0x1248
   bool m_bUIWeapon; // 0x1249 - 0x1249
   CHandle< C_CSPlayerPawnBase > m_hPrevOwner; // 0x1258 - 0x1258
   bool m_donated; // 0x127C - 0x127C
   GameTime_t m_fLastShotTime; // 0x1280 - 0x1280
   bool m_bWasOwnedByCT; // 0x1284 - 0x1284
   bool m_bWasOwnedByTerrorist; // 0x1285 - 0x1285
   std::float_t m_gunHeat; // 0x1288 - 0x1288
   std::uint32_t m_smokeAttachments; // 0x128C - 0x128C
   GameTime_t m_lastSmokeTime; // 0x1290 - 0x1290
   std::float_t m_flLastClientFireBulletTime; // 0x1294 - 0x1294
   C_IronSightController m_IronSightController; // 0x12F0 - 0x12F0
   std::int32_t m_iIronSightMode; // 0x13A0 - 0x13A0
   GameTime_t m_flLastLOSTraceFailureTime; // 0x13B0 - 0x13B0
   std::int32_t m_iNumEmptyAttacks; // 0x13B4 - 0x13B4

}; // size - 0x13D0


class CAnimUpdateNodeBase
{
public:

   CAnimNodePath m_nodePath; // 0x18 - 0x18
   CUtlString m_name; // 0x48 - 0x48
   AnimNodeNetworkMode m_networkMode; // 0x50 - 0x50

}; // size - 0x58


class CPlayerPawnComponent
{
public:

   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x8

}; // size - 0x40


class CAnimNodeBase
{
public:

   CUtlString m_sName; // 0x20 - 0x20
   Vector2D m_vecPosition; // 0x28 - 0x28
   AnimNodeID m_nNodeID; // 0x30 - 0x30
   AnimNodeNetworkMode m_networkMode; // 0x34 - 0x34

}; // size - 0x38


class CPhysicsProp : public CBreakableProp
{
public:

   CEntityIOOutput m_MotionEnabled; // 0x9A0 - 0x9A0
   CEntityIOOutput m_OnAwakened; // 0x9C8 - 0x9C8
   CEntityIOOutput m_OnAwake; // 0x9F0 - 0x9F0
   CEntityIOOutput m_OnAsleep; // 0xA18 - 0xA18
   CEntityIOOutput m_OnPlayerUse; // 0xA40 - 0xA40
   CEntityIOOutput m_OnPlayerPickup; // 0xA68 - 0xA68
   CEntityIOOutput m_OnOutOfWorld; // 0xA90 - 0xA90
   std::float_t m_massScale; // 0xAB8 - 0xAB8
   std::float_t m_inertiaScale; // 0xABC - 0xABC
   std::int32_t m_damageType; // 0xAC0 - 0xAC0
   std::int32_t m_damageToEnableMotion; // 0xAC4 - 0xAC4
   std::float_t m_flForceToEnableMotion; // 0xAC8 - 0xAC8
   bool m_bThrownByPlayer; // 0xACC - 0xACC
   bool m_bDroppedByPlayer; // 0xACD - 0xACD
   bool m_bTouchedByPlayer; // 0xACE - 0xACE
   bool m_bFirstCollisionAfterLaunch; // 0xACF - 0xACF
   std::int32_t m_iExploitableByPlayer; // 0xAD0 - 0xAD0
   bool m_bHasBeenAwakened; // 0xAD4 - 0xAD4
   bool m_bIsOverrideProp; // 0xAD5 - 0xAD5
   GameTime_t m_fNextCheckDisableMotionContactsTime; // 0xAD8 - 0xAD8
   std::int32_t m_iInitialGlowState; // 0xADC - 0xADC
   std::int32_t m_nGlowRange; // 0xAE0 - 0xAE0
   std::int32_t m_nGlowRangeMin; // 0xAE4 - 0xAE4
   Color m_glowColor; // 0xAE8 - 0xAE8
   bool m_bForceNavIgnore; // 0xAEC - 0xAEC
   bool m_bNoNavmeshBlocker; // 0xAED - 0xAED
   bool m_bForceNpcExclude; // 0xAEE - 0xAEE
   bool m_bShouldAutoConvertBackFromDebris; // 0xAEF - 0xAEF
   bool m_bMuteImpactEffects; // 0xAF0 - 0xAF0
   bool m_bAcceptDamageFromHeldObjects; // 0xAF8 - 0xAF8
   bool m_bEnableUseOutput; // 0xAF9 - 0xAF9
   bool m_bAwake; // 0xAFA - 0xAFA
   std::int32_t m_nCollisionGroupOverride; // 0xAFC - 0xAFC

}; // size - 0xB00


class CBaseTrigger : public CBaseToggle
{
public:

   bool m_bDisabled; // 0x770 - 0x770
   CUtlSymbolLarge m_iFilterName; // 0x778 - 0x778
   CHandle< CBaseFilter > m_hFilter; // 0x780 - 0x780
   CEntityIOOutput m_OnStartTouch; // 0x788 - 0x788
   CEntityIOOutput m_OnStartTouchAll; // 0x7B0 - 0x7B0
   CEntityIOOutput m_OnEndTouch; // 0x7D8 - 0x7D8
   CEntityIOOutput m_OnEndTouchAll; // 0x800 - 0x800
   CEntityIOOutput m_OnTouching; // 0x828 - 0x828
   CEntityIOOutput m_OnNotTouching; // 0x850 - 0x850
   CUtlVector< CHandle< CBaseEntity > > m_hTouchingEntities; // 0x878 - 0x878
   bool m_bClientSidePredicted; // 0x890 - 0x890

}; // size - 0x898


class CParticleFunctionPreEmission : public CParticleFunctionOperator
{
public:

   bool m_bRunOnce; // 0x1F0 - 0x1F0

}; // size - 0x200


class CPhysicsPropMultiplayer : public CPhysicsProp
{
public:


}; // size - 0xB00


class CBaseProp : public CBaseAnimGraph
{
public:

   bool m_bModelOverrodeBlockLOS; // 0x998 - 0x998
   std::int32_t m_iShapeType; // 0x99C - 0x99C
   bool m_bConformToCollisionBounds; // 0x9A0 - 0x9A0
   matrix3x4_t m_mPreferredCatchTransform; // 0x9A4 - 0x9A4

}; // size - 0x9D8


class CParticleFunctionRenderer : public CParticleFunction
{
public:

   CParticleVisibilityInputs VisibilityInputs; // 0x1E8 - 0x1E8
   bool m_bCannotBeRefracted; // 0x22C - 0x22C
   bool m_bSkipRenderingOnMobile; // 0x22D - 0x22D

}; // size - 0x230


class CWeaponCSBaseGun : public CWeaponCSBase
{
public:

   std::int32_t m_zoomLevel; // 0xD50 - 0xD50
   std::int32_t m_iBurstShotsRemaining; // 0xD54 - 0xD54
   std::int32_t m_silencedModelIndex; // 0xD60 - 0xD60
   bool m_inPrecache; // 0xD64 - 0xD64
   bool m_bNeedsBoltAction; // 0xD65 - 0xD65
   bool m_bSkillReloadAvailable; // 0xD66 - 0xD66
   bool m_bSkillReloadLiftedReloadKey; // 0xD67 - 0xD67
   bool m_bSkillBoltInterruptAvailable; // 0xD68 - 0xD68
   bool m_bSkillBoltLiftedFireKey; // 0xD69 - 0xD69

}; // size - 0xD70


class C_WeaponCSBaseGun : public C_WeaponCSBase
{
public:

   std::int32_t m_zoomLevel; // 0x13D0 - 0x13D0
   std::int32_t m_iBurstShotsRemaining; // 0x13D4 - 0x13D4
   std::int32_t m_iSilencerBodygroup; // 0x13D8 - 0x13D8
   std::int32_t m_silencedModelIndex; // 0x13E8 - 0x13E8
   bool m_inPrecache; // 0x13EC - 0x13EC
   bool m_bNeedsBoltAction; // 0x13ED - 0x13ED

}; // size - 0x13F0


class CBrBaseItem : public CPhysicsPropMultiplayer
{
public:


}; // size - 0xB28


class CEntityComponent
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class CUnaryUpdateNode : public CAnimUpdateNodeBase
{
public:

   CAnimUpdateNodeRef m_pChildNode; // 0x58 - 0x58

}; // size - 0x68


class C_BreakableProp : public CBaseProp
{
public:

   CEntityIOOutput m_OnBreak; // 0x9E0 - 0x9E0
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0xA08 - 0xA08
   CEntityIOOutput m_OnTakeDamage; // 0xA30 - 0xA30
   std::float_t m_impactEnergyScale; // 0xA58 - 0xA58
   std::int32_t m_iMinHealthDmg; // 0xA5C - 0xA5C
   std::float_t m_flPressureDelay; // 0xA60 - 0xA60
   CHandle< C_BaseEntity > m_hBreaker; // 0xA64 - 0xA64
   PerformanceMode_t m_PerformanceMode; // 0xA68 - 0xA68
   std::float_t m_flDmgModBullet; // 0xA6C - 0xA6C
   std::float_t m_flDmgModClub; // 0xA70 - 0xA70
   std::float_t m_flDmgModExplosive; // 0xA74 - 0xA74
   std::float_t m_flDmgModFire; // 0xA78 - 0xA78
   CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0xA80 - 0xA80
   CUtlSymbolLarge m_iszBasePropData; // 0xA88 - 0xA88
   std::int32_t m_iInteractions; // 0xA90 - 0xA90
   GameTime_t m_flPreventDamageBeforeTime; // 0xA94 - 0xA94
   bool m_bHasBreakPiecesOrCommands; // 0xA98 - 0xA98
   std::float_t m_explodeDamage; // 0xA9C - 0xA9C
   std::float_t m_explodeRadius; // 0xAA0 - 0xAA0
   std::float_t m_explosionDelay; // 0xAA8 - 0xAA8
   CUtlSymbolLarge m_explosionBuildupSound; // 0xAB0 - 0xAB0
   CUtlSymbolLarge m_explosionCustomEffect; // 0xAB8 - 0xAB8
   CUtlSymbolLarge m_explosionCustomSound; // 0xAC0 - 0xAC0
   CUtlSymbolLarge m_explosionModifier; // 0xAC8 - 0xAC8
   CHandle< C_BasePlayerPawn > m_hPhysicsAttacker; // 0xAD0 - 0xAD0
   GameTime_t m_flLastPhysicsInfluenceTime; // 0xAD4 - 0xAD4
   std::float_t m_flDefaultFadeScale; // 0xAD8 - 0xAD8
   CHandle< C_BaseEntity > m_hLastAttacker; // 0xADC - 0xADC
   CHandle< C_BaseEntity > m_hFlareEnt; // 0xAE0 - 0xAE0
   bool m_noGhostCollision; // 0xAE4 - 0xAE4

}; // size - 0xAE8


class CServerOnlyPointEntity : public CServerOnlyEntity
{
public:


}; // size - 0x4A0


class CParticleFunctionForce : public CParticleFunction
{
public:


}; // size - 0x1F0


class C_BaseCombatCharacter : public C_BaseFlex
{
public:

   enum class WaterWakeMode_t : std::uint32_t
   {
      WATER_WAKE_NONE = 0,
      WATER_WAKE_IDLE = 1,
      WATER_WAKE_WALKING = 2,
      WATER_WAKE_RUNNING = 3,
      WATER_WAKE_WATER_OVERHEAD = 4
   }

   C_NetworkUtlVectorBase< CHandle< C_EconWearable > > m_hMyWearables; // 0xB28 - 0xB28
   std::int32_t m_bloodColor; // 0xB40 - 0xB40
   AttachmentHandle_t m_leftFootAttachment; // 0xB44 - 0xB44
   AttachmentHandle_t m_rightFootAttachment; // 0xB45 - 0xB45
   C_BaseCombatCharacter::WaterWakeMode_t m_nWaterWakeMode; // 0xB48 - 0xB48
   std::float_t m_flWaterWorldZ; // 0xB4C - 0xB4C
   std::float_t m_flWaterNextTraceTime; // 0xB50 - 0xB50
   std::float_t m_flFieldOfView; // 0xB54 - 0xB54

}; // size - 0xBB8


class EventSimulate_t
{
public:

   EngineLoopState_t m_LoopState; // 0x0 - 0x0
   bool m_bFirstTick; // 0x28 - 0x28
   bool m_bLastTick; // 0x29 - 0x29

}; // size - 0x30


class CBoneConstraintBase
{
public:


}; // size - 0x28


class CPhysPropWeaponUpgrade : public CBrBaseItem
{
public:

   std::int32_t m_nEventPriority; // 0xB28 - 0xB28
   GameTime_t m_flTimeLastUsed; // 0xB2C - 0xB2C

}; // size - 0xB30


class CBaseFilter : public CLogicalEntity
{
public:

   bool m_bNegated; // 0x4A0 - 0x4A0
   CEntityIOOutput m_OnPass; // 0x4A8 - 0x4A8
   CEntityIOOutput m_OnFail; // 0x4D0 - 0x4D0

}; // size - 0x4F8


class CBaseGrenade : public CBaseFlex
{
public:

   CEntityIOOutput m_OnPlayerPickup; // 0x8B8 - 0x8B8
   CEntityIOOutput m_OnExplode; // 0x8E0 - 0x8E0
   bool m_bHasWarnedAI; // 0x908 - 0x908
   bool m_bIsSmokeGrenade; // 0x909 - 0x909
   bool m_bIsLive; // 0x90A - 0x90A
   std::float_t m_DmgRadius; // 0x90C - 0x90C
   GameTime_t m_flDetonateTime; // 0x910 - 0x910
   std::float_t m_flWarnAITime; // 0x914 - 0x914
   std::float_t m_flDamage; // 0x918 - 0x918
   CUtlSymbolLarge m_iszBounceSound; // 0x920 - 0x920
   CUtlString m_ExplosionSound; // 0x928 - 0x928
   CHandle< CBaseEntity > m_hThrower; // 0x934 - 0x934
   GameTime_t m_flNextAttack; // 0x950 - 0x950
   CHandle< CBaseEntity > m_hOriginalThrower; // 0x954 - 0x954

}; // size - 0x958


class CDynamicProp : public CBreakableProp
{
public:

   bool m_bCreateNavObstacle; // 0x9A0 - 0x9A0
   bool m_bUseHitboxesForRenderBox; // 0x9A1 - 0x9A1
   bool m_bUseAnimGraph; // 0x9A2 - 0x9A2
   CEntityIOOutput m_pOutputAnimBegun; // 0x9A8 - 0x9A8
   CEntityIOOutput m_pOutputAnimOver; // 0x9D0 - 0x9D0
   CEntityIOOutput m_pOutputAnimLoopCycleOver; // 0x9F8 - 0x9F8
   CEntityIOOutput m_OnAnimReachedStart; // 0xA20 - 0xA20
   CEntityIOOutput m_OnAnimReachedEnd; // 0xA48 - 0xA48
   CUtlSymbolLarge m_iszDefaultAnim; // 0xA70 - 0xA70
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0xA78 - 0xA78
   bool m_bAnimateOnServer; // 0xA7C - 0xA7C
   bool m_bRandomizeCycle; // 0xA7D - 0xA7D
   bool m_bStartDisabled; // 0xA7E - 0xA7E
   bool m_bScriptedMovement; // 0xA7F - 0xA7F
   bool m_bFiredStartEndOutput; // 0xA80 - 0xA80
   bool m_bForceNpcExclude; // 0xA81 - 0xA81
   bool m_bCreateNonSolid; // 0xA82 - 0xA82
   bool m_bIsOverrideProp; // 0xA83 - 0xA83
   std::int32_t m_iInitialGlowState; // 0xA84 - 0xA84
   std::int32_t m_nGlowRange; // 0xA88 - 0xA88
   std::int32_t m_nGlowRangeMin; // 0xA8C - 0xA8C
   Color m_glowColor; // 0xA90 - 0xA90
   std::int32_t m_nGlowTeam; // 0xA94 - 0xA94

}; // size - 0xA98


class CMotionMetricBase
{
public:

   std::float_t m_flWeight; // 0x20 - 0x20

}; // size - 0x28


class CMotionMetricEvaluator
{
public:

   CUtlVector< float32 > m_means; // 0x18 - 0x18
   CUtlVector< float32 > m_standardDeviations; // 0x30 - 0x30
   std::float_t m_flWeight; // 0x48 - 0x48
   std::int32_t m_nDimensionStartIndex; // 0x4C - 0x4C

}; // size - 0x50


class C_BaseToggle : public C_BaseModelEntity
{
public:


}; // size - 0x838


class CParticleFunctionConstraint : public CParticleFunction
{
public:


}; // size - 0x1F0


class CLeafUpdateNode : public CAnimUpdateNodeBase
{
public:


}; // size - 0x58


class CPhysConstraint : public CLogicalEntity
{
public:

   CUtlSymbolLarge m_nameAttach1; // 0x4A8 - 0x4A8
   CUtlSymbolLarge m_nameAttach2; // 0x4B0 - 0x4B0
   CUtlSymbolLarge m_breakSound; // 0x4B8 - 0x4B8
   std::float_t m_forceLimit; // 0x4C0 - 0x4C0
   std::float_t m_torqueLimit; // 0x4C4 - 0x4C4
   std::uint32_t m_teleportTick; // 0x4C8 - 0x4C8
   std::float_t m_minTeleportDistance; // 0x4CC - 0x4CC
   CEntityIOOutput m_OnBreak; // 0x4D0 - 0x4D0

}; // size - 0x4F8


class CAnimTagBase
{
public:

   CUtlString m_name; // 0x20 - 0x20
   CUtlString m_group; // 0x28 - 0x28
   AnimTagID m_tagID; // 0x30 - 0x30
   bool m_bIsReferenced; // 0x34 - 0x34

}; // size - 0x38


class CBaseCombatCharacter : public CBaseFlex
{
public:

   bool m_bForceServerRagdoll; // 0x8B0 - 0x8B0
   CNetworkUtlVectorBase< CHandle< CEconWearable > > m_hMyWearables; // 0x8B8 - 0x8B8
   std::float_t m_flFieldOfView; // 0x8D0 - 0x8D0
   std::float_t m_impactEnergyScale; // 0x8D4 - 0x8D4
   HitGroup_t m_LastHitGroup; // 0x8D8 - 0x8D8
   bool m_bApplyStressDamage; // 0x8DC - 0x8DC
   std::int32_t m_bloodColor; // 0x8E0 - 0x8E0
   std::int32_t m_registeredNavTeam; // 0x940 - 0x940
   std::int32_t m_navMeshID; // 0x944 - 0x944
   std::int32_t m_iDamageCount; // 0x948 - 0x948
   CUtlVector< RelationshipOverride_t >* m_pVecRelationships; // 0x950 - 0x950
   CUtlSymbolLarge m_strRelationships; // 0x958 - 0x958
   Hull_t m_eHull; // 0x960 - 0x960
   std::uint32_t m_nNavHullIdx; // 0x964 - 0x964

}; // size - 0x968


class C_BasePlayerPawn : public C_BaseCombatCharacter
{
public:

   CPlayer_WeaponServices* m_pWeaponServices; // 0xBB8 - 0xBB8
   CPlayer_ItemServices* m_pItemServices; // 0xBC0 - 0xBC0
   CPlayer_AutoaimServices* m_pAutoaimServices; // 0xBC8 - 0xBC8
   CPlayer_ObserverServices* m_pObserverServices; // 0xBD0 - 0xBD0
   CPlayer_WaterServices* m_pWaterServices; // 0xBD8 - 0xBD8
   CPlayer_UseServices* m_pUseServices; // 0xBE0 - 0xBE0
   CPlayer_FlashlightServices* m_pFlashlightServices; // 0xBE8 - 0xBE8
   CPlayer_CameraServices* m_pCameraServices; // 0xBF0 - 0xBF0
   CPlayer_MovementServices* m_pMovementServices; // 0xBF8 - 0xBF8
   QAngle v_angle; // 0xC08 - 0xC08
   std::uint32_t m_iHideHUD; // 0xC14 - 0xC14
   sky3dparams_t m_skybox3d; // 0xC18 - 0xC18
   GameTime_t m_flDeathTime; // 0xCA8 - 0xCA8
   Vector m_vecPredictionError; // 0xCAC - 0xCAC
   GameTime_t m_flPredictionErrorTime; // 0xCB8 - 0xCB8
   std::float_t m_flFOVSensitivityAdjust; // 0xCBC - 0xCBC
   std::float_t m_flMouseSensitivity; // 0xCC0 - 0xCC0
   Vector m_vOldOrigin; // 0xCC4 - 0xCC4
   std::float_t m_flOldSimulationTime; // 0xCD0 - 0xCD0
   std::int32_t m_nLastExecutedCommandNumber; // 0xCD4 - 0xCD4
   std::int32_t m_nLastExecutedCommandTick; // 0xCD8 - 0xCD8
   CHandle< CBasePlayerController > m_hController; // 0xCDC - 0xCDC
   bool m_bIsSwappingToPredictableController; // 0xCE0 - 0xCE0

}; // size - 0xCE8


class C_PhysicsProp : public C_BreakableProp
{
public:

   bool m_bAwake; // 0xAE8 - 0xAE8

}; // size - 0xAF0


class CAnimComponentBase
{
public:

   CUtlString m_group; // 0x18 - 0x18
   AnimComponentID m_id; // 0x28 - 0x28
   bool m_bStartEnabled; // 0x2C - 0x2C
   std::int32_t m_nPriority; // 0x30 - 0x30
   AnimNodeNetworkMode m_networkMode; // 0x34 - 0x34

}; // size - 0x38


class CAnimComponentUpdater
{
public:

   CUtlString m_name; // 0x18 - 0x18
   AnimComponentID m_id; // 0x20 - 0x20
   AnimNodeNetworkMode m_networkMode; // 0x24 - 0x24
   bool m_bStartEnabled; // 0x28 - 0x28

}; // size - 0x30


class CItem : public CBaseAnimGraph
{
public:

   CEntityIOOutput m_OnPlayerTouch; // 0x828 - 0x828
   bool m_bActivateWhenAtRest; // 0x850 - 0x850
   CEntityIOOutput m_OnCacheInteraction; // 0x858 - 0x858
   CEntityIOOutput m_OnPlayerPickup; // 0x880 - 0x880
   CEntityIOOutput m_OnGlovePulled; // 0x8A8 - 0x8A8
   Vector m_vOriginalSpawnOrigin; // 0x8D0 - 0x8D0
   QAngle m_vOriginalSpawnAngles; // 0x8DC - 0x8DC
   bool m_bPhysStartAsleep; // 0x8E8 - 0x8E8

}; // size - 0x8F8


class CModelConfigElement
{
public:

   CUtlString m_ElementName; // 0x8 - 0x8
   CUtlVector< CModelConfigElement* > m_NestedElements; // 0x10 - 0x10

}; // size - 0x48


class C_BaseGrenade : public C_BaseFlex
{
public:

   bool m_bHasWarnedAI; // 0xB28 - 0xB28
   bool m_bIsSmokeGrenade; // 0xB29 - 0xB29
   bool m_bIsLive; // 0xB2A - 0xB2A
   std::float_t m_DmgRadius; // 0xB2C - 0xB2C
   GameTime_t m_flDetonateTime; // 0xB30 - 0xB30
   std::float_t m_flWarnAITime; // 0xB34 - 0xB34
   std::float_t m_flDamage; // 0xB38 - 0xB38
   CUtlSymbolLarge m_iszBounceSound; // 0xB40 - 0xB40
   CUtlString m_ExplosionSound; // 0xB48 - 0xB48
   CHandle< C_BaseEntity > m_hThrower; // 0xB54 - 0xB54
   GameTime_t m_flNextAttack; // 0xB70 - 0xB70
   CHandle< C_BaseEntity > m_hOriginalThrower; // 0xB74 - 0xB74

}; // size - 0xB78


class CBtNode
{
public:


}; // size - 0x58


class CEntitySubclassVDataBase
{
public:


}; // size - 0x28


class C_CSGO_TeamPreviewCharacterPosition : public C_BaseEntity
{
public:

   std::int32_t m_nOrdinal; // 0x538 - 0x538
   CUtlString m_sWeaponName; // 0x540 - 0x540
   std::uint64_t m_xuid; // 0x548 - 0x548
   C_EconItemView m_weaponItem; // 0x550 - 0x550

}; // size - 0x9D0


class CBaseCSGrenade : public CWeaponCSBase
{
public:

   bool m_bRedraw; // 0xD70 - 0xD70
   bool m_bIsHeldByPlayer; // 0xD71 - 0xD71
   bool m_bPinPulled; // 0xD72 - 0xD72
   EGrenadeThrowState m_eThrowStatus; // 0xD74 - 0xD74
   GameTime_t m_fThrowTime; // 0xD78 - 0xD78
   std::float_t m_flThrowStrength; // 0xD7C - 0xD7C
   std::float_t m_flThrowStrengthApproach; // 0xD80 - 0xD80
   GameTime_t m_fDropTime; // 0xD84 - 0xD84

}; // size - 0xD90


class CNavVolume
{
public:


}; // size - 0x70


class C_BaseCSGrenade : public C_WeaponCSBase
{
public:

   bool m_bRedraw; // 0x13F0 - 0x13F0
   bool m_bIsHeldByPlayer; // 0x13F1 - 0x13F1
   bool m_bPinPulled; // 0x13F2 - 0x13F2
   EGrenadeThrowState m_eThrowStatus; // 0x13F4 - 0x13F4
   GameTime_t m_fThrowTime; // 0x13F8 - 0x13F8
   std::float_t m_flThrowStrength; // 0x13FC - 0x13FC
   std::float_t m_flThrowStrengthApproach; // 0x1400 - 0x1400
   GameTime_t m_fDropTime; // 0x1404 - 0x1404

}; // size - 0x1410


class C_PointEntity : public C_BaseEntity
{
public:


}; // size - 0x538


class CBaseConstraint : public CBoneConstraintBase
{
public:

   CUtlString m_name; // 0x28 - 0x28
   Vector m_vUpVector; // 0x30 - 0x30
   CUtlVector< CConstraintSlave > m_slaves; // 0x40 - 0x40
   CUtlVector< CConstraintTarget > m_targets; // 0x58 - 0x58

}; // size - 0x70


class CBasePlatTrain : public CBaseToggle
{
public:

   CUtlSymbolLarge m_NoiseMoving; // 0x770 - 0x770
   CUtlSymbolLarge m_NoiseArrived; // 0x778 - 0x778
   std::float_t m_volume; // 0x788 - 0x788
   std::float_t m_flTWidth; // 0x78C - 0x78C
   std::float_t m_flTLength; // 0x790 - 0x790

}; // size - 0x798


class CCSGO_TeamPreviewCharacterPosition : public CBaseEntity
{
public:

   std::int32_t m_nOrdinal; // 0x4A0 - 0x4A0
   CUtlString m_sWeaponName; // 0x4A8 - 0x4A8
   std::uint64_t m_xuid; // 0x4B0 - 0x4B0
   CEconItemView m_weaponItem; // 0x4B8 - 0x4B8

}; // size - 0x730


class CConditionBase
{
public:


}; // size - 0x28


class CPlayerControllerComponent
{
public:

   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x8

}; // size - 0x40


class CRuleEntity : public CBaseModelEntity
{
public:

   CUtlSymbolLarge m_iszMaster; // 0x6F0 - 0x6F0

}; // size - 0x6F8


class CMarkupVolume : public CBaseModelEntity
{
public:

   bool m_bEnabled; // 0x6F0 - 0x6F0

}; // size - 0x6F8


class CSimpleSimTimer
{
public:

   GameTime_t m_next; // 0x0 - 0x0
   WorldGroupId_t m_nWorldGroupId; // 0x4 - 0x4

}; // size - 0x8


class C_BaseClientUIEntity : public C_BaseModelEntity
{
public:

   bool m_bEnabled; // 0x840 - 0x840
   CUtlSymbolLarge m_DialogXMLName; // 0x848 - 0x848
   CUtlSymbolLarge m_PanelClassName; // 0x850 - 0x850
   CUtlSymbolLarge m_PanelID; // 0x858 - 0x858

}; // size - 0x868


class C_CSPlayerPawnBase : public C_BasePlayerPawn
{
public:

   CCSPlayer_ActionTrackingServices* m_pActionTrackingServices; // 0xD00 - 0xD00
   CCSPlayer_PingServices* m_pPingServices; // 0xD08 - 0xD08
   CCSPlayer_ViewModelServices* m_pViewModelServices; // 0xD10 - 0xD10
   float32 m_fRenderingClipPlane[4]; // 0xD18 - 0xD18
   std::int32_t m_nLastClipPlaneSetupFrame; // 0xD28 - 0xD28
   Vector m_vecLastClipCameraPos; // 0xD2C - 0xD2C
   Vector m_vecLastClipCameraForward; // 0xD38 - 0xD38
   bool m_bClipHitStaticWorld; // 0xD44 - 0xD44
   bool m_bCachedPlaneIsValid; // 0xD45 - 0xD45
   C_WeaponCSBase* m_pClippingWeapon; // 0xD48 - 0xD48
   CSPlayerState m_previousPlayerState; // 0xD50 - 0xD50
   std::float_t m_flLastCollisionCeiling; // 0xD54 - 0xD54
   std::float_t m_flLastCollisionCeilingChangeTime; // 0xD58 - 0xD58
   bool m_bInLanding; // 0xDB8 - 0xDB8
   std::float_t m_flLandingTime; // 0xDBC - 0xDBC
   GameTime_t m_grenadeParameterStashTime; // 0xDC0 - 0xDC0
   bool m_bGrenadeParametersStashed; // 0xDC4 - 0xDC4
   QAngle m_angStashedShootAngles; // 0xDC8 - 0xDC8
   Vector m_vecStashedGrenadeThrowPosition; // 0xDD4 - 0xDD4
   Vector m_vecStashedVelocity; // 0xDE0 - 0xDE0
   QAngle m_angShootAngleHistory[2]; // 0xDEC - 0xDEC
   Vector m_vecThrowPositionHistory[2]; // 0xE04 - 0xE04
   Vector m_vecVelocityHistory[2]; // 0xE1C - 0xE1C
   QAngle m_thirdPersonHeading; // 0xE38 - 0xE38
   std::float_t m_flSlopeDropOffset; // 0xE50 - 0xE50
   std::float_t m_flSlopeDropHeight; // 0xE60 - 0xE60
   Vector m_vHeadConstraintOffset; // 0xE70 - 0xE70
   bool m_bClientTransparentImmunityAlphaEffectEnabled; // 0xE88 - 0xE88
   bool m_bClientDeferDrawToImmunityAlphaPass; // 0xE89 - 0xE89
   bool m_bIsScoped; // 0xE8A - 0xE8A
   bool m_bIsWalking; // 0xE8B - 0xE8B
   bool m_bResumeZoom; // 0xE8C - 0xE8C
   CSPlayerState m_iPlayerState; // 0xE90 - 0xE90
   bool m_bIsDefusing; // 0xE94 - 0xE94
   bool m_bIsGrabbingHostage; // 0xE95 - 0xE95
   CSPlayerBlockingUseAction_t m_iBlockingUseActionInProgress; // 0xE98 - 0xE98
   bool m_bIsRescuing; // 0xE9C - 0xE9C
   GameTime_t m_fImmuneToGunGameDamageTime; // 0xEA0 - 0xEA0
   GameTime_t m_fImmuneToGunGameDamageTimeLast; // 0xEA4 - 0xEA4
   bool m_bGunGameImmunity; // 0xEA8 - 0xEA8
   bool m_bHasMovedSinceSpawn; // 0xEA9 - 0xEA9
   bool m_bMadeFinalGunGameProgressiveKill; // 0xEAA - 0xEAA
   std::int32_t m_iGunGameProgressiveWeaponIndex; // 0xEAC - 0xEAC
   std::int32_t m_iNumGunGameTRKillPoints; // 0xEB0 - 0xEB0
   std::int32_t m_iNumGunGameKillsWithCurrentWeapon; // 0xEB4 - 0xEB4
   std::uint32_t m_unTotalRoundDamageDealt; // 0xEB8 - 0xEB8
   std::float_t m_fMolotovUseTime; // 0xEBC - 0xEBC
   std::float_t m_fMolotovDamageTime; // 0xEC0 - 0xEC0
   bool m_bInBombZone; // 0xEC4 - 0xEC4
   std::int32_t m_nWhichBombZone; // 0xEC8 - 0xEC8
   bool m_bInBuyZone; // 0xECC - 0xECC
   bool m_bInNoDefuseArea; // 0xECD - 0xECD
   std::int32_t m_iThrowGrenadeCounter; // 0xED0 - 0xED0
   bool m_bWaitForNoAttack; // 0xED4 - 0xED4
   bool m_bIsRespawningForDMBonus; // 0xED5 - 0xED5
   std::float_t m_flGuardianTooFarDistFrac; // 0xED8 - 0xED8
   GameTime_t m_flDetectedByEnemySensorTime; // 0xEDC - 0xEDC
   std::float_t m_flNextGuardianTooFarWarning; // 0xEE0 - 0xEE0
   bool m_bSuppressGuardianTooFarWarningAudio; // 0xEE4 - 0xEE4
   bool m_bKilledByTaser; // 0xEE5 - 0xEE5
   std::int32_t m_iMoveState; // 0xEE8 - 0xEE8
   bool m_bCanMoveDuringFreezePeriod; // 0xEEC - 0xEEC
   bool m_isCurrentGunGameLeader; // 0xEED - 0xEED
   bool m_isCurrentGunGameTeamLeader; // 0xEEE - 0xEEE
   std::float_t m_flLowerBodyYawTarget; // 0xEF0 - 0xEF0
   bool m_bStrafing; // 0xEF4 - 0xEF4
   char m_szLastPlaceName[18]; // 0xEF5 - 0xEF5
   std::float_t m_flLastExoJumpTime; // 0xF08 - 0xF08
   GameTime_t m_flLastSpawnTimeIndex; // 0xF18 - 0xF18
   std::int32_t m_iAddonBits; // 0xF1C - 0xF1C
   std::int32_t m_iPrimaryAddon; // 0xF20 - 0xF20
   std::int32_t m_iSecondaryAddon; // 0xF24 - 0xF24
   std::int32_t m_iProgressBarDuration; // 0xF28 - 0xF28
   std::float_t m_flProgressBarStartTime; // 0xF2C - 0xF2C
   std::float_t m_flStamina; // 0xF30 - 0xF30
   std::int32_t m_iDirection; // 0xF34 - 0xF34
   std::int32_t m_iShotsFired; // 0xF38 - 0xF38
   bool m_bNightVisionOn; // 0xF3C - 0xF3C
   bool m_bHasNightVision; // 0xF3D - 0xF3D
   std::float_t m_flVelocityModifier; // 0xF40 - 0xF40
   std::float_t m_flGroundAccelLinearFracLastTime; // 0xF44 - 0xF44
   std::int32_t m_iStartAccount; // 0xF48 - 0xF48
   bool m_bIsSpawnRappelling; // 0xF4C - 0xF4C
   Vector m_vecSpawnRappellingRopeOrigin; // 0xF50 - 0xF50
   std::float_t m_flSpawnRappellingFadeOutForClientViewOffset; // 0xF5C - 0xF5C
   std::int32_t m_nSurvivalTeam; // 0xF60 - 0xF60
   CHandle< C_CSPlayerPawnBase > m_hSurvivalAssassinationTarget; // 0xF64 - 0xF64
   std::float_t m_flHealthShotBoostExpirationTime; // 0xF68 - 0xF68
   std::float_t m_flLastKnownParachuteScreenEffectAmount; // 0xF6C - 0xF6C
   Vector m_vecIntroStartEyePosition; // 0xF70 - 0xF70
   Vector m_vecIntroStartPlayerForward; // 0xF7C - 0xF7C
   std::float_t m_flClientDeathTime; // 0xF88 - 0xF88
   std::float_t m_flNightVisionAlpha; // 0xF94 - 0xF94
   bool m_bScreenTearFrameCaptured; // 0xF98 - 0xF98
   std::float_t m_flFlashBangTime; // 0xF9C - 0xF9C
   std::float_t m_flFlashScreenshotAlpha; // 0xFA0 - 0xFA0
   std::float_t m_flFlashOverlayAlpha; // 0xFA4 - 0xFA4
   bool m_bFlashBuildUp; // 0xFA8 - 0xFA8
   bool m_bFlashDspHasBeenCleared; // 0xFA9 - 0xFA9
   bool m_bFlashScreenshotHasBeenGrabbed; // 0xFAA - 0xFAA
   std::float_t m_flFlashMaxAlpha; // 0xFAC - 0xFAC
   std::float_t m_flFlashDuration; // 0xFB0 - 0xFB0
   std::float_t m_flLastFiredWeaponTime; // 0xFB4 - 0xFB4
   Vector m_lastStandingPos; // 0xFB8 - 0xFB8
   Vector m_vecLastMuzzleFlashPos; // 0xFC4 - 0xFC4
   QAngle m_angLastMuzzleFlashAngle; // 0xFD0 - 0xFD0
   CHandle< C_BaseEntity > m_hMuzzleFlashShape; // 0xFDC - 0xFDC
   std::int32_t m_iHealthBarRenderMaskIndex; // 0xFE0 - 0xFE0
   std::float_t m_flHealthFadeValue; // 0xFE4 - 0xFE4
   std::float_t m_flHealthFadeAlpha; // 0xFE8 - 0xFE8
   std::int32_t m_nMyCollisionGroup; // 0xFEC - 0xFEC
   std::float_t m_ignoreLadderJumpTime; // 0xFF0 - 0xFF0
   CountdownTimer m_ladderSurpressionTimer; // 0xFF8 - 0xFF8
   Vector m_lastLadderNormal; // 0x1010 - 0x1010
   Vector m_lastLadderPos; // 0x101C - 0x101C
   std::float_t m_flDeathCCWeight; // 0x1030 - 0x1030
   bool m_bOldIsScoped; // 0x1034 - 0x1034
   std::float_t m_flPrevRoundEndTime; // 0x1038 - 0x1038
   std::float_t m_flPrevMatchEndTime; // 0x103C - 0x103C
   std::uint16_t m_unCurrentEquipmentValue; // 0x1040 - 0x1040
   std::uint16_t m_unRoundStartEquipmentValue; // 0x1042 - 0x1042
   std::uint16_t m_unFreezetimeEndEquipmentValue; // 0x1044 - 0x1044
   bool m_passiveItems[4]; // 0x1046 - 0x1046
   Vector m_vecThirdPersonViewPositionOverride; // 0x104C - 0x104C
   std::int32_t m_nHeavyAssaultSuitCooldownRemaining; // 0x1058 - 0x1058
   std::int32_t m_ArmorValue; // 0x105C - 0x105C
   QAngle m_angEyeAngles; // 0x1060 - 0x1060
   bool m_bInHostageRescueZone; // 0x1078 - 0x1078
   std::float_t m_fNextThinkPushAway; // 0x107C - 0x107C
   bool m_bShouldAutobuyDMWeapons; // 0x1080 - 0x1080
   bool m_bShouldAutobuyNow; // 0x1081 - 0x1081
   bool m_bHud_MiniScoreHidden; // 0x1082 - 0x1082
   bool m_bHud_RadarHidden; // 0x1083 - 0x1083
   CEntityIndex m_nLastKillerIndex; // 0x1084 - 0x1084
   std::int32_t m_nLastConcurrentKilled; // 0x1088 - 0x1088
   std::int32_t m_nDeathCamMusic; // 0x108C - 0x108C
   CEntityIndex m_iIDEntIndex; // 0x1090 - 0x1090
   CountdownTimer m_delayTargetIDTimer; // 0x1098 - 0x1098
   CEntityIndex m_iTargetedWeaponEntIndex; // 0x10B0 - 0x10B0
   CEntityIndex m_iOldIDEntIndex; // 0x10B4 - 0x10B4
   CountdownTimer m_holdTargetIDTimer; // 0x10B8 - 0x10B8
   std::float_t m_flCurrentMusicStartTime; // 0x111C - 0x111C
   std::float_t m_flMusicRoundStartTime; // 0x1120 - 0x1120
   std::int32_t m_cycleLatch; // 0x1124 - 0x1124
   std::float_t m_serverIntendedCycle; // 0x1128 - 0x1128
   uint32 m_vecPlayerPatchEconIndices[5]; // 0x112C - 0x112C
   bool m_bClientEconPatchesNeedUpdate; // 0x1140 - 0x1140
   bool m_bHideTargetID; // 0x1141 - 0x1141
   std::float_t m_nextTaserShakeTime; // 0x1144 - 0x1144
   std::float_t m_firstTaserShakeTime; // 0x1148 - 0x1148
   std::float_t m_flLastSmokeOverlayAlpha; // 0x114C - 0x114C
   Vector m_vLastSmokeOverlayColor; // 0x1150 - 0x1150
   ParticleIndex_t m_nPlayerSmokedFx; // 0x115C - 0x115C
   std::float_t m_flLastKnownAccumulatedWeaponEncumbrance; // 0x1160 - 0x1160
   std::float_t m_flLastTimeComputedAccumulatedWeaponEncumbrance; // 0x1164 - 0x1164
   std::float_t m_flNextMagDropTime; // 0x1168 - 0x1168
   std::int32_t m_nLastMagDropAttachmentIndex; // 0x116C - 0x116C
   CUtlVector< C_BulletHitModel* > m_vecBulletHitModels; // 0x1170 - 0x1170
   CUtlVector< C_PickUpModelSlerper* > m_vecPickupModelSlerpers; // 0x1188 - 0x1188
   Vector m_vecLastAliveLocalVelocity; // 0x11A0 - 0x11A0
   std::float_t m_flLastNearbyItemHighlightCheck; // 0x11AC - 0x11AC
   bool m_bInSurvivalDangerZone; // 0x11B0 - 0x11B0
   bool m_bNearDangerZone; // 0x11B1 - 0x11B1
   EntitySpottedState_t m_entitySpottedState; // 0x11E8 - 0x11E8
   std::float_t m_flTimeOfLastInjury; // 0x1200 - 0x1200
   RelativeDamagedDirection_t m_nRelativeDirectionOfLastInjury; // 0x1204 - 0x1204
   std::int32_t m_nSurvivalTeamNumber; // 0x1208 - 0x1208
   std::float_t m_flNextSprayDecalTime; // 0x120C - 0x120C
   bool m_bPreviouslyInBuyZone; // 0x1210 - 0x1210
   std::uint32_t m_unPreviousWeaponHash; // 0x1214 - 0x1214
   std::uint32_t m_unWeaponHash; // 0x1218 - 0x1218
   bool m_bPrevDefuser; // 0x121C - 0x121C
   bool m_bPrevHelmet; // 0x121D - 0x121D
   std::int32_t m_nPrevArmorVal; // 0x1220 - 0x1220
   bool m_bGuardianShouldSprayCustomXMark; // 0x1224 - 0x1224
   QAngle m_aimPunchAngle; // 0x1228 - 0x1228
   QAngle m_aimPunchAngleVel; // 0x1234 - 0x1234
   std::int32_t m_aimPunchTickBase; // 0x1240 - 0x1240
   std::float_t m_aimPunchTickFraction; // 0x1244 - 0x1244
   CUtlVector< QAngle > m_aimPunchCache; // 0x1248 - 0x1248
   std::float_t m_flOldFallVelocity; // 0x1268 - 0x1268
   bool m_bHasDeathInfo; // 0x126C - 0x126C
   std::float_t m_flDeathInfoTime; // 0x1270 - 0x1270
   Vector m_vecDeathInfoOrigin; // 0x1274 - 0x1274
   bool m_bKilledByHeadshot; // 0x1280 - 0x1280
   CHandle< CCSPlayerController > m_hOriginalController; // 0x1284 - 0x1284
   std::float_t m_flLandseconds; // 0x1298 - 0x1298

}; // size - 0x12A0


class SpawnPoint : public CServerOnlyPointEntity
{
public:

   std::int32_t m_iPriority; // 0x4A0 - 0x4A0
   bool m_bEnabled; // 0x4A4 - 0x4A4
   std::int32_t m_nType; // 0x4A8 - 0x4A8

}; // size - 0x4B0


class CSoundOpvarSetPointBase : public CBaseEntity
{
public:

   bool m_bDisabled; // 0x4A0 - 0x4A0
   CEntityHandle m_hSource; // 0x4A4 - 0x4A4
   CUtlSymbolLarge m_iszSourceEntityName; // 0x4B0 - 0x4B0
   Vector m_vLastPosition; // 0x508 - 0x508
   CUtlSymbolLarge m_iszStackName; // 0x518 - 0x518
   CUtlSymbolLarge m_iszOperatorName; // 0x520 - 0x520
   CUtlSymbolLarge m_iszOpvarName; // 0x528 - 0x528
   std::int32_t m_iOpvarIndex; // 0x530 - 0x530
   bool m_bUseAutoCompare; // 0x534 - 0x534

}; // size - 0x538


class C_CSGO_MapPreviewCameraPath : public C_BaseEntity
{
public:

   std::float_t m_flZFar; // 0x538 - 0x538
   std::float_t m_flZNear; // 0x53C - 0x53C
   bool m_bLoop; // 0x540 - 0x540
   bool m_bVerticalFOV; // 0x541 - 0x541
   bool m_bConstantSpeed; // 0x542 - 0x542
   std::float_t m_flDuration; // 0x544 - 0x544
   std::float_t m_flPathLength; // 0x588 - 0x588
   std::float_t m_flPathDuration; // 0x58C - 0x58C

}; // size - 0x598


class C_SoundOpvarSetPointBase : public C_BaseEntity
{
public:

   CUtlSymbolLarge m_iszStackName; // 0x538 - 0x538
   CUtlSymbolLarge m_iszOperatorName; // 0x540 - 0x540
   CUtlSymbolLarge m_iszOpvarName; // 0x548 - 0x548
   std::int32_t m_iOpvarIndex; // 0x550 - 0x550
   bool m_bUseAutoCompare; // 0x554 - 0x554

}; // size - 0x558


class CAnimParameterBase
{
public:

   CAnimGraphSymbolWithStorage m_name; // 0x18 - 0x18
   CUtlString m_group; // 0x38 - 0x38
   AnimParamID m_id; // 0x40 - 0x40
   CUtlString m_componentName; // 0x58 - 0x58
   AnimParamButton_t m_previewButton; // 0x64 - 0x64
   bool m_bUseMostRecentValue; // 0x68 - 0x68
   bool m_bAutoReset; // 0x69 - 0x69
   AnimParamNetworkSetting m_eNetworkSetting; // 0x6C - 0x6C
   bool m_bGameWritable; // 0x70 - 0x70
   bool m_bGraphWritable; // 0x71 - 0x71
   bool m_bIsReferenced; // 0x72 - 0x72
   bool m_bNetworkingRequested; // 0x73 - 0x73

}; // size - 0x78


class CBaseCSGrenadeProjectile : public CBaseGrenade
{
public:

   Vector m_vInitialVelocity; // 0x958 - 0x958
   std::int32_t m_nBounces; // 0x964 - 0x964
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_nExplodeEffectIndex; // 0x968 - 0x968
   std::int32_t m_nExplodeEffectTickBegin; // 0x970 - 0x970
   Vector m_vecExplodeEffectOrigin; // 0x974 - 0x974
   std::uint8_t m_unOGSExtraFlags; // 0x980 - 0x980
   bool m_bDetonationRecorded; // 0x981 - 0x981
   GameTime_t m_flDetonateTime; // 0x984 - 0x984
   std::uint16_t m_nItemIndex; // 0x988 - 0x988
   Vector m_vecOriginalSpawnLocation; // 0x98C - 0x98C
   GameTime_t m_flLastBounceSoundTime; // 0x998 - 0x998

}; // size - 0x9A0


class CEnvSoundscape : public CServerOnlyEntity
{
public:

   CEntityIOOutput m_OnPlay; // 0x4A0 - 0x4A0
   std::float_t m_flRadius; // 0x4C8 - 0x4C8
   CUtlSymbolLarge m_soundscapeName; // 0x4D0 - 0x4D0
   CUtlSymbolLarge m_soundEventName; // 0x4D8 - 0x4D8
   bool m_bOverrideWithEvent; // 0x4E0 - 0x4E0
   std::int32_t m_soundscapeIndex; // 0x4E4 - 0x4E4
   std::int32_t m_soundscapeEntityListId; // 0x4E8 - 0x4E8
   std::uint32_t m_soundEventHash; // 0x4EC - 0x4EC
   CUtlSymbolLarge m_positionNames[8]; // 0x4F0 - 0x4F0
   CHandle< CEnvSoundscape > m_hProxySoundscape; // 0x530 - 0x530
   bool m_bDisabled; // 0x534 - 0x534

}; // size - 0x538


class CModelPointEntity : public CBaseModelEntity
{
public:


}; // size - 0x6F0


class CTriggerMultiple : public CBaseTrigger
{
public:

   CEntityIOOutput m_OnTrigger; // 0x898 - 0x898

}; // size - 0x8C0


class C_BaseTrigger : public C_BaseToggle
{
public:

   bool m_bDisabled; // 0x838 - 0x838
   bool m_bClientSidePredicted; // 0x839 - 0x839

}; // size - 0x840


class MaterialParam_t
{
public:

   CUtlString m_name; // 0x0 - 0x0

}; // size - 0x8


class CGameRules
{
public:

   char m_szQuestName[128]; // 0x8 - 0x8
   std::int32_t m_nQuestPhase; // 0x88 - 0x88

}; // size - 0x90


class C_GameRules
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class C_INIT_RemapParticleCountToScalar : public CParticleFunctionInitializer
{
public:

   ParticleAttributeIndex_t m_nFieldOutput; // 0x1F0 - 0x1F0
   std::int32_t m_nInputMin; // 0x1F4 - 0x1F4
   std::int32_t m_nInputMax; // 0x1F8 - 0x1F8
   std::int32_t m_nScaleControlPoint; // 0x1FC - 0x1FC
   std::int32_t m_nScaleControlPointField; // 0x200 - 0x200
   std::float_t m_flOutputMin; // 0x204 - 0x204
   std::float_t m_flOutputMax; // 0x208 - 0x208
   ParticleSetMethod_t m_nSetMethod; // 0x20C - 0x20C
   bool m_bActiveRange; // 0x210 - 0x210
   bool m_bInvert; // 0x211 - 0x211
   bool m_bWrap; // 0x212 - 0x212
   std::float_t m_flRemapBias; // 0x214 - 0x214

}; // size - 0x220


class CAnimMotorBase
{
public:

   CUtlString m_name; // 0x18 - 0x18
   bool m_bDefault; // 0x20 - 0x20

}; // size - 0x28


class CAnimMotorUpdaterBase
{
public:

   CUtlString m_name; // 0x10 - 0x10
   bool m_bDefault; // 0x18 - 0x18

}; // size - 0x20


class CAnimationGraphVisualizerPrimitiveBase
{
public:

   CAnimationGraphVisualizerPrimitiveType m_Type; // 0x8 - 0x8

}; // size - 0x10


class CBaseClientUIEntity : public CBaseModelEntity
{
public:

   bool m_bEnabled; // 0x6F0 - 0x6F0
   CUtlSymbolLarge m_DialogXMLName; // 0x6F8 - 0x6F8
   CUtlSymbolLarge m_PanelClassName; // 0x700 - 0x700
   CUtlSymbolLarge m_PanelID; // 0x708 - 0x708
   CEntityIOOutput m_CustomOutput0; // 0x710 - 0x710
   CEntityIOOutput m_CustomOutput1; // 0x738 - 0x738
   CEntityIOOutput m_CustomOutput2; // 0x760 - 0x760
   CEntityIOOutput m_CustomOutput3; // 0x788 - 0x788
   CEntityIOOutput m_CustomOutput4; // 0x7B0 - 0x7B0
   CEntityIOOutput m_CustomOutput5; // 0x7D8 - 0x7D8
   CEntityIOOutput m_CustomOutput6; // 0x800 - 0x800
   CEntityIOOutput m_CustomOutput7; // 0x828 - 0x828
   CEntityIOOutput m_CustomOutput8; // 0x850 - 0x850
   CEntityIOOutput m_CustomOutput9; // 0x878 - 0x878

}; // size - 0x8A0


class CBodyComponent : public CEntityComponent
{
public:

   CGameSceneNode* m_pSceneNode; // 0x8 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x20 - 0x20

}; // size - 0x50


class CBodyComponent : public CEntityComponent
{
public:

   CGameSceneNode* m_pSceneNode; // 0x8 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x20 - 0x20

}; // size - 0x50


class C_DynamicProp : public C_BreakableProp
{
public:

   bool m_bUseHitboxesForRenderBox; // 0xAE8 - 0xAE8
   bool m_bUseAnimGraph; // 0xAE9 - 0xAE9
   CEntityIOOutput m_pOutputAnimBegun; // 0xAF0 - 0xAF0
   CEntityIOOutput m_pOutputAnimOver; // 0xB18 - 0xB18
   CEntityIOOutput m_pOutputAnimLoopCycleOver; // 0xB40 - 0xB40
   CEntityIOOutput m_OnAnimReachedStart; // 0xB68 - 0xB68
   CEntityIOOutput m_OnAnimReachedEnd; // 0xB90 - 0xB90
   CUtlSymbolLarge m_iszDefaultAnim; // 0xBB8 - 0xBB8
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0xBC0 - 0xBC0
   bool m_bAnimateOnServer; // 0xBC4 - 0xBC4
   bool m_bRandomizeCycle; // 0xBC5 - 0xBC5
   bool m_bStartDisabled; // 0xBC6 - 0xBC6
   bool m_bScriptedMovement; // 0xBC7 - 0xBC7
   bool m_bFiredStartEndOutput; // 0xBC8 - 0xBC8
   bool m_bForceNpcExclude; // 0xBC9 - 0xBC9
   bool m_bCreateNonSolid; // 0xBCA - 0xBCA
   bool m_bIsOverrideProp; // 0xBCB - 0xBCB
   std::int32_t m_iInitialGlowState; // 0xBCC - 0xBCC
   std::int32_t m_nGlowRange; // 0xBD0 - 0xBD0
   std::int32_t m_nGlowRangeMin; // 0xBD4 - 0xBD4
   Color m_glowColor; // 0xBD8 - 0xBD8
   std::int32_t m_nGlowTeam; // 0xBDC - 0xBDC
   std::int32_t m_iCachedFrameCount; // 0xBE0 - 0xBE0
   Vector m_vecCachedRenderMins; // 0xBE4 - 0xBE4
   Vector m_vecCachedRenderMaxs; // 0xBF0 - 0xBF0

}; // size - 0xC00


class CBasePropDoor : public CDynamicProp
{
public:

   std::float_t m_flAutoReturnDelay; // 0xAA8 - 0xAA8
   CUtlVector< CHandle< CBasePropDoor > > m_hDoorList; // 0xAB0 - 0xAB0
   std::int32_t m_nHardwareType; // 0xAC8 - 0xAC8
   bool m_bNeedsHardware; // 0xACC - 0xACC
   DoorState_t m_eDoorState; // 0xAD0 - 0xAD0
   bool m_bLocked; // 0xAD4 - 0xAD4
   Vector m_closedPosition; // 0xAD8 - 0xAD8
   QAngle m_closedAngles; // 0xAE4 - 0xAE4
   CHandle< CBaseEntity > m_hBlocker; // 0xAF0 - 0xAF0
   bool m_bFirstBlocked; // 0xAF4 - 0xAF4
   locksound_t m_ls; // 0xAF8 - 0xAF8
   bool m_bForceClosed; // 0xB18 - 0xB18
   Vector m_vecLatchWorldPosition; // 0xB1C - 0xB1C
   CHandle< CBaseEntity > m_hActivator; // 0xB28 - 0xB28
   std::uint32_t m_sndParamAngularSpeed; // 0xB34 - 0xB34
   CUtlSymbolLarge m_SoundMoving; // 0xB38 - 0xB38
   CUtlSymbolLarge m_SoundOpen; // 0xB40 - 0xB40
   CUtlSymbolLarge m_SoundClose; // 0xB48 - 0xB48
   CUtlSymbolLarge m_SoundLock; // 0xB50 - 0xB50
   CUtlSymbolLarge m_SoundUnlock; // 0xB58 - 0xB58
   CUtlSymbolLarge m_SoundLatch; // 0xB60 - 0xB60
   CUtlSymbolLarge m_SoundPound; // 0xB68 - 0xB68
   CUtlSymbolLarge m_SoundJiggle; // 0xB70 - 0xB70
   CUtlSymbolLarge m_SoundLockedAnim; // 0xB78 - 0xB78
   std::int32_t m_numCloseAttempts; // 0xB80 - 0xB80
   CUtlStringToken m_nPhysicsMaterial; // 0xB84 - 0xB84
   CUtlSymbolLarge m_SlaveName; // 0xB88 - 0xB88
   CHandle< CBasePropDoor > m_hMaster; // 0xB90 - 0xB90
   CEntityIOOutput m_OnBlockedClosing; // 0xB98 - 0xB98
   CEntityIOOutput m_OnBlockedOpening; // 0xBC0 - 0xBC0
   CEntityIOOutput m_OnUnblockedClosing; // 0xBE8 - 0xBE8
   CEntityIOOutput m_OnUnblockedOpening; // 0xC10 - 0xC10
   CEntityIOOutput m_OnFullyClosed; // 0xC38 - 0xC38
   CEntityIOOutput m_OnFullyOpen; // 0xC60 - 0xC60
   CEntityIOOutput m_OnClose; // 0xC88 - 0xC88
   CEntityIOOutput m_OnOpen; // 0xCB0 - 0xCB0
   CEntityIOOutput m_OnLockedUse; // 0xCD8 - 0xCD8
   CEntityIOOutput m_OnAjarOpen; // 0xD00 - 0xD00

}; // size - 0xD28


class CBaseRendererSource2 : public CParticleFunctionRenderer
{
public:

   CParticleCollectionFloatInput m_flRadiusScale; // 0x230 - 0x230
   CParticleCollectionFloatInput m_flAlphaScale; // 0x368 - 0x368
   CParticleCollectionFloatInput m_flRollScale; // 0x4A0 - 0x4A0
   ParticleAttributeIndex_t m_nAlpha2Field; // 0x5D8 - 0x5D8
   CParticleCollectionVecInput m_vecColorScale; // 0x5E0 - 0x5E0
   ParticleColorBlendType_t m_nColorBlendType; // 0xBA8 - 0xBA8
   SpriteCardShaderType_t m_nShaderType; // 0xBAC - 0xBAC
   CUtlString m_strShaderOverride; // 0xBB0 - 0xBB0
   CParticleCollectionFloatInput m_flCenterXOffset; // 0xBB8 - 0xBB8
   CParticleCollectionFloatInput m_flCenterYOffset; // 0xCF0 - 0xCF0
   std::float_t m_flBumpStrength; // 0xE28 - 0xE28
   ParticleSequenceCropOverride_t m_nCropTextureOverride; // 0xE2C - 0xE2C
   CUtlVector< TextureGroup_t > m_vecTexturesInput; // 0xE30 - 0xE30
   std::float_t m_flAnimationRate; // 0xE48 - 0xE48
   AnimationType_t m_nAnimationType; // 0xE4C - 0xE4C
   bool m_bAnimateInFPS; // 0xE50 - 0xE50
   CParticleCollectionFloatInput m_flSelfIllumAmount; // 0xE58 - 0xE58
   CParticleCollectionFloatInput m_flDiffuseAmount; // 0xF90 - 0xF90
   std::int32_t m_nLightingControlPoint; // 0x10C8 - 0x10C8
   ParticleAttributeIndex_t m_nSelfIllumPerParticle; // 0x10CC - 0x10CC
   ParticleOutputBlendMode_t m_nOutputBlendMode; // 0x10D0 - 0x10D0
   bool m_bGammaCorrectVertexColors; // 0x10D4 - 0x10D4
   bool m_bSaturateColorPreAlphaBlend; // 0x10D5 - 0x10D5
   CParticleCollectionFloatInput m_flAddSelfAmount; // 0x10D8 - 0x10D8
   CParticleCollectionFloatInput m_flDesaturation; // 0x1210 - 0x1210
   CParticleCollectionFloatInput m_flOverbrightFactor; // 0x1348 - 0x1348
   std::int32_t m_nHSVShiftControlPoint; // 0x1480 - 0x1480
   ParticleFogType_t m_nFogType; // 0x1484 - 0x1484
   bool m_bTintByFOW; // 0x1488 - 0x1488
   bool m_bTintByGlobalLight; // 0x1489 - 0x1489
   SpriteCardPerParticleScale_t m_nPerParticleAlphaReference; // 0x148C - 0x148C
   SpriteCardPerParticleScale_t m_nPerParticleAlphaRefWindow; // 0x1490 - 0x1490
   ParticleAlphaReferenceType_t m_nAlphaReferenceType; // 0x1494 - 0x1494
   CParticleCollectionFloatInput m_flAlphaReferenceSoftness; // 0x1498 - 0x1498
   CParticleCollectionFloatInput m_flSourceAlphaValueToMapToZero; // 0x15D0 - 0x15D0
   CParticleCollectionFloatInput m_flSourceAlphaValueToMapToOne; // 0x1708 - 0x1708
   bool m_bRefract; // 0x1840 - 0x1840
   bool m_bRefractSolid; // 0x1841 - 0x1841
   CParticleCollectionFloatInput m_flRefractAmount; // 0x1848 - 0x1848
   std::int32_t m_nRefractBlurRadius; // 0x1980 - 0x1980
   BlurFilterType_t m_nRefractBlurType; // 0x1984 - 0x1984
   bool m_bOnlyRenderInEffectsBloomPass; // 0x1988 - 0x1988
   bool m_bOnlyRenderInEffectsWaterPass; // 0x1989 - 0x1989
   bool m_bUseMixedResolutionRendering; // 0x198A - 0x198A
   bool m_bOnlyRenderInEffecsGameOverlay; // 0x198B - 0x198B
   char m_stencilTestID[128]; // 0x198C - 0x198C
   bool m_bStencilTestExclude; // 0x1A0C - 0x1A0C
   char m_stencilWriteID[128]; // 0x1A0D - 0x1A0D
   bool m_bWriteStencilOnDepthPass; // 0x1A8D - 0x1A8D
   bool m_bWriteStencilOnDepthFail; // 0x1A8E - 0x1A8E
   bool m_bReverseZBuffering; // 0x1A8F - 0x1A8F
   bool m_bDisableZBuffering; // 0x1A90 - 0x1A90
   ParticleDepthFeatheringMode_t m_nFeatheringMode; // 0x1A94 - 0x1A94
   CParticleCollectionFloatInput m_flFeatheringMinDist; // 0x1A98 - 0x1A98
   CParticleCollectionFloatInput m_flFeatheringMaxDist; // 0x1BD0 - 0x1BD0
   CParticleCollectionFloatInput m_flFeatheringFilter; // 0x1D08 - 0x1D08
   std::float_t m_flDepthBias; // 0x1E40 - 0x1E40
   ParticleSortingChoiceList_t m_nSortMethod; // 0x1E44 - 0x1E44
   bool m_bBlendFramesSeq0; // 0x1E48 - 0x1E48
   bool m_bMaxLuminanceBlendingSequence0; // 0x1E49 - 0x1E49

}; // size - 0x2050


class CFuncPlat : public CBasePlatTrain
{
public:

   CUtlSymbolLarge m_sNoise; // 0x798 - 0x798

}; // size - 0x7A0


class CLightEntity : public CBaseModelEntity
{
public:

   CLightComponent* m_CLightComponent; // 0x6F0 - 0x6F0

}; // size - 0x6F8


class CMarkupVolumeTagged : public CMarkupVolume
{
public:

   bool m_bIsGroup; // 0x728 - 0x728
   bool m_bGroupByPrefab; // 0x729 - 0x729
   bool m_bGroupByVolume; // 0x72A - 0x72A
   bool m_bGroupOtherGroups; // 0x72B - 0x72B
   bool m_bIsInGroup; // 0x72C - 0x72C

}; // size - 0x730


class C_LightEntity : public C_BaseModelEntity
{
public:

   CLightComponent* m_CLightComponent; // 0x838 - 0x838

}; // size - 0x840


class CAnimActionBase
{
public:


}; // size - 0x28


class CAnimActionUpdater
{
public:


}; // size - 0x18


class CBasePlayerPawn : public CBaseCombatCharacter
{
public:

   CPlayer_WeaponServices* m_pWeaponServices; // 0x968 - 0x968
   CPlayer_ItemServices* m_pItemServices; // 0x970 - 0x970
   CPlayer_AutoaimServices* m_pAutoaimServices; // 0x978 - 0x978
   CPlayer_ObserverServices* m_pObserverServices; // 0x980 - 0x980
   CPlayer_WaterServices* m_pWaterServices; // 0x988 - 0x988
   CPlayer_UseServices* m_pUseServices; // 0x990 - 0x990
   CPlayer_FlashlightServices* m_pFlashlightServices; // 0x998 - 0x998
   CPlayer_CameraServices* m_pCameraServices; // 0x9A0 - 0x9A0
   CPlayer_MovementServices* m_pMovementServices; // 0x9A8 - 0x9A8
   QAngle v_angle; // 0x9B8 - 0x9B8
   std::uint32_t m_iHideHUD; // 0x9D4 - 0x9D4
   sky3dparams_t m_skybox3d; // 0x9D8 - 0x9D8
   GameTime_t m_fTimeLastHurt; // 0xA68 - 0xA68
   GameTime_t m_flDeathTime; // 0xA6C - 0xA6C
   GameTime_t m_fNextSuicideTime; // 0xA70 - 0xA70
   bool m_fInitHUD; // 0xA74 - 0xA74
   GameTime_t m_flNextDecalTime; // 0xA78 - 0xA78
   CAI_Expresser* m_pExpresser; // 0xA80 - 0xA80
   CHandle< CBasePlayerController > m_hController; // 0xA88 - 0xA88
   std::float_t m_fHltvReplayDelay; // 0xA90 - 0xA90
   std::float_t m_fHltvReplayEnd; // 0xA94 - 0xA94
   CEntityIndex m_iHltvReplayEntity; // 0xA98 - 0xA98

}; // size - 0xAA0


class CParticleFunctionEmitter : public CParticleFunction
{
public:

   std::int32_t m_nEmitterIndex; // 0x1E8 - 0x1E8

}; // size - 0x1F0


class CSprite : public CBaseModelEntity
{
public:

   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hSpriteMaterial; // 0x6F0 - 0x6F0
   CHandle< CBaseEntity > m_hAttachedToEntity; // 0x6F8 - 0x6F8
   AttachmentHandle_t m_nAttachment; // 0x6FC - 0x6FC
   std::float_t m_flSpriteFramerate; // 0x700 - 0x700
   std::float_t m_flFrame; // 0x704 - 0x704
   GameTime_t m_flDieTime; // 0x708 - 0x708
   std::uint32_t m_nBrightness; // 0x718 - 0x718
   std::float_t m_flBrightnessDuration; // 0x71C - 0x71C
   std::float_t m_flSpriteScale; // 0x720 - 0x720
   std::float_t m_flScaleDuration; // 0x724 - 0x724
   bool m_bWorldSpaceScale; // 0x728 - 0x728
   std::float_t m_flGlowProxySize; // 0x72C - 0x72C
   std::float_t m_flHDRColorScale; // 0x730 - 0x730
   GameTime_t m_flLastTime; // 0x734 - 0x734
   std::float_t m_flMaxFrame; // 0x738 - 0x738
   std::float_t m_flStartScale; // 0x73C - 0x73C
   std::float_t m_flDestScale; // 0x740 - 0x740
   GameTime_t m_flScaleTimeStart; // 0x744 - 0x744
   std::int32_t m_nStartBrightness; // 0x748 - 0x748
   std::int32_t m_nDestBrightness; // 0x74C - 0x74C
   GameTime_t m_flBrightnessTimeStart; // 0x750 - 0x750
   std::int32_t m_nSpriteWidth; // 0x754 - 0x754
   std::int32_t m_nSpriteHeight; // 0x758 - 0x758

}; // size - 0x760


class C_BaseCSGrenadeProjectile : public C_BaseGrenade
{
public:

   Vector m_vInitialVelocity; // 0xB78 - 0xB78
   std::int32_t m_nBounces; // 0xB84 - 0xB84
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_nExplodeEffectIndex; // 0xB88 - 0xB88
   std::int32_t m_nExplodeEffectTickBegin; // 0xB90 - 0xB90
   Vector m_vecExplodeEffectOrigin; // 0xB94 - 0xB94
   GameTime_t m_flSpawnTime; // 0xBA0 - 0xBA0
   Vector vecLastTrailLinePos; // 0xBA4 - 0xBA4
   GameTime_t flNextTrailLineTime; // 0xBB0 - 0xBB0
   bool m_bExplodeEffectBegan; // 0xBB4 - 0xBB4
   bool m_bCanCreateGrenadeTrail; // 0xBB5 - 0xBB5
   ParticleIndex_t m_nSnapshotTrajectoryEffectIndex; // 0xBB8 - 0xBB8
   CStrongHandle< InfoForResourceTypeIParticleSnapshot > m_hSnapshotTrajectoryParticleSnapshot; // 0xBC0 - 0xBC0
   CUtlVector< Vector > m_arrTrajectoryTrailPoints; // 0xBC8 - 0xBC8
   CUtlVector< float32 > m_arrTrajectoryTrailPointCreationTimes; // 0xBE0 - 0xBE0
   std::float_t m_flTrajectoryTrailEffectCreationTime; // 0xBF8 - 0xBF8

}; // size - 0xC00


class C_CSGO_TeamPreviewCamera : public C_CSGO_MapPreviewCameraPath
{
public:

   bool m_bDofEnabled; // 0x598 - 0x598
   std::float_t m_flDofNearBlurry; // 0x59C - 0x59C
   std::float_t m_flDofNearCrisp; // 0x5A0 - 0x5A0
   std::float_t m_flDofFarCrisp; // 0x5A4 - 0x5A4
   std::float_t m_flDofFarBlurry; // 0x5A8 - 0x5A8
   std::float_t m_flDofTiltToGround; // 0x5AC - 0x5AC

}; // size - 0x5B0


class C_CSPlayerPawn : public C_CSPlayerPawnBase
{
public:

   CCSPlayer_BulletServices* m_pBulletServices; // 0x12A0 - 0x12A0
   CCSPlayer_HostageServices* m_pHostageServices; // 0x12A8 - 0x12A8
   CCSPlayer_GlowServices* m_pGlowServices; // 0x12B0 - 0x12B0
   bool m_bIsBuyMenuOpen; // 0x12B8 - 0x12B8
   std::int32_t m_iRetakesOffering; // 0x1388 - 0x1388
   std::int32_t m_iRetakesOfferingCard; // 0x138C - 0x138C
   bool m_bRetakesHasDefuseKit; // 0x1390 - 0x1390
   bool m_bRetakesMVPLastRound; // 0x1391 - 0x1391
   std::int32_t m_iRetakesMVPBoostItem; // 0x1394 - 0x1394
   loadout_positions_t m_RetakesMVPBoostExtraUtility; // 0x1398 - 0x1398
   bool m_bNeedToReApplyGloves; // 0x13AC - 0x13AC
   C_EconItemView m_EconGloves; // 0x13B0 - 0x13B0
   bool m_bMustSyncRagdollState; // 0x17F8 - 0x17F8
   std::int32_t m_nRagdollDamageBone; // 0x17FC - 0x17FC
   Vector m_vRagdollDamageForce; // 0x1800 - 0x1800
   Vector m_vRagdollDamagePosition; // 0x180C - 0x180C
   char m_szRagdollDamageWeaponName[64]; // 0x1818 - 0x1818
   bool m_bRagdollDamageHeadshot; // 0x1858 - 0x1858
   bool m_bLastHeadBoneTransformIsValid; // 0x1980 - 0x1980
   QAngle m_qDeathEyeAngles; // 0x199C - 0x199C

}; // size - 0x19A8


class C_PhysicsPropMultiplayer : public C_PhysicsProp
{
public:


}; // size - 0xAF0


class RnShapeDesc_t
{
public:

   std::uint32_t m_nCollisionAttributeIndex; // 0x0 - 0x0
   std::uint32_t m_nSurfacePropertyIndex; // 0x4 - 0x4
   CUtlString m_UserFriendlyName; // 0x8 - 0x8

}; // size - 0x10


class CBaseButton : public CBaseToggle
{
public:

   QAngle m_angMoveEntitySpace; // 0x770 - 0x770
   bool m_fStayPushed; // 0x77C - 0x77C
   bool m_fRotating; // 0x77D - 0x77D
   locksound_t m_ls; // 0x780 - 0x780
   CUtlSymbolLarge m_sUseSound; // 0x7A0 - 0x7A0
   CUtlSymbolLarge m_sLockedSound; // 0x7A8 - 0x7A8
   CUtlSymbolLarge m_sUnlockedSound; // 0x7B0 - 0x7B0
   bool m_bLocked; // 0x7B8 - 0x7B8
   bool m_bDisabled; // 0x7B9 - 0x7B9
   GameTime_t m_flUseLockedTime; // 0x7BC - 0x7BC
   bool m_bSolidBsp; // 0x7C0 - 0x7C0
   CEntityIOOutput m_OnDamaged; // 0x7C8 - 0x7C8
   CEntityIOOutput m_OnPressed; // 0x7F0 - 0x7F0
   CEntityIOOutput m_OnUseLocked; // 0x818 - 0x818
   CEntityIOOutput m_OnIn; // 0x840 - 0x840
   CEntityIOOutput m_OnOut; // 0x868 - 0x868
   std::int32_t m_nState; // 0x890 - 0x890
   CEntityHandle m_hConstraint; // 0x894 - 0x894
   CEntityHandle m_hConstraintParent; // 0x898 - 0x898
   bool m_bForceNpcExclude; // 0x89C - 0x89C
   CUtlSymbolLarge m_sGlowEntity; // 0x8A0 - 0x8A0
   CHandle< CBaseModelEntity > m_glowEntity; // 0x8A8 - 0x8A8
   bool m_usable; // 0x8AC - 0x8AC
   CUtlSymbolLarge m_szDisplayText; // 0x8B0 - 0x8B0

}; // size - 0x8B8


class CSoundOpvarSetPointEntity : public CSoundOpvarSetPointBase
{
public:

   CEntityIOOutput m_OnEnter; // 0x538 - 0x538
   CEntityIOOutput m_OnExit; // 0x560 - 0x560
   bool m_bAutoDisable; // 0x588 - 0x588
   std::float_t m_flDistanceMin; // 0x5CC - 0x5CC
   std::float_t m_flDistanceMax; // 0x5D0 - 0x5D0
   std::float_t m_flDistanceMapMin; // 0x5D4 - 0x5D4
   std::float_t m_flDistanceMapMax; // 0x5D8 - 0x5D8
   std::float_t m_flOcclusionRadius; // 0x5DC - 0x5DC
   std::float_t m_flOcclusionMin; // 0x5E0 - 0x5E0
   std::float_t m_flOcclusionMax; // 0x5E4 - 0x5E4
   std::float_t m_flValSetOnDisable; // 0x5E8 - 0x5E8
   bool m_bSetValueOnDisable; // 0x5EC - 0x5EC
   std::int32_t m_nSimulationMode; // 0x5F0 - 0x5F0
   std::int32_t m_nVisibilitySamples; // 0x5F4 - 0x5F4
   Vector m_vDynamicProxyPoint; // 0x5F8 - 0x5F8
   std::float_t m_flDynamicMaximumOcclusion; // 0x604 - 0x604
   CEntityHandle m_hDynamicEntity; // 0x608 - 0x608
   CUtlSymbolLarge m_iszDynamicEntityName; // 0x610 - 0x610
   std::float_t m_flPathingDistanceNormFactor; // 0x618 - 0x618
   Vector m_vPathingSourcePos; // 0x61C - 0x61C
   Vector m_vPathingListenerPos; // 0x628 - 0x628

}; // size - 0x638


class C_SoundOpvarSetPointEntity : public C_SoundOpvarSetPointBase
{
public:


}; // size - 0x558


class CBinaryUpdateNode : public CAnimUpdateNodeBase
{
public:

   CAnimUpdateNodeRef m_pChild1; // 0x58 - 0x58
   CAnimUpdateNodeRef m_pChild2; // 0x68 - 0x68
   BinaryNodeTiming m_timingBehavior; // 0x78 - 0x78
   std::float_t m_flTimingBlend; // 0x7C - 0x7C
   bool m_bResetChild1; // 0x80 - 0x80
   bool m_bResetChild2; // 0x81 - 0x81

}; // size - 0x88


class CGeneralRandomRotation : public CParticleFunctionInitializer
{
public:

   ParticleAttributeIndex_t m_nFieldOutput; // 0x1F0 - 0x1F0
   std::float_t m_flDegrees; // 0x1F4 - 0x1F4
   std::float_t m_flDegreesMin; // 0x1F8 - 0x1F8
   std::float_t m_flDegreesMax; // 0x1FC - 0x1FC
   std::float_t m_flRotationRandExponent; // 0x200 - 0x200
   bool m_bRandomlyFlipDirection; // 0x204 - 0x204

}; // size - 0x210


class CGlowOverlay
{
public:

   Vector m_vPos; // 0x8 - 0x8
   bool m_bDirectional; // 0x14 - 0x14
   Vector m_vDirection; // 0x18 - 0x18
   bool m_bInSky; // 0x24 - 0x24
   std::float_t m_skyObstructionScale; // 0x28 - 0x28
   CGlowSprite m_Sprites[4]; // 0x30 - 0x30
   std::int32_t m_nSprites; // 0xB0 - 0xB0
   std::float_t m_flProxyRadius; // 0xB4 - 0xB4
   std::float_t m_flHDRColorScale; // 0xB8 - 0xB8
   std::float_t m_flGlowObstructionScale; // 0xBC - 0xBC
   bool m_bCacheGlowObstruction; // 0xC0 - 0xC0
   bool m_bCacheSkyObstruction; // 0xC1 - 0xC1
   std::int16_t m_bActivated; // 0xC2 - 0xC2
   std::uint16_t m_ListIndex; // 0xC4 - 0xC4
   std::int32_t m_queryHandle; // 0xC8 - 0xC8

}; // size - 0xD0


class CParticleFloatInput
{
public:

   ParticleFloatType_t m_nType; // 0x0 - 0x0
   ParticleFloatMapType_t m_nMapType; // 0x4 - 0x4
   std::float_t m_flLiteralValue; // 0x8 - 0x8
   CKV3MemberNameWithStorage m_NamedValue; // 0x10 - 0x10
   std::int32_t m_nControlPoint; // 0x48 - 0x48
   ParticleAttributeIndex_t m_nScalarAttribute; // 0x4C - 0x4C
   ParticleAttributeIndex_t m_nVectorAttribute; // 0x50 - 0x50
   std::int32_t m_nVectorComponent; // 0x54 - 0x54
   std::float_t m_flRandomMin; // 0x58 - 0x58
   std::float_t m_flRandomMax; // 0x5C - 0x5C
   bool m_bHasRandomSignFlip; // 0x60 - 0x60
   ParticleFloatRandomMode_t m_nRandomMode; // 0x64 - 0x64
   std::float_t m_flLOD0; // 0x6C - 0x6C
   std::float_t m_flLOD1; // 0x70 - 0x70
   std::float_t m_flLOD2; // 0x74 - 0x74
   std::float_t m_flLOD3; // 0x78 - 0x78
   ParticleAttributeIndex_t m_nNoiseInputVectorAttribute; // 0x7C - 0x7C
   std::float_t m_flNoiseOutputMin; // 0x80 - 0x80
   std::float_t m_flNoiseOutputMax; // 0x84 - 0x84
   std::float_t m_flNoiseScale; // 0x88 - 0x88
   Vector m_vecNoiseOffsetRate; // 0x8C - 0x8C
   std::float_t m_flNoiseOffset; // 0x98 - 0x98
   std::int32_t m_nNoiseOctaves; // 0x9C - 0x9C
   PFNoiseTurbulence_t m_nNoiseTurbulence; // 0xA0 - 0xA0
   PFNoiseType_t m_nNoiseType; // 0xA4 - 0xA4
   PFNoiseModifier_t m_nNoiseModifier; // 0xA8 - 0xA8
   std::float_t m_flNoiseTurbulenceScale; // 0xAC - 0xAC
   std::float_t m_flNoiseTurbulenceMix; // 0xB0 - 0xB0
   std::float_t m_flNoiseImgPreviewScale; // 0xB4 - 0xB4
   bool m_bNoiseImgPreviewLive; // 0xB8 - 0xB8
   ParticleFloatInputMode_t m_nInputMode; // 0xC0 - 0xC0
   std::float_t m_flMultFactor; // 0xC4 - 0xC4
   std::float_t m_flInput0; // 0xC8 - 0xC8
   std::float_t m_flInput1; // 0xCC - 0xCC
   std::float_t m_flOutput0; // 0xD0 - 0xD0
   std::float_t m_flOutput1; // 0xD4 - 0xD4
   std::float_t m_flNotchedRangeMin; // 0xD8 - 0xD8
   std::float_t m_flNotchedRangeMax; // 0xDC - 0xDC
   std::float_t m_flNotchedOutputOutside; // 0xE0 - 0xE0
   std::float_t m_flNotchedOutputInside; // 0xE4 - 0xE4
   ParticleFloatBiasType_t m_nBiasType; // 0xE8 - 0xE8
   std::float_t m_flBiasParameter; // 0xEC - 0xEC
   CPiecewiseCurve m_Curve; // 0xF0 - 0xF0

}; // size - 0x138


class CPhysPropLootCrate : public CBrBaseItem
{
public:

   bool m_bRenderInPSPM; // 0xB28 - 0xB28
   bool m_bRenderInTablet; // 0xB29 - 0xB29
   GameTime_t m_flSpawnTime; // 0xB2C - 0xB2C
   bool m_bTakeDamageFromDangerZone; // 0xB30 - 0xB30
   char* m_pszCrateName; // 0xB38 - 0xB38
   CHandle< CBasePlayerPawn > m_hCrateOwner; // 0xB40 - 0xB40
   bool m_bOwnedByPlayer; // 0xB44 - 0xB44
   std::float_t m_flDampingOriginalSpeed; // 0xB48 - 0xB48
   std::float_t m_flDampingOriginalRot; // 0xB4C - 0xB4C

}; // size - 0xB50


class CPhysPropWeaponUpgradeTablet : public CPhysPropWeaponUpgrade
{
public:


}; // size - 0xB30


class CRulePointEntity : public CRuleEntity
{
public:

   std::int32_t m_Score; // 0x6F8 - 0x6F8

}; // size - 0x700


class CSoundEventEntity : public CBaseEntity
{
public:

   bool m_bStartOnSpawn; // 0x4A0 - 0x4A0
   bool m_bToLocalPlayer; // 0x4A1 - 0x4A1
   bool m_bStopOnNew; // 0x4A2 - 0x4A2
   bool m_bSaveRestore; // 0x4A3 - 0x4A3
   bool m_bSavedIsPlaying; // 0x4A4 - 0x4A4
   std::float_t m_flSavedElapsedTime; // 0x4A8 - 0x4A8
   CUtlSymbolLarge m_iszSourceEntityName; // 0x4B0 - 0x4B0
   CUtlSymbolLarge m_iszAttachmentName; // 0x4B8 - 0x4B8
   CEntityOutputTemplate< uint64 > m_onGUIDChanged; // 0x4C0 - 0x4C0
   CEntityIOOutput m_onSoundFinished; // 0x4E8 - 0x4E8
   CUtlSymbolLarge m_iszSoundName; // 0x530 - 0x530
   CEntityHandle m_hSource; // 0x540 - 0x540

}; // size - 0x548


class CStopwatchBase : public CSimpleSimTimer
{
public:

   bool m_fIsRunning; // 0x8 - 0x8

}; // size - 0xC


class C_INIT_RandomNamedModelElement : public CParticleFunctionInitializer
{
public:

   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1F0 - 0x1F0
   CUtlVector< CUtlString > m_names; // 0x1F8 - 0x1F8
   bool m_bShuffle; // 0x210 - 0x210
   bool m_bLinear; // 0x211 - 0x211
   bool m_bModelFromRenderer; // 0x212 - 0x212
   ParticleAttributeIndex_t m_nFieldOutput; // 0x214 - 0x214

}; // size - 0x220


class C_INIT_RemapNamedModelElementToScalar : public CParticleFunctionInitializer
{
public:

   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1F0 - 0x1F0
   CUtlVector< CUtlString > m_names; // 0x1F8 - 0x1F8
   CUtlVector< float32 > m_values; // 0x210 - 0x210
   ParticleAttributeIndex_t m_nFieldInput; // 0x228 - 0x228
   ParticleAttributeIndex_t m_nFieldOutput; // 0x22C - 0x22C
   ParticleSetMethod_t m_nSetMethod; // 0x230 - 0x230
   bool m_bModelFromRenderer; // 0x234 - 0x234

}; // size - 0x240


class C_INIT_RemapParticleCountToNamedModelElementScalar : public C_INIT_RemapParticleCountToScalar
{
public:

   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x220 - 0x220
   CUtlString m_outputMinName; // 0x228 - 0x228
   CUtlString m_outputMaxName; // 0x230 - 0x230
   bool m_bModelFromRenderer; // 0x238 - 0x238

}; // size - 0x240


class C_ModelPointEntity : public C_BaseModelEntity
{
public:


}; // size - 0x838


class C_OP_RemapNamedModelElementEndCap : public CParticleFunctionOperator
{
public:

   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1F0 - 0x1F0
   CUtlVector< CUtlString > m_inNames; // 0x1F8 - 0x1F8
   CUtlVector< CUtlString > m_outNames; // 0x210 - 0x210
   CUtlVector< CUtlString > m_fallbackNames; // 0x228 - 0x228
   bool m_bModelFromRenderer; // 0x240 - 0x240
   ParticleAttributeIndex_t m_nFieldInput; // 0x244 - 0x244
   ParticleAttributeIndex_t m_nFieldOutput; // 0x248 - 0x248

}; // size - 0x250


class C_OP_RemapNamedModelElementOnceTimed : public CParticleFunctionOperator
{
public:

   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1F0 - 0x1F0
   CUtlVector< CUtlString > m_inNames; // 0x1F8 - 0x1F8
   CUtlVector< CUtlString > m_outNames; // 0x210 - 0x210
   CUtlVector< CUtlString > m_fallbackNames; // 0x228 - 0x228
   bool m_bModelFromRenderer; // 0x240 - 0x240
   bool m_bProportional; // 0x241 - 0x241
   ParticleAttributeIndex_t m_nFieldInput; // 0x244 - 0x244
   ParticleAttributeIndex_t m_nFieldOutput; // 0x248 - 0x248
   std::float_t m_flRemapTime; // 0x24C - 0x24C

}; // size - 0x250


class C_PointClientUIWorldPanel : public C_BaseClientUIEntity
{
public:

   bool m_bForceRecreateNextUpdate; // 0x870 - 0x870
   bool m_bMoveViewToPlayerNextThink; // 0x871 - 0x871
   bool m_bCheckCSSClasses; // 0x872 - 0x872
   CTransform m_anchorDeltaTransform; // 0x880 - 0x880
   CPointOffScreenIndicatorUi* m_pOffScreenIndicator; // 0xA20 - 0xA20
   bool m_bIgnoreInput; // 0xA48 - 0xA48
   bool m_bLit; // 0xA49 - 0xA49
   bool m_bFollowPlayerAcrossTeleport; // 0xA4A - 0xA4A
   std::float_t m_flWidth; // 0xA4C - 0xA4C
   std::float_t m_flHeight; // 0xA50 - 0xA50
   std::float_t m_flDPI; // 0xA54 - 0xA54
   std::float_t m_flInteractDistance; // 0xA58 - 0xA58
   std::float_t m_flDepthOffset; // 0xA5C - 0xA5C
   std::uint32_t m_unOwnerContext; // 0xA60 - 0xA60
   std::uint32_t m_unHorizontalAlign; // 0xA64 - 0xA64
   std::uint32_t m_unVerticalAlign; // 0xA68 - 0xA68
   std::uint32_t m_unOrientation; // 0xA6C - 0xA6C
   bool m_bAllowInteractionFromAllSceneWorlds; // 0xA70 - 0xA70
   C_NetworkUtlVectorBase< CUtlSymbolLarge > m_vecCSSClasses; // 0xA78 - 0xA78
   bool m_bOpaque; // 0xA90 - 0xA90
   bool m_bNoDepth; // 0xA91 - 0xA91
   bool m_bRenderBackface; // 0xA92 - 0xA92
   bool m_bUseOffScreenIndicator; // 0xA93 - 0xA93
   bool m_bExcludeFromSaveGames; // 0xA94 - 0xA94
   bool m_bGrabbable; // 0xA95 - 0xA95
   bool m_bOnlyRenderToTexture; // 0xA96 - 0xA96
   bool m_bDisableMipGen; // 0xA97 - 0xA97
   std::int32_t m_nExplicitImageLayout; // 0xA98 - 0xA98

}; // size - 0xAA0


class C_Sprite : public C_BaseModelEntity
{
public:

   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hSpriteMaterial; // 0x850 - 0x850
   CHandle< C_BaseEntity > m_hAttachedToEntity; // 0x858 - 0x858
   AttachmentHandle_t m_nAttachment; // 0x85C - 0x85C
   std::float_t m_flSpriteFramerate; // 0x860 - 0x860
   std::float_t m_flFrame; // 0x864 - 0x864
   GameTime_t m_flDieTime; // 0x868 - 0x868
   std::uint32_t m_nBrightness; // 0x878 - 0x878
   std::float_t m_flBrightnessDuration; // 0x87C - 0x87C
   std::float_t m_flSpriteScale; // 0x880 - 0x880
   std::float_t m_flScaleDuration; // 0x884 - 0x884
   bool m_bWorldSpaceScale; // 0x888 - 0x888
   std::float_t m_flGlowProxySize; // 0x88C - 0x88C
   std::float_t m_flHDRColorScale; // 0x890 - 0x890
   GameTime_t m_flLastTime; // 0x894 - 0x894
   std::float_t m_flMaxFrame; // 0x898 - 0x898
   std::float_t m_flStartScale; // 0x89C - 0x89C
   std::float_t m_flDestScale; // 0x8A0 - 0x8A0
   GameTime_t m_flScaleTimeStart; // 0x8A4 - 0x8A4
   std::int32_t m_nStartBrightness; // 0x8A8 - 0x8A8
   std::int32_t m_nDestBrightness; // 0x8AC - 0x8AC
   GameTime_t m_flBrightnessTimeStart; // 0x8B0 - 0x8B0
   CWeakHandle< InfoForResourceTypeIMaterial2 > m_hOldSpriteMaterial; // 0x8B8 - 0x8B8
   std::int32_t m_nSpriteWidth; // 0x960 - 0x960
   std::int32_t m_nSpriteHeight; // 0x964 - 0x964

}; // size - 0x968


class CAI_Expresser
{
public:

   GameTime_t m_flStopTalkTime; // 0x38 - 0x38
   GameTime_t m_flStopTalkTimeWithoutDelay; // 0x3C - 0x3C
   GameTime_t m_flBlockedTalkTime; // 0x40 - 0x40
   std::int32_t m_voicePitch; // 0x44 - 0x44
   GameTime_t m_flLastTimeAcceptedSpeak; // 0x48 - 0x48
   bool m_bAllowSpeakingInterrupts; // 0x4C - 0x4C
   bool m_bConsiderSceneInvolvementAsSpeech; // 0x4D - 0x4D
   std::int32_t m_nLastSpokenPriority; // 0x50 - 0x50
   CBaseFlex* m_pOuter; // 0x58 - 0x58

}; // size - 0x60


class CBaseViewModel : public CBaseAnimGraph
{
public:

   Vector m_vecLastFacing; // 0x828 - 0x828
   std::uint32_t m_nViewModelIndex; // 0x834 - 0x834
   std::uint32_t m_nAnimationParity; // 0x838 - 0x838
   std::float_t m_flAnimationStartTime; // 0x83C - 0x83C
   CHandle< CBasePlayerWeapon > m_hWeapon; // 0x840 - 0x840
   CUtlSymbolLarge m_sVMName; // 0x848 - 0x848
   CUtlSymbolLarge m_sAnimationPrefix; // 0x850 - 0x850
   HSequence m_hOldLayerSequence; // 0x858 - 0x858
   std::int32_t m_oldLayer; // 0x85C - 0x85C
   std::float_t m_oldLayerStartTime; // 0x860 - 0x860
   CEntityHandle m_hControlPanel; // 0x864 - 0x864

}; // size - 0x868


class CBtNodeDecorator : public CBtNode
{
public:


}; // size - 0x58


class CFuncPlatRot : public CFuncPlat
{
public:

   QAngle m_end; // 0x7A0 - 0x7A0
   QAngle m_start; // 0x7AC - 0x7AC

}; // size - 0x7B8


class CHostageExpresserShim : public CBaseCombatCharacter
{
public:

   CAI_Expresser* m_pExpresser; // 0x968 - 0x968

}; // size - 0x970


class CLogicNPCCounter : public CBaseEntity
{
public:

   CEntityIOOutput m_OnMinCountAll; // 0x4A0 - 0x4A0
   CEntityIOOutput m_OnMaxCountAll; // 0x4C8 - 0x4C8
   CEntityOutputTemplate< float32 > m_OnFactorAll; // 0x4F0 - 0x4F0
   CEntityOutputTemplate< float32 > m_OnMinPlayerDistAll; // 0x518 - 0x518
   CEntityIOOutput m_OnMinCount_1; // 0x540 - 0x540
   CEntityIOOutput m_OnMaxCount_1; // 0x568 - 0x568
   CEntityOutputTemplate< float32 > m_OnFactor_1; // 0x590 - 0x590
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_1; // 0x5B8 - 0x5B8
   CEntityIOOutput m_OnMinCount_2; // 0x5E0 - 0x5E0
   CEntityIOOutput m_OnMaxCount_2; // 0x608 - 0x608
   CEntityOutputTemplate< float32 > m_OnFactor_2; // 0x630 - 0x630
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_2; // 0x658 - 0x658
   CEntityIOOutput m_OnMinCount_3; // 0x680 - 0x680
   CEntityIOOutput m_OnMaxCount_3; // 0x6A8 - 0x6A8
   CEntityOutputTemplate< float32 > m_OnFactor_3; // 0x6D0 - 0x6D0
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_3; // 0x6F8 - 0x6F8
   CEntityHandle m_hSource; // 0x720 - 0x720
   CUtlSymbolLarge m_iszSourceEntityName; // 0x728 - 0x728
   std::float_t m_flDistanceMax; // 0x730 - 0x730
   bool m_bDisabled; // 0x734 - 0x734
   std::int32_t m_nMinCountAll; // 0x738 - 0x738
   std::int32_t m_nMaxCountAll; // 0x73C - 0x73C
   std::int32_t m_nMinFactorAll; // 0x740 - 0x740
   std::int32_t m_nMaxFactorAll; // 0x744 - 0x744
   CUtlSymbolLarge m_iszNPCClassname_1; // 0x750 - 0x750
   std::int32_t m_nNPCState_1; // 0x758 - 0x758
   bool m_bInvertState_1; // 0x75C - 0x75C
   std::int32_t m_nMinCount_1; // 0x760 - 0x760
   std::int32_t m_nMaxCount_1; // 0x764 - 0x764
   std::int32_t m_nMinFactor_1; // 0x768 - 0x768
   std::int32_t m_nMaxFactor_1; // 0x76C - 0x76C
   std::float_t m_flDefaultDist_1; // 0x774 - 0x774
   CUtlSymbolLarge m_iszNPCClassname_2; // 0x778 - 0x778
   std::int32_t m_nNPCState_2; // 0x780 - 0x780
   bool m_bInvertState_2; // 0x784 - 0x784
   std::int32_t m_nMinCount_2; // 0x788 - 0x788
   std::int32_t m_nMaxCount_2; // 0x78C - 0x78C
   std::int32_t m_nMinFactor_2; // 0x790 - 0x790
   std::int32_t m_nMaxFactor_2; // 0x794 - 0x794
   std::float_t m_flDefaultDist_2; // 0x79C - 0x79C
   CUtlSymbolLarge m_iszNPCClassname_3; // 0x7A0 - 0x7A0
   std::int32_t m_nNPCState_3; // 0x7A8 - 0x7A8
   bool m_bInvertState_3; // 0x7AC - 0x7AC
   std::int32_t m_nMinCount_3; // 0x7B0 - 0x7B0
   std::int32_t m_nMaxCount_3; // 0x7B4 - 0x7B4
   std::int32_t m_nMinFactor_3; // 0x7B8 - 0x7B8
   std::int32_t m_nMaxFactor_3; // 0x7BC - 0x7BC
   std::float_t m_flDefaultDist_3; // 0x7C4 - 0x7C4

}; // size - 0x7E0


class CMultiplayRules : public CGameRules
{
public:


}; // size - 0x90


class CPlayer_MovementServices : public CPlayerPawnComponent
{
public:

   std::int32_t m_nImpulse; // 0x40 - 0x40
   CInButtonState m_nButtons; // 0x48 - 0x48
   std::uint64_t m_nQueuedButtonDownMask; // 0x68 - 0x68
   std::uint64_t m_nQueuedButtonChangeMask; // 0x70 - 0x70
   std::uint64_t m_nButtonDoublePressed; // 0x78 - 0x78
   uint32 m_pButtonPressedCmdNumber[64]; // 0x80 - 0x80
   std::uint32_t m_nLastCommandNumberProcessed; // 0x180 - 0x180
   std::uint64_t m_nToggleButtonDownMask; // 0x188 - 0x188
   std::float_t m_flMaxspeed; // 0x190 - 0x190
   std::float_t m_flForceSubtickMoveWhen; // 0x194 - 0x194
   std::float_t m_flForwardMove; // 0x198 - 0x198
   std::float_t m_flLeftMove; // 0x19C - 0x19C
   std::float_t m_flUpMove; // 0x1A0 - 0x1A0
   QAngle m_vecOldViewAngles; // 0x1A4 - 0x1A4

}; // size - 0x1B8


class CPlayer_MovementServices : public CPlayerPawnComponent
{
public:

   std::int32_t m_nImpulse; // 0x40 - 0x40
   CInButtonState m_nButtons; // 0x48 - 0x48
   std::uint64_t m_nQueuedButtonDownMask; // 0x68 - 0x68
   std::uint64_t m_nQueuedButtonChangeMask; // 0x70 - 0x70
   std::uint64_t m_nButtonDoublePressed; // 0x78 - 0x78
   uint32 m_pButtonPressedCmdNumber[64]; // 0x80 - 0x80
   std::uint32_t m_nLastCommandNumberProcessed; // 0x180 - 0x180
   std::uint64_t m_nToggleButtonDownMask; // 0x188 - 0x188
   std::float_t m_flMaxspeed; // 0x190 - 0x190
   std::float_t m_flForceSubtickMoveWhen; // 0x194 - 0x194
   std::float_t m_flForwardMove; // 0x198 - 0x198
   std::float_t m_flLeftMove; // 0x19C - 0x19C
   std::float_t m_flUpMove; // 0x1A0 - 0x1A0
   QAngle m_vecOldViewAngles; // 0x1A4 - 0x1A4

}; // size - 0x1B8


class CPropDoorRotating : public CBasePropDoor
{
public:

   Vector m_vecAxis; // 0xD28 - 0xD28
   std::float_t m_flDistance; // 0xD34 - 0xD34
   PropDoorRotatingSpawnPos_t m_eSpawnPosition; // 0xD38 - 0xD38
   PropDoorRotatingOpenDirection_e m_eOpenDirection; // 0xD3C - 0xD3C
   PropDoorRotatingOpenDirection_e m_eCurrentOpenDirection; // 0xD40 - 0xD40
   std::float_t m_flAjarAngle; // 0xD44 - 0xD44
   QAngle m_angRotationAjarDeprecated; // 0xD48 - 0xD48
   QAngle m_angRotationClosed; // 0xD54 - 0xD54
   QAngle m_angRotationOpenForward; // 0xD60 - 0xD60
   QAngle m_angRotationOpenBack; // 0xD6C - 0xD6C
   QAngle m_angGoal; // 0xD78 - 0xD78
   Vector m_vecForwardBoundsMin; // 0xD84 - 0xD84
   Vector m_vecForwardBoundsMax; // 0xD90 - 0xD90
   Vector m_vecBackBoundsMin; // 0xD9C - 0xD9C
   Vector m_vecBackBoundsMax; // 0xDA8 - 0xDA8
   CHandle< CEntityBlocker > m_hEntityBlocker; // 0xDB4 - 0xDB4

}; // size - 0xDB8


class C_BaseViewModel : public CBaseAnimGraph
{
public:

   Vector m_vecLastFacing; // 0x9A0 - 0x9A0
   std::uint32_t m_nViewModelIndex; // 0x9AC - 0x9AC
   std::uint32_t m_nAnimationParity; // 0x9B0 - 0x9B0
   std::float_t m_flAnimationStartTime; // 0x9B4 - 0x9B4
   CHandle< C_BasePlayerWeapon > m_hWeapon; // 0x9B8 - 0x9B8
   CUtlSymbolLarge m_sVMName; // 0x9C0 - 0x9C0
   CUtlSymbolLarge m_sAnimationPrefix; // 0x9C8 - 0x9C8
   CHandle< C_ViewmodelWeapon > m_hWeaponModel; // 0x9D0 - 0x9D0
   AttachmentHandle_t m_iCameraAttachment; // 0x9D4 - 0x9D4
   QAngle m_vecLastCameraAngles; // 0x9D8 - 0x9D8
   std::float_t m_previousElapsedDuration; // 0x9E4 - 0x9E4
   std::float_t m_previousCycle; // 0x9E8 - 0x9E8
   std::int32_t m_nOldAnimationParity; // 0x9EC - 0x9EC
   HSequence m_hOldLayerSequence; // 0x9F0 - 0x9F0
   std::int32_t m_oldLayer; // 0x9F4 - 0x9F4
   std::float_t m_oldLayerStartTime; // 0x9F8 - 0x9F8
   CEntityHandle m_hControlPanel; // 0x9FC - 0x9FC

}; // size - 0xA00


class C_MultiplayRules : public C_GameRules
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class BaseSceneObjectOverride_t
{
public:

   std::uint32_t m_nSceneObjectIndex; // 0x0 - 0x0

}; // size - 0x4


class CAnimState
{
public:

   CUtlVector< CSmartPtr< CAnimStateTransition > > m_transitions; // 0x28 - 0x28
   CUtlVector< CStateAction > m_actions; // 0x40 - 0x40
   CUtlString m_name; // 0x58 - 0x58
   AnimStateID m_stateID; // 0x60 - 0x60
   Vector2D m_position; // 0x64 - 0x64
   bool m_bIsStartState; // 0x6C - 0x6C
   bool m_bIsEndtState; // 0x6D - 0x6D
   bool m_bIsPassthrough; // 0x6E - 0x6E

}; // size - 0x70


class CAnimStateTransition
{
public:

   CConditionContainer m_conditionList; // 0x28 - 0x28
   AnimStateID m_srcState; // 0x60 - 0x60
   AnimStateID m_destState; // 0x64 - 0x64
   bool m_bDisabled; // 0x68 - 0x68

}; // size - 0x70


class CBarnLight : public CBaseModelEntity
{
public:

   bool m_bEnabled; // 0x6F0 - 0x6F0
   std::int32_t m_nColorMode; // 0x6F4 - 0x6F4
   Color m_Color; // 0x6F8 - 0x6F8
   std::float_t m_flColorTemperature; // 0x6FC - 0x6FC
   std::float_t m_flBrightness; // 0x700 - 0x700
   std::float_t m_flBrightnessScale; // 0x704 - 0x704
   std::int32_t m_nDirectLight; // 0x708 - 0x708
   std::int32_t m_nBakedShadowIndex; // 0x70C - 0x70C
   std::int32_t m_nLuminaireShape; // 0x710 - 0x710
   std::float_t m_flLuminaireSize; // 0x714 - 0x714
   std::float_t m_flLuminaireAnisotropy; // 0x718 - 0x718
   CUtlString m_LightStyleString; // 0x720 - 0x720
   GameTime_t m_flLightStyleStartTime; // 0x728 - 0x728
   CNetworkUtlVectorBase< CUtlString > m_QueuedLightStyleStrings; // 0x730 - 0x730
   CNetworkUtlVectorBase< CUtlString > m_LightStyleEvents; // 0x748 - 0x748
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_LightStyleTargets; // 0x760 - 0x760
   CEntityIOOutput m_StyleEvent[4]; // 0x778 - 0x778
   CUtlString m_StyleRadianceVar; // 0x818 - 0x818
   CUtlString m_StyleVar; // 0x820 - 0x820
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; // 0x848 - 0x848
   std::float_t m_flShape; // 0x850 - 0x850
   std::float_t m_flSoftX; // 0x854 - 0x854
   std::float_t m_flSoftY; // 0x858 - 0x858
   std::float_t m_flSkirt; // 0x85C - 0x85C
   std::float_t m_flSkirtNear; // 0x860 - 0x860
   Vector m_vSizeParams; // 0x864 - 0x864
   std::float_t m_flRange; // 0x870 - 0x870
   Vector m_vShear; // 0x874 - 0x874
   std::int32_t m_nBakeSpecularToCubemaps; // 0x880 - 0x880
   Vector m_vBakeSpecularToCubemapsSize; // 0x884 - 0x884
   std::int32_t m_nCastShadows; // 0x890 - 0x890
   std::int32_t m_nShadowMapSize; // 0x894 - 0x894
   std::int32_t m_nShadowPriority; // 0x898 - 0x898
   bool m_bContactShadow; // 0x89C - 0x89C
   std::int32_t m_nBounceLight; // 0x8A0 - 0x8A0
   std::float_t m_flBounceScale; // 0x8A4 - 0x8A4
   std::float_t m_flMinRoughness; // 0x8A8 - 0x8A8
   std::int32_t m_nFog; // 0x8AC - 0x8AC
   std::float_t m_flFogStrength; // 0x8B0 - 0x8B0
   std::int32_t m_nFogShadows; // 0x8B4 - 0x8B4
   std::float_t m_flFogScale; // 0x8B8 - 0x8B8
   std::float_t m_flFadeSizeStart; // 0x8BC - 0x8BC
   std::float_t m_flFadeSizeEnd; // 0x8C0 - 0x8C0
   std::float_t m_flShadowFadeSizeStart; // 0x8C4 - 0x8C4
   std::float_t m_flShadowFadeSizeEnd; // 0x8C8 - 0x8C8
   bool m_bPrecomputedFieldsValid; // 0x8CC - 0x8CC
   Vector m_vPrecomputedBoundsMins; // 0x8D0 - 0x8D0
   Vector m_vPrecomputedBoundsMaxs; // 0x8DC - 0x8DC
   Vector m_vPrecomputedOBBOrigin; // 0x8E8 - 0x8E8
   QAngle m_vPrecomputedOBBAngles; // 0x8F4 - 0x8F4
   Vector m_vPrecomputedOBBExtent; // 0x900 - 0x900
   bool m_bPvsModifyEntity; // 0x90C - 0x90C

}; // size - 0x918


class CBaseDoor : public CBaseToggle
{
public:

   QAngle m_angMoveEntitySpace; // 0x780 - 0x780
   Vector m_vecMoveDirParentSpace; // 0x78C - 0x78C
   locksound_t m_ls; // 0x798 - 0x798
   bool m_bForceClosed; // 0x7B8 - 0x7B8
   bool m_bDoorGroup; // 0x7B9 - 0x7B9
   bool m_bLocked; // 0x7BA - 0x7BA
   bool m_bIgnoreDebris; // 0x7BB - 0x7BB
   FuncDoorSpawnPos_t m_eSpawnPosition; // 0x7BC - 0x7BC
   std::float_t m_flBlockDamage; // 0x7C0 - 0x7C0
   CUtlSymbolLarge m_NoiseMoving; // 0x7C8 - 0x7C8
   CUtlSymbolLarge m_NoiseArrived; // 0x7D0 - 0x7D0
   CUtlSymbolLarge m_NoiseMovingClosed; // 0x7D8 - 0x7D8
   CUtlSymbolLarge m_NoiseArrivedClosed; // 0x7E0 - 0x7E0
   CUtlSymbolLarge m_ChainTarget; // 0x7E8 - 0x7E8
   CEntityIOOutput m_OnBlockedClosing; // 0x7F0 - 0x7F0
   CEntityIOOutput m_OnBlockedOpening; // 0x818 - 0x818
   CEntityIOOutput m_OnUnblockedClosing; // 0x840 - 0x840
   CEntityIOOutput m_OnUnblockedOpening; // 0x868 - 0x868
   CEntityIOOutput m_OnFullyClosed; // 0x890 - 0x890
   CEntityIOOutput m_OnFullyOpen; // 0x8B8 - 0x8B8
   CEntityIOOutput m_OnClose; // 0x8E0 - 0x8E0
   CEntityIOOutput m_OnOpen; // 0x908 - 0x908
   CEntityIOOutput m_OnLockedUse; // 0x930 - 0x930
   bool m_bLoopMoveSound; // 0x958 - 0x958
   bool m_bCreateNavObstacle; // 0x970 - 0x970
   bool m_isChaining; // 0x971 - 0x971
   bool m_bIsUsable; // 0x972 - 0x972

}; // size - 0x978


class CBeam : public CBaseModelEntity
{
public:

   std::float_t m_flFrameRate; // 0x6F0 - 0x6F0
   std::float_t m_flHDRColorScale; // 0x6F4 - 0x6F4
   GameTime_t m_flFireTime; // 0x6F8 - 0x6F8
   std::float_t m_flDamage; // 0x6FC - 0x6FC
   std::uint8_t m_nNumBeamEnts; // 0x700 - 0x700
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hBaseMaterial; // 0x708 - 0x708
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_nHaloIndex; // 0x710 - 0x710
   BeamType_t m_nBeamType; // 0x718 - 0x718
   std::uint32_t m_nBeamFlags; // 0x71C - 0x71C
   CHandle< CBaseEntity > m_hAttachEntity[10]; // 0x720 - 0x720
   AttachmentHandle_t m_nAttachIndex[10]; // 0x748 - 0x748
   std::float_t m_fWidth; // 0x754 - 0x754
   std::float_t m_fEndWidth; // 0x758 - 0x758
   std::float_t m_fFadeLength; // 0x75C - 0x75C
   std::float_t m_fHaloScale; // 0x760 - 0x760
   std::float_t m_fAmplitude; // 0x764 - 0x764
   std::float_t m_fStartFrame; // 0x768 - 0x768
   std::float_t m_fSpeed; // 0x76C - 0x76C
   std::float_t m_flFrame; // 0x770 - 0x770
   BeamClipStyle_t m_nClipStyle; // 0x774 - 0x774
   bool m_bTurnedOff; // 0x778 - 0x778
   Vector m_vecEndPos; // 0x77C - 0x77C
   CHandle< CBaseEntity > m_hEndEntity; // 0x788 - 0x788
   std::int32_t m_nDissolveType; // 0x78C - 0x78C

}; // size - 0x790


class CBlend2DItemBase
{
public:

   Vector2D m_blendValue; // 0x18 - 0x18
   bool m_bUseCustomDuration; // 0x28 - 0x28
   std::float_t m_flCustomDuration; // 0x2C - 0x2C

}; // size - 0x30


class CBodyComponentSkeletonInstance : public CBodyComponent
{
public:

   CSkeletonInstance m_skeletonInstance; // 0x50 - 0x50
   CNetworkVarChainer __m_pChainEntity; // 0x440 - 0x440

}; // size - 0x470


class CBodyComponentSkeletonInstance : public CBodyComponent
{
public:

   CSkeletonInstance m_skeletonInstance; // 0x50 - 0x50
   CNetworkVarChainer __m_pChainEntity; // 0x440 - 0x440

}; // size - 0x470


class CBreakable : public CBaseModelEntity
{
public:

   Materials m_Material; // 0x700 - 0x700
   CHandle< CBaseEntity > m_hBreaker; // 0x704 - 0x704
   Explosions m_Explosion; // 0x708 - 0x708
   CUtlSymbolLarge m_iszSpawnObject; // 0x710 - 0x710
   std::float_t m_flPressureDelay; // 0x718 - 0x718
   std::int32_t m_iMinHealthDmg; // 0x71C - 0x71C
   CUtlSymbolLarge m_iszPropData; // 0x720 - 0x720
   std::float_t m_impactEnergyScale; // 0x728 - 0x728
   EOverrideBlockLOS_t m_nOverrideBlockLOS; // 0x72C - 0x72C
   CEntityIOOutput m_OnBreak; // 0x730 - 0x730
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0x758 - 0x758
   std::float_t m_flDmgModBullet; // 0x780 - 0x780
   std::float_t m_flDmgModClub; // 0x784 - 0x784
   std::float_t m_flDmgModExplosive; // 0x788 - 0x788
   std::float_t m_flDmgModFire; // 0x78C - 0x78C
   CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0x790 - 0x790
   CUtlSymbolLarge m_iszBasePropData; // 0x798 - 0x798
   std::int32_t m_iInteractions; // 0x7A0 - 0x7A0
   PerformanceMode_t m_PerformanceMode; // 0x7A4 - 0x7A4
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x7A8 - 0x7A8
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x7AC - 0x7AC

}; // size - 0x7B0


class CCSGO_TeamIntroCharacterPosition : public CCSGO_TeamPreviewCharacterPosition
{
public:


}; // size - 0x730


class CCSGO_TeamSelectCharacterPosition : public CCSGO_TeamPreviewCharacterPosition
{
public:


}; // size - 0x730


class CCSPlayerPawnBase : public CBasePlayerPawn
{
public:

   CTouchExpansionComponent m_CTouchExpansionComponent; // 0xAB0 - 0xAB0
   CCSPlayer_ActionTrackingServices* m_pActionTrackingServices; // 0xAD0 - 0xAD0
   CCSPlayer_ViewModelServices* m_pViewModelServices; // 0xAD8 - 0xAD8
   std::uint32_t m_iDisplayHistoryBits; // 0xAE0 - 0xAE0
   std::float_t m_flLastAttackedTeammate; // 0xAE4 - 0xAE4
   CHandle< CCSPlayerController > m_hOriginalController; // 0xAE8 - 0xAE8
   GameTime_t m_blindUntilTime; // 0xAEC - 0xAEC
   GameTime_t m_blindStartTime; // 0xAF0 - 0xAF0
   GameTime_t m_allowAutoFollowTime; // 0xAF4 - 0xAF4
   EntitySpottedState_t m_entitySpottedState; // 0xAF8 - 0xAF8
   std::int32_t m_nSpotRules; // 0xB10 - 0xB10
   std::float_t m_flTimeOfLastInjury; // 0xB14 - 0xB14
   RelativeDamagedDirection_t m_nRelativeDirectionOfLastInjury; // 0xB18 - 0xB18
   CSPlayerState m_iPlayerState; // 0xB1C - 0xB1C
   CountdownTimer m_chickenIdleSoundTimer; // 0xB28 - 0xB28
   CountdownTimer m_chickenJumpSoundTimer; // 0xB40 - 0xB40
   Vector m_vecLastBookmarkedPosition; // 0xBF8 - 0xBF8
   std::float_t m_flLastDistanceTraveledNotice; // 0xC04 - 0xC04
   std::float_t m_flAccumulatedDistanceTraveled; // 0xC08 - 0xC08
   std::float_t m_flLastFriendlyFireDamageReductionRatio; // 0xC0C - 0xC0C
   bool m_bRespawning; // 0xC10 - 0xC10
   std::int32_t m_iNumGunGameTRBombTotalPoints; // 0xC14 - 0xC14
   bool m_bShouldProgressGunGameTRBombModeWeapon; // 0xC18 - 0xC18
   std::int32_t m_nLastPickupPriority; // 0xC1C - 0xC1C
   std::float_t m_flLastPickupPriorityTime; // 0xC20 - 0xC20
   bool m_passiveItems[4]; // 0xC24 - 0xC24
   bool m_bIsScoped; // 0xC28 - 0xC28
   bool m_bIsWalking; // 0xC29 - 0xC29
   bool m_bResumeZoom; // 0xC2A - 0xC2A
   bool m_bIsDefusing; // 0xC2B - 0xC2B
   bool m_bIsGrabbingHostage; // 0xC2C - 0xC2C
   CSPlayerBlockingUseAction_t m_iBlockingUseActionInProgress; // 0xC30 - 0xC30
   GameTime_t m_fImmuneToGunGameDamageTime; // 0xC34 - 0xC34
   bool m_bGunGameImmunity; // 0xC38 - 0xC38
   bool m_bMadeFinalGunGameProgressiveKill; // 0xC39 - 0xC39
   std::int32_t m_iGunGameProgressiveWeaponIndex; // 0xC3C - 0xC3C
   std::int32_t m_iNumGunGameTRKillPoints; // 0xC40 - 0xC40
   std::int32_t m_iNumGunGameKillsWithCurrentWeapon; // 0xC44 - 0xC44
   std::uint32_t m_unTotalRoundDamageDealt; // 0xC48 - 0xC48
   std::float_t m_fMolotovDamageTime; // 0xC4C - 0xC4C
   bool m_bHasMovedSinceSpawn; // 0xC50 - 0xC50
   bool m_bCanMoveDuringFreezePeriod; // 0xC51 - 0xC51
   bool m_isCurrentGunGameLeader; // 0xC52 - 0xC52
   bool m_isCurrentGunGameTeamLeader; // 0xC53 - 0xC53
   std::float_t m_flGuardianTooFarDistFrac; // 0xC54 - 0xC54
   std::float_t m_flNextGuardianTooFarHurtTime; // 0xC58 - 0xC58
   GameTime_t m_flDetectedByEnemySensorTime; // 0xC5C - 0xC5C
   bool m_bIsSpawnRappelling; // 0xC60 - 0xC60
   Vector m_vecSpawnRappellingRopeOrigin; // 0xC64 - 0xC64
   std::int32_t m_nSurvivalTeam; // 0xC70 - 0xC70
   CHandle< CCSPlayerPawnBase > m_hSurvivalAssassinationTarget; // 0xC74 - 0xC74
   std::int32_t m_nCompletedSurvivalAssassinations; // 0xC78 - 0xC78
   std::float_t m_flDealtDamageToEnemyMostRecentTimestamp; // 0xC7C - 0xC7C
   std::float_t m_flHealthShotBoostExpirationTime; // 0xC80 - 0xC80
   GameTime_t m_flLastEquippedHelmetTime; // 0xC84 - 0xC84
   GameTime_t m_flLastEquippedArmorTime; // 0xC88 - 0xC88
   std::int32_t m_nHeavyAssaultSuitCooldownRemaining; // 0xC8C - 0xC8C
   bool m_bResetArmorNextSpawn; // 0xC90 - 0xC90
   std::float_t m_flLastExoJumpTime; // 0xC94 - 0xC94
   GameTime_t m_flLastBumpMineBumpTime; // 0xC98 - 0xC98
   bool m_bEscaped; // 0xCA8 - 0xCA8
   bool m_bIsVIP; // 0xCA9 - 0xCA9
   std::int32_t m_iNumSpawns; // 0xCAC - 0xCAC
   std::int32_t m_iShouldHaveCash; // 0xCB0 - 0xCB0
   bool m_bJustKilledTeammate; // 0xCB4 - 0xCB4
   bool m_bPunishedForTK; // 0xCB5 - 0xCB5
   bool m_bInvalidSteamLogonDelayed; // 0xCB6 - 0xCB6
   std::int32_t m_iTeamKills; // 0xCB8 - 0xCB8
   GameTime_t m_flLastAction; // 0xCBC - 0xCBC
   float32 m_flNameChangeHistory[5]; // 0xCC0 - 0xCC0
   std::float_t m_fLastGivenDefuserTime; // 0xCD4 - 0xCD4
   std::float_t m_fLastGivenBombTime; // 0xCD8 - 0xCD8
   bool m_bHasNightVision; // 0xCDC - 0xCDC
   bool m_bNightVisionOn; // 0xCDD - 0xCDD
   std::float_t m_fNextRadarUpdateTime; // 0xCE0 - 0xCE0
   std::float_t m_flLastMoneyUpdateTime; // 0xCE4 - 0xCE4
   char m_MenuStringBuffer[1024]; // 0xCE8 - 0xCE8
   CHandle< CBaseEntity > m_pIntroCamera; // 0x10E8 - 0x10E8
   std::float_t m_fIntroCamTime; // 0x10EC - 0x10EC
   std::int32_t m_nMyCollisionGroup; // 0x10F0 - 0x10F0
   bool m_bInBombZone; // 0x10F4 - 0x10F4
   bool m_bInBuyZone; // 0x10F5 - 0x10F5
   bool m_bInNoDefuseArea; // 0x10F6 - 0x10F6
   bool m_bKilledByTaser; // 0x10F7 - 0x10F7
   std::int32_t m_iMoveState; // 0x10F8 - 0x10F8
   CStrongHandle< InfoForResourceTypeCModel > m_nPreviousModelIndex; // 0x1100 - 0x1100
   GameTime_t m_grenadeParameterStashTime; // 0x1108 - 0x1108
   bool m_bGrenadeParametersStashed; // 0x110C - 0x110C
   QAngle m_angStashedShootAngles; // 0x1110 - 0x1110
   Vector m_vecStashedGrenadeThrowPosition; // 0x111C - 0x111C
   Vector m_vecStashedVelocity; // 0x1128 - 0x1128
   QAngle m_angShootAngleHistory[2]; // 0x1134 - 0x1134
   Vector m_vecThrowPositionHistory[2]; // 0x114C - 0x114C
   Vector m_vecVelocityHistory[2]; // 0x1164 - 0x1164
   std::uint16_t m_nCharacterDefIndex; // 0x117C - 0x117C
   bool m_bDiedAirborne; // 0x117E - 0x117E
   CEntityIndex m_iBombSiteIndex; // 0x1180 - 0x1180
   std::int32_t m_nWhichBombZone; // 0x1184 - 0x1184
   bool m_bInBombZoneTrigger; // 0x1188 - 0x1188
   bool m_bWasInBombZoneTrigger; // 0x1189 - 0x1189
   bool m_bWasInHostageRescueZone; // 0x118A - 0x118A
   bool m_bWasInBuyZone; // 0x118B - 0x118B
   bool m_bInHostageRescueZone; // 0x118C - 0x118C
   std::float_t m_flStamina; // 0x1190 - 0x1190
   std::int32_t m_iDirection; // 0x1194 - 0x1194
   std::int32_t m_iShotsFired; // 0x1198 - 0x1198
   std::int32_t m_ArmorValue; // 0x119C - 0x119C
   std::float_t m_flFlinchStack; // 0x11A0 - 0x11A0
   std::float_t m_flVelocityModifier; // 0x11A4 - 0x11A4
   std::float_t m_flGroundAccelLinearFracLastTime; // 0x11A8 - 0x11A8
   std::int32_t m_iHostagesKilled; // 0x11AC - 0x11AC
   Vector m_vecTotalBulletForce; // 0x11B0 - 0x11B0
   std::float_t m_flFlashDuration; // 0x11BC - 0x11BC
   std::float_t m_flFlashMaxAlpha; // 0x11C0 - 0x11C0
   std::float_t m_flProgressBarStartTime; // 0x11C4 - 0x11C4
   std::int32_t m_iProgressBarDuration; // 0x11C8 - 0x11C8
   bool m_bWaitForNoAttack; // 0x11CC - 0x11CC
   bool m_bIsRespawningForDMBonus; // 0x11CD - 0x11CD
   std::float_t m_flLowerBodyYawTarget; // 0x11D0 - 0x11D0
   bool m_bStrafing; // 0x11D4 - 0x11D4
   Vector m_lastStandingPos; // 0x11D8 - 0x11D8
   std::float_t m_ignoreLadderJumpTime; // 0x11E4 - 0x11E4
   CountdownTimer m_ladderSurpressionTimer; // 0x11E8 - 0x11E8
   Vector m_lastLadderNormal; // 0x1200 - 0x1200
   Vector m_lastLadderPos; // 0x120C - 0x120C
   QAngle m_thirdPersonHeading; // 0x1218 - 0x1218
   std::float_t m_flSlopeDropOffset; // 0x1224 - 0x1224
   std::float_t m_flSlopeDropHeight; // 0x1228 - 0x1228
   Vector m_vHeadConstraintOffset; // 0x122C - 0x122C
   std::int32_t m_iLastWeaponFireUsercmd; // 0x1240 - 0x1240
   QAngle m_angEyeAngles; // 0x1244 - 0x1244
   bool m_bVCollisionInitted; // 0x1250 - 0x1250
   Vector m_storedSpawnPosition; // 0x1254 - 0x1254
   QAngle m_storedSpawnAngle; // 0x1260 - 0x1260
   bool m_bIsSpawning; // 0x126C - 0x126C
   bool m_bHideTargetID; // 0x126D - 0x126D
   std::int32_t m_nNumDangerZoneDamageHits; // 0x1270 - 0x1270
   bool m_bHud_MiniScoreHidden; // 0x1274 - 0x1274
   bool m_bHud_RadarHidden; // 0x1275 - 0x1275
   CEntityIndex m_nLastKillerIndex; // 0x1278 - 0x1278
   std::int32_t m_nLastConcurrentKilled; // 0x127C - 0x127C
   std::int32_t m_nDeathCamMusic; // 0x1280 - 0x1280
   std::int32_t m_iAddonBits; // 0x1284 - 0x1284
   std::int32_t m_iPrimaryAddon; // 0x1288 - 0x1288
   std::int32_t m_iSecondaryAddon; // 0x128C - 0x128C
   std::int32_t m_nTeamDamageGivenForMatch; // 0x1290 - 0x1290
   bool m_bTDGaveProtectionWarning; // 0x1294 - 0x1294
   bool m_bTDGaveProtectionWarningThisRound; // 0x1295 - 0x1295
   std::float_t m_applyDeafnessTime; // 0x1298 - 0x1298
   std::float_t m_flLastTHWarningTime; // 0x129C - 0x129C
   CUtlStringToken m_currentDeafnessFilter; // 0x12A0 - 0x12A0
   CUtlVector< CHandle< CCSPlayerPawnBase > > m_enemyPlayersKilledThisRound; // 0x12A8 - 0x12A8
   std::int32_t m_NumEnemiesKilledThisSpawn; // 0x12C0 - 0x12C0
   std::int32_t m_maxNumEnemiesKillStreak; // 0x12C4 - 0x12C4
   std::int32_t m_NumEnemiesKilledThisRound; // 0x12C8 - 0x12C8
   std::int32_t m_NumEnemiesAtRoundStart; // 0x12CC - 0x12CC
   std::int32_t m_iRoundsWon; // 0x12D0 - 0x12D0
   bool m_bHasUsedDMBonusRespawn; // 0x12D4 - 0x12D4
   std::int32_t m_lastRoundResult; // 0x12D8 - 0x12D8
   bool m_wasNotKilledNaturally; // 0x12DC - 0x12DC
   uint32 m_vecPlayerPatchEconIndices[5]; // 0x12E0 - 0x12E0
   std::int32_t m_iDeathFlags; // 0x12F4 - 0x12F4
   CHandle< CChicken > m_hPet; // 0x12F8 - 0x12F8
   std::float_t m_flLastKnownAccumulatedWeaponEncumbrance; // 0x12FC - 0x12FC
   std::float_t m_flLastTimeComputedAccumulatedWeaponEncumbrance; // 0x1300 - 0x1300
   std::uint16_t m_unCurrentEquipmentValue; // 0x14D0 - 0x14D0
   std::uint16_t m_unRoundStartEquipmentValue; // 0x14D2 - 0x14D2
   std::uint16_t m_unFreezetimeEndEquipmentValue; // 0x14D4 - 0x14D4
   char m_szLastPlaceName[18]; // 0x14D6 - 0x14D6
   std::int32_t m_nSuicides; // 0x14E8 - 0x14E8
   std::int32_t m_nSurvivalTeamNumber; // 0x14EC - 0x14EC
   QAngle m_aimPunchAngle; // 0x14F0 - 0x14F0
   QAngle m_aimPunchAngleVel; // 0x14FC - 0x14FC
   std::int32_t m_aimPunchTickBase; // 0x1508 - 0x1508
   std::float_t m_aimPunchTickFraction; // 0x150C - 0x150C
   CUtlVector< QAngle > m_aimPunchCache; // 0x1510 - 0x1510
   bool m_bHasDeathInfo; // 0x1528 - 0x1528
   std::float_t m_flDeathInfoTime; // 0x152C - 0x152C
   Vector m_vecDeathInfoOrigin; // 0x1530 - 0x1530
   bool m_bKilledByHeadshot; // 0x153C - 0x153C
   std::int32_t m_LastHitBox; // 0x1540 - 0x1540
   std::int32_t m_LastHealth; // 0x1544 - 0x1544
   std::float_t m_flLastCollisionCeiling; // 0x1548 - 0x1548
   std::float_t m_flLastCollisionCeilingChangeTime; // 0x154C - 0x154C
   CUtlString m_strVOPrefix; // 0x1550 - 0x1550
   std::float_t m_flLandseconds; // 0x1558 - 0x1558
   CCSBot* m_pBot; // 0x1560 - 0x1560
   bool m_bBotAllowActive; // 0x1568 - 0x1568
   bool m_bCommittingSuicideOnTeamChange; // 0x1569 - 0x1569

}; // size - 0x1570


class CContainerAnimNodeBase : public CAnimNodeBase
{
public:

   AnimNodeID m_inputNodeID; // 0x48 - 0x48
   AnimNodeID m_outputNodeID; // 0x4C - 0x4C
   CUtlHashtable< AnimNodeOutputID, CAnimNodeConnection > m_inputConnectionMap; // 0x50 - 0x50

}; // size - 0x70


class CCycleBase
{
public:

   std::float_t m_flCycle; // 0x0 - 0x0

}; // size - 0x4


class CExampleSchemaVData_PolymorphicBase
{
public:

   std::int32_t m_nBase; // 0x8 - 0x8

}; // size - 0x10


class CFuncBrush : public CBaseModelEntity
{
public:

   BrushSolidities_e m_iSolidity; // 0x6F0 - 0x6F0
   std::int32_t m_iDisabled; // 0x6F4 - 0x6F4
   bool m_bSolidBsp; // 0x6F8 - 0x6F8
   CUtlSymbolLarge m_iszExcludedClass; // 0x700 - 0x700
   bool m_bInvertExclusion; // 0x708 - 0x708
   bool m_bScriptedMovement; // 0x709 - 0x709

}; // size - 0x710


class CFuncMoveLinear : public CBaseToggle
{
public:

   MoveLinearAuthoredPos_t m_authoredPosition; // 0x770 - 0x770
   QAngle m_angMoveEntitySpace; // 0x774 - 0x774
   Vector m_vecMoveDirParentSpace; // 0x780 - 0x780
   CUtlSymbolLarge m_soundStart; // 0x790 - 0x790
   CUtlSymbolLarge m_soundStop; // 0x798 - 0x798
   CUtlSymbolLarge m_currentSound; // 0x7A0 - 0x7A0
   std::float_t m_flBlockDamage; // 0x7A8 - 0x7A8
   std::float_t m_flStartPosition; // 0x7AC - 0x7AC
   std::float_t m_flMoveDistance; // 0x7B0 - 0x7B0
   CEntityIOOutput m_OnFullyOpen; // 0x7C0 - 0x7C0
   CEntityIOOutput m_OnFullyClosed; // 0x7E8 - 0x7E8
   bool m_bCreateNavObstacle; // 0x810 - 0x810

}; // size - 0x820


class CGeneralSpin : public CParticleFunctionOperator
{
public:

   std::int32_t m_nSpinRateDegrees; // 0x1F0 - 0x1F0
   std::int32_t m_nSpinRateMinDegrees; // 0x1F4 - 0x1F4
   std::float_t m_fSpinRateStopTime; // 0x1FC - 0x1FC

}; // size - 0x210


class CLogicalEntity : public C_BaseEntity
{
public:


}; // size - 0x538


class CMotionItem
{
public:

   CMotionParameterManager m_paramManager; // 0x28 - 0x28
   CUtlVector< CSmartPtr< CAnimTagSpan > > m_blockSpans; // 0x50 - 0x50
   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x68 - 0x68
   CUtlVector< CSmartPtr< CAnimParamSpan > > m_paramSpans; // 0x80 - 0x80
   bool m_bLoop; // 0xA0 - 0xA0

}; // size - 0xA8


class CMotionNode
{
public:

   CUtlString m_name; // 0x18 - 0x18
   AnimNodeID m_id; // 0x20 - 0x20

}; // size - 0x28


class CParticleVecInput
{
public:

   ParticleVecType_t m_nType; // 0x0 - 0x0
   Vector m_vLiteralValue; // 0x4 - 0x4
   Color m_LiteralColor; // 0x10 - 0x10
   CKV3MemberNameWithStorage m_NamedValue; // 0x18 - 0x18
   bool m_bFollowNamedValue; // 0x50 - 0x50
   ParticleAttributeIndex_t m_nVectorAttribute; // 0x54 - 0x54
   Vector m_vVectorAttributeScale; // 0x58 - 0x58
   std::int32_t m_nControlPoint; // 0x64 - 0x64
   Vector m_vCPValueScale; // 0x68 - 0x68
   Vector m_vCPRelativePosition; // 0x74 - 0x74
   Vector m_vCPRelativeDir; // 0x80 - 0x80
   CParticleFloatInput m_FloatComponentX; // 0x90 - 0x90
   CParticleFloatInput m_FloatComponentY; // 0x1C8 - 0x1C8
   CParticleFloatInput m_FloatComponentZ; // 0x300 - 0x300
   CParticleFloatInput m_FloatInterp; // 0x438 - 0x438
   std::float_t m_flInterpInput0; // 0x570 - 0x570
   std::float_t m_flInterpInput1; // 0x574 - 0x574
   Vector m_vInterpOutput0; // 0x578 - 0x578
   Vector m_vInterpOutput1; // 0x584 - 0x584
   CColorGradient m_Gradient; // 0x590 - 0x590
   Vector m_vRandomMin; // 0x5A8 - 0x5A8
   Vector m_vRandomMax; // 0x5B4 - 0x5B4

}; // size - 0x5C8


class CPathAnimMotorBase : public CAnimMotorBase
{
public:

   bool m_bLockToPath; // 0x28 - 0x28

}; // size - 0x30


class CPathAnimMotorUpdaterBase : public CAnimMotorUpdaterBase
{
public:

   bool m_bLockToPath; // 0x20 - 0x20

}; // size - 0x28


class CPhysForce : public CPointEntity
{
public:

   CUtlSymbolLarge m_nameAttach; // 0x4A8 - 0x4A8
   std::float_t m_force; // 0x4B0 - 0x4B0
   std::float_t m_forceTime; // 0x4B4 - 0x4B4
   CHandle< CBaseEntity > m_attachedObject; // 0x4B8 - 0x4B8
   bool m_wasRestored; // 0x4BC - 0x4BC
   CConstantForceController m_integrator; // 0x4C0 - 0x4C0

}; // size - 0x500


class CPointClientUIWorldPanel : public CBaseClientUIEntity
{
public:

   bool m_bIgnoreInput; // 0x8A0 - 0x8A0
   bool m_bLit; // 0x8A1 - 0x8A1
   bool m_bFollowPlayerAcrossTeleport; // 0x8A2 - 0x8A2
   std::float_t m_flWidth; // 0x8A4 - 0x8A4
   std::float_t m_flHeight; // 0x8A8 - 0x8A8
   std::float_t m_flDPI; // 0x8AC - 0x8AC
   std::float_t m_flInteractDistance; // 0x8B0 - 0x8B0
   std::float_t m_flDepthOffset; // 0x8B4 - 0x8B4
   std::uint32_t m_unOwnerContext; // 0x8B8 - 0x8B8
   std::uint32_t m_unHorizontalAlign; // 0x8BC - 0x8BC
   std::uint32_t m_unVerticalAlign; // 0x8C0 - 0x8C0
   std::uint32_t m_unOrientation; // 0x8C4 - 0x8C4
   bool m_bAllowInteractionFromAllSceneWorlds; // 0x8C8 - 0x8C8
   CNetworkUtlVectorBase< CUtlSymbolLarge > m_vecCSSClasses; // 0x8D0 - 0x8D0
   bool m_bOpaque; // 0x8E8 - 0x8E8
   bool m_bNoDepth; // 0x8E9 - 0x8E9
   bool m_bRenderBackface; // 0x8EA - 0x8EA
   bool m_bUseOffScreenIndicator; // 0x8EB - 0x8EB
   bool m_bExcludeFromSaveGames; // 0x8EC - 0x8EC
   bool m_bGrabbable; // 0x8ED - 0x8ED
   bool m_bOnlyRenderToTexture; // 0x8EE - 0x8EE
   bool m_bDisableMipGen; // 0x8EF - 0x8EF
   std::int32_t m_nExplicitImageLayout; // 0x8F0 - 0x8F0

}; // size - 0x8F8


class CProxyAnimNodeBase : public CAnimNodeBase
{
public:

   CUtlVector< CConnectionProxyItem > m_proxyItems; // 0x40 - 0x40

}; // size - 0x58


class CRagdollProp : public CBaseAnimGraph
{
public:

   ragdoll_t m_ragdoll; // 0x828 - 0x828
   bool m_bStartDisabled; // 0x860 - 0x860
   CNetworkUtlVectorBase< Vector > m_ragPos; // 0x868 - 0x868
   CNetworkUtlVectorBase< QAngle > m_ragAngles; // 0x880 - 0x880
   CHandle< CBaseEntity > m_hRagdollSource; // 0x898 - 0x898
   std::uint32_t m_lastUpdateTickCount; // 0x89C - 0x89C
   bool m_allAsleep; // 0x8A0 - 0x8A0
   bool m_bFirstCollisionAfterLaunch; // 0x8A1 - 0x8A1
   CHandle< CBaseEntity > m_hDamageEntity; // 0x8A4 - 0x8A4
   CHandle< CBaseEntity > m_hKiller; // 0x8A8 - 0x8A8
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x8AC - 0x8AC
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x8B0 - 0x8B0
   GameTime_t m_flFadeOutStartTime; // 0x8B4 - 0x8B4
   std::float_t m_flFadeTime; // 0x8B8 - 0x8B8
   Vector m_vecLastOrigin; // 0x8BC - 0x8BC
   GameTime_t m_flAwakeTime; // 0x8C8 - 0x8C8
   GameTime_t m_flLastOriginChangeTime; // 0x8CC - 0x8CC
   std::int32_t m_nBloodColor; // 0x8D0 - 0x8D0
   CUtlSymbolLarge m_strOriginClassName; // 0x8D8 - 0x8D8
   CUtlSymbolLarge m_strSourceClassName; // 0x8E0 - 0x8E0
   bool m_bHasBeenPhysgunned; // 0x8E8 - 0x8E8
   bool m_bShouldTeleportPhysics; // 0x8E9 - 0x8E9
   std::float_t m_flBlendWeight; // 0x8EC - 0x8EC
   std::float_t m_flDefaultFadeScale; // 0x8F0 - 0x8F0
   CUtlVector< Vector > m_ragdollMins; // 0x8F8 - 0x8F8
   CUtlVector< Vector > m_ragdollMaxs; // 0x910 - 0x910
   bool m_bShouldDeleteActivationRecord; // 0x928 - 0x928
   bool m_bValidatePoweredRagdollPose; // 0x988 - 0x988

}; // size - 0x9C8


class CSSDSMsg_LayerBase
{
public:

   SceneViewId_t m_viewId; // 0x0 - 0x0
   CUtlString m_ViewName; // 0x10 - 0x10
   std::int32_t m_nLayerIndex; // 0x18 - 0x18
   std::uint64_t m_nLayerId; // 0x20 - 0x20
   CUtlString m_LayerName; // 0x28 - 0x28
   CUtlString m_displayText; // 0x30 - 0x30

}; // size - 0x38


class CSceneEntity : public CPointEntity
{
public:

   CUtlSymbolLarge m_iszSceneFile; // 0x4A8 - 0x4A8
   CUtlSymbolLarge m_iszResumeSceneFile; // 0x4B0 - 0x4B0
   CUtlSymbolLarge m_iszTarget1; // 0x4B8 - 0x4B8
   CUtlSymbolLarge m_iszTarget2; // 0x4C0 - 0x4C0
   CUtlSymbolLarge m_iszTarget3; // 0x4C8 - 0x4C8
   CUtlSymbolLarge m_iszTarget4; // 0x4D0 - 0x4D0
   CUtlSymbolLarge m_iszTarget5; // 0x4D8 - 0x4D8
   CUtlSymbolLarge m_iszTarget6; // 0x4E0 - 0x4E0
   CUtlSymbolLarge m_iszTarget7; // 0x4E8 - 0x4E8
   CUtlSymbolLarge m_iszTarget8; // 0x4F0 - 0x4F0
   CHandle< CBaseEntity > m_hTarget1; // 0x4F8 - 0x4F8
   CHandle< CBaseEntity > m_hTarget2; // 0x4FC - 0x4FC
   CHandle< CBaseEntity > m_hTarget3; // 0x500 - 0x500
   CHandle< CBaseEntity > m_hTarget4; // 0x504 - 0x504
   CHandle< CBaseEntity > m_hTarget5; // 0x508 - 0x508
   CHandle< CBaseEntity > m_hTarget6; // 0x50C - 0x50C
   CHandle< CBaseEntity > m_hTarget7; // 0x510 - 0x510
   CHandle< CBaseEntity > m_hTarget8; // 0x514 - 0x514
   bool m_bIsPlayingBack; // 0x518 - 0x518
   bool m_bPaused; // 0x519 - 0x519
   bool m_bMultiplayer; // 0x51A - 0x51A
   bool m_bAutogenerated; // 0x51B - 0x51B
   std::float_t m_flForceClientTime; // 0x51C - 0x51C
   std::float_t m_flCurrentTime; // 0x520 - 0x520
   std::float_t m_flFrameTime; // 0x524 - 0x524
   bool m_bCancelAtNextInterrupt; // 0x528 - 0x528
   std::float_t m_fPitch; // 0x52C - 0x52C
   bool m_bAutomated; // 0x530 - 0x530
   std::int32_t m_nAutomatedAction; // 0x534 - 0x534
   std::float_t m_flAutomationDelay; // 0x538 - 0x538
   std::float_t m_flAutomationTime; // 0x53C - 0x53C
   CHandle< CBaseEntity > m_hWaitingForThisResumeScene; // 0x540 - 0x540
   bool m_bWaitingForResumeScene; // 0x544 - 0x544
   bool m_bPausedViaInput; // 0x545 - 0x545
   bool m_bPauseAtNextInterrupt; // 0x546 - 0x546
   bool m_bWaitingForActor; // 0x547 - 0x547
   bool m_bWaitingForInterrupt; // 0x548 - 0x548
   bool m_bInterruptedActorsScenes; // 0x549 - 0x549
   bool m_bBreakOnNonIdle; // 0x54A - 0x54A
   CNetworkUtlVectorBase< CHandle< CBaseFlex > > m_hActorList; // 0x550 - 0x550
   CUtlVector< CHandle< CBaseEntity > > m_hRemoveActorList; // 0x568 - 0x568
   std::int32_t m_nSceneFlushCounter; // 0x590 - 0x590
   std::uint16_t m_nSceneStringIndex; // 0x594 - 0x594
   CEntityIOOutput m_OnStart; // 0x598 - 0x598
   CEntityIOOutput m_OnCompletion; // 0x5C0 - 0x5C0
   CEntityIOOutput m_OnCanceled; // 0x5E8 - 0x5E8
   CEntityIOOutput m_OnPaused; // 0x610 - 0x610
   CEntityIOOutput m_OnResumed; // 0x638 - 0x638
   CEntityIOOutput m_OnTrigger[16]; // 0x660 - 0x660
   CHandle< CSceneEntity > m_hInterruptScene; // 0x970 - 0x970
   std::int32_t m_nInterruptCount; // 0x974 - 0x974
   bool m_bSceneMissing; // 0x978 - 0x978
   bool m_bInterrupted; // 0x979 - 0x979
   bool m_bCompletedEarly; // 0x97A - 0x97A
   bool m_bInterruptSceneFinished; // 0x97B - 0x97B
   bool m_bRestoring; // 0x97C - 0x97C
   CUtlVector< CHandle< CSceneEntity > > m_hNotifySceneCompletion; // 0x980 - 0x980
   CUtlVector< CHandle< CSceneListManager > > m_hListManagers; // 0x998 - 0x998
   CUtlSymbolLarge m_iszSoundName; // 0x9D8 - 0x9D8
   CHandle< CBaseFlex > m_hActor; // 0x9E0 - 0x9E0
   CHandle< CBaseEntity > m_hActivator; // 0x9E4 - 0x9E4
   CHandle< CBaseEntity > m_hCamera; // 0x9E8 - 0x9E8
   std::int32_t m_BusyActor; // 0x9EC - 0x9EC
   SceneOnPlayerDeath_t m_iPlayerDeathBehavior; // 0x9F0 - 0x9F0

}; // size - 0xA00


class CServerOnlyModelEntity : public CBaseModelEntity
{
public:


}; // size - 0x6F0


class CSkeletonAnimationController
{
public:

   CSkeletonInstance* m_pSkeletonInstance; // 0x8 - 0x8

}; // size - 0x10


class CSosGroupActionSchema
{
public:

   CUtlString m_name; // 0x8 - 0x8
   ActionType_t m_actionType; // 0x10 - 0x10
   ActionType_t m_actionInstanceType; // 0x14 - 0x14

}; // size - 0x18


class CSoundAreaEntityBase : public CBaseEntity
{
public:

   bool m_bDisabled; // 0x4A0 - 0x4A0
   CUtlSymbolLarge m_iszSoundAreaType; // 0x4A8 - 0x4A8
   Vector m_vPos; // 0x4B0 - 0x4B0

}; // size - 0x4C0


class CTriggerHurt : public CBaseTrigger
{
public:

   std::float_t m_flOriginalDamage; // 0x898 - 0x898
   std::float_t m_flDamage; // 0x89C - 0x89C
   std::float_t m_flDamageCap; // 0x8A0 - 0x8A0
   GameTime_t m_flLastDmgTime; // 0x8A4 - 0x8A4
   std::float_t m_flForgivenessDelay; // 0x8A8 - 0x8A8
   std::int32_t m_bitsDamageInflict; // 0x8AC - 0x8AC
   std::int32_t m_damageModel; // 0x8B0 - 0x8B0
   bool m_bNoDmgForce; // 0x8B4 - 0x8B4
   Vector m_vDamageForce; // 0x8B8 - 0x8B8
   bool m_thinkAlways; // 0x8C4 - 0x8C4
   std::float_t m_hurtThinkPeriod; // 0x8C8 - 0x8C8
   CEntityIOOutput m_OnHurt; // 0x8D0 - 0x8D0
   CEntityIOOutput m_OnHurtPlayer; // 0x8F8 - 0x8F8
   CUtlVector< CHandle< CBaseEntity > > m_hurtEntities; // 0x920 - 0x920

}; // size - 0x938


class CTriggerOnce : public CTriggerMultiple
{
public:


}; // size - 0x8C0


class C_BarnLight : public C_BaseModelEntity
{
public:

   bool m_bEnabled; // 0x838 - 0x838
   std::int32_t m_nColorMode; // 0x83C - 0x83C
   Color m_Color; // 0x840 - 0x840
   std::float_t m_flColorTemperature; // 0x844 - 0x844
   std::float_t m_flBrightness; // 0x848 - 0x848
   std::float_t m_flBrightnessScale; // 0x84C - 0x84C
   std::int32_t m_nDirectLight; // 0x850 - 0x850
   std::int32_t m_nBakedShadowIndex; // 0x854 - 0x854
   std::int32_t m_nLuminaireShape; // 0x858 - 0x858
   std::float_t m_flLuminaireSize; // 0x85C - 0x85C
   std::float_t m_flLuminaireAnisotropy; // 0x860 - 0x860
   CUtlString m_LightStyleString; // 0x868 - 0x868
   GameTime_t m_flLightStyleStartTime; // 0x870 - 0x870
   C_NetworkUtlVectorBase< CUtlString > m_QueuedLightStyleStrings; // 0x878 - 0x878
   C_NetworkUtlVectorBase< CUtlString > m_LightStyleEvents; // 0x890 - 0x890
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_LightStyleTargets; // 0x8A8 - 0x8A8
   CEntityIOOutput m_StyleEvent[4]; // 0x8C0 - 0x8C0
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; // 0x960 - 0x960
   std::float_t m_flShape; // 0x968 - 0x968
   std::float_t m_flSoftX; // 0x96C - 0x96C
   std::float_t m_flSoftY; // 0x970 - 0x970
   std::float_t m_flSkirt; // 0x974 - 0x974
   std::float_t m_flSkirtNear; // 0x978 - 0x978
   Vector m_vSizeParams; // 0x97C - 0x97C
   std::float_t m_flRange; // 0x988 - 0x988
   Vector m_vShear; // 0x98C - 0x98C
   std::int32_t m_nBakeSpecularToCubemaps; // 0x998 - 0x998
   Vector m_vBakeSpecularToCubemapsSize; // 0x99C - 0x99C
   std::int32_t m_nCastShadows; // 0x9A8 - 0x9A8
   std::int32_t m_nShadowMapSize; // 0x9AC - 0x9AC
   std::int32_t m_nShadowPriority; // 0x9B0 - 0x9B0
   bool m_bContactShadow; // 0x9B4 - 0x9B4
   std::int32_t m_nBounceLight; // 0x9B8 - 0x9B8
   std::float_t m_flBounceScale; // 0x9BC - 0x9BC
   std::float_t m_flMinRoughness; // 0x9C0 - 0x9C0
   std::int32_t m_nFog; // 0x9C4 - 0x9C4
   std::float_t m_flFogStrength; // 0x9C8 - 0x9C8
   std::int32_t m_nFogShadows; // 0x9CC - 0x9CC
   std::float_t m_flFogScale; // 0x9D0 - 0x9D0
   std::float_t m_flFadeSizeStart; // 0x9D4 - 0x9D4
   std::float_t m_flFadeSizeEnd; // 0x9D8 - 0x9D8
   std::float_t m_flShadowFadeSizeStart; // 0x9DC - 0x9DC
   std::float_t m_flShadowFadeSizeEnd; // 0x9E0 - 0x9E0
   bool m_bPrecomputedFieldsValid; // 0x9E4 - 0x9E4
   Vector m_vPrecomputedBoundsMins; // 0x9E8 - 0x9E8
   Vector m_vPrecomputedBoundsMaxs; // 0x9F4 - 0x9F4
   Vector m_vPrecomputedOBBOrigin; // 0xA00 - 0xA00
   QAngle m_vPrecomputedOBBAngles; // 0xA0C - 0xA0C
   Vector m_vPrecomputedOBBExtent; // 0xA18 - 0xA18

}; // size - 0xA70


class C_CSGO_EndOfMatchLineupEndpoint : public C_BaseEntity
{
public:


}; // size - 0x538


class C_CSGO_PreviewPlayer : public C_CSPlayerPawn
{
public:

   CUtlString m_animgraph; // 0x19A8 - 0x19A8
   CUtlString m_animgraphCharacterModeString; // 0x19B0 - 0x19B0
   std::float_t m_flInitialModelScale; // 0x19B8 - 0x19B8

}; // size - 0x1A30


class C_CSGO_TeamIntroCharacterPosition : public C_CSGO_TeamPreviewCharacterPosition
{
public:


}; // size - 0x9D0


class C_CSGO_TeamSelectCharacterPosition : public C_CSGO_TeamPreviewCharacterPosition
{
public:


}; // size - 0x9D0


class C_FuncBrush : public C_BaseModelEntity
{
public:


}; // size - 0x838


class C_Item : public C_EconEntity
{
public:

   bool m_bShouldGlow; // 0x1070 - 0x1070
   char m_pReticleHintTextName[256]; // 0x1071 - 0x1071

}; // size - 0x1178


class C_OP_RemapDistanceToLineSegmentBase : public CParticleFunctionOperator
{
public:

   std::int32_t m_nCP0; // 0x1F0 - 0x1F0
   std::int32_t m_nCP1; // 0x1F4 - 0x1F4
   std::float_t m_flMinInputValue; // 0x1F8 - 0x1F8
   std::float_t m_flMaxInputValue; // 0x1FC - 0x1FC
   bool m_bInfiniteLine; // 0x200 - 0x200

}; // size - 0x210


class C_ParticleSystem : public C_BaseModelEntity
{
public:

   char m_szSnapshotFileName[512]; // 0x838 - 0x838
   bool m_bActive; // 0xA38 - 0xA38
   bool m_bFrozen; // 0xA39 - 0xA39
   std::float_t m_flFreezeTransitionDuration; // 0xA3C - 0xA3C
   std::int32_t m_nStopType; // 0xA40 - 0xA40
   bool m_bAnimateDuringGameplayPause; // 0xA44 - 0xA44
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0xA48 - 0xA48
   GameTime_t m_flStartTime; // 0xA50 - 0xA50
   std::float_t m_flPreSimTime; // 0xA54 - 0xA54
   Vector m_vServerControlPoints[4]; // 0xA58 - 0xA58
   uint8 m_iServerControlPointAssignments[4]; // 0xA88 - 0xA88
   CHandle< C_BaseEntity > m_hControlPointEnts[64]; // 0xA8C - 0xA8C
   bool m_bNoSave; // 0xB8C - 0xB8C
   bool m_bNoFreeze; // 0xB8D - 0xB8D
   bool m_bStartActive; // 0xB8E - 0xB8E
   CUtlSymbolLarge m_iszEffectName; // 0xB90 - 0xB90
   CUtlSymbolLarge m_iszControlPointNames[64]; // 0xB98 - 0xB98
   std::int32_t m_nDataCP; // 0xD98 - 0xD98
   Vector m_vecDataCPValue; // 0xD9C - 0xD9C
   std::int32_t m_nTintCP; // 0xDA8 - 0xDA8
   Color m_clrTint; // 0xDAC - 0xDAC
   bool m_bOldActive; // 0xDD0 - 0xDD0
   bool m_bOldFrozen; // 0xDD1 - 0xDD1

}; // size - 0xDE8


class C_SoundAreaEntityBase : public C_BaseEntity
{
public:

   bool m_bDisabled; // 0x538 - 0x538
   bool m_bWasEnabled; // 0x540 - 0x540
   CUtlSymbolLarge m_iszSoundAreaType; // 0x548 - 0x548
   Vector m_vPos; // 0x550 - 0x550

}; // size - 0x560


class EventAdvanceTick_t : public EventSimulate_t
{
public:

   std::int32_t m_nCurrentTick; // 0x30 - 0x30
   std::int32_t m_nCurrentTickThisFrame; // 0x34 - 0x34
   std::int32_t m_nTotalTicksThisFrame; // 0x38 - 0x38
   std::int32_t m_nTotalTicks; // 0x3C - 0x3C

}; // size - 0x40


class EventPostAdvanceTick_t : public EventSimulate_t
{
public:

   std::int32_t m_nCurrentTick; // 0x30 - 0x30
   std::int32_t m_nCurrentTickThisFrame; // 0x34 - 0x34
   std::int32_t m_nTotalTicksThisFrame; // 0x38 - 0x38
   std::int32_t m_nTotalTicks; // 0x3C - 0x3C

}; // size - 0x40


class IEconItemInterface
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class AmmoTypeInfo_t
{
public:

   std::int32_t m_nMaxCarry; // 0x10 - 0x10
   CRangeInt m_nSplashSize; // 0x1C - 0x1C
   AmmoFlags_t m_nFlags; // 0x24 - 0x24
   std::float_t m_flMass; // 0x28 - 0x28
   CRangeFloat m_flSpeed; // 0x2C - 0x2C

}; // size - 0x38


class AnimationSnapshotBase_t
{
public:

   std::float_t m_flRealTime; // 0x0 - 0x0
   matrix3x4a_t m_rootToWorld; // 0x10 - 0x10
   bool m_bBonesInWorldSpace; // 0x40 - 0x40
   CUtlVector< uint32 > m_boneSetupMask; // 0x48 - 0x48
   CUtlVector< matrix3x4a_t > m_boneTransforms; // 0x60 - 0x60
   CUtlVector< float32 > m_flexControllers; // 0x78 - 0x78
   AnimationSnapshotType_t m_SnapshotType; // 0x90 - 0x90
   bool m_bHasDecodeDump; // 0x94 - 0x94
   AnimationDecodeDebugDumpElement_t m_DecodeDump; // 0x98 - 0x98

}; // size - 0x110


class CAI_ExpresserWithFollowup : public CAI_Expresser
{
public:

   ResponseFollowup* m_pPostponedFollowup; // 0x60 - 0x60

}; // size - 0x70


class CAnimGraphSettingsGroup
{
public:


}; // size - 0x20


class CAnimNodeManager
{
public:

   CUtlHashtable< AnimNodeID, CSmartPtr< CAnimNodeBase > > m_nodes; // 0x8 - 0x8

}; // size - 0x48


class CAnimationSubGraph
{
public:

   CAnimNodeManager m_nodeManager; // 0x8 - 0x8
   CAnimComponentManager m_componentManager; // 0x50 - 0x50
   CUtlVector< CSmartPtr< CAnimParameterBase > > m_localParameters; // 0x78 - 0x78
   CUtlVector< CSmartPtr< CAnimTagBase > > m_localTags; // 0x90 - 0x90
   CUtlVector< CUtlString > m_referencedParamGroups; // 0xA8 - 0xA8
   CUtlVector< CUtlString > m_referencedTagGroups; // 0xC0 - 0xC0

}; // size - 0xE0


class CAttributeManager
{
public:

   class cached_attribute_float_t
   {
   public:

      std::float_t flIn; // 0x0 - 0x0
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x8
      std::float_t flOut; // 0x10 - 0x10

   }; // size - 0x18

   class cached_attribute_float_t
   {
   public:

      std::float_t flIn; // 0x0 - 0x0
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x8
      std::float_t flOut; // 0x10 - 0x10

   }; // size - 0x18

   CUtlVector< CHandle< CBaseEntity > > m_Providers; // 0x8 - 0x8
   std::int32_t m_iReapplyProvisionParity; // 0x20 - 0x20
   CHandle< CBaseEntity > m_hOuter; // 0x24 - 0x24
   bool m_bPreventLoopback; // 0x28 - 0x28
   attributeprovidertypes_t m_ProviderType; // 0x2C - 0x2C
   CUtlVector< CAttributeManager::cached_attribute_float_t > m_CachedResults; // 0x30 - 0x30

}; // size - 0x50


class CAttributeManager
{
public:

   class cached_attribute_float_t
   {
   public:

      std::float_t flIn; // 0x0 - 0x0
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x8
      std::float_t flOut; // 0x10 - 0x10

   }; // size - 0x18

   class cached_attribute_float_t
   {
   public:

      std::float_t flIn; // 0x0 - 0x0
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x8
      std::float_t flOut; // 0x10 - 0x10

   }; // size - 0x18

   CUtlVector< CHandle< C_BaseEntity > > m_Providers; // 0x8 - 0x8
   std::int32_t m_iReapplyProvisionParity; // 0x20 - 0x20
   CHandle< C_BaseEntity > m_hOuter; // 0x24 - 0x24
   bool m_bPreventLoopback; // 0x28 - 0x28
   attributeprovidertypes_t m_ProviderType; // 0x2C - 0x2C
   CUtlVector< CAttributeManager::cached_attribute_float_t > m_CachedResults; // 0x30 - 0x30

}; // size - 0x50


class CBaseFire : public CBaseEntity
{
public:

   std::float_t m_flScale; // 0x4A0 - 0x4A0
   std::float_t m_flStartScale; // 0x4A4 - 0x4A4
   std::float_t m_flScaleTime; // 0x4A8 - 0x4A8
   std::uint32_t m_nFlags; // 0x4AC - 0x4AC

}; // size - 0x4B0


class CBasePlayerController : public C_BaseEntity
{
public:

   std::int32_t m_nFinalPredictedTick; // 0x540 - 0x540
   C_CommandContext m_CommandContext; // 0x548 - 0x548
   std::uint64_t m_nInButtonsWhichAreToggles; // 0x5C8 - 0x5C8
   std::uint32_t m_nTickBase; // 0x5D0 - 0x5D0
   CHandle< C_BasePlayerPawn > m_hPawn; // 0x5D4 - 0x5D4
   CHandle< C_BasePlayerPawn > m_hPredictedPawn; // 0x5D8 - 0x5D8
   CSplitScreenSlot m_nSplitScreenSlot; // 0x5DC - 0x5DC
   CHandle< CBasePlayerController > m_hSplitOwner; // 0x5E0 - 0x5E0
   CUtlVector< CHandle< CBasePlayerController > > m_hSplitScreenPlayers; // 0x5E8 - 0x5E8
   bool m_bIsHLTV; // 0x600 - 0x600
   PlayerConnectedState m_iConnected; // 0x604 - 0x604
   char m_iszPlayerName[128]; // 0x608 - 0x608
   std::uint64_t m_steamID; // 0x690 - 0x690
   bool m_bIsLocalPlayerController; // 0x698 - 0x698
   std::uint32_t m_iDesiredFOV; // 0x69C - 0x69C

}; // size - 0x6A0


class CBasePlayerController : public CBaseEntity
{
public:

   std::uint64_t m_nInButtonsWhichAreToggles; // 0x4A8 - 0x4A8
   std::uint32_t m_nTickBase; // 0x4B0 - 0x4B0
   CHandle< CBasePlayerPawn > m_hPawn; // 0x4E0 - 0x4E0
   CSplitScreenSlot m_nSplitScreenSlot; // 0x4E4 - 0x4E4
   CHandle< CBasePlayerController > m_hSplitOwner; // 0x4E8 - 0x4E8
   CUtlVector< CHandle< CBasePlayerController > > m_hSplitScreenPlayers; // 0x4F0 - 0x4F0
   bool m_bIsHLTV; // 0x508 - 0x508
   PlayerConnectedState m_iConnected; // 0x50C - 0x50C
   char m_iszPlayerName[128]; // 0x510 - 0x510
   CUtlString m_szNetworkIDString; // 0x590 - 0x590
   std::float_t m_fLerpTime; // 0x598 - 0x598
   bool m_bLagCompensation; // 0x59C - 0x59C
   bool m_bPredict; // 0x59D - 0x59D
   bool m_bAutoKickDisabled; // 0x59E - 0x59E
   bool m_bIsLowViolence; // 0x59F - 0x59F
   bool m_bGamePaused; // 0x5A0 - 0x5A0
   std::int32_t m_nHighestCommandNumberReceived; // 0x618 - 0x618
   std::int64_t m_nUsecTimestampLastUserCmdReceived; // 0x620 - 0x620
   ChatIgnoreType_t m_iIgnoreGlobalChat; // 0x638 - 0x638
   std::float_t m_flLastPlayerTalkTime; // 0x63C - 0x63C
   std::float_t m_flLastEntitySteadyState; // 0x640 - 0x640
   std::int32_t m_nAvailableEntitySteadyState; // 0x644 - 0x644
   bool m_bHasAnySteadyStateEnts; // 0x648 - 0x648
   std::uint64_t m_steamID; // 0x658 - 0x658
   std::uint32_t m_iDesiredFOV; // 0x660 - 0x660

}; // size - 0x668


class CBasePlayerWeaponVData : public CEntitySubclassVDataBase
{
public:

   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_szWorldModel; // 0x28 - 0x28
   bool m_bBuiltRightHanded; // 0x108 - 0x108
   bool m_bAllowFlipping; // 0x109 - 0x109
   bool m_bIsFullAuto; // 0x10A - 0x10A
   std::int32_t m_nNumBullets; // 0x10C - 0x10C
   CUtlString m_sMuzzleAttachment; // 0x110 - 0x110
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szMuzzleFlashParticle; // 0x118 - 0x118
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szTracerParticle; // 0x1F8 - 0x1F8
   ItemFlagTypes_t m_iFlags; // 0x2D8 - 0x2D8
   AmmoIndex_t m_nPrimaryAmmoType; // 0x2D9 - 0x2D9
   AmmoIndex_t m_nSecondaryAmmoType; // 0x2DA - 0x2DA
   std::int32_t m_iMaxClip1; // 0x2DC - 0x2DC
   std::int32_t m_iMaxClip2; // 0x2E0 - 0x2E0
   std::int32_t m_iDefaultClip1; // 0x2E4 - 0x2E4
   std::int32_t m_iDefaultClip2; // 0x2E8 - 0x2E8
   std::int32_t m_iWeight; // 0x2EC - 0x2EC
   bool m_bAutoSwitchTo; // 0x2F0 - 0x2F0
   bool m_bAutoSwitchFrom; // 0x2F1 - 0x2F1
   RumbleEffect_t m_iRumbleEffect; // 0x2F4 - 0x2F4
   CUtlMap< WeaponSound_t, CSoundEventName > m_aShootSounds; // 0x2F8 - 0x2F8
   std::int32_t m_iSlot; // 0x318 - 0x318
   std::int32_t m_iPosition; // 0x31C - 0x31C

}; // size - 0x320


class CBasePlayerWeaponVData : public CEntitySubclassVDataBase
{
public:

   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_szWorldModel; // 0x28 - 0x28
   bool m_bBuiltRightHanded; // 0x108 - 0x108
   bool m_bAllowFlipping; // 0x109 - 0x109
   bool m_bIsFullAuto; // 0x10A - 0x10A
   std::int32_t m_nNumBullets; // 0x10C - 0x10C
   CUtlString m_sMuzzleAttachment; // 0x110 - 0x110
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szMuzzleFlashParticle; // 0x118 - 0x118
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szTracerParticle; // 0x1F8 - 0x1F8
   ItemFlagTypes_t m_iFlags; // 0x2D8 - 0x2D8
   AmmoIndex_t m_nPrimaryAmmoType; // 0x2D9 - 0x2D9
   AmmoIndex_t m_nSecondaryAmmoType; // 0x2DA - 0x2DA
   std::int32_t m_iMaxClip1; // 0x2DC - 0x2DC
   std::int32_t m_iMaxClip2; // 0x2E0 - 0x2E0
   std::int32_t m_iDefaultClip1; // 0x2E4 - 0x2E4
   std::int32_t m_iDefaultClip2; // 0x2E8 - 0x2E8
   std::int32_t m_iWeight; // 0x2EC - 0x2EC
   bool m_bAutoSwitchTo; // 0x2F0 - 0x2F0
   bool m_bAutoSwitchFrom; // 0x2F1 - 0x2F1
   RumbleEffect_t m_iRumbleEffect; // 0x2F4 - 0x2F4
   CUtlMap< WeaponSound_t, CSoundEventName > m_aShootSounds; // 0x2F8 - 0x2F8
   std::int32_t m_iSlot; // 0x318 - 0x318
   std::int32_t m_iPosition; // 0x31C - 0x31C

}; // size - 0x320


class CBaseTrailRenderer : public CBaseRendererSource2
{
public:

   ParticleOrientationChoiceList_t m_nOrientationType; // 0x2050 - 0x2050
   std::int32_t m_nOrientationControlPoint; // 0x2054 - 0x2054
   std::float_t m_flMinSize; // 0x2058 - 0x2058
   std::float_t m_flMaxSize; // 0x205C - 0x205C
   CParticleCollectionFloatInput m_flStartFadeSize; // 0x2060 - 0x2060
   CParticleCollectionFloatInput m_flEndFadeSize; // 0x2198 - 0x2198
   bool m_bClampV; // 0x22D0 - 0x22D0

}; // size - 0x22E0


class CBot
{
public:

   CCSPlayerPawnBase* m_pPlayer; // 0x10 - 0x10
   bool m_bHasSpawned; // 0x18 - 0x18
   std::uint32_t m_id; // 0x1C - 0x1C
   bool m_isRunning; // 0x90 - 0x90
   bool m_isCrouching; // 0x91 - 0x91
   std::float_t m_forwardSpeed; // 0x94 - 0x94
   std::float_t m_leftSpeed; // 0x98 - 0x98
   std::float_t m_verticalSpeed; // 0x9C - 0x9C
   std::uint64_t m_buttonFlags; // 0xA0 - 0xA0
   std::float_t m_jumpTimestamp; // 0xA8 - 0xA8
   Vector m_viewForward; // 0xAC - 0xAC
   std::int32_t m_postureStackIndex; // 0xC8 - 0xC8

}; // size - 0xD0


class CBtNodeCondition : public CBtNodeDecorator
{
public:

   bool m_bNegated; // 0x58 - 0x58

}; // size - 0x60


class CEnvCubemap : public CBaseEntity
{
public:

   CStrongHandle< InfoForResourceTypeCTextureBase > m_hCubemapTexture; // 0x590 - 0x590
   bool m_bCustomCubemapTexture; // 0x598 - 0x598
   std::float_t m_flInfluenceRadius; // 0x59C - 0x59C
   Vector m_vBoxProjectMins; // 0x5A0 - 0x5A0
   Vector m_vBoxProjectMaxs; // 0x5AC - 0x5AC
   CUtlSymbolLarge m_LightGroups; // 0x5B8 - 0x5B8
   bool m_bMoveable; // 0x5C0 - 0x5C0
   std::int32_t m_nHandshake; // 0x5C4 - 0x5C4
   std::int32_t m_nEnvCubeMapArrayIndex; // 0x5C8 - 0x5C8
   std::int32_t m_nPriority; // 0x5CC - 0x5CC
   std::float_t m_flEdgeFadeDist; // 0x5D0 - 0x5D0
   Vector m_vEdgeFadeDists; // 0x5D4 - 0x5D4
   std::float_t m_flDiffuseScale; // 0x5E0 - 0x5E0
   bool m_bStartDisabled; // 0x5E4 - 0x5E4
   bool m_bDefaultEnvMap; // 0x5E5 - 0x5E5
   bool m_bDefaultSpecEnvMap; // 0x5E6 - 0x5E6
   bool m_bIndoorCubeMap; // 0x5E7 - 0x5E7
   bool m_bCopyDiffuseFromDefaultCubemap; // 0x5E8 - 0x5E8
   bool m_bEnabled; // 0x5F8 - 0x5F8

}; // size - 0x600


class CEnvSoundscapeProxy : public CEnvSoundscape
{
public:

   CUtlSymbolLarge m_MainSoundscapeName; // 0x538 - 0x538

}; // size - 0x540


class CEnvSoundscapeTriggerable : public CEnvSoundscape
{
public:


}; // size - 0x538


class CFuncLadder : public CBaseModelEntity
{
public:

   Vector m_vecLadderDir; // 0x6F0 - 0x6F0
   CUtlVector< CHandle< CInfoLadderDismount > > m_Dismounts; // 0x700 - 0x700
   Vector m_vecLocalTop; // 0x718 - 0x718
   Vector m_vecPlayerMountPositionTop; // 0x724 - 0x724
   Vector m_vecPlayerMountPositionBottom; // 0x730 - 0x730
   std::float_t m_flAutoRideSpeed; // 0x73C - 0x73C
   bool m_bDisabled; // 0x740 - 0x740
   bool m_bFakeLadder; // 0x741 - 0x741
   bool m_bHasSlack; // 0x742 - 0x742
   CUtlSymbolLarge m_surfacePropName; // 0x748 - 0x748
   CEntityIOOutput m_OnPlayerGotOnLadder; // 0x750 - 0x750
   CEntityIOOutput m_OnPlayerGotOffLadder; // 0x778 - 0x778

}; // size - 0x7A0


class CFuncNavBlocker : public CBaseModelEntity
{
public:

   bool m_bDisabled; // 0x6F0 - 0x6F0
   std::int32_t m_nBlockedTeamNumber; // 0x6F4 - 0x6F4

}; // size - 0x700


class CFuncTrackChange : public CFuncPlatRot
{
public:

   CPathTrack* m_trackTop; // 0x7B8 - 0x7B8
   CPathTrack* m_trackBottom; // 0x7C0 - 0x7C0
   CFuncTrackTrain* m_train; // 0x7C8 - 0x7C8
   CUtlSymbolLarge m_trackTopName; // 0x7D0 - 0x7D0
   CUtlSymbolLarge m_trackBottomName; // 0x7D8 - 0x7D8
   CUtlSymbolLarge m_trainName; // 0x7E0 - 0x7E0
   TRAIN_CODE m_code; // 0x7E8 - 0x7E8
   std::int32_t m_targetState; // 0x7EC - 0x7EC
   std::int32_t m_use; // 0x7F0 - 0x7F0

}; // size - 0x7F8


class CFuncTrackTrain : public CBaseModelEntity
{
public:

   CHandle< CPathTrack > m_ppath; // 0x6F0 - 0x6F0
   std::float_t m_length; // 0x6F4 - 0x6F4
   Vector m_controlMins; // 0x6F8 - 0x6F8
   Vector m_controlMaxs; // 0x704 - 0x704
   Vector m_lastBlockPos; // 0x710 - 0x710
   std::int32_t m_lastBlockTick; // 0x71C - 0x71C
   std::float_t m_flVolume; // 0x720 - 0x720
   std::float_t m_flBank; // 0x724 - 0x724
   std::float_t m_oldSpeed; // 0x728 - 0x728
   std::float_t m_flBlockDamage; // 0x72C - 0x72C
   std::float_t m_height; // 0x730 - 0x730
   std::float_t m_maxSpeed; // 0x734 - 0x734
   std::float_t m_dir; // 0x738 - 0x738
   CUtlSymbolLarge m_iszSoundMove; // 0x740 - 0x740
   CUtlSymbolLarge m_iszSoundMovePing; // 0x748 - 0x748
   CUtlSymbolLarge m_iszSoundStart; // 0x750 - 0x750
   CUtlSymbolLarge m_iszSoundStop; // 0x758 - 0x758
   CUtlSymbolLarge m_strPathTarget; // 0x760 - 0x760
   std::float_t m_flMoveSoundMinDuration; // 0x768 - 0x768
   std::float_t m_flMoveSoundMaxDuration; // 0x76C - 0x76C
   GameTime_t m_flNextMoveSoundTime; // 0x770 - 0x770
   std::float_t m_flMoveSoundMinPitch; // 0x774 - 0x774
   std::float_t m_flMoveSoundMaxPitch; // 0x778 - 0x778
   TrainOrientationType_t m_eOrientationType; // 0x77C - 0x77C
   TrainVelocityType_t m_eVelocityType; // 0x780 - 0x780
   CEntityIOOutput m_OnStart; // 0x790 - 0x790
   CEntityIOOutput m_OnNext; // 0x7B8 - 0x7B8
   CEntityIOOutput m_OnArrivedAtDestinationNode; // 0x7E0 - 0x7E0
   bool m_bManualSpeedChanges; // 0x808 - 0x808
   std::float_t m_flDesiredSpeed; // 0x80C - 0x80C
   GameTime_t m_flSpeedChangeTime; // 0x810 - 0x810
   std::float_t m_flAccelSpeed; // 0x814 - 0x814
   std::float_t m_flDecelSpeed; // 0x818 - 0x818
   bool m_bAccelToSpeed; // 0x81C - 0x81C
   std::float_t m_flTimeScale; // 0x820 - 0x820
   GameTime_t m_flNextMPSoundTime; // 0x824 - 0x824

}; // size - 0x828


class CFuncWall : public CBaseModelEntity
{
public:

   std::int32_t m_nState; // 0x6F0 - 0x6F0

}; // size - 0x6F8


class CGameRulesProxy : public CBaseEntity
{
public:


}; // size - 0x4A0


class CGameSceneNode
{
public:

   CTransform m_nodeToWorld; // 0x10 - 0x10
   CEntityInstance* m_pOwner; // 0x30 - 0x30
   CGameSceneNode* m_pParent; // 0x38 - 0x38
   CGameSceneNode* m_pChild; // 0x40 - 0x40
   CGameSceneNode* m_pNextSibling; // 0x48 - 0x48
   CGameSceneNodeHandle m_hParent; // 0x70 - 0x70
   CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x80 - 0x80
   QAngle m_angRotation; // 0xB8 - 0xB8
   std::float_t m_flScale; // 0xC4 - 0xC4
   Vector m_vecAbsOrigin; // 0xC8 - 0xC8
   QAngle m_angAbsRotation; // 0xD4 - 0xD4
   std::float_t m_flAbsScale; // 0xE0 - 0xE0
   std::int16_t m_nParentAttachmentOrBone; // 0xE4 - 0xE4
   bool m_bDebugAbsOriginChanges; // 0xE6 - 0xE6
   bool m_bDormant; // 0xE7 - 0xE7
   bool m_bForceParentToBeNetworked; // 0xE8 - 0xE8
   bitfield:1 m_bDirtyHierarchy; // 0x0 - 0x0
   bitfield:1 m_bDirtyBoneMergeInfo; // 0x0 - 0x0
   bitfield:1 m_bNetworkedPositionChanged; // 0x0 - 0x0
   bitfield:1 m_bNetworkedAnglesChanged; // 0x0 - 0x0
   bitfield:1 m_bNetworkedScaleChanged; // 0x0 - 0x0
   bitfield:1 m_bWillBeCallingPostDataUpdate; // 0x0 - 0x0
   bitfield:1 m_bNotifyBoneTransformsChanged; // 0x0 - 0x0
   bitfield:1 m_bBoneMergeFlex; // 0x0 - 0x0
   bitfield:2 m_nLatchAbsOrigin; // 0x0 - 0x0
   bitfield:1 m_bDirtyBoneMergeBoneToRoot; // 0x0 - 0x0
   std::uint8_t m_nHierarchicalDepth; // 0xEB - 0xEB
   std::uint8_t m_nHierarchyType; // 0xEC - 0xEC
   std::uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0xED - 0xED
   CUtlStringToken m_name; // 0xF0 - 0xF0
   CUtlStringToken m_hierarchyAttachName; // 0x130 - 0x130
   std::float_t m_flZOffset; // 0x134 - 0x134
   Vector m_vRenderOrigin; // 0x138 - 0x138

}; // size - 0x150


class CGameSceneNode
{
public:

   CTransform m_nodeToWorld; // 0x10 - 0x10
   CEntityInstance* m_pOwner; // 0x30 - 0x30
   CGameSceneNode* m_pParent; // 0x38 - 0x38
   CGameSceneNode* m_pChild; // 0x40 - 0x40
   CGameSceneNode* m_pNextSibling; // 0x48 - 0x48
   CGameSceneNodeHandle m_hParent; // 0x70 - 0x70
   CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x80 - 0x80
   QAngle m_angRotation; // 0xB8 - 0xB8
   std::float_t m_flScale; // 0xC4 - 0xC4
   Vector m_vecAbsOrigin; // 0xC8 - 0xC8
   QAngle m_angAbsRotation; // 0xD4 - 0xD4
   std::float_t m_flAbsScale; // 0xE0 - 0xE0
   std::int16_t m_nParentAttachmentOrBone; // 0xE4 - 0xE4
   bool m_bDebugAbsOriginChanges; // 0xE6 - 0xE6
   bool m_bDormant; // 0xE7 - 0xE7
   bool m_bForceParentToBeNetworked; // 0xE8 - 0xE8
   bitfield:1 m_bDirtyHierarchy; // 0x0 - 0x0
   bitfield:1 m_bDirtyBoneMergeInfo; // 0x0 - 0x0
   bitfield:1 m_bNetworkedPositionChanged; // 0x0 - 0x0
   bitfield:1 m_bNetworkedAnglesChanged; // 0x0 - 0x0
   bitfield:1 m_bNetworkedScaleChanged; // 0x0 - 0x0
   bitfield:1 m_bWillBeCallingPostDataUpdate; // 0x0 - 0x0
   bitfield:1 m_bNotifyBoneTransformsChanged; // 0x0 - 0x0
   bitfield:1 m_bBoneMergeFlex; // 0x0 - 0x0
   bitfield:2 m_nLatchAbsOrigin; // 0x0 - 0x0
   bitfield:1 m_bDirtyBoneMergeBoneToRoot; // 0x0 - 0x0
   std::uint8_t m_nHierarchicalDepth; // 0xEB - 0xEB
   std::uint8_t m_nHierarchyType; // 0xEC - 0xEC
   std::uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0xED - 0xED
   CUtlStringToken m_name; // 0xF0 - 0xF0
   CUtlStringToken m_hierarchyAttachName; // 0x130 - 0x130
   std::float_t m_flZOffset; // 0x134 - 0x134
   Vector m_vRenderOrigin; // 0x138 - 0x138

}; // size - 0x150


class CHostage : public CHostageExpresserShim
{
public:

   CEntityIOOutput m_OnHostageBeginGrab; // 0x980 - 0x980
   CEntityIOOutput m_OnFirstPickedUp; // 0x9A8 - 0x9A8
   CEntityIOOutput m_OnDroppedNotRescued; // 0x9D0 - 0x9D0
   CEntityIOOutput m_OnRescued; // 0x9F8 - 0x9F8
   EntitySpottedState_t m_entitySpottedState; // 0xA20 - 0xA20
   std::int32_t m_nSpotRules; // 0xA38 - 0xA38
   std::uint32_t m_uiHostageSpawnExclusionGroupMask; // 0xA3C - 0xA3C
   std::uint32_t m_nHostageSpawnRandomFactor; // 0xA40 - 0xA40
   bool m_bRemove; // 0xA44 - 0xA44
   Vector m_vel; // 0xA48 - 0xA48
   bool m_isRescued; // 0xA54 - 0xA54
   bool m_jumpedThisFrame; // 0xA55 - 0xA55
   std::int32_t m_nHostageState; // 0xA58 - 0xA58
   CHandle< CBaseEntity > m_leader; // 0xA5C - 0xA5C
   CHandle< CCSPlayerPawnBase > m_lastLeader; // 0xA60 - 0xA60
   CountdownTimer m_reuseTimer; // 0xA68 - 0xA68
   bool m_hasBeenUsed; // 0xA80 - 0xA80
   Vector m_accel; // 0xA84 - 0xA84
   bool m_isRunning; // 0xA90 - 0xA90
   bool m_isCrouching; // 0xA91 - 0xA91
   CountdownTimer m_jumpTimer; // 0xA98 - 0xA98
   bool m_isWaitingForLeader; // 0xAB0 - 0xAB0
   CountdownTimer m_repathTimer; // 0x2AC0 - 0x2AC0
   CountdownTimer m_inhibitDoorTimer; // 0x2AD8 - 0x2AD8
   CountdownTimer m_inhibitObstacleAvoidanceTimer; // 0x2B68 - 0x2B68
   CountdownTimer m_wiggleTimer; // 0x2B88 - 0x2B88
   bool m_isAdjusted; // 0x2BA4 - 0x2BA4
   bool m_bHandsHaveBeenCut; // 0x2BA5 - 0x2BA5
   CHandle< CCSPlayerPawn > m_pHostageGrabber; // 0x2BA8 - 0x2BA8
   GameTime_t m_fLastGrabTime; // 0x2BAC - 0x2BAC
   std::float_t m_flGrabbingLength; // 0x2BB0 - 0x2BB0
   Vector m_vecPositionWhenStartedDroppingToGround; // 0x2BB4 - 0x2BB4
   Vector m_vecGrabbedPos; // 0x2BC0 - 0x2BC0
   GameTime_t m_flRescueStartTime; // 0x2BCC - 0x2BCC
   GameTime_t m_flGrabSuccessTime; // 0x2BD0 - 0x2BD0
   GameTime_t m_flDropStartTime; // 0x2BD4 - 0x2BD4
   std::int32_t m_nApproachRewardPayouts; // 0x2BD8 - 0x2BD8
   std::int32_t m_nPickupEventCount; // 0x2BDC - 0x2BDC
   Vector m_vecSpawnGroundPos; // 0x2BE0 - 0x2BE0

}; // size - 0x2C00


class CHostageRescueZoneShim : public CBaseTrigger
{
public:


}; // size - 0x898


class CInferno : public CBaseModelEntity
{
public:

   int32 m_fireXDelta[64]; // 0x700 - 0x700
   int32 m_fireYDelta[64]; // 0x800 - 0x800
   int32 m_fireZDelta[64]; // 0x900 - 0x900
   int32 m_fireParentXDelta[64]; // 0xA00 - 0xA00
   int32 m_fireParentYDelta[64]; // 0xB00 - 0xB00
   int32 m_fireParentZDelta[64]; // 0xC00 - 0xC00
   bool m_bFireIsBurning[64]; // 0xD00 - 0xD00
   Vector m_BurnNormal[64]; // 0xD40 - 0xD40
   std::int32_t m_fireCount; // 0x1040 - 0x1040
   std::int32_t m_nInfernoType; // 0x1044 - 0x1044
   std::int32_t m_nFireEffectTickBegin; // 0x1048 - 0x1048
   std::float_t m_nFireLifetime; // 0x104C - 0x104C
   bool m_bInPostEffectTime; // 0x1050 - 0x1050
   std::int32_t m_nFiresExtinguishCount; // 0x1054 - 0x1054
   bool m_bWasCreatedInSmoke; // 0x1058 - 0x1058
   Extent m_extent; // 0x1260 - 0x1260
   CountdownTimer m_damageTimer; // 0x1278 - 0x1278
   CountdownTimer m_damageRampTimer; // 0x1290 - 0x1290
   Vector m_splashVelocity; // 0x12A8 - 0x12A8
   Vector m_InitialSplashVelocity; // 0x12B4 - 0x12B4
   Vector m_startPos; // 0x12C0 - 0x12C0
   Vector m_vecOriginalSpawnLocation; // 0x12CC - 0x12CC
   IntervalTimer m_activeTimer; // 0x12D8 - 0x12D8
   std::int32_t m_fireSpawnOffset; // 0x12E8 - 0x12E8
   std::int32_t m_nMaxFlames; // 0x12EC - 0x12EC
   CountdownTimer m_BookkeepingTimer; // 0x12F0 - 0x12F0
   CountdownTimer m_NextSpreadTimer; // 0x1308 - 0x1308
   std::uint16_t m_nSourceItemDefIndex; // 0x1320 - 0x1320

}; // size - 0x1378


class CInfoDynamicShadowHint : public CPointEntity
{
public:

   bool m_bDisabled; // 0x4A0 - 0x4A0
   std::float_t m_flRange; // 0x4A4 - 0x4A4
   std::int32_t m_nImportance; // 0x4A8 - 0x4A8
   std::int32_t m_nLightChoice; // 0x4AC - 0x4AC
   CHandle< CBaseEntity > m_hLight; // 0x4B0 - 0x4B0

}; // size - 0x4B8


class CInfoDynamicShadowHint : public C_PointEntity
{
public:

   bool m_bDisabled; // 0x538 - 0x538
   std::float_t m_flRange; // 0x53C - 0x53C
   std::int32_t m_nImportance; // 0x540 - 0x540
   std::int32_t m_nLightChoice; // 0x544 - 0x544
   CHandle< C_BaseEntity > m_hLight; // 0x548 - 0x548

}; // size - 0x550


class CItemAssaultSuit : public CItem
{
public:


}; // size - 0x8F8


class CItemDefuser : public CItem
{
public:

   EntitySpottedState_t m_entitySpottedState; // 0x8F8 - 0x8F8
   std::int32_t m_nSpotRules; // 0x910 - 0x910

}; // size - 0x918


class CKnife : public CWeaponCSBase
{
public:


}; // size - 0xD50


class CLightDirectionalEntity : public CLightEntity
{
public:


}; // size - 0x6F8


class CLogicAutosave : public CLogicalEntity
{
public:

   bool m_bForceNewLevelUnit; // 0x4A0 - 0x4A0
   std::int32_t m_minHitPoints; // 0x4A4 - 0x4A4
   std::int32_t m_minHitPointsToCommit; // 0x4A8 - 0x4A8

}; // size - 0x4B0


class CLogicNPCCounterAABB : public CLogicNPCCounter
{
public:

   Vector m_vDistanceOuterMins; // 0x7E0 - 0x7E0
   Vector m_vDistanceOuterMaxs; // 0x7EC - 0x7EC
   Vector m_vOuterMins; // 0x7F8 - 0x7F8
   Vector m_vOuterMaxs; // 0x804 - 0x804

}; // size - 0x810


class CMarkupVolumeWithRef : public CMarkupVolumeTagged
{
public:

   bool m_bUseRef; // 0x730 - 0x730
   Vector m_vRefPos; // 0x734 - 0x734
   std::float_t m_flRefDot; // 0x740 - 0x740

}; // size - 0x748


class CMolotovGrenade : public CBaseCSGrenade
{
public:


}; // size - 0xD90


class CMotionGraph
{
public:

   CParamSpanUpdater m_paramSpans; // 0x10 - 0x10
   CUtlVector< TagSpan_t > m_tags; // 0x28 - 0x28
   CSmartPtr< CMotionNode > m_pRootNode; // 0x40 - 0x40
   std::int32_t m_nParameterCount; // 0x48 - 0x48
   std::int32_t m_nConfigStartIndex; // 0x4C - 0x4C
   std::int32_t m_nConfigCount; // 0x50 - 0x50
   bool m_bLoop; // 0x54 - 0x54

}; // size - 0x58


class CNavVolumeCalculatedVector : public CNavVolume
{
public:


}; // size - 0x98


class CNavVolumeSphere : public CNavVolume
{
public:

   Vector m_vCenter; // 0x70 - 0x70
   std::float_t m_flRadius; // 0x7C - 0x7C

}; // size - 0x80


class CNavVolumeVector : public CNavVolume
{
public:

   bool m_bHasBeenPreFiltered; // 0x78 - 0x78

}; // size - 0x98


class CParticleSystem : public CBaseModelEntity
{
public:

   char m_szSnapshotFileName[512]; // 0x6F0 - 0x6F0
   bool m_bActive; // 0x8F0 - 0x8F0
   bool m_bFrozen; // 0x8F1 - 0x8F1
   std::float_t m_flFreezeTransitionDuration; // 0x8F4 - 0x8F4
   std::int32_t m_nStopType; // 0x8F8 - 0x8F8
   bool m_bAnimateDuringGameplayPause; // 0x8FC - 0x8FC
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x900 - 0x900
   GameTime_t m_flStartTime; // 0x908 - 0x908
   std::float_t m_flPreSimTime; // 0x90C - 0x90C
   Vector m_vServerControlPoints[4]; // 0x910 - 0x910
   uint8 m_iServerControlPointAssignments[4]; // 0x940 - 0x940
   CHandle< CBaseEntity > m_hControlPointEnts[64]; // 0x944 - 0x944
   bool m_bNoSave; // 0xA44 - 0xA44
   bool m_bNoFreeze; // 0xA45 - 0xA45
   bool m_bStartActive; // 0xA46 - 0xA46
   CUtlSymbolLarge m_iszEffectName; // 0xA48 - 0xA48
   CUtlSymbolLarge m_iszControlPointNames[64]; // 0xA50 - 0xA50
   std::int32_t m_nDataCP; // 0xC50 - 0xC50
   Vector m_vecDataCPValue; // 0xC54 - 0xC54
   std::int32_t m_nTintCP; // 0xC60 - 0xC60
   Color m_clrTint; // 0xC64 - 0xC64

}; // size - 0xC68


class CPathCorner : public CPointEntity
{
public:

   std::float_t m_flWait; // 0x4A0 - 0x4A0
   std::float_t m_flRadius; // 0x4A4 - 0x4A4
   CEntityIOOutput m_OnPass; // 0x4A8 - 0x4A8

}; // size - 0x4D0


class CPathKeyFrame : public CLogicalEntity
{
public:

   Vector m_Origin; // 0x4A0 - 0x4A0
   QAngle m_Angles; // 0x4AC - 0x4AC
   Quaternion m_qAngle; // 0x4C0 - 0x4C0
   CUtlSymbolLarge m_iNextKey; // 0x4D0 - 0x4D0
   std::float_t m_flNextTime; // 0x4D8 - 0x4D8
   CPathKeyFrame* m_pNextKey; // 0x4E0 - 0x4E0
   CPathKeyFrame* m_pPrevKey; // 0x4E8 - 0x4E8
   std::float_t m_flSpeed; // 0x4F0 - 0x4F0

}; // size - 0x500


class CPathParticleRope : public CBaseEntity
{
public:

   bool m_bStartActive; // 0x4A0 - 0x4A0
   std::float_t m_flMaxSimulationTime; // 0x4A4 - 0x4A4
   CUtlSymbolLarge m_iszEffectName; // 0x4A8 - 0x4A8
   CUtlVector< CUtlSymbolLarge > m_PathNodes_Name; // 0x4B0 - 0x4B0
   std::float_t m_flParticleSpacing; // 0x4C8 - 0x4C8
   std::float_t m_flSlack; // 0x4CC - 0x4CC
   std::float_t m_flRadius; // 0x4D0 - 0x4D0
   Color m_ColorTint; // 0x4D4 - 0x4D4
   std::int32_t m_nEffectState; // 0x4D8 - 0x4D8
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x4E0 - 0x4E0
   CNetworkUtlVectorBase< Vector > m_PathNodes_Position; // 0x4E8 - 0x4E8
   CNetworkUtlVectorBase< Vector > m_PathNodes_TangentIn; // 0x500 - 0x500
   CNetworkUtlVectorBase< Vector > m_PathNodes_TangentOut; // 0x518 - 0x518
   CNetworkUtlVectorBase< Vector > m_PathNodes_Color; // 0x530 - 0x530
   CNetworkUtlVectorBase< bool > m_PathNodes_PinEnabled; // 0x548 - 0x548
   CNetworkUtlVectorBase< float32 > m_PathNodes_RadiusScale; // 0x560 - 0x560

}; // size - 0x580


class CPhysHinge : public CPhysConstraint
{
public:

   ConstraintSoundInfo m_soundInfo; // 0x500 - 0x500
   CEntityIOOutput m_NotifyMinLimitReached; // 0x588 - 0x588
   CEntityIOOutput m_NotifyMaxLimitReached; // 0x5B0 - 0x5B0
   bool m_bAtMinLimit; // 0x5D8 - 0x5D8
   bool m_bAtMaxLimit; // 0x5D9 - 0x5D9
   constraint_hingeparams_t m_hinge; // 0x5DC - 0x5DC
   std::float_t m_hingeFriction; // 0x61C - 0x61C
   std::float_t m_systemLoadScale; // 0x620 - 0x620
   bool m_bIsAxisLocal; // 0x624 - 0x624
   std::float_t m_flMinRotation; // 0x628 - 0x628
   std::float_t m_flMaxRotation; // 0x62C - 0x62C
   std::float_t m_flInitialRotation; // 0x630 - 0x630
   std::float_t m_flMotorFrequency; // 0x634 - 0x634
   std::float_t m_flMotorDampingRatio; // 0x638 - 0x638
   std::float_t m_flAngleSpeed; // 0x63C - 0x63C
   std::float_t m_flAngleSpeedThreshold; // 0x640 - 0x640
   CEntityIOOutput m_OnStartMoving; // 0x648 - 0x648
   CEntityIOOutput m_OnStopMoving; // 0x670 - 0x670

}; // size - 0x698


class CPlantedC4 : public CBaseAnimGraph
{
public:

   bool m_bPlantedAtQuestTarget; // 0x820 - 0x820
   bool m_bBombTicking; // 0x821 - 0x821
   GameTime_t m_flC4Blow; // 0x824 - 0x824
   std::int32_t m_nBombSite; // 0x828 - 0x828
   std::int32_t m_nSourceSoundscapeHash; // 0x82C - 0x82C
   CEntityIOOutput m_OnBombDefused; // 0x830 - 0x830
   CEntityIOOutput m_OnBombBeginDefuse; // 0x858 - 0x858
   CEntityIOOutput m_OnBombDefuseAborted; // 0x880 - 0x880
   bool m_bCannotBeDefused; // 0x8A8 - 0x8A8
   EntitySpottedState_t m_entitySpottedState; // 0x8B0 - 0x8B0
   std::int32_t m_nSpotRules; // 0x8C8 - 0x8C8
   bool m_bTrainingPlacedByPlayer; // 0x8CC - 0x8CC
   bool m_bHasExploded; // 0x8CD - 0x8CD
   std::float_t m_flTimerLength; // 0x8D0 - 0x8D0
   bool m_bBeingDefused; // 0x8D4 - 0x8D4
   GameTime_t m_fLastDefuseTime; // 0x8DC - 0x8DC
   std::float_t m_flDefuseLength; // 0x8E4 - 0x8E4
   GameTime_t m_flDefuseCountDown; // 0x8E8 - 0x8E8
   bool m_bBombDefused; // 0x8EC - 0x8EC
   CHandle< CCSPlayerPawnBase > m_hBombDefuser; // 0x8F0 - 0x8F0
   CEntityHandle m_hControlPanel; // 0x8F4 - 0x8F4
   std::int32_t m_iProgressBarTime; // 0x8F8 - 0x8F8
   bool m_bVoiceAlertFired; // 0x8FC - 0x8FC
   bool m_bVoiceAlertPlayed[4]; // 0x8FD - 0x8FD
   GameTime_t m_flNextBotBeepTime; // 0x904 - 0x904
   bool m_bPlantedAfterPickup; // 0x90C - 0x90C
   QAngle m_angCatchUpToPlayerEye; // 0x910 - 0x910
   GameTime_t m_flLastSpinDetectionTime; // 0x91C - 0x91C

}; // size - 0x920


class CPlayer_CameraServices : public CPlayerPawnComponent
{
public:

   std::uint32_t m_iFOV; // 0x40 - 0x40
   std::uint32_t m_iFOVStart; // 0x44 - 0x44
   GameTime_t m_flFOVTime; // 0x48 - 0x48
   std::float_t m_flFOVRate; // 0x4C - 0x4C
   QAngle m_vecPunchAngle; // 0x50 - 0x50
   QAngle m_vecPunchAngleVel; // 0x68 - 0x68
   GameTick_t m_nPunchAngleJoltTickClientSide; // 0x80 - 0x80
   GameTick_t m_nPunchAngleJoltTick; // 0x84 - 0x84
   CHandle< C_BaseEntity > m_hZoomOwner; // 0x88 - 0x88
   C_fogplayerparams_t m_PlayerFog; // 0x90 - 0x90
   CHandle< C_ColorCorrection > m_hColorCorrectionCtrl; // 0xD0 - 0xD0
   CHandle< C_BaseEntity > m_hViewEntity; // 0xD4 - 0xD4
   CHandle< C_TonemapController2 > m_hTonemapController; // 0xD8 - 0xD8
   audioparams_t m_audio; // 0xE0 - 0xE0
   C_NetworkUtlVectorBase< CHandle< C_PostProcessingVolume > > m_PostProcessingVolumes; // 0x158 - 0x158
   std::float_t m_flOldPlayerZ; // 0x170 - 0x170
   std::float_t m_flOldPlayerViewOffsetZ; // 0x174 - 0x174
   fogparams_t m_CurrentFog; // 0x178 - 0x178
   CHandle< C_FogController > m_hOldFogController; // 0x1E0 - 0x1E0
   bool m_bOverrideFogColor[5]; // 0x1E4 - 0x1E4
   Color m_OverrideFogColor[5]; // 0x1E9 - 0x1E9
   bool m_bOverrideFogStartEnd[5]; // 0x1FD - 0x1FD
   float32 m_fOverrideFogStart[5]; // 0x204 - 0x204
   float32 m_fOverrideFogEnd[5]; // 0x218 - 0x218
   CHandle< C_PostProcessingVolume > m_hActivePostProcessingVolume; // 0x22C - 0x22C
   QAngle m_angDemoViewAngles; // 0x230 - 0x230

}; // size - 0x248


class CPlayer_CameraServices : public CPlayerPawnComponent
{
public:

   std::uint32_t m_iFOV; // 0x40 - 0x40
   std::uint32_t m_iFOVStart; // 0x44 - 0x44
   GameTime_t m_flFOVTime; // 0x48 - 0x48
   std::float_t m_flFOVRate; // 0x4C - 0x4C
   QAngle m_vecPunchAngle; // 0x50 - 0x50
   QAngle m_vecPunchAngleVel; // 0x5C - 0x5C
   GameTick_t m_nPunchAngleJoltTick; // 0x68 - 0x68
   CHandle< CBaseEntity > m_hZoomOwner; // 0x6C - 0x6C
   fogplayerparams_t m_PlayerFog; // 0x70 - 0x70
   CHandle< CColorCorrection > m_hColorCorrectionCtrl; // 0xB0 - 0xB0
   CHandle< CBaseEntity > m_hViewEntity; // 0xB4 - 0xB4
   CHandle< CTonemapController2 > m_hTonemapController; // 0xB8 - 0xB8
   audioparams_t m_audio; // 0xC0 - 0xC0
   CNetworkUtlVectorBase< CHandle< CPostProcessingVolume > > m_PostProcessingVolumes; // 0x138 - 0x138
   std::float_t m_flOldPlayerZ; // 0x150 - 0x150
   std::float_t m_flOldPlayerViewOffsetZ; // 0x154 - 0x154
   CUtlVector< CHandle< CEnvSoundscapeTriggerable > > m_hTriggerSoundscapeList; // 0x170 - 0x170

}; // size - 0x188


class CPlayer_ItemServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CPlayer_ItemServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CPlayer_MovementServices_Humanoid : public CPlayer_MovementServices
{
public:

   std::float_t m_flStepSoundTime; // 0x1B8 - 0x1B8
   std::float_t m_flFallVelocity; // 0x1BC - 0x1BC
   bool m_bInCrouch; // 0x1C0 - 0x1C0
   std::uint32_t m_nCrouchState; // 0x1C4 - 0x1C4
   GameTime_t m_flCrouchTransitionStartTime; // 0x1C8 - 0x1C8
   bool m_bDucked; // 0x1CC - 0x1CC
   bool m_bDucking; // 0x1CD - 0x1CD
   bool m_bInDuckJump; // 0x1CE - 0x1CE
   Vector m_groundNormal; // 0x1D0 - 0x1D0
   std::float_t m_flSurfaceFriction; // 0x1DC - 0x1DC
   CUtlStringToken m_surfaceProps; // 0x1E0 - 0x1E0
   std::int32_t m_nStepside; // 0x1F0 - 0x1F0
   std::int32_t m_iTargetVolume; // 0x1F4 - 0x1F4
   Vector m_vecSmoothedVelocity; // 0x1F8 - 0x1F8

}; // size - 0x208


class CPlayer_MovementServices_Humanoid : public CPlayer_MovementServices
{
public:

   std::float_t m_flStepSoundTime; // 0x1B8 - 0x1B8
   std::float_t m_flFallVelocity; // 0x1BC - 0x1BC
   bool m_bInCrouch; // 0x1C0 - 0x1C0
   std::uint32_t m_nCrouchState; // 0x1C4 - 0x1C4
   GameTime_t m_flCrouchTransitionStartTime; // 0x1C8 - 0x1C8
   bool m_bDucked; // 0x1CC - 0x1CC
   bool m_bDucking; // 0x1CD - 0x1CD
   bool m_bInDuckJump; // 0x1CE - 0x1CE
   Vector m_groundNormal; // 0x1D0 - 0x1D0
   std::float_t m_flSurfaceFriction; // 0x1DC - 0x1DC
   CUtlStringToken m_surfaceProps; // 0x1E0 - 0x1E0
   std::int32_t m_nStepside; // 0x1F0 - 0x1F0

}; // size - 0x1F8


class CPlayer_ObserverServices : public CPlayerPawnComponent
{
public:

   std::uint8_t m_iObserverMode; // 0x40 - 0x40
   CHandle< CBaseEntity > m_hObserverTarget; // 0x44 - 0x44
   ObserverMode_t m_iObserverLastMode; // 0x48 - 0x48
   bool m_bForcedObserverMode; // 0x4C - 0x4C

}; // size - 0x50


class CPlayer_ObserverServices : public CPlayerPawnComponent
{
public:

   std::uint8_t m_iObserverMode; // 0x40 - 0x40
   CHandle< C_BaseEntity > m_hObserverTarget; // 0x44 - 0x44
   ObserverMode_t m_iObserverLastMode; // 0x48 - 0x48
   bool m_bForcedObserverMode; // 0x4C - 0x4C
   std::float_t m_flObserverChaseDistance; // 0x50 - 0x50

}; // size - 0x58


class CPlayer_UseServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CPlayer_UseServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CPlayer_WaterServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CPlayer_WaterServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CPlayer_WeaponServices : public CPlayerPawnComponent
{
public:

   bool m_bAllowSwitchToNoWeapon; // 0x40 - 0x40
   CNetworkUtlVectorBase< CHandle< CBasePlayerWeapon > > m_hMyWeapons; // 0x48 - 0x48
   CHandle< CBasePlayerWeapon > m_hActiveWeapon; // 0x60 - 0x60
   CHandle< CBasePlayerWeapon > m_hLastWeapon; // 0x64 - 0x64
   uint16 m_iAmmo[32]; // 0x68 - 0x68
   bool m_bPreventWeaponPickup; // 0xA8 - 0xA8

}; // size - 0xB0


class CPlayer_WeaponServices : public CPlayerPawnComponent
{
public:

   bool m_bAllowSwitchToNoWeapon; // 0x40 - 0x40
   C_NetworkUtlVectorBase< CHandle< C_BasePlayerWeapon > > m_hMyWeapons; // 0x48 - 0x48
   CHandle< C_BasePlayerWeapon > m_hActiveWeapon; // 0x60 - 0x60
   CHandle< C_BasePlayerWeapon > m_hLastWeapon; // 0x64 - 0x64
   uint16 m_iAmmo[32]; // 0x68 - 0x68

}; // size - 0xA8


class CPointCamera : public CBaseEntity
{
public:

   std::float_t m_FOV; // 0x4A0 - 0x4A0
   std::float_t m_Resolution; // 0x4A4 - 0x4A4
   bool m_bFogEnable; // 0x4A8 - 0x4A8
   Color m_FogColor; // 0x4A9 - 0x4A9
   std::float_t m_flFogStart; // 0x4B0 - 0x4B0
   std::float_t m_flFogEnd; // 0x4B4 - 0x4B4
   std::float_t m_flFogMaxDensity; // 0x4B8 - 0x4B8
   bool m_bActive; // 0x4BC - 0x4BC
   bool m_bUseScreenAspectRatio; // 0x4BD - 0x4BD
   std::float_t m_flAspectRatio; // 0x4C0 - 0x4C0
   bool m_bNoSky; // 0x4C4 - 0x4C4
   std::float_t m_fBrightness; // 0x4C8 - 0x4C8
   std::float_t m_flZFar; // 0x4CC - 0x4CC
   std::float_t m_flZNear; // 0x4D0 - 0x4D0
   bool m_bDofEnabled; // 0x4D4 - 0x4D4
   std::float_t m_flDofNearBlurry; // 0x4D8 - 0x4D8
   std::float_t m_flDofNearCrisp; // 0x4DC - 0x4DC
   std::float_t m_flDofFarCrisp; // 0x4E0 - 0x4E0
   std::float_t m_flDofFarBlurry; // 0x4E4 - 0x4E4
   std::float_t m_flDofTiltToGround; // 0x4E8 - 0x4E8
   std::float_t m_TargetFOV; // 0x4EC - 0x4EC
   std::float_t m_DegreesPerSecond; // 0x4F0 - 0x4F0
   bool m_bIsOn; // 0x4F4 - 0x4F4
   CPointCamera* m_pNext; // 0x4F8 - 0x4F8

}; // size - 0x500


class CPointDZItemSpawn : public CServerOnlyPointEntity
{
public:


}; // size - 0x4A8


class CPointDZItemSpawnGroup : public CServerOnlyPointEntity
{
public:

   std::float_t m_flRadius; // 0x4A0 - 0x4A0

}; // size - 0x4C0


class CPointHMDAnchor : public CBaseEntity
{
public:

   bool m_bDisabled; // 0x4A0 - 0x4A0
   GameTime_t m_flEnableTime; // 0x4A4 - 0x4A4
   std::int32_t m_nPlayerIndex; // 0x4A8 - 0x4A8

}; // size - 0x4B0


class CPredictedViewModel : public CBaseViewModel
{
public:


}; // size - 0x868


class CPropDoorRotatingBreakable : public CPropDoorRotating
{
public:

   bool m_bBreakable; // 0xDB8 - 0xDB8
   bool m_isAbleToCloseAreaPortals; // 0xDB9 - 0xDB9
   std::int32_t m_currentDamageState; // 0xDBC - 0xDBC
   CUtlVector< CUtlSymbolLarge > m_damageStates; // 0xDC0 - 0xDC0

}; // size - 0xDD8


class CRopeKeyframe : public CBaseModelEntity
{
public:

   std::uint16_t m_RopeFlags; // 0x6F8 - 0x6F8
   CUtlSymbolLarge m_iNextLinkName; // 0x700 - 0x700
   std::int16_t m_Slack; // 0x708 - 0x708
   std::float_t m_Width; // 0x70C - 0x70C
   std::float_t m_TextureScale; // 0x710 - 0x710
   std::uint8_t m_nSegments; // 0x714 - 0x714
   bool m_bConstrainBetweenEndpoints; // 0x715 - 0x715
   CUtlSymbolLarge m_strRopeMaterialModel; // 0x718 - 0x718
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_iRopeMaterialModelIndex; // 0x720 - 0x720
   std::uint8_t m_Subdiv; // 0x728 - 0x728
   std::uint8_t m_nChangeCount; // 0x729 - 0x729
   std::int16_t m_RopeLength; // 0x72A - 0x72A
   std::uint8_t m_fLockedPoints; // 0x72C - 0x72C
   bool m_bCreatedFromMapFile; // 0x72D - 0x72D
   std::float_t m_flScrollSpeed; // 0x730 - 0x730
   bool m_bStartPointValid; // 0x734 - 0x734
   bool m_bEndPointValid; // 0x735 - 0x735
   CHandle< CBaseEntity > m_hStartPoint; // 0x738 - 0x738
   CHandle< CBaseEntity > m_hEndPoint; // 0x73C - 0x73C
   AttachmentHandle_t m_iStartAttachment; // 0x740 - 0x740
   AttachmentHandle_t m_iEndAttachment; // 0x741 - 0x741

}; // size - 0x748


class CRotButton : public CBaseButton
{
public:


}; // size - 0x8B8


class CRuleBrushEntity : public CRuleEntity
{
public:


}; // size - 0x6F8


class CSAdditionalPerRoundStats_t
{
public:

   std::int32_t m_numChickensKilled; // 0x0 - 0x0
   std::int32_t m_killsWhileBlind; // 0x4 - 0x4
   std::int32_t m_bombCarrierkills; // 0x8 - 0x8
   std::int32_t m_iBurnDamageInflicted; // 0xC - 0xC
   std::int32_t m_iDinks; // 0x10 - 0x10

}; // size - 0x14


class CSPerRoundStats_t
{
public:

   std::int32_t m_iKills; // 0x30 - 0x30
   std::int32_t m_iDeaths; // 0x34 - 0x34
   std::int32_t m_iAssists; // 0x38 - 0x38
   std::int32_t m_iDamage; // 0x3C - 0x3C
   std::int32_t m_iEquipmentValue; // 0x40 - 0x40
   std::int32_t m_iMoneySaved; // 0x44 - 0x44
   std::int32_t m_iKillReward; // 0x48 - 0x48
   std::int32_t m_iLiveTime; // 0x4C - 0x4C
   std::int32_t m_iHeadShotKills; // 0x50 - 0x50
   std::int32_t m_iObjective; // 0x54 - 0x54
   std::int32_t m_iCashEarned; // 0x58 - 0x58
   std::int32_t m_iUtilityDamage; // 0x5C - 0x5C
   std::int32_t m_iEnemiesFlashed; // 0x60 - 0x60

}; // size - 0x68


class CSPerRoundStats_t
{
public:

   std::int32_t m_iKills; // 0x30 - 0x30
   std::int32_t m_iDeaths; // 0x34 - 0x34
   std::int32_t m_iAssists; // 0x38 - 0x38
   std::int32_t m_iDamage; // 0x3C - 0x3C
   std::int32_t m_iEquipmentValue; // 0x40 - 0x40
   std::int32_t m_iMoneySaved; // 0x44 - 0x44
   std::int32_t m_iKillReward; // 0x48 - 0x48
   std::int32_t m_iLiveTime; // 0x4C - 0x4C
   std::int32_t m_iHeadShotKills; // 0x50 - 0x50
   std::int32_t m_iObjective; // 0x54 - 0x54
   std::int32_t m_iCashEarned; // 0x58 - 0x58
   std::int32_t m_iUtilityDamage; // 0x5C - 0x5C
   std::int32_t m_iEnemiesFlashed; // 0x60 - 0x60

}; // size - 0x68


class CSequenceAnimNode : public CAnimNodeBase
{
public:

   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x68 - 0x68
   CUtlVector< CSmartPtr< CAnimParamSpan > > m_paramSpans; // 0x80 - 0x80
   CUtlString m_sequenceName; // 0x98 - 0x98
   std::float_t m_playbackSpeed; // 0xA0 - 0xA0
   bool m_bLoop; // 0xA4 - 0xA4

}; // size - 0xA8


class CSequenceUpdateNode : public CLeafUpdateNode
{
public:

   CParamSpanUpdater m_paramSpans; // 0x60 - 0x60
   CUtlVector< TagSpan_t > m_tags; // 0x78 - 0x78
   HSequence m_hSequence; // 0x94 - 0x94
   std::float_t m_playbackSpeed; // 0x98 - 0x98
   std::float_t m_duration; // 0x9C - 0x9C
   bool m_bLoop; // 0xA0 - 0xA0

}; // size - 0xA8


class CSosGroupBranchPattern
{
public:

   bool m_bMatchEventName; // 0x8 - 0x8
   bool m_bMatchEventSubString; // 0x9 - 0x9
   bool m_bMatchEntIndex; // 0xA - 0xA
   bool m_bMatchOpvar; // 0xB - 0xB

}; // size - 0x10


class CSoundOpvarSetAABBEntity : public CSoundOpvarSetPointEntity
{
public:

   Vector m_vDistanceInnerMins; // 0x638 - 0x638
   Vector m_vDistanceInnerMaxs; // 0x644 - 0x644
   Vector m_vDistanceOuterMins; // 0x650 - 0x650
   Vector m_vDistanceOuterMaxs; // 0x65C - 0x65C
   std::int32_t m_nAABBDirection; // 0x668 - 0x668
   Vector m_vInnerMins; // 0x66C - 0x66C
   Vector m_vInnerMaxs; // 0x678 - 0x678
   Vector m_vOuterMins; // 0x684 - 0x684
   Vector m_vOuterMaxs; // 0x690 - 0x690

}; // size - 0x6A0


class CSpinUpdateBase : public CParticleFunctionOperator
{
public:


}; // size - 0x1F0


class CStaticPoseCache
{
public:

   CUtlVector< CCachedPose > m_poses; // 0x10 - 0x10
   std::int32_t m_nBoneCount; // 0x28 - 0x28
   std::int32_t m_nMorphCount; // 0x2C - 0x2C

}; // size - 0x30


class CTabletBlockerShim : public CBaseTrigger
{
public:


}; // size - 0x898


class CTeam : public CBaseEntity
{
public:

   CNetworkUtlVectorBase< CHandle< CBasePlayerController > > m_aPlayerControllers; // 0x4A0 - 0x4A0
   CNetworkUtlVectorBase< CHandle< CBasePlayerPawn > > m_aPlayers; // 0x4B8 - 0x4B8
   std::int32_t m_iScore; // 0x4D0 - 0x4D0
   char m_szTeamname[129]; // 0x4D4 - 0x4D4

}; // size - 0x558


class CTeamplayRules : public CMultiplayRules
{
public:


}; // size - 0x90


class CTonemapController2 : public CBaseEntity
{
public:

   std::float_t m_flAutoExposureMin; // 0x4A0 - 0x4A0
   std::float_t m_flAutoExposureMax; // 0x4A4 - 0x4A4
   std::float_t m_flTonemapPercentTarget; // 0x4A8 - 0x4A8
   std::float_t m_flTonemapPercentBrightPixels; // 0x4AC - 0x4AC
   std::float_t m_flTonemapMinAvgLum; // 0x4B0 - 0x4B0
   std::float_t m_flExposureAdaptationSpeedUp; // 0x4B4 - 0x4B4
   std::float_t m_flExposureAdaptationSpeedDown; // 0x4B8 - 0x4B8
   std::float_t m_flTonemapEVSmoothingRange; // 0x4BC - 0x4BC

}; // size - 0x4C8


class CTriggerCustomBounds : public CBaseTrigger
{
public:


}; // size - 0x898


class CTriggerPush : public CBaseTrigger
{
public:

   QAngle m_angPushEntitySpace; // 0x898 - 0x898
   Vector m_vecPushDirEntitySpace; // 0x8A4 - 0x8A4
   bool m_bTriggerOnStartTouch; // 0x8B0 - 0x8B0
   std::float_t m_flAlternateTicksFix; // 0x8B4 - 0x8B4
   std::float_t m_flPushSpeed; // 0x8B8 - 0x8B8

}; // size - 0x8C0


class CWeaponBaseItem : public CWeaponCSBase
{
public:

   CountdownTimer m_SequenceCompleteTimer; // 0xD50 - 0xD50
   bool m_bRedraw; // 0xD68 - 0xD68

}; // size - 0xD70


class C_BaseFire : public C_BaseEntity
{
public:

   std::float_t m_flScale; // 0x538 - 0x538
   std::float_t m_flStartScale; // 0x53C - 0x53C
   std::float_t m_flScaleTime; // 0x540 - 0x540
   std::uint32_t m_nFlags; // 0x544 - 0x544

}; // size - 0x548


class C_Breakable : public C_BaseModelEntity
{
public:


}; // size - 0x838


class C_CSGO_PreviewModel : public C_BaseFlex
{
public:

   CUtlString m_animgraph; // 0xB28 - 0xB28
   CUtlString m_animgraphCharacterModeString; // 0xB30 - 0xB30
   CUtlString m_defaultAnim; // 0xB38 - 0xB38
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0xB40 - 0xB40
   std::float_t m_flInitialModelScale; // 0xB44 - 0xB44

}; // size - 0xBF0


class C_EnvCubemap : public C_BaseEntity
{
public:

   CStrongHandle< InfoForResourceTypeCTextureBase > m_hCubemapTexture; // 0x628 - 0x628
   bool m_bCustomCubemapTexture; // 0x630 - 0x630
   std::float_t m_flInfluenceRadius; // 0x634 - 0x634
   Vector m_vBoxProjectMins; // 0x638 - 0x638
   Vector m_vBoxProjectMaxs; // 0x644 - 0x644
   CUtlSymbolLarge m_LightGroups; // 0x650 - 0x650
   bool m_bMoveable; // 0x658 - 0x658
   std::int32_t m_nHandshake; // 0x65C - 0x65C
   std::int32_t m_nEnvCubeMapArrayIndex; // 0x660 - 0x660
   std::int32_t m_nPriority; // 0x664 - 0x664
   std::float_t m_flEdgeFadeDist; // 0x668 - 0x668
   Vector m_vEdgeFadeDists; // 0x66C - 0x66C
   std::float_t m_flDiffuseScale; // 0x678 - 0x678
   bool m_bStartDisabled; // 0x67C - 0x67C
   bool m_bDefaultEnvMap; // 0x67D - 0x67D
   bool m_bDefaultSpecEnvMap; // 0x67E - 0x67E
   bool m_bIndoorCubeMap; // 0x67F - 0x67F
   bool m_bCopyDiffuseFromDefaultCubemap; // 0x680 - 0x680
   bool m_bEnabled; // 0x690 - 0x690

}; // size - 0x698


class C_GameRulesProxy : public C_BaseEntity
{
public:


}; // size - 0x538


class C_Inferno : public C_BaseModelEntity
{
public:

   ParticleIndex_t m_nfxFireDamageEffect; // 0x878 - 0x878
   int32 m_fireXDelta[64]; // 0x87C - 0x87C
   int32 m_fireYDelta[64]; // 0x97C - 0x97C
   int32 m_fireZDelta[64]; // 0xA7C - 0xA7C
   int32 m_fireParentXDelta[64]; // 0xB7C - 0xB7C
   int32 m_fireParentYDelta[64]; // 0xC7C - 0xC7C
   int32 m_fireParentZDelta[64]; // 0xD7C - 0xD7C
   bool m_bFireIsBurning[64]; // 0xE7C - 0xE7C
   Vector m_BurnNormal[64]; // 0xEBC - 0xEBC
   std::int32_t m_fireCount; // 0x11BC - 0x11BC
   std::int32_t m_nInfernoType; // 0x11C0 - 0x11C0
   std::float_t m_nFireLifetime; // 0x11C4 - 0x11C4
   bool m_bInPostEffectTime; // 0x11C8 - 0x11C8
   std::int32_t m_lastFireCount; // 0x11CC - 0x11CC
   std::int32_t m_nFireEffectTickBegin; // 0x11D0 - 0x11D0
   std::int32_t m_drawableCount; // 0x7DE0 - 0x7DE0
   bool m_blosCheck; // 0x7DE4 - 0x7DE4
   std::int32_t m_nlosperiod; // 0x7DE8 - 0x7DE8
   std::float_t m_maxFireHalfWidth; // 0x7DEC - 0x7DEC
   std::float_t m_maxFireHeight; // 0x7DF0 - 0x7DF0
   Vector m_minBounds; // 0x7DF4 - 0x7DF4
   Vector m_maxBounds; // 0x7E00 - 0x7E00
   std::float_t m_flLastGrassBurnThink; // 0x7E0C - 0x7E0C

}; // size - 0x7E20


class C_Knife : public C_WeaponCSBase
{
public:


}; // size - 0x13D0


class C_LightDirectionalEntity : public C_LightEntity
{
public:


}; // size - 0x840


class C_MolotovGrenade : public C_BaseCSGrenade
{
public:


}; // size - 0x1430


class C_OP_RenderPoints : public CParticleFunctionRenderer
{
public:

   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x230 - 0x230

}; // size - 0x240


class C_PathParticleRope : public C_BaseEntity
{
public:

   bool m_bStartActive; // 0x538 - 0x538
   std::float_t m_flMaxSimulationTime; // 0x53C - 0x53C
   CUtlSymbolLarge m_iszEffectName; // 0x540 - 0x540
   CUtlVector< CUtlSymbolLarge > m_PathNodes_Name; // 0x548 - 0x548
   std::float_t m_flParticleSpacing; // 0x560 - 0x560
   std::float_t m_flSlack; // 0x564 - 0x564
   std::float_t m_flRadius; // 0x568 - 0x568
   Color m_ColorTint; // 0x56C - 0x56C
   std::int32_t m_nEffectState; // 0x570 - 0x570
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x578 - 0x578
   C_NetworkUtlVectorBase< Vector > m_PathNodes_Position; // 0x580 - 0x580
   C_NetworkUtlVectorBase< Vector > m_PathNodes_TangentIn; // 0x598 - 0x598
   C_NetworkUtlVectorBase< Vector > m_PathNodes_TangentOut; // 0x5B0 - 0x5B0
   C_NetworkUtlVectorBase< Vector > m_PathNodes_Color; // 0x5C8 - 0x5C8
   C_NetworkUtlVectorBase< bool > m_PathNodes_PinEnabled; // 0x5E0 - 0x5E0
   C_NetworkUtlVectorBase< float32 > m_PathNodes_RadiusScale; // 0x5F8 - 0x5F8

}; // size - 0x640


class C_PlantedC4 : public CBaseAnimGraph
{
public:

   bool m_bBombTicking; // 0x998 - 0x998
   std::int32_t m_nBombSite; // 0x99C - 0x99C
   std::int32_t m_nSourceSoundscapeHash; // 0x9A0 - 0x9A0
   EntitySpottedState_t m_entitySpottedState; // 0x9A8 - 0x9A8
   GameTime_t m_flNextGlow; // 0x9C0 - 0x9C0
   GameTime_t m_flNextBeep; // 0x9C4 - 0x9C4
   GameTime_t m_flC4Blow; // 0x9C8 - 0x9C8
   std::float_t m_flTimerLength; // 0x9CC - 0x9CC
   std::float_t m_bTenSecWarning; // 0x9D0 - 0x9D0
   std::float_t m_bTriggerWarning; // 0x9D4 - 0x9D4
   std::float_t m_bExplodeWarning; // 0x9D8 - 0x9D8
   bool m_bLocalBRMusicPlayed; // 0x9DC - 0x9DC
   std::float_t m_flDefuseLength; // 0x9E0 - 0x9E0
   GameTime_t m_flDefuseCountDown; // 0x9E4 - 0x9E4
   bool m_bBombDefused; // 0x9E8 - 0x9E8
   CHandle< C_CSPlayerPawnBase > m_hBombDefuser; // 0x9EC - 0x9EC
   CEntityHandle m_hControlPanel; // 0x9F0 - 0x9F0
   CHandle< C_Multimeter > m_hDefuserMultimeter; // 0x9F4 - 0x9F4
   GameTime_t m_flNextRadarFlashTime; // 0x9F8 - 0x9F8
   bool m_bRadarFlash; // 0x9FC - 0x9FC
   CHandle< C_CSPlayerPawnBase > m_hLocalDefusingPlayerHandle; // 0xA00 - 0xA00

}; // size - 0xA08


class C_PointCamera : public C_BaseEntity
{
public:

   std::float_t m_FOV; // 0x538 - 0x538
   std::float_t m_Resolution; // 0x53C - 0x53C
   bool m_bFogEnable; // 0x540 - 0x540
   Color m_FogColor; // 0x541 - 0x541
   std::float_t m_flFogStart; // 0x548 - 0x548
   std::float_t m_flFogEnd; // 0x54C - 0x54C
   std::float_t m_flFogMaxDensity; // 0x550 - 0x550
   bool m_bActive; // 0x554 - 0x554
   bool m_bUseScreenAspectRatio; // 0x555 - 0x555
   std::float_t m_flAspectRatio; // 0x558 - 0x558
   bool m_bNoSky; // 0x55C - 0x55C
   std::float_t m_fBrightness; // 0x560 - 0x560
   std::float_t m_flZFar; // 0x564 - 0x564
   std::float_t m_flZNear; // 0x568 - 0x568
   bool m_bDofEnabled; // 0x56C - 0x56C
   std::float_t m_flDofNearBlurry; // 0x570 - 0x570
   std::float_t m_flDofNearCrisp; // 0x574 - 0x574
   std::float_t m_flDofFarCrisp; // 0x578 - 0x578
   std::float_t m_flDofFarBlurry; // 0x57C - 0x57C
   std::float_t m_flDofTiltToGround; // 0x580 - 0x580
   std::float_t m_TargetFOV; // 0x584 - 0x584
   std::float_t m_DegreesPerSecond; // 0x588 - 0x588
   bool m_bIsOn; // 0x58C - 0x58C
   C_PointCamera* m_pNext; // 0x590 - 0x590

}; // size - 0x598


class C_PointHMDAnchor : public C_BaseEntity
{
public:

   bool m_bDisabled; // 0x538 - 0x538
   GameTime_t m_flEnableTime; // 0x53C - 0x53C
   std::int32_t m_nPlayerIndex; // 0x540 - 0x540
   std::int32_t m_nLastSimulateFrame; // 0x544 - 0x544

}; // size - 0x548


class C_PredictedViewModel : public C_BaseViewModel
{
public:

   QAngle m_LagAnglesHistory; // 0xA00 - 0xA00
   Vector m_vPredictedOffset; // 0xA18 - 0xA18

}; // size - 0xA28


class C_RagdollProp : public CBaseAnimGraph
{
public:

   C_NetworkUtlVectorBase< Vector > m_ragPos; // 0x9A0 - 0x9A0
   C_NetworkUtlVectorBase< QAngle > m_ragAngles; // 0x9B8 - 0x9B8
   std::float_t m_flBlendWeight; // 0x9D0 - 0x9D0
   CHandle< C_BaseEntity > m_hRagdollSource; // 0x9D4 - 0x9D4
   AttachmentHandle_t m_iEyeAttachment; // 0x9D8 - 0x9D8
   std::float_t m_flBlendWeightCurrent; // 0x9DC - 0x9DC
   CUtlVector< int32 > m_parentPhysicsBoneIndices; // 0x9E0 - 0x9E0
   CUtlVector< int32 > m_worldSpaceBoneComputationOrder; // 0x9F8 - 0x9F8

}; // size - 0xA10


class C_SoundOpvarSetAABBEntity : public C_SoundOpvarSetPointEntity
{
public:


}; // size - 0x558


class C_Team : public C_BaseEntity
{
public:

   C_NetworkUtlVectorBase< CHandle< CBasePlayerController > > m_aPlayerControllers; // 0x538 - 0x538
   C_NetworkUtlVectorBase< CHandle< C_BasePlayerPawn > > m_aPlayers; // 0x550 - 0x550
   std::int32_t m_iScore; // 0x568 - 0x568
   char m_szTeamname[129]; // 0x56C - 0x56C

}; // size - 0x5F0


class C_TeamplayRules : public C_MultiplayRules
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class C_TonemapController2 : public C_BaseEntity
{
public:

   std::float_t m_flAutoExposureMin; // 0x538 - 0x538
   std::float_t m_flAutoExposureMax; // 0x53C - 0x53C
   std::float_t m_flTonemapPercentTarget; // 0x540 - 0x540
   std::float_t m_flTonemapPercentBrightPixels; // 0x544 - 0x544
   std::float_t m_flTonemapMinAvgLum; // 0x548 - 0x548
   std::float_t m_flExposureAdaptationSpeedUp; // 0x54C - 0x54C
   std::float_t m_flExposureAdaptationSpeedDown; // 0x550 - 0x550
   std::float_t m_flTonemapEVSmoothingRange; // 0x554 - 0x554

}; // size - 0x560


class C_WeaponBaseItem : public C_WeaponCSBase
{
public:

   CountdownTimer m_SequenceCompleteTimer; // 0x13D0 - 0x13D0
   bool m_bRedraw; // 0x13E8 - 0x13E8

}; // size - 0x13F0


class FeBoxRigid_t
{
public:

   CTransform tmFrame2; // 0x0 - 0x0
   std::uint16_t nNode; // 0x20 - 0x20
   std::uint16_t nCollisionMask; // 0x22 - 0x22
   Vector vSize; // 0x24 - 0x24
   std::float_t flStickiness; // 0x30 - 0x30
   std::uint16_t nVertexMapIndex; // 0x34 - 0x34
   std::uint16_t nFlags; // 0x36 - 0x36
   float32 flReserved[2]; // 0x38 - 0x38

}; // size - 0x40


class FeSphereRigid_t
{
public:

   fltx4 vSphere; // 0x0 - 0x0
   std::float_t flStickiness; // 0x10 - 0x10
   std::uint16_t nNode; // 0x14 - 0x14
   std::uint16_t nCollisionMask; // 0x16 - 0x16
   std::uint16_t nVertexMapIndex; // 0x18 - 0x18
   std::uint16_t nFlags; // 0x1A - 0x1A

}; // size - 0x20


class FeTaperedCapsuleRigid_t
{
public:

   fltx4 vSphere[2]; // 0x0 - 0x0
   std::float_t flStickiness; // 0x20 - 0x20
   std::uint16_t nNode; // 0x24 - 0x24
   std::uint16_t nCollisionMask; // 0x26 - 0x26
   std::uint16_t nVertexMapIndex; // 0x28 - 0x28
   std::uint16_t nFlags; // 0x2A - 0x2A

}; // size - 0x30


class IChoreoServices
{
public:

   enum class ScriptState_t : std::uint32_t
   {
      SCRIPT_PLAYING = 0,
      SCRIPT_WAIT = 1,
      SCRIPT_POST_IDLE = 2,
      SCRIPT_CLEANUP = 3,
      SCRIPT_WALK_TO_MARK = 4,
      SCRIPT_RUN_TO_MARK = 5,
      SCRIPT_CUSTOM_MOVE_TO_MARK = 6
   }

   enum class ChoreoState_t : std::uint32_t
   {
      STATE_PRE_SCRIPT = 0,
      STATE_WAIT_FOR_SCRIPT = 1,
      STATE_WALK_TO_MARK = 2,
      STATE_SYNCHRONIZE_SCRIPT = 3,
      STATE_PLAY_SCRIPT = 4,
      STATE_PLAY_SCRIPT_POST_IDLE = 5,
      STATE_PLAY_SCRIPT_POST_IDLE_DONE = 6
   }

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class IClientAlphaProperty
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class IParticleEffect
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class IParticleSystemDefinition
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class IRagdoll
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class IntervalTimer
{
public:

   GameTime_t m_timestamp; // 0x8 - 0x8
   WorldGroupId_t m_nWorldGroupId; // 0xC - 0xC

}; // size - 0x10


class IntervalTimer
{
public:

   GameTime_t m_timestamp; // 0x8 - 0x8
   WorldGroupId_t m_nWorldGroupId; // 0xC - 0xC

}; // size - 0x10


class PointDefinition_t
{
public:

   std::int32_t m_nControlPoint; // 0x0 - 0x0
   bool m_bLocalCoords; // 0x4 - 0x4
   Vector m_vOffset; // 0x8 - 0x8

}; // size - 0x14


class Relationship_t
{
public:

   Disposition_t disposition; // 0x0 - 0x0
   std::int32_t priority; // 0x4 - 0x4

}; // size - 0x8


class SpawnPointCoopEnemy : public SpawnPoint
{
public:

   enum class BotDefaultBehavior_t : std::uint32_t
   {
      DEFEND_AREA = 0,
      HUNT = 1,
      CHARGE_ENEMY = 2,
      DEFEND_INVESTIGATE = 3
   }

   CUtlSymbolLarge m_szWeaponsToGive; // 0x4B0 - 0x4B0
   CUtlSymbolLarge m_szPlayerModelToUse; // 0x4B8 - 0x4B8
   std::int32_t m_nArmorToSpawnWith; // 0x4C0 - 0x4C0
   SpawnPointCoopEnemy::BotDefaultBehavior_t m_nDefaultBehavior; // 0x4C4 - 0x4C4
   std::int32_t m_nBotDifficulty; // 0x4C8 - 0x4C8
   bool m_bIsAgressive; // 0x4CC - 0x4CC
   bool m_bStartAsleep; // 0x4CD - 0x4CD
   std::float_t m_flHideRadius; // 0x4D0 - 0x4D0
   CUtlSymbolLarge m_szBehaviorTreeFile; // 0x4E0 - 0x4E0

}; // size - 0x4E8


class dynpitchvol_base_t
{
public:

   std::int32_t preset; // 0x0 - 0x0
   std::int32_t pitchrun; // 0x4 - 0x4
   std::int32_t pitchstart; // 0x8 - 0x8
   std::int32_t spinup; // 0xC - 0xC
   std::int32_t spindown; // 0x10 - 0x10
   std::int32_t volrun; // 0x14 - 0x14
   std::int32_t volstart; // 0x18 - 0x18
   std::int32_t fadein; // 0x1C - 0x1C
   std::int32_t fadeout; // 0x20 - 0x20
   std::int32_t lfotype; // 0x24 - 0x24
   std::int32_t lforate; // 0x28 - 0x28
   std::int32_t lfomodpitch; // 0x2C - 0x2C
   std::int32_t lfomodvol; // 0x30 - 0x30
   std::int32_t cspinup; // 0x34 - 0x34
   std::int32_t cspincount; // 0x38 - 0x38
   std::int32_t pitch; // 0x3C - 0x3C
   std::int32_t spinupsav; // 0x40 - 0x40
   std::int32_t spindownsav; // 0x44 - 0x44
   std::int32_t pitchfrac; // 0x48 - 0x48
   std::int32_t vol; // 0x4C - 0x4C
   std::int32_t fadeinsav; // 0x50 - 0x50
   std::int32_t fadeoutsav; // 0x54 - 0x54
   std::int32_t volfrac; // 0x58 - 0x58
   std::int32_t lfofrac; // 0x5C - 0x5C
   std::int32_t lfomult; // 0x60 - 0x60

}; // size - 0x64


class AABB_t
{
public:

   Vector m_vMinBounds; // 0x0 - 0x0
   Vector m_vMaxBounds; // 0xC - 0xC

}; // size - 0x18


class ActiveModelConfig_t
{
public:

   ModelConfigHandle_t m_Handle; // 0x28 - 0x28
   CUtlSymbolLarge m_Name; // 0x30 - 0x30
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_AssociatedEntities; // 0x38 - 0x38
   CNetworkUtlVectorBase< CUtlSymbolLarge > m_AssociatedEntityNames; // 0x50 - 0x50

}; // size - 0x68


class ActiveModelConfig_t
{
public:

   ModelConfigHandle_t m_Handle; // 0x28 - 0x28
   CUtlSymbolLarge m_Name; // 0x30 - 0x30
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_AssociatedEntities; // 0x38 - 0x38
   C_NetworkUtlVectorBase< CUtlSymbolLarge > m_AssociatedEntityNames; // 0x50 - 0x50

}; // size - 0x68


class AggregateMeshInfo_t
{
public:

   std::uint32_t m_nVisClusterMemberOffset; // 0x0 - 0x0
   std::uint8_t m_nVisClusterMemberCount; // 0x4 - 0x4
   bool m_bHasTransform; // 0x5 - 0x5
   std::int16_t m_nDrawCallIndex; // 0x6 - 0x6
   Color m_vTintColor; // 0x8 - 0x8
   std::uint8_t m_nLODGroupMask; // 0xC - 0xC
   ObjectTypeFlags_t m_objectFlags; // 0x10 - 0x10
   Vector m_vLODOrigin; // 0x14 - 0x14
   std::float_t m_fLODStartDrawDistance; // 0x20 - 0x20
   std::float_t m_fLODEndDrawDistance; // 0x24 - 0x24
   std::float_t m_fMaxObjectScale; // 0x28 - 0x28
   std::int32_t m_nLightProbeVolumePrecomputedHandshake; // 0x2C - 0x2C

}; // size - 0x30


class AggregateSceneObject_t
{
public:

   ObjectTypeFlags_t m_allFlags; // 0x0 - 0x0
   ObjectTypeFlags_t m_anyFlags; // 0x4 - 0x4
   std::int16_t m_nLayer; // 0x8 - 0x8
   CUtlVector< AggregateMeshInfo_t > m_aggregateMeshes; // 0x10 - 0x10
   CUtlVector< uint16 > m_visClusterMembership; // 0x28 - 0x28
   CUtlVector< matrix3x4_t > m_fragmentTransforms; // 0x40 - 0x40
   CStrongHandle< InfoForResourceTypeCModel > m_renderableModel; // 0x58 - 0x58

}; // size - 0x60


class AimMatrixOpFixedSettings_t
{
public:

   CAnimAttachment m_attachment; // 0x0 - 0x0
   CAnimInputDamping m_damping; // 0x80 - 0x80
   CPoseHandle m_poseCacheHandles[10]; // 0x90 - 0x90
   AimMatrixBlendMode m_eBlendMode; // 0xB8 - 0xB8
   std::float_t m_fAngleIncrement; // 0xBC - 0xBC
   std::int32_t m_nSequenceMaxFrame; // 0xC0 - 0xC0
   std::int32_t m_nBoneMaskIndex; // 0xC4 - 0xC4
   bool m_bTargetIsPosition; // 0xC8 - 0xC8

}; // size - 0xD0


class AmmoIndex_t
{
public:

   std::int8_t m_Value; // 0x0 - 0x0

}; // size - 0x1


class AnimComponentID
{
public:

   std::uint32_t m_id; // 0x0 - 0x0

}; // size - 0x4


class AnimNodeID
{
public:

   std::uint32_t m_id; // 0x0 - 0x0

}; // size - 0x4


class AnimNodeOutputID
{
public:

   std::uint32_t m_id; // 0x0 - 0x0

}; // size - 0x4


class AnimParamID
{
public:

   std::uint32_t m_id; // 0x0 - 0x0

}; // size - 0x4


class AnimScriptHandle
{
public:

   std::uint32_t m_id; // 0x0 - 0x0

}; // size - 0x4


class AnimStateID
{
public:

   std::uint32_t m_id; // 0x0 - 0x0

}; // size - 0x4


class AnimTagID
{
public:

   std::uint32_t m_id; // 0x0 - 0x0

}; // size - 0x4


class AnimationDecodeDebugDumpElement_t
{
public:

   std::int32_t m_nEntityIndex; // 0x0 - 0x0
   CUtlString m_modelName; // 0x8 - 0x8
   CUtlVector< CUtlString > m_poseParams; // 0x10 - 0x10
   CUtlVector< CUtlString > m_decodeOps; // 0x28 - 0x28
   CUtlVector< CUtlString > m_internalOps; // 0x40 - 0x40
   CUtlVector< CUtlString > m_decodedAnims; // 0x58 - 0x58

}; // size - 0x70


class AnimationDecodeDebugDump_t
{
public:

   AnimationProcessingType_t m_processingType; // 0x0 - 0x0
   CUtlVector< AnimationDecodeDebugDumpElement_t > m_elems; // 0x8 - 0x8

}; // size - 0x20


class AnimationSnapshot_t : public AnimationSnapshotBase_t
{
public:

   std::int32_t m_nEntIndex; // 0x110 - 0x110
   CUtlString m_modelName; // 0x118 - 0x118

}; // size - 0x120


class AnimationUpdateListHandle_t
{
public:

   std::uint32_t m_Value; // 0x0 - 0x0

}; // size - 0x4


class AttachmentHandle_t
{
public:

   std::uint8_t m_Value; // 0x0 - 0x0

}; // size - 0x1


class BakedLightingInfo_t
{
public:

   std::uint32_t m_nLightmapVersionNumber; // 0x0 - 0x0
   std::uint32_t m_nLightmapGameVersionNumber; // 0x4 - 0x4
   Vector2D m_vLightmapUvScale; // 0x8 - 0x8
   bool m_bHasLightmaps; // 0x10 - 0x10
   CUtlVector< CStrongHandle< InfoForResourceTypeCTextureBase > > m_lightMaps; // 0x18 - 0x18

}; // size - 0x30


class BlendItem_t
{
public:

   CUtlVector< TagSpan_t > m_tags; // 0x0 - 0x0
   CAnimUpdateNodeRef m_pChild; // 0x18 - 0x18
   HSequence m_hSequence; // 0x28 - 0x28
   Vector2D m_vPos; // 0x2C - 0x2C
   std::float_t m_flDuration; // 0x34 - 0x34
   bool m_bUseCustomDuration; // 0x38 - 0x38

}; // size - 0x40


class CAISound : public CPointEntity
{
public:

   std::int32_t m_iSoundType; // 0x4A0 - 0x4A0
   std::int32_t m_iSoundContext; // 0x4A4 - 0x4A4
   std::int32_t m_iVolume; // 0x4A8 - 0x4A8
   std::int32_t m_iSoundIndex; // 0x4AC - 0x4AC
   std::float_t m_flDuration; // 0x4B0 - 0x4B0
   CUtlSymbolLarge m_iszProxyEntityName; // 0x4B8 - 0x4B8

}; // size - 0x4C0


class CAI_ChangeHintGroup : public CBaseEntity
{
public:

   std::int32_t m_iSearchType; // 0x4A0 - 0x4A0
   CUtlSymbolLarge m_strSearchName; // 0x4A8 - 0x4A8
   CUtlSymbolLarge m_strNewHintGroup; // 0x4B0 - 0x4B0
   std::float_t m_flRadius; // 0x4B8 - 0x4B8

}; // size - 0x4C0


class CAI_ChangeTarget : public CBaseEntity
{
public:

   CUtlSymbolLarge m_iszNewTarget; // 0x4A0 - 0x4A0

}; // size - 0x4A8


class CAK47 : public CWeaponCSBaseGun
{
public:


}; // size - 0xD70


class CActionComponent : public CAnimComponentBase
{
public:

   CUtlVector< CSmartPtr< CAnimActionBase > > m_actions; // 0x38 - 0x38
   CUtlString m_sName; // 0x50 - 0x50

}; // size - 0x58


class CActionComponentUpdater : public CAnimComponentUpdater
{
public:

   CUtlVector< CSmartPtr< CAnimActionUpdater > > m_actions; // 0x30 - 0x30

}; // size - 0x48


class CAddAnimNode : public CAnimNodeBase
{
public:

   CAnimNodeConnection m_baseInput; // 0x38 - 0x38
   CAnimNodeConnection m_additiveInput; // 0x40 - 0x40
   BinaryNodeTiming m_timingBehavior; // 0x48 - 0x48
   std::float_t m_flTimingBlend; // 0x4C - 0x4C
   BinaryNodeChildOption m_footMotionTiming; // 0x50 - 0x50
   bool m_bApplyToFootMotion; // 0x54 - 0x54
   bool m_bResetBase; // 0x55 - 0x55
   bool m_bResetAdditive; // 0x56 - 0x56
   bool m_bApplyChannelsSeparately; // 0x57 - 0x57
   bool m_bUseModelSpace; // 0x58 - 0x58

}; // size - 0x60


class CAddUpdateNode : public CBinaryUpdateNode
{
public:

   BinaryNodeChildOption m_footMotionTiming; // 0x8C - 0x8C
   bool m_bApplyToFootMotion; // 0x90 - 0x90
   bool m_bApplyChannelsSeparately; // 0x91 - 0x91
   bool m_bUseModelSpace; // 0x92 - 0x92

}; // size - 0x98


class CAimConstraint : public CBaseConstraint
{
public:

   Quaternion m_qAimOffset; // 0x70 - 0x70
   std::uint32_t m_nUpType; // 0x80 - 0x80

}; // size - 0x90


class CAimMatrixAnimNode : public CAnimNodeBase
{
public:

   CAnimNodeConnection m_inputConnection; // 0x40 - 0x40
   CUtlString m_sequenceName; // 0x48 - 0x48
   std::float_t m_fAngleIncrement; // 0x50 - 0x50
   AnimVectorSource m_target; // 0x54 - 0x54
   AnimParamID m_param; // 0x58 - 0x58
   CUtlString m_attachmentName; // 0x60 - 0x60
   AimMatrixBlendMode m_blendMode; // 0x68 - 0x68
   CUtlString m_boneMaskName; // 0x70 - 0x70
   bool m_bResetBase; // 0x78 - 0x78
   bool m_bLockWhenWaning; // 0x79 - 0x79
   CAnimInputDamping m_damping; // 0x80 - 0x80

}; // size - 0x90


class CAimMatrixUpdateNode : public CUnaryUpdateNode
{
public:

   AimMatrixOpFixedSettings_t m_opFixedSettings; // 0x70 - 0x70
   AnimVectorSource m_target; // 0x148 - 0x148
   CAnimParamHandle m_paramIndex; // 0x14C - 0x14C
   HSequence m_hSequence; // 0x150 - 0x150
   bool m_bResetChild; // 0x154 - 0x154
   bool m_bLockWhenWaning; // 0x155 - 0x155

}; // size - 0x160


class CAmbientGeneric : public CPointEntity
{
public:

   std::float_t m_radius; // 0x4A0 - 0x4A0
   std::float_t m_flMaxRadius; // 0x4A4 - 0x4A4
   soundlevel_t m_iSoundLevel; // 0x4A8 - 0x4A8
   dynpitchvol_t m_dpv; // 0x4AC - 0x4AC
   bool m_fActive; // 0x510 - 0x510
   bool m_fLooping; // 0x511 - 0x511
   CUtlSymbolLarge m_iszSound; // 0x518 - 0x518
   CUtlSymbolLarge m_sSourceEntName; // 0x520 - 0x520
   CHandle< CBaseEntity > m_hSoundSource; // 0x528 - 0x528
   CEntityIndex m_nSoundSourceEntIndex; // 0x52C - 0x52C

}; // size - 0x538


class CAndCondition : public CConditionBase
{
public:


}; // size - 0x60


class CAnimActivity
{
public:

   CBufferString m_name; // 0x0 - 0x0
   std::int32_t m_nActivity; // 0x10 - 0x10
   std::int32_t m_nFlags; // 0x14 - 0x14
   std::int32_t m_nWeight; // 0x18 - 0x18

}; // size - 0x20


class CAnimAnimEvent
{
public:

   std::int32_t m_nFrame; // 0x0 - 0x0
   std::float_t m_flCycle; // 0x4 - 0x4
   KeyValues3 m_EventData; // 0x8 - 0x8
   CBufferString m_sLegacyOptions; // 0x18 - 0x18
   CBufferString m_sEventName; // 0x28 - 0x28

}; // size - 0x38


class CAnimBone
{
public:

   CBufferString m_name; // 0x0 - 0x0
   std::int32_t m_parent; // 0x10 - 0x10
   Vector m_pos; // 0x14 - 0x14
   QuaternionStorage m_quat; // 0x20 - 0x20
   std::float_t m_scale; // 0x30 - 0x30
   QuaternionStorage m_qAlignment; // 0x34 - 0x34
   std::int32_t m_flags; // 0x44 - 0x44

}; // size - 0x48


class CAnimBoneDifference
{
public:

   CBufferString m_name; // 0x0 - 0x0
   CBufferString m_parent; // 0x10 - 0x10
   Vector m_posError; // 0x20 - 0x20
   bool m_bHasRotation; // 0x2C - 0x2C
   bool m_bHasMovement; // 0x2D - 0x2D

}; // size - 0x30


class CAnimClipData
{
public:

   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x20 - 0x20
   CUtlString m_clipName; // 0x38 - 0x38

}; // size - 0x48


class CAnimClipDataManager
{
public:

   CUtlHashtable< CUtlString, CSmartPtr< CAnimClipData > > m_itemTable; // 0x18 - 0x18

}; // size - 0x38


class CAnimComponentManager
{
public:

   CUtlVector< CSmartPtr< CAnimComponentBase > > m_components; // 0x8 - 0x8

}; // size - 0x28


class CAnimComponentState : public CAnimState
{
public:


}; // size - 0x70


class CAnimComponentStateTransition : public CAnimStateTransition
{
public:


}; // size - 0x70


class CAnimCycle : public CCycleBase
{
public:


}; // size - 0x4


class CAnimData
{
public:

   CBufferString m_name; // 0x10 - 0x10
   CUtlVector< CAnimDesc > m_animArray; // 0x20 - 0x20
   CUtlVector< CAnimDecoder > m_decoderArray; // 0x38 - 0x38
   std::int32_t m_nMaxUniqueFrameIndex; // 0x50 - 0x50
   CUtlVector< CAnimFrameSegment > m_segmentArray; // 0x58 - 0x58

}; // size - 0x70


class CAnimDataChannelDesc
{
public:

   CBufferString m_szChannelClass; // 0x0 - 0x0
   CBufferString m_szVariableName; // 0x10 - 0x10
   std::int32_t m_nFlags; // 0x20 - 0x20
   std::int32_t m_nType; // 0x24 - 0x24
   CBufferString m_szGrouping; // 0x28 - 0x28
   CBufferString m_szDescription; // 0x38 - 0x38
   CUtlVector< CBufferString > m_szElementNameArray; // 0x48 - 0x48
   CUtlVector< int32 > m_nElementIndexArray; // 0x60 - 0x60
   CUtlVector< uint32 > m_nElementMaskArray; // 0x78 - 0x78

}; // size - 0x90


class CAnimDecoder
{
public:

   CBufferString m_szName; // 0x0 - 0x0
   std::int32_t m_nVersion; // 0x10 - 0x10
   std::int32_t m_nType; // 0x14 - 0x14

}; // size - 0x18


class CAnimDesc
{
public:

   CBufferString m_name; // 0x0 - 0x0
   CAnimDesc_Flag m_flags; // 0x10 - 0x10
   std::float_t fps; // 0x18 - 0x18
   CAnimEncodedFrames m_Data; // 0x20 - 0x20
   CUtlVector< CAnimMovement > m_movementArray; // 0xF8 - 0xF8
   CUtlVector< CAnimAnimEvent > m_eventArray; // 0x110 - 0x110
   CUtlVector< CAnimActivity > m_activityArray; // 0x128 - 0x128
   CUtlVector< CAnimLocalHierarchy > m_hierarchyArray; // 0x140 - 0x140
   std::float_t framestalltime; // 0x158 - 0x158
   Vector m_vecRootMin; // 0x15C - 0x15C
   Vector m_vecRootMax; // 0x168 - 0x168
   CUtlVector< Vector > m_vecBoneWorldMin; // 0x178 - 0x178
   CUtlVector< Vector > m_vecBoneWorldMax; // 0x190 - 0x190
   CAnimSequenceParams m_sequenceParams; // 0x1A8 - 0x1A8

}; // size - 0x1B0


class CAnimDesc_Flag
{
public:

   bool m_bLooping; // 0x0 - 0x0
   bool m_bAllZeros; // 0x1 - 0x1
   bool m_bHidden; // 0x2 - 0x2
   bool m_bDelta; // 0x3 - 0x3
   bool m_bLegacyWorldspace; // 0x4 - 0x4
   bool m_bModelDoc; // 0x5 - 0x5
   bool m_bImplicitSeqIgnoreDelta; // 0x6 - 0x6
   bool m_bAnimGraphAdditive; // 0x7 - 0x7

}; // size - 0x8


class CAnimEncodeDifference
{
public:

   CUtlVector< CAnimBoneDifference > m_boneArray; // 0x0 - 0x0
   CUtlVector< CAnimMorphDifference > m_morphArray; // 0x18 - 0x18
   CUtlVector< CAnimUserDifference > m_userArray; // 0x30 - 0x30
   CUtlVector< uint8 > m_bHasRotationBitArray; // 0x48 - 0x48
   CUtlVector< uint8 > m_bHasMovementBitArray; // 0x60 - 0x60
   CUtlVector< uint8 > m_bHasMorphBitArray; // 0x78 - 0x78
   CUtlVector< uint8 > m_bHasUserBitArray; // 0x90 - 0x90

}; // size - 0xA8


class CAnimEncodedFrames
{
public:

   CBufferString m_fileName; // 0x0 - 0x0
   std::int32_t m_nFrames; // 0x10 - 0x10
   std::int32_t m_nFramesPerBlock; // 0x14 - 0x14
   CUtlVector< CAnimFrameBlockAnim > m_frameblockArray; // 0x18 - 0x18
   CAnimEncodeDifference m_usageDifferences; // 0x30 - 0x30

}; // size - 0xD8


class CAnimEnum
{
public:

   std::uint8_t m_value; // 0x0 - 0x0

}; // size - 0x1


class CAnimFoot
{
public:

   CUtlString m_name; // 0x0 - 0x0
   Vector m_vBallOffset; // 0x8 - 0x8
   Vector m_vHeelOffset; // 0x14 - 0x14
   std::int32_t m_ankleBoneIndex; // 0x20 - 0x20
   std::int32_t m_toeBoneIndex; // 0x24 - 0x24

}; // size - 0x28


class CAnimFrameBlockAnim
{
public:

   std::int32_t m_nStartFrame; // 0x0 - 0x0
   std::int32_t m_nEndFrame; // 0x4 - 0x4
   CUtlVector< int32 > m_segmentIndexArray; // 0x8 - 0x8

}; // size - 0x20


class CAnimFrameSegment
{
public:

   std::int32_t m_nUniqueFrameIndex; // 0x0 - 0x0
   std::uint32_t m_nLocalElementMasks; // 0x4 - 0x4
   std::int32_t m_nLocalChannel; // 0x8 - 0x8
   CUtlBinaryBlock m_container; // 0x10 - 0x10

}; // size - 0x28


class CAnimGraphDebugReplay
{
public:

   CUtlString m_animGraphFileName; // 0x40 - 0x40
   CUtlVector< CSmartPtr< CAnimReplayFrame > > m_frameList; // 0x48 - 0x48
   std::int32_t m_startIndex; // 0x60 - 0x60
   std::int32_t m_writeIndex; // 0x64 - 0x64
   std::int32_t m_frameCount; // 0x68 - 0x68

}; // size - 0x70


class CAnimGraphModelBinding
{
public:

   CUtlString m_modelName; // 0x8 - 0x8
   CSmartPtr< CAnimUpdateSharedData > m_pSharedData; // 0x10 - 0x10

}; // size - 0x28


class CAnimGraphNetworkSettings : public CAnimGraphSettingsGroup
{
public:

   bool m_bNetworkingEnabled; // 0x20 - 0x20

}; // size - 0x28


class CAnimGraphNetworkedVariables
{
public:

   CNetworkUtlVectorBase< uint32 > m_PredNetBoolVariables; // 0x8 - 0x8
   CNetworkUtlVectorBase< uint8 > m_PredNetByteVariables; // 0x20 - 0x20
   CNetworkUtlVectorBase< uint16 > m_PredNetUInt16Variables; // 0x38 - 0x38
   CNetworkUtlVectorBase< int32 > m_PredNetIntVariables; // 0x50 - 0x50
   CNetworkUtlVectorBase< uint32 > m_PredNetUInt32Variables; // 0x68 - 0x68
   CNetworkUtlVectorBase< float32 > m_PredNetFloatVariables; // 0x80 - 0x80
   CNetworkUtlVectorBase< Vector > m_PredNetVectorVariables; // 0x98 - 0x98
   CNetworkUtlVectorBase< Quaternion > m_PredNetQuaternionVariables; // 0xB0 - 0xB0
   CNetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetBoolVariables; // 0xC8 - 0xC8
   CNetworkUtlVectorBase< uint8 > m_OwnerOnlyPredNetByteVariables; // 0xE0 - 0xE0
   CNetworkUtlVectorBase< uint16 > m_OwnerOnlyPredNetUInt16Variables; // 0xF8 - 0xF8
   CNetworkUtlVectorBase< int32 > m_OwnerOnlyPredNetIntVariables; // 0x110 - 0x110
   CNetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetUInt32Variables; // 0x128 - 0x128
   CNetworkUtlVectorBase< float32 > m_OwnerOnlyPredNetFloatVariables; // 0x140 - 0x140
   CNetworkUtlVectorBase< Vector > m_OwnerOnlyPredNetVectorVariables; // 0x158 - 0x158
   CNetworkUtlVectorBase< Quaternion > m_OwnerOnlyPredNetQuaternionVariables; // 0x170 - 0x170
   std::int32_t m_nBoolVariablesCount; // 0x188 - 0x188
   std::int32_t m_nOwnerOnlyBoolVariablesCount; // 0x18C - 0x18C
   std::int32_t m_nRandomSeedOffset; // 0x190 - 0x190
   std::float_t m_flLastTeleportTime; // 0x194 - 0x194

}; // size - 0x1A8


class CAnimGraphNetworkedVariables
{
public:

   C_NetworkUtlVectorBase< uint32 > m_PredNetBoolVariables; // 0x8 - 0x8
   C_NetworkUtlVectorBase< uint8 > m_PredNetByteVariables; // 0x20 - 0x20
   C_NetworkUtlVectorBase< uint16 > m_PredNetUInt16Variables; // 0x38 - 0x38
   C_NetworkUtlVectorBase< int32 > m_PredNetIntVariables; // 0x50 - 0x50
   C_NetworkUtlVectorBase< uint32 > m_PredNetUInt32Variables; // 0x68 - 0x68
   C_NetworkUtlVectorBase< float32 > m_PredNetFloatVariables; // 0x80 - 0x80
   C_NetworkUtlVectorBase< Vector > m_PredNetVectorVariables; // 0x98 - 0x98
   C_NetworkUtlVectorBase< Quaternion > m_PredNetQuaternionVariables; // 0xB0 - 0xB0
   C_NetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetBoolVariables; // 0xC8 - 0xC8
   C_NetworkUtlVectorBase< uint8 > m_OwnerOnlyPredNetByteVariables; // 0xE0 - 0xE0
   C_NetworkUtlVectorBase< uint16 > m_OwnerOnlyPredNetUInt16Variables; // 0xF8 - 0xF8
   C_NetworkUtlVectorBase< int32 > m_OwnerOnlyPredNetIntVariables; // 0x110 - 0x110
   C_NetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetUInt32Variables; // 0x128 - 0x128
   C_NetworkUtlVectorBase< float32 > m_OwnerOnlyPredNetFloatVariables; // 0x140 - 0x140
   C_NetworkUtlVectorBase< Vector > m_OwnerOnlyPredNetVectorVariables; // 0x158 - 0x158
   C_NetworkUtlVectorBase< Quaternion > m_OwnerOnlyPredNetQuaternionVariables; // 0x170 - 0x170
   std::int32_t m_nBoolVariablesCount; // 0x188 - 0x188
   std::int32_t m_nOwnerOnlyBoolVariablesCount; // 0x18C - 0x18C
   std::int32_t m_nRandomSeedOffset; // 0x190 - 0x190
   std::float_t m_flLastTeleportTime; // 0x1120 - 0x1120

}; // size - 0x1138


class CAnimGraphSettingsManager
{
public:

   CUtlVector< CSmartPtr< CAnimGraphSettingsGroup > > m_settingsGroups; // 0x18 - 0x18

}; // size - 0x30


class CAnimInputDamping
{
public:

   DampingSpeedFunction m_speedFunction; // 0x8 - 0x8
   std::float_t m_fSpeedScale; // 0xC - 0xC

}; // size - 0x10


class CAnimKeyData
{
public:

   CBufferString m_name; // 0x0 - 0x0
   CUtlVector< CAnimBone > m_boneArray; // 0x10 - 0x10
   CUtlVector< CAnimUser > m_userArray; // 0x28 - 0x28
   CUtlVector< CBufferString > m_morphArray; // 0x40 - 0x40
   std::int32_t m_nChannelElements; // 0x58 - 0x58
   CUtlVector< CAnimDataChannelDesc > m_dataChannelArray; // 0x60 - 0x60

}; // size - 0x78


class CAnimLocalHierarchy
{
public:

   CBufferString m_sBone; // 0x0 - 0x0
   CBufferString m_sNewParent; // 0x10 - 0x10
   std::int32_t m_nStartFrame; // 0x20 - 0x20
   std::int32_t m_nPeakFrame; // 0x24 - 0x24
   std::int32_t m_nTailFrame; // 0x28 - 0x28
   std::int32_t m_nEndFrame; // 0x2C - 0x2C

}; // size - 0x30


class CAnimMorphDifference
{
public:

   CBufferString m_name; // 0x0 - 0x0

}; // size - 0x10


class CAnimMovement
{
public:

   std::int32_t endframe; // 0x0 - 0x0
   std::int32_t motionflags; // 0x4 - 0x4
   std::float_t v0; // 0x8 - 0x8
   std::float_t v1; // 0xC - 0xC
   std::float_t angle; // 0x10 - 0x10
   Vector vector; // 0x14 - 0x14
   Vector position; // 0x20 - 0x20

}; // size - 0x2C


class CAnimNodeConnection
{
public:

   AnimNodeID m_nodeID; // 0x0 - 0x0
   AnimNodeOutputID m_outputID; // 0x4 - 0x4

}; // size - 0x8


class CAnimNodeList
{
public:

   CUtlVector< CAnimNodeBase* > m_nodes; // 0x10 - 0x10

}; // size - 0x28


class CAnimNodePath
{
public:

   AnimNodeID m_path[11]; // 0x0 - 0x0
   std::int32_t m_nCount; // 0x2C - 0x2C

}; // size - 0x30


class CAnimNodeState : public CAnimState
{
public:

   CAnimNodeConnection m_inputConnection; // 0x70 - 0x70
   bool m_bIsRootMotionExclusive; // 0x78 - 0x78

}; // size - 0x80


class CAnimNodeStateTransition : public CAnimStateTransition
{
public:

   CFloatAnimValue m_blendDuration; // 0x78 - 0x78
   bool m_bReset; // 0x90 - 0x90
   ResetCycleOption m_resetCycleOption; // 0x94 - 0x94
   CFloatAnimValue m_flFixedCycleValue; // 0x98 - 0x98
   CBlendCurve m_blendCurve; // 0xB0 - 0xB0

}; // size - 0xB8


class CAnimParamHandle
{
public:

   AnimParamType_t m_type; // 0x0 - 0x0
   std::uint8_t m_index; // 0x1 - 0x1

}; // size - 0x2


class CAnimParamHandleMap
{
public:

   CUtlHashtable< uint16, int16 > m_list; // 0x0 - 0x0

}; // size - 0x20


class CAnimParamSpan
{
public:

   CUtlVector< CAnimParamSpanSample > m_samples; // 0x20 - 0x20
   AnimParamID m_id; // 0x38 - 0x38
   std::float_t m_flStartCycle; // 0x3C - 0x3C
   std::float_t m_flEndCycle; // 0x40 - 0x40

}; // size - 0x48


class CAnimParamSpanSample
{
public:

   CAnimVariant m_value; // 0x8 - 0x8
   std::float_t m_flCycle; // 0x1C - 0x1C

}; // size - 0x20


class CAnimParameterList
{
public:

   CUtlVector< CSmartPtr< CAnimParameterBase > > m_Parameters; // 0x20 - 0x20

}; // size - 0x58


class CAnimParameterListUpdater
{
public:

   CUtlVector< CSmartPtr< CAnimParameterBase > > m_parameters; // 0x18 - 0x18
   CUtlHashtable< AnimParamID, int32 > m_idToIndexMap; // 0x30 - 0x30
   CUtlHashtable< CUtlString, int32 > m_nameToIndexMap; // 0x50 - 0x50
   CUtlVector< CAnimParamHandle > m_indexToHandle; // 0x70 - 0x70
   CUtlVector< CUtlPair< CAnimParamHandle, CAnimVariant > > m_autoResetParams; // 0x88 - 0x88
   CUtlHashtable< CAnimParamHandle, int16 > m_autoResetMap; // 0xA0 - 0xA0

}; // size - 0x100


class CAnimReplayFrame
{
public:

   CUtlVector< CUtlBinaryBlock > m_inputDataBlocks; // 0x10 - 0x10
   CUtlBinaryBlock m_instanceData; // 0x28 - 0x28
   CTransform m_startingLocalToWorldTransform; // 0x40 - 0x40
   CTransform m_localToWorldTransform; // 0x60 - 0x60
   std::float_t m_timeStamp; // 0x80 - 0x80

}; // size - 0x90


class CAnimScriptComponent : public CAnimComponentBase
{
public:

   CUtlString m_sName; // 0x40 - 0x40
   CUtlString m_scriptFilename; // 0x48 - 0x48

}; // size - 0x58


class CAnimScriptComponentUpdater : public CAnimComponentUpdater
{
public:

   AnimScriptHandle m_hScript; // 0x30 - 0x30

}; // size - 0x38


class CAnimScriptManager
{
public:

   CUtlVector< ScriptInfo_t > m_scriptInfo; // 0x10 - 0x10

}; // size - 0x110


class CAnimSequenceParams
{
public:

   std::float_t m_flFadeInTime; // 0x0 - 0x0
   std::float_t m_flFadeOutTime; // 0x4 - 0x4

}; // size - 0x8


class CAnimSkeleton
{
public:

   CUtlVector< CTransform > m_localSpaceTransforms; // 0x10 - 0x10
   CUtlVector< CTransform > m_modelSpaceTransforms; // 0x28 - 0x28
   CUtlVector< CUtlString > m_boneNames; // 0x40 - 0x40
   CUtlVector< CUtlVector< int32 > > m_children; // 0x58 - 0x58
   CUtlVector< int32 > m_parents; // 0x70 - 0x70
   CUtlVector< CAnimFoot > m_feet; // 0x88 - 0x88
   CUtlVector< CUtlString > m_morphNames; // 0xA0 - 0xA0
   CUtlVector< int32 > m_lodBoneCounts; // 0xB8 - 0xB8

}; // size - 0xD0


class CAnimStateList
{
public:

   CUtlVector< CAnimState* > m_states; // 0x10 - 0x10

}; // size - 0x28


class CAnimStateMachine
{
public:

   CUtlVector< CSmartPtr< CAnimState > > m_states; // 0x8 - 0x8

}; // size - 0x28


class CAnimStateMachineUpdater
{
public:

   CUtlVector< CStateUpdateData > m_states; // 0x8 - 0x8
   CUtlVector< CTransitionUpdateData > m_transitions; // 0x20 - 0x20
   std::int32_t m_startStateIndex; // 0x50 - 0x50

}; // size - 0x58


class CAnimTagManager
{
public:

   CUtlVector< CSmartPtr< CAnimTagBase > > m_tags; // 0x18 - 0x18

}; // size - 0x58


class CAnimTagManagerUpdater
{
public:

   CUtlVector< CSmartPtr< CAnimTagBase > > m_tags; // 0x18 - 0x18

}; // size - 0x38


class CAnimTagSpan
{
public:

   AnimTagID m_id; // 0x20 - 0x20
   std::float_t m_fStartCycle; // 0x24 - 0x24
   std::float_t m_fDuration; // 0x28 - 0x28

}; // size - 0x30


class CAnimUpdateNodeRef
{
public:

   std::int32_t m_nodeIndex; // 0x8 - 0x8

}; // size - 0x10


class CAnimUpdateSharedData
{
public:

   CUtlVector< CSmartPtr< CAnimUpdateNodeBase > > m_nodes; // 0x10 - 0x10
   CUtlHashtable< CAnimNodePath, int32 > m_nodeIndexMap; // 0x28 - 0x28
   CUtlVector< CSmartPtr< CAnimComponentUpdater > > m_components; // 0x48 - 0x48
   CSmartPtr< CAnimParameterListUpdater > m_pParamListUpdater; // 0x60 - 0x60
   CSmartPtr< CAnimTagManagerUpdater > m_pTagManagerUpdater; // 0x68 - 0x68
   CSmartPtr< CAnimScriptManager > m_scriptManager; // 0x70 - 0x70
   CAnimGraphSettingsManager m_settings; // 0x78 - 0x78
   CSmartPtr< CStaticPoseCacheBuilder > m_pStaticPoseCache; // 0xA8 - 0xA8
   CSmartPtr< CAnimSkeleton > m_pSkeleton; // 0xB0 - 0xB0
   CAnimNodePath m_rootNodePath; // 0xB8 - 0xB8

}; // size - 0x100


class CAnimUser
{
public:

   CBufferString m_name; // 0x0 - 0x0
   std::int32_t m_nType; // 0x10 - 0x10

}; // size - 0x18


class CAnimUserDifference
{
public:

   CBufferString m_name; // 0x0 - 0x0
   std::int32_t m_nType; // 0x10 - 0x10

}; // size - 0x18


class CAnimationGraph : public CAnimationSubGraph
{
public:

   CSmartPtr< CAnimGraphSettingsManager > m_pSettingsManager; // 0xE8 - 0xE8
   CAnimClipDataManager m_clipDataManager; // 0xF8 - 0xF8
   CUtlString m_modelName; // 0x140 - 0x140
   CUtlString m_previewModelName; // 0x148 - 0x148

}; // size - 0x150


class CAnimationGraphVisualizerAxis : public CAnimationGraphVisualizerPrimitiveBase
{
public:

   CTransform m_xWsTransform; // 0x10 - 0x10
   std::float_t m_flAxisSize; // 0x30 - 0x30

}; // size - 0x40


class CAnimationGraphVisualizerLine : public CAnimationGraphVisualizerPrimitiveBase
{
public:

   VectorAligned m_vWsPositionStart; // 0x10 - 0x10
   VectorAligned m_vWsPositionEnd; // 0x20 - 0x20
   Color m_Color; // 0x30 - 0x30

}; // size - 0x40


class CAnimationGraphVisualizerPie : public CAnimationGraphVisualizerPrimitiveBase
{
public:

   VectorAligned m_vWsCenter; // 0x10 - 0x10
   VectorAligned m_vWsStart; // 0x20 - 0x20
   VectorAligned m_vWsEnd; // 0x30 - 0x30
   Color m_Color; // 0x40 - 0x40

}; // size - 0x50


class CAnimationGraphVisualizerSphere : public CAnimationGraphVisualizerPrimitiveBase
{
public:

   VectorAligned m_vWsPosition; // 0x10 - 0x10
   std::float_t m_flRadius; // 0x20 - 0x20
   Color m_Color; // 0x24 - 0x24

}; // size - 0x30


class CAnimationGraphVisualizerText : public CAnimationGraphVisualizerPrimitiveBase
{
public:

   VectorAligned m_vWsPosition; // 0x10 - 0x10
   Color m_Color; // 0x20 - 0x20
   CUtlString m_Text; // 0x28 - 0x28

}; // size - 0x30


class CAnimationGroup
{
public:

   std::uint32_t m_nFlags; // 0x10 - 0x10
   CBufferString m_name; // 0x18 - 0x18
   CUtlVector< CStrongHandle< InfoForResourceTypeCAnimData > > m_localHAnimArray_Handle; // 0x60 - 0x60
   CUtlVector< CStrongHandle< InfoForResourceTypeCAnimationGroup > > m_includedGroupArray_Handle; // 0x78 - 0x78
   CStrongHandle< InfoForResourceTypeCSequenceGroupData > m_directHSeqGroup_Handle; // 0x90 - 0x90
   CAnimKeyData m_decodeKey; // 0x98 - 0x98
   CUtlVector< CBufferString > m_szScripts; // 0x110 - 0x110

}; // size - 0x130


class CAttachment
{
public:

   CUtlString m_name; // 0x0 - 0x0
   CUtlString m_influenceNames[3]; // 0x8 - 0x8
   Quaternion m_vInfluenceRotations[3]; // 0x20 - 0x20
   Vector m_vInfluenceOffsets[3]; // 0x50 - 0x50
   float32 m_influenceWeights[3]; // 0x74 - 0x74
   bool m_bInfluenceRootTransform[3]; // 0x80 - 0x80
   std::uint8_t m_nInfluences; // 0x83 - 0x83
   bool m_bIgnoreRotation; // 0x84 - 0x84

}; // size - 0x90


class CAttributeContainer : public CAttributeManager
{
public:

   CEconItemView m_Item; // 0x50 - 0x50

}; // size - 0x2C8


class CAttributeList
{
public:

   CUtlVectorEmbeddedNetworkVar< CEconItemAttribute > m_Attributes; // 0x8 - 0x8
   CAttributeManager* m_pManager; // 0x58 - 0x58

}; // size - 0x60


class CAttributeList
{
public:

   C_UtlVectorEmbeddedNetworkVar< CEconItemAttribute > m_Attributes; // 0x8 - 0x8
   CAttributeManager* m_pManager; // 0x58 - 0x58

}; // size - 0x60




class CAudioAnimTag : public CAnimTagBase
{
public:

   CUtlString m_clipName; // 0x40 - 0x40
   CUtlString m_attachmentName; // 0x48 - 0x48
   std::float_t m_flVolume; // 0x50 - 0x50
   bool m_bStopWhenTagEnds; // 0x54 - 0x54
   bool m_bStopWhenGraphEnds; // 0x55 - 0x55
   bool m_bPlayOnServer; // 0x56 - 0x56
   bool m_bPlayOnClient; // 0x57 - 0x57

}; // size - 0x58


class CBRC4Target : public CBaseAnimGraph
{
public:

   CHandle< CBaseEntity > m_hPlayerThatActivatedMe; // 0x848 - 0x848
   bool m_bBrokenOpen; // 0x84C - 0x84C
   std::float_t m_flRadius; // 0x850 - 0x850

}; // size - 0x858


class CBaseAnimGraphController : public CSkeletonAnimationController
{
public:

   CNetworkedSequenceOperation m_baseLayer; // 0x18 - 0x18
   CAnimGraphNetworkedVariables m_animGraphNetworkedVars; // 0x40 - 0x40
   bool m_bSequenceFinished; // 0x1180 - 0x1180
   std::float_t m_flLastEventCycle; // 0x1184 - 0x1184
   std::float_t m_flLastEventAnimTime; // 0x1188 - 0x1188
   CNetworkedQuantizedFloat m_flPlaybackRate; // 0x118C - 0x118C
   std::float_t m_flPrevAnimTime; // 0x1194 - 0x1194
   bool m_bClientSideAnimation; // 0x1198 - 0x1198
   bool m_bNetworkedAnimationInputsChanged; // 0x1199 - 0x1199
   std::uint8_t m_nPrevNewSequenceParity; // 0x119A - 0x119A
   std::uint8_t m_nPrevResetEventsParity; // 0x119B - 0x119B
   std::int32_t m_nNewSequenceParity; // 0x119C - 0x119C
   std::int32_t m_nResetEventsParity; // 0x11A0 - 0x11A0
   AnimLoopMode_t m_nAnimLoopMode; // 0x11A4 - 0x11A4
   AnimationUpdateListHandle_t m_hAnimationUpdate; // 0x123C - 0x123C
   HSequence m_hLastAnimEventSequence; // 0x1240 - 0x1240

}; // size - 0x1298


class CBaseAnimGraphController : public CSkeletonAnimationController
{
public:

   CNetworkedSequenceOperation m_baseLayer; // 0x18 - 0x18
   CAnimGraphNetworkedVariables m_animGraphNetworkedVars; // 0x40 - 0x40
   bool m_bSequenceFinished; // 0x1F0 - 0x1F0
   std::float_t m_flLastEventCycle; // 0x1F4 - 0x1F4
   std::float_t m_flLastEventAnimTime; // 0x1F8 - 0x1F8
   CNetworkedQuantizedFloat m_flPlaybackRate; // 0x1FC - 0x1FC
   std::float_t m_flPrevAnimTime; // 0x204 - 0x204
   bool m_bClientSideAnimation; // 0x208 - 0x208
   bool m_bNetworkedAnimationInputsChanged; // 0x209 - 0x209
   std::int32_t m_nNewSequenceParity; // 0x20C - 0x20C
   std::int32_t m_nResetEventsParity; // 0x210 - 0x210
   AnimLoopMode_t m_nAnimLoopMode; // 0x214 - 0x214
   AnimationUpdateListHandle_t m_hAnimationUpdate; // 0x2AC - 0x2AC

}; // size - 0x2B0


class CBaseDMStart : public CPointEntity
{
public:

   CUtlSymbolLarge m_Master; // 0x4A0 - 0x4A0

}; // size - 0x4A8


class CBaseFlexAlias_funCBaseFlex : public CBaseFlex
{
public:


}; // size - 0x8B0


class CBaseIssue
{
public:

   char m_szTypeString[64]; // 0x20 - 0x20
   char m_szDetailsString[260]; // 0x60 - 0x60
   std::int32_t m_iNumYesVotes; // 0x164 - 0x164
   std::int32_t m_iNumNoVotes; // 0x168 - 0x168
   std::int32_t m_iNumPotentialVotes; // 0x16C - 0x16C
   CVoteController* m_pVoteController; // 0x170 - 0x170

}; // size - 0x178


class CBaseMoveBehavior : public CPathKeyFrame
{
public:

   std::int32_t m_iPositionInterpolator; // 0x500 - 0x500
   std::int32_t m_iRotationInterpolator; // 0x504 - 0x504
   std::float_t m_flAnimStartTime; // 0x508 - 0x508
   std::float_t m_flAnimEndTime; // 0x50C - 0x50C
   std::float_t m_flAverageSpeedAcrossFrame; // 0x510 - 0x510
   CPathKeyFrame* m_pCurrentKeyFrame; // 0x518 - 0x518
   CPathKeyFrame* m_pTargetKeyFrame; // 0x520 - 0x520
   CPathKeyFrame* m_pPreKeyFrame; // 0x528 - 0x528
   CPathKeyFrame* m_pPostKeyFrame; // 0x530 - 0x530
   std::float_t m_flTimeIntoFrame; // 0x538 - 0x538
   std::int32_t m_iDirection; // 0x53C - 0x53C

}; // size - 0x540


class CBasePlayerVData : public CEntitySubclassVDataBase
{
public:

   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_sModelName; // 0x28 - 0x28
   CSkillFloat m_flHeadDamageMultiplier; // 0x108 - 0x108
   CSkillFloat m_flChestDamageMultiplier; // 0x118 - 0x118
   CSkillFloat m_flStomachDamageMultiplier; // 0x128 - 0x128
   CSkillFloat m_flArmDamageMultiplier; // 0x138 - 0x138
   CSkillFloat m_flLegDamageMultiplier; // 0x148 - 0x148
   std::float_t m_flHoldBreathTime; // 0x158 - 0x158
   std::float_t m_flDrowningDamageInterval; // 0x15C - 0x15C
   std::int32_t m_nDrowningDamageInitial; // 0x160 - 0x160
   std::int32_t m_nDrowningDamageMax; // 0x164 - 0x164
   std::int32_t m_nWaterSpeed; // 0x168 - 0x168
   std::float_t m_flUseRange; // 0x16C - 0x16C
   std::float_t m_flUseAngleTolerance; // 0x170 - 0x170
   std::float_t m_flCrouchTime; // 0x174 - 0x174

}; // size - 0x178


class CBasePlayerVData : public CEntitySubclassVDataBase
{
public:

   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_sModelName; // 0x28 - 0x28
   CSkillFloat m_flHeadDamageMultiplier; // 0x108 - 0x108
   CSkillFloat m_flChestDamageMultiplier; // 0x118 - 0x118
   CSkillFloat m_flStomachDamageMultiplier; // 0x128 - 0x128
   CSkillFloat m_flArmDamageMultiplier; // 0x138 - 0x138
   CSkillFloat m_flLegDamageMultiplier; // 0x148 - 0x148
   std::float_t m_flHoldBreathTime; // 0x158 - 0x158
   std::float_t m_flDrowningDamageInterval; // 0x15C - 0x15C
   std::int32_t m_nDrowningDamageInitial; // 0x160 - 0x160
   std::int32_t m_nDrowningDamageMax; // 0x164 - 0x164
   std::int32_t m_nWaterSpeed; // 0x168 - 0x168
   std::float_t m_flUseRange; // 0x16C - 0x16C
   std::float_t m_flUseAngleTolerance; // 0x170 - 0x170
   std::float_t m_flCrouchTime; // 0x174 - 0x174

}; // size - 0x178


class CBindPoseAnimNode : public CAnimNodeBase
{
public:


}; // size - 0x38


class CBindPoseUpdateNode : public CLeafUpdateNode
{
public:


}; // size - 0x60


class CBlend2DAnimNode : public CAnimNodeBase
{
public:

   CUtlVector< CSmartPtr< CBlend2DItemBase > > m_items; // 0x50 - 0x50
   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x68 - 0x68
   CUtlVector< CSmartPtr< CAnimParamSpan > > m_paramSpans; // 0x80 - 0x80
   AnimValueSource m_blendSourceX; // 0x98 - 0x98
   AnimParamID m_paramX; // 0x9C - 0x9C
   AnimValueSource m_blendSourceY; // 0xA0 - 0xA0
   AnimParamID m_paramY; // 0xA4 - 0xA4
   bool m_bLoop; // 0xA8 - 0xA8
   bool m_bLockBlendOnReset; // 0xA9 - 0xA9
   bool m_bLockWhenWaning; // 0xAA - 0xAA
   std::float_t m_playbackSpeed; // 0xAC - 0xAC
   CAnimInputDamping m_damping; // 0xB0 - 0xB0
   bool m_bAnimEventsAndTagsOnMostWeightedOnly; // 0xC0 - 0xC0

}; // size - 0xC8


class CBlend2DUpdateNode : public CAnimUpdateNodeBase
{
public:

   CUtlVector< BlendItem_t > m_items; // 0x60 - 0x60
   CUtlVector< TagSpan_t > m_tags; // 0x78 - 0x78
   CParamSpanUpdater m_paramSpans; // 0x90 - 0x90
   CUtlVector< int32 > m_nodeItemIndices; // 0xA8 - 0xA8
   CAnimInputDamping m_damping; // 0xC0 - 0xC0
   AnimValueSource m_blendSourceX; // 0xD0 - 0xD0
   CAnimParamHandle m_paramX; // 0xD4 - 0xD4
   AnimValueSource m_blendSourceY; // 0xD8 - 0xD8
   CAnimParamHandle m_paramY; // 0xDC - 0xDC
   Blend2DMode m_eBlendMode; // 0xE0 - 0xE0
   std::float_t m_playbackSpeed; // 0xE4 - 0xE4
   bool m_bLoop; // 0xE8 - 0xE8
   bool m_bLockBlendOnReset; // 0xE9 - 0xE9
   bool m_bLockWhenWaning; // 0xEA - 0xEA
   bool m_bAnimEventsAndTagsOnMostWeightedOnly; // 0xEB - 0xEB

}; // size - 0xF0


class CBlendAnimNode : public CAnimNodeBase
{
public:

   CUtlVector< CBlendNodeChild > m_children; // 0x48 - 0x48
   AnimValueSource m_blendValueSource; // 0x60 - 0x60
   AnimParamID m_param; // 0x64 - 0x64
   BlendKeyType m_blendKeyType; // 0x68 - 0x68
   bool m_bLockBlendOnReset; // 0x6C - 0x6C
   bool m_bSyncCycles; // 0x6D - 0x6D
   bool m_bLoop; // 0x6E - 0x6E
   bool m_bLockWhenWaning; // 0x6F - 0x6F
   CAnimInputDamping m_damping; // 0x70 - 0x70

}; // size - 0x80


class CBlendCurve
{
public:

   std::float_t m_flControlPoint1; // 0x0 - 0x0
   std::float_t m_flControlPoint2; // 0x4 - 0x4

}; // size - 0x8


class CBlendNodeChild
{
public:

   CAnimNodeConnection m_inputConnection; // 0x8 - 0x8
   CUtlString m_name; // 0x10 - 0x10
   std::float_t m_blendValue; // 0x18 - 0x18

}; // size - 0x20


class CBlendUpdateNode : public CAnimUpdateNodeBase
{
public:

   CUtlVector< CAnimUpdateNodeRef > m_children; // 0x60 - 0x60
   CUtlVector< uint8 > m_sortedOrder; // 0x78 - 0x78
   CUtlVector< float32 > m_targetValues; // 0x90 - 0x90
   AnimValueSource m_blendValueSource; // 0xAC - 0xAC
   CAnimParamHandle m_paramIndex; // 0xB0 - 0xB0
   CAnimInputDamping m_damping; // 0xB8 - 0xB8
   BlendKeyType m_blendKeyType; // 0xC8 - 0xC8
   bool m_bLockBlendOnReset; // 0xCC - 0xCC
   bool m_bSyncCycles; // 0xCD - 0xCD
   bool m_bLoop; // 0xCE - 0xCE
   bool m_bLockWhenWaning; // 0xCF - 0xCF

}; // size - 0xD0


class CBlockSelectionMetric : public CMotionMetricBase
{
public:


}; // size - 0x28


class CBlockSelectionMetricEvaluator : public CMotionMetricEvaluator
{
public:


}; // size - 0x50


class CBlood : public CPointEntity
{
public:

   QAngle m_vecSprayAngles; // 0x4A0 - 0x4A0
   Vector m_vecSprayDir; // 0x4AC - 0x4AC
   std::float_t m_flAmount; // 0x4B8 - 0x4B8
   std::int32_t m_Color; // 0x4BC - 0x4BC

}; // size - 0x4C0


class CBodyComponentBaseAnimGraph : public CBodyComponentSkeletonInstance
{
public:

   CBaseAnimGraphController m_animationController; // 0x470 - 0x470
   CNetworkVarChainer __m_pChainEntity; // 0x1708 - 0x1708

}; // size - 0x1730


class CBodyComponentBaseAnimGraph : public CBodyComponentSkeletonInstance
{
public:

   CBaseAnimGraphController m_animationController; // 0x470 - 0x470
   CNetworkVarChainer __m_pChainEntity; // 0x720 - 0x720

}; // size - 0x750


class CBodyComponentBaseModelEntity : public CBodyComponentSkeletonInstance
{
public:

   CNetworkVarChainer __m_pChainEntity; // 0x470 - 0x470

}; // size - 0x4A0


class CBodyComponentBaseModelEntity : public CBodyComponentSkeletonInstance
{
public:

   CNetworkVarChainer __m_pChainEntity; // 0x470 - 0x470

}; // size - 0x4A0


class CBodyComponentPoint : public CBodyComponent
{
public:

   CGameSceneNode m_sceneNode; // 0x50 - 0x50
   CNetworkVarChainer __m_pChainEntity; // 0x1A0 - 0x1A0

}; // size - 0x1D0


class CBodyComponentPoint : public CBodyComponent
{
public:

   CGameSceneNode m_sceneNode; // 0x50 - 0x50
   CNetworkVarChainer __m_pChainEntity; // 0x1A0 - 0x1A0

}; // size - 0x1D0


class CBodyGroupAnimTag : public CAnimTagBase
{
public:

   std::int32_t m_nPriority; // 0x40 - 0x40
   CUtlVector< CBodyGroupSetting > m_bodyGroupSettings; // 0x48 - 0x48

}; // size - 0x60


class CBodyGroupSetting
{
public:

   CUtlString m_BodyGroupName; // 0x0 - 0x0
   std::int32_t m_nBodyGroupOption; // 0x8 - 0x8

}; // size - 0x10


class CBombTarget : public CBaseTrigger
{
public:

   CEntityIOOutput m_OnBombExplode; // 0x898 - 0x898
   CEntityIOOutput m_OnBombPlanted; // 0x8C0 - 0x8C0
   CEntityIOOutput m_OnBombDefused; // 0x8E8 - 0x8E8
   bool m_bIsBombSiteB; // 0x910 - 0x910
   bool m_bIsHeistBombTarget; // 0x911 - 0x911
   bool m_bBombPlantedHere; // 0x912 - 0x912
   CUtlSymbolLarge m_szMountTarget; // 0x918 - 0x918
   CHandle< CBaseEntity > m_hInstructorHint; // 0x920 - 0x920

}; // size - 0x928


class CBoneConstraintPoseSpaceBone : public CBaseConstraint
{
public:

   class Input_t
   {
   public:

      Vector m_inputValue; // 0x0 - 0x0
      CUtlVector< CTransform > m_outputTransformList; // 0x10 - 0x10

   }; // size - 0x28

   CUtlVector< CBoneConstraintPoseSpaceBone::Input_t > m_inputList; // 0x70 - 0x70

}; // size - 0x98



class CBoneConstraintPoseSpaceMorph : public CBoneConstraintBase
{
public:

   class Input_t
   {
   public:

      Vector m_inputValue; // 0x0 - 0x0
      CUtlVector< float32 > m_outputWeightList; // 0x10 - 0x10

   }; // size - 0x28

   CUtlString m_sBoneName; // 0x28 - 0x28
   CUtlString m_sAttachmentName; // 0x30 - 0x30
   CUtlVector< CUtlString > m_outputMorph; // 0x38 - 0x38
   CUtlVector< CBoneConstraintPoseSpaceMorph::Input_t > m_inputList; // 0x50 - 0x50
   bool m_bClamp; // 0x68 - 0x68

}; // size - 0xA8



class CBoneMaskAnimNode : public CAnimNodeBase
{
public:

   CUtlString m_weightListName; // 0x38 - 0x38
   CAnimNodeConnection m_inputConnection1; // 0x40 - 0x40
   CAnimNodeConnection m_inputConnection2; // 0x48 - 0x48
   BoneMaskBlendSpace m_blendSpace; // 0x50 - 0x50
   bool m_bUseBlendScale; // 0x54 - 0x54
   AnimValueSource m_blendValueSource; // 0x58 - 0x58
   AnimParamID m_blendParameter; // 0x5C - 0x5C
   BinaryNodeTiming m_timingBehavior; // 0x60 - 0x60
   std::float_t m_flTimingBlend; // 0x64 - 0x64
   std::float_t m_flRootMotionBlend; // 0x68 - 0x68
   BinaryNodeChildOption m_footMotionTiming; // 0x6C - 0x6C
   bool m_bResetChild1; // 0x70 - 0x70
   bool m_bResetChild2; // 0x71 - 0x71

}; // size - 0x78


class CBoneMaskUpdateNode : public CBinaryUpdateNode
{
public:

   std::int32_t m_nWeightListIndex; // 0x8C - 0x8C
   std::float_t m_flRootMotionBlend; // 0x90 - 0x90
   BoneMaskBlendSpace m_blendSpace; // 0x94 - 0x94
   BinaryNodeChildOption m_footMotionTiming; // 0x98 - 0x98
   bool m_bUseBlendScale; // 0x9C - 0x9C
   AnimValueSource m_blendValueSource; // 0xA0 - 0xA0
   CAnimParamHandle m_hBlendParameter; // 0xA4 - 0xA4

}; // size - 0xA8


class CBonePositionMetric : public CMotionMetricBase
{
public:

   CUtlString m_boneName; // 0x28 - 0x28

}; // size - 0x30


class CBonePositionMetricEvaluator : public CMotionMetricEvaluator
{
public:

   std::int32_t m_nBoneIndex; // 0x50 - 0x50

}; // size - 0x58


class CBoneVelocityMetric : public CMotionMetricBase
{
public:

   CUtlString m_boneName; // 0x28 - 0x28

}; // size - 0x30


class CBoneVelocityMetricEvaluator : public CMotionMetricEvaluator
{
public:

   std::int32_t m_nBoneIndex; // 0x50 - 0x50

}; // size - 0x58


class CBoolAnimParameter : public CAnimParameterBase
{
public:

   bool m_bDefaultValue; // 0x78 - 0x78

}; // size - 0x80


class CBreachCharge : public CWeaponCSBase
{
public:


}; // size - 0xD50


class CBreachChargeProjectile : public CBaseGrenade
{
public:

   bool m_bShouldExplode; // 0x958 - 0x958
   CHandle< CBaseEntity > m_weaponThatThrewMe; // 0x95C - 0x95C
   std::int32_t m_nParentBoneIndex; // 0x960 - 0x960
   Vector m_vecParentBonePos; // 0x964 - 0x964
   bool m_bDefused; // 0x970 - 0x970
   bool m_bUnstuckFromPlayer; // 0x971 - 0x971
   bool m_bResolvedParent; // 0x972 - 0x972
   Vector m_vecLastKnownValidPos; // 0x974 - 0x974
   CEntityHandle m_hDesiredParent; // 0x980 - 0x980

}; // size - 0x988


class CBtActionAim : public CBtNode
{
public:

   CUtlString m_szSensorInputKey; // 0x68 - 0x68
   CUtlString m_szAimReadyKey; // 0x80 - 0x80
   std::float_t m_flZoomCooldownTimestamp; // 0x88 - 0x88
   bool m_bDoneAiming; // 0x8C - 0x8C
   std::float_t m_flLerpStartTime; // 0x90 - 0x90
   std::float_t m_flNextLookTargetLerpTime; // 0x94 - 0x94
   std::float_t m_flPenaltyReductionRatio; // 0x98 - 0x98
   QAngle m_NextLookTarget; // 0x9C - 0x9C
   CountdownTimer m_AimTimer; // 0xA8 - 0xA8
   CountdownTimer m_SniperHoldTimer; // 0xC0 - 0xC0
   CountdownTimer m_FocusIntervalTimer; // 0xD8 - 0xD8
   bool m_bAcquired; // 0xF0 - 0xF0

}; // size - 0xF8


class CBtActionCombatPositioning : public CBtNode
{
public:

   CUtlString m_szSensorInputKey; // 0x68 - 0x68
   CUtlString m_szIsAttackingKey; // 0x80 - 0x80
   CountdownTimer m_ActionTimer; // 0x88 - 0x88
   bool m_bCrouching; // 0xA0 - 0xA0

}; // size - 0xB0


class CBtActionMoveTo : public CBtNode
{
public:

   CUtlString m_szDestinationInputKey; // 0x60 - 0x60
   CUtlString m_szHidingSpotInputKey; // 0x68 - 0x68
   CUtlString m_szThreatInputKey; // 0x70 - 0x70
   Vector m_vecDestination; // 0x78 - 0x78
   bool m_bAutoLookAdjust; // 0x84 - 0x84
   bool m_bComputePath; // 0x85 - 0x85
   std::float_t m_flDamagingAreasPenaltyCost; // 0x88 - 0x88
   CountdownTimer m_CheckApproximateCornersTimer; // 0x90 - 0x90
   CountdownTimer m_CheckHighPriorityItem; // 0xA8 - 0xA8
   CountdownTimer m_RepathTimer; // 0xC0 - 0xC0
   std::float_t m_flArrivalEpsilon; // 0xD8 - 0xD8
   std::float_t m_flAdditionalArrivalEpsilon2D; // 0xDC - 0xDC
   std::float_t m_flHidingSpotCheckDistanceThreshold; // 0xE0 - 0xE0
   std::float_t m_flNearestAreaDistanceThreshold; // 0xE4 - 0xE4

}; // size - 0xE8


class CBtActionParachutePositioning : public CBtNode
{
public:

   CountdownTimer m_ActionTimer; // 0x58 - 0x58

}; // size - 0x78


class CBtNodeComposite : public CBtNode
{
public:


}; // size - 0x58


class CBtNodeConditionInactive : public CBtNodeCondition
{
public:

   std::float_t m_flRoundStartThresholdSeconds; // 0x78 - 0x78
   std::float_t m_flSensorInactivityThresholdSeconds; // 0x7C - 0x7C
   CountdownTimer m_SensorInactivityTimer; // 0x80 - 0x80

}; // size - 0x98


class CBubbling : public CBaseModelEntity
{
public:

   std::int32_t m_density; // 0x6F0 - 0x6F0
   std::int32_t m_frequency; // 0x6F4 - 0x6F4
   std::int32_t m_state; // 0x6F8 - 0x6F8

}; // size - 0x700


class CBumpMine : public CWeaponCSBase
{
public:


}; // size - 0xD50


class CBumpMineProjectile : public CBaseGrenade
{
public:

   bool m_bShouldExplode; // 0x958 - 0x958
   std::int32_t m_nParentBoneIndex; // 0x95C - 0x95C
   Vector m_vecParentBonePos; // 0x960 - 0x960
   bool m_bArmed; // 0x96C - 0x96C
   bool m_bDefused; // 0x96D - 0x96D
   bool m_bUnstuckFromPlayer; // 0x96E - 0x96E
   CUtlVector< CHandle< CBaseEntity > > m_vecTargetedObjects; // 0x970 - 0x970
   bool m_bResolvedParent; // 0x9B0 - 0x9B0
   Vector m_vecLastKnownValidPos; // 0x9B4 - 0x9B4
   CEntityHandle m_hDesiredParent; // 0x9C0 - 0x9C0
   bool m_bBeingUsed; // 0x9C4 - 0x9C4

}; // size - 0x9C8


class CBuoyancyHelper
{
public:

   std::float_t m_flFluidDensity; // 0x18 - 0x18

}; // size - 0x20


class CBuoyancyHelper
{
public:

   std::float_t m_flFluidDensity; // 0x18 - 0x18

}; // size - 0x20


class CBuyZone : public CBaseTrigger
{
public:

   std::int32_t m_LegacyTeamNum; // 0x898 - 0x898

}; // size - 0x8A0


class CC4 : public CWeaponCSBase
{
public:

   Vector m_vecLastValidPlayerHeldPosition; // 0xD50 - 0xD50
   Vector m_vecLastValidDroppedPosition; // 0xD5C - 0xD5C
   bool m_bDoValidDroppedPositionCheck; // 0xD68 - 0xD68
   bool m_bStartedArming; // 0xD69 - 0xD69
   GameTime_t m_fArmedTime; // 0xD6C - 0xD6C
   bool m_bBombPlacedAnimation; // 0xD70 - 0xD70
   bool m_bShowC4LED; // 0xD71 - 0xD71
   bool m_bIsPlantingViaUse; // 0xD72 - 0xD72
   EntitySpottedState_t m_entitySpottedState; // 0xD78 - 0xD78
   std::int32_t m_nSpotRules; // 0xD90 - 0xD90
   bool m_bPlayedArmingBeeps[7]; // 0xD94 - 0xD94
   bool m_bBombPlanted; // 0xD9B - 0xD9B
   bool m_bDroppedFromDeath; // 0xD9C - 0xD9C

}; // size - 0xDA0


class CCSBot : public CBot
{
public:

   CHandle< SpawnPointCoopEnemy > m_lastCoopSpawnPoint; // 0xD0 - 0xD0
   Vector m_eyePosition; // 0xE0 - 0xE0
   char m_name[64]; // 0xEC - 0xEC
   std::float_t m_combatRange; // 0x12C - 0x12C
   bool m_isRogue; // 0x130 - 0x130
   CountdownTimer m_rogueTimer; // 0x138 - 0x138
   bool m_diedLastRound; // 0x154 - 0x154
   std::float_t m_safeTime; // 0x158 - 0x158
   bool m_wasSafe; // 0x15C - 0x15C
   bool m_blindFire; // 0x164 - 0x164
   CountdownTimer m_surpriseTimer; // 0x168 - 0x168
   bool m_bAllowActive; // 0x180 - 0x180
   bool m_isFollowing; // 0x181 - 0x181
   CHandle< CCSPlayerPawn > m_leader; // 0x184 - 0x184
   std::float_t m_followTimestamp; // 0x188 - 0x188
   std::float_t m_allowAutoFollowTime; // 0x18C - 0x18C
   CountdownTimer m_hurryTimer; // 0x190 - 0x190
   CountdownTimer m_alertTimer; // 0x1A8 - 0x1A8
   CountdownTimer m_sneakTimer; // 0x1C0 - 0x1C0
   CountdownTimer m_panicTimer; // 0x1D8 - 0x1D8
   std::float_t m_stateTimestamp; // 0x4D8 - 0x4D8
   bool m_isAttacking; // 0x4DC - 0x4DC
   bool m_isOpeningDoor; // 0x4DD - 0x4DD
   CHandle< CBaseEntity > m_taskEntity; // 0x4E4 - 0x4E4
   Vector m_goalPosition; // 0x4F4 - 0x4F4
   CHandle< CBaseEntity > m_goalEntity; // 0x500 - 0x500
   CHandle< CBaseEntity > m_avoid; // 0x504 - 0x504
   std::float_t m_avoidTimestamp; // 0x508 - 0x508
   bool m_isStopping; // 0x50C - 0x50C
   bool m_hasVisitedEnemySpawn; // 0x50D - 0x50D
   IntervalTimer m_stillTimer; // 0x510 - 0x510
   bool m_bEyeAnglesUnderPathFinderControl; // 0x520 - 0x520
   std::int32_t m_pathIndex; // 0x6618 - 0x6618
   GameTime_t m_areaEnteredTimestamp; // 0x661C - 0x661C
   CountdownTimer m_repathTimer; // 0x6620 - 0x6620
   CountdownTimer m_avoidFriendTimer; // 0x6638 - 0x6638
   bool m_isFriendInTheWay; // 0x6650 - 0x6650
   CountdownTimer m_politeTimer; // 0x6658 - 0x6658
   bool m_isWaitingBehindFriend; // 0x6670 - 0x6670
   std::float_t m_pathLadderEnd; // 0x669C - 0x669C
   CountdownTimer m_mustRunTimer; // 0x66E8 - 0x66E8
   CountdownTimer m_waitTimer; // 0x6700 - 0x6700
   CountdownTimer m_updateTravelDistanceTimer; // 0x6718 - 0x6718
   float32 m_playerTravelDistance[64]; // 0x6730 - 0x6730
   std::uint8_t m_travelDistancePhase; // 0x6830 - 0x6830
   std::uint8_t m_hostageEscortCount; // 0x69C8 - 0x69C8
   std::float_t m_hostageEscortCountTimestamp; // 0x69CC - 0x69CC
   std::int32_t m_desiredTeam; // 0x69D0 - 0x69D0
   bool m_hasJoined; // 0x69D4 - 0x69D4
   bool m_isWaitingForHostage; // 0x69D5 - 0x69D5
   CountdownTimer m_inhibitWaitingForHostageTimer; // 0x69D8 - 0x69D8
   CountdownTimer m_waitForHostageTimer; // 0x69F0 - 0x69F0
   Vector m_noisePosition; // 0x6A08 - 0x6A08
   std::float_t m_noiseTravelDistance; // 0x6A14 - 0x6A14
   std::float_t m_noiseTimestamp; // 0x6A18 - 0x6A18
   CBasePlayerPawn* m_noiseSource; // 0x6A20 - 0x6A20
   CountdownTimer m_noiseBendTimer; // 0x6A38 - 0x6A38
   Vector m_bentNoisePosition; // 0x6A50 - 0x6A50
   bool m_bendNoisePositionValid; // 0x6A5C - 0x6A5C
   std::float_t m_lookAroundStateTimestamp; // 0x6A60 - 0x6A60
   std::float_t m_lookAheadAngle; // 0x6A64 - 0x6A64
   std::float_t m_forwardAngle; // 0x6A68 - 0x6A68
   std::float_t m_inhibitLookAroundTimestamp; // 0x6A6C - 0x6A6C
   Vector m_lookAtSpot; // 0x6A74 - 0x6A74
   std::float_t m_lookAtSpotDuration; // 0x6A84 - 0x6A84
   std::float_t m_lookAtSpotTimestamp; // 0x6A88 - 0x6A88
   std::float_t m_lookAtSpotAngleTolerance; // 0x6A8C - 0x6A8C
   bool m_lookAtSpotClearIfClose; // 0x6A90 - 0x6A90
   bool m_lookAtSpotAttack; // 0x6A91 - 0x6A91
   char* m_lookAtDesc; // 0x6A98 - 0x6A98
   std::float_t m_peripheralTimestamp; // 0x6AA0 - 0x6AA0
   std::uint8_t m_approachPointCount; // 0x6C28 - 0x6C28
   Vector m_approachPointViewPosition; // 0x6C2C - 0x6C2C
   IntervalTimer m_viewSteadyTimer; // 0x6C38 - 0x6C38
   CountdownTimer m_tossGrenadeTimer; // 0x6C50 - 0x6C50
   CountdownTimer m_isAvoidingGrenade; // 0x6C70 - 0x6C70
   std::float_t m_spotCheckTimestamp; // 0x6C90 - 0x6C90
   std::int32_t m_checkedHidingSpotCount; // 0x7098 - 0x7098
   std::float_t m_lookPitch; // 0x709C - 0x709C
   std::float_t m_lookPitchVel; // 0x70A0 - 0x70A0
   std::float_t m_lookYaw; // 0x70A4 - 0x70A4
   std::float_t m_lookYawVel; // 0x70A8 - 0x70A8
   Vector m_targetSpot; // 0x70AC - 0x70AC
   Vector m_targetSpotVelocity; // 0x70B8 - 0x70B8
   Vector m_targetSpotPredicted; // 0x70C4 - 0x70C4
   QAngle m_aimError; // 0x70D0 - 0x70D0
   QAngle m_aimGoal; // 0x70DC - 0x70DC
   GameTime_t m_targetSpotTime; // 0x70E8 - 0x70E8
   std::float_t m_aimFocus; // 0x70EC - 0x70EC
   std::float_t m_aimFocusInterval; // 0x70F0 - 0x70F0
   GameTime_t m_aimFocusNextUpdate; // 0x70F4 - 0x70F4
   CountdownTimer m_ignoreEnemiesTimer; // 0x7100 - 0x7100
   CHandle< CCSPlayerPawnBase > m_enemy; // 0x7118 - 0x7118
   bool m_isEnemyVisible; // 0x711C - 0x711C
   std::uint8_t m_visibleEnemyParts; // 0x711D - 0x711D
   Vector m_lastEnemyPosition; // 0x7120 - 0x7120
   std::float_t m_lastSawEnemyTimestamp; // 0x712C - 0x712C
   std::float_t m_firstSawEnemyTimestamp; // 0x7130 - 0x7130
   std::float_t m_currentEnemyAcquireTimestamp; // 0x7134 - 0x7134
   std::float_t m_enemyDeathTimestamp; // 0x7138 - 0x7138
   std::float_t m_friendDeathTimestamp; // 0x713C - 0x713C
   bool m_isLastEnemyDead; // 0x7140 - 0x7140
   std::int32_t m_nearbyEnemyCount; // 0x7144 - 0x7144
   CHandle< CCSPlayerPawnBase > m_bomber; // 0x7350 - 0x7350
   std::int32_t m_nearbyFriendCount; // 0x7354 - 0x7354
   CHandle< CCSPlayerPawnBase > m_closestVisibleFriend; // 0x7358 - 0x7358
   CHandle< CCSPlayerPawnBase > m_closestVisibleHumanFriend; // 0x735C - 0x735C
   IntervalTimer m_attentionInterval; // 0x7360 - 0x7360
   CHandle< CCSPlayerPawnBase > m_attacker; // 0x7370 - 0x7370
   std::float_t m_attackedTimestamp; // 0x7374 - 0x7374
   IntervalTimer m_burnedByFlamesTimer; // 0x7378 - 0x7378
   std::int32_t m_lastVictimID; // 0x7388 - 0x7388
   bool m_isAimingAtEnemy; // 0x738C - 0x738C
   bool m_isRapidFiring; // 0x738D - 0x738D
   IntervalTimer m_equipTimer; // 0x7390 - 0x7390
   CountdownTimer m_zoomTimer; // 0x73A0 - 0x73A0
   GameTime_t m_fireWeaponTimestamp; // 0x73B8 - 0x73B8
   CountdownTimer m_lookForWeaponsOnGroundTimer; // 0x73C0 - 0x73C0
   bool m_bIsSleeping; // 0x73D8 - 0x73D8
   bool m_isEnemySniperVisible; // 0x73D9 - 0x73D9
   CountdownTimer m_sawEnemySniperTimer; // 0x73E0 - 0x73E0
   std::uint8_t m_enemyQueueIndex; // 0x7498 - 0x7498
   std::uint8_t m_enemyQueueCount; // 0x7499 - 0x7499
   std::uint8_t m_enemyQueueAttendIndex; // 0x749A - 0x749A
   bool m_isStuck; // 0x749B - 0x749B
   GameTime_t m_stuckTimestamp; // 0x749C - 0x749C
   Vector m_stuckSpot; // 0x74A0 - 0x74A0
   CountdownTimer m_wiggleTimer; // 0x74B0 - 0x74B0
   CountdownTimer m_stuckJumpTimer; // 0x74C8 - 0x74C8
   GameTime_t m_nextCleanupCheckTimestamp; // 0x74E0 - 0x74E0
   float32 m_avgVel[10]; // 0x74E4 - 0x74E4
   std::int32_t m_avgVelIndex; // 0x750C - 0x750C
   std::int32_t m_avgVelCount; // 0x7510 - 0x7510
   Vector m_lastOrigin; // 0x7514 - 0x7514
   std::float_t m_lastRadioRecievedTimestamp; // 0x7524 - 0x7524
   std::float_t m_lastRadioSentTimestamp; // 0x7528 - 0x7528
   CHandle< CCSPlayerPawnBase > m_radioSubject; // 0x752C - 0x752C
   Vector m_radioPosition; // 0x7530 - 0x7530
   std::float_t m_voiceEndTimestamp; // 0x753C - 0x753C
   std::int32_t m_lastValidReactionQueueFrame; // 0x7548 - 0x7548

}; // size - 0x7550


class CCSEnvGunfire : public CPointEntity
{
public:

   std::int32_t m_iMinBurstSize; // 0x4A0 - 0x4A0
   std::int32_t m_iMaxBurstSize; // 0x4A4 - 0x4A4
   std::float_t m_flMinBurstDelay; // 0x4A8 - 0x4A8
   std::float_t m_flMaxBurstDelay; // 0x4AC - 0x4AC
   std::float_t m_flRateOfFire; // 0x4B0 - 0x4B0
   CUtlSymbolLarge m_iszShootSound; // 0x4B8 - 0x4B8
   CUtlSymbolLarge m_iszTracerType; // 0x4C0 - 0x4C0
   CUtlSymbolLarge m_iszWeaponName; // 0x4C8 - 0x4C8
   bool m_bDisabled; // 0x4D0 - 0x4D0
   std::int32_t m_iShotsRemaining; // 0x4D4 - 0x4D4
   std::int32_t m_iSpread; // 0x4D8 - 0x4D8
   Vector m_vecSpread; // 0x4DC - 0x4DC
   Vector m_vecTargetPosition; // 0x4E8 - 0x4E8
   std::float_t m_flTargetDist; // 0x4F4 - 0x4F4
   std::float_t m_flBias; // 0x4F8 - 0x4F8
   bool m_bCollide; // 0x4FC - 0x4FC
   CHandle< CBaseEntity > m_hTarget; // 0x500 - 0x500
   bool m_bAllowNullTarget; // 0x504 - 0x504
   bool m_bAlwaysWallbangTracer; // 0x505 - 0x505
   std::float_t m_flDamageScaleValue; // 0x508 - 0x508
   std::float_t m_flAdditionalSpread; // 0x50C - 0x50C

}; // size - 0x510


class CCSGOPlayerAnimGraphState
{
public:


}; // size - 0x120


class CCSGOViewModel : public CPredictedViewModel
{
public:

   bool m_bShouldIgnoreOffsetAndAccuracy; // 0x868 - 0x868
   std::uint32_t m_nWeaponParity; // 0x86C - 0x86C
   std::uint32_t m_nOldWeaponParity; // 0x870 - 0x870

}; // size - 0x878


class CCSGO_TeamIntroCounterTerroristPosition : public CCSGO_TeamIntroCharacterPosition
{
public:


}; // size - 0x730


class CCSGO_TeamIntroTerroristPosition : public CCSGO_TeamIntroCharacterPosition
{
public:


}; // size - 0x730


class CCSGO_TeamSelectCounterTerroristPosition : public CCSGO_TeamSelectCharacterPosition
{
public:


}; // size - 0x730


class CCSGO_TeamSelectTerroristPosition : public CCSGO_TeamSelectCharacterPosition
{
public:


}; // size - 0x730


class CCSGameRules : public CTeamplayRules
{
public:

   CNetworkVarChainer __m_pChainEntity; // 0x98 - 0x98
   CHandle< CBaseEntity > m_coopMissionManager; // 0xC0 - 0xC0
   bool m_bFreezePeriod; // 0xC4 - 0xC4
   bool m_bWarmupPeriod; // 0xC5 - 0xC5
   GameTime_t m_fWarmupPeriodEnd; // 0xC8 - 0xC8
   GameTime_t m_fWarmupPeriodStart; // 0xCC - 0xCC
   bool m_bTerroristTimeOutActive; // 0xD0 - 0xD0
   bool m_bCTTimeOutActive; // 0xD1 - 0xD1
   std::float_t m_flTerroristTimeOutRemaining; // 0xD4 - 0xD4
   std::float_t m_flCTTimeOutRemaining; // 0xD8 - 0xD8
   std::int32_t m_nTerroristTimeOuts; // 0xDC - 0xDC
   std::int32_t m_nCTTimeOuts; // 0xE0 - 0xE0
   bool m_bTechnicalTimeOut; // 0xE4 - 0xE4
   bool m_bMatchWaitingForResume; // 0xE5 - 0xE5
   std::int32_t m_iRoundTime; // 0xE8 - 0xE8
   std::float_t m_fMatchStartTime; // 0xEC - 0xEC
   GameTime_t m_fRoundStartTime; // 0xF0 - 0xF0
   GameTime_t m_flRestartRoundTime; // 0xF4 - 0xF4
   bool m_bGameRestart; // 0xF8 - 0xF8
   std::float_t m_flGameStartTime; // 0xFC - 0xFC
   std::float_t m_timeUntilNextPhaseStarts; // 0x100 - 0x100
   std::int32_t m_gamePhase; // 0x104 - 0x104
   std::int32_t m_totalRoundsPlayed; // 0x108 - 0x108
   std::int32_t m_nRoundsPlayedThisPhase; // 0x10C - 0x10C
   std::int32_t m_nOvertimePlaying; // 0x110 - 0x110
   std::int32_t m_iHostagesRemaining; // 0x114 - 0x114
   bool m_bAnyHostageReached; // 0x118 - 0x118
   bool m_bMapHasBombTarget; // 0x119 - 0x119
   bool m_bMapHasRescueZone; // 0x11A - 0x11A
   bool m_bMapHasBuyZone; // 0x11B - 0x11B
   bool m_bIsQueuedMatchmaking; // 0x11C - 0x11C
   std::int32_t m_nQueuedMatchmakingMode; // 0x120 - 0x120
   bool m_bIsValveDS; // 0x124 - 0x124
   bool m_bLogoMap; // 0x125 - 0x125
   bool m_bPlayAllStepSoundsOnServer; // 0x126 - 0x126
   std::int32_t m_iNumGunGameProgressiveWeaponsCT; // 0x128 - 0x128
   std::int32_t m_iNumGunGameProgressiveWeaponsT; // 0x12C - 0x12C
   std::int32_t m_iSpectatorSlotCount; // 0x130 - 0x130
   int32 m_GGProgressiveWeaponOrderCT[60]; // 0x134 - 0x134
   int32 m_GGProgressiveWeaponOrderT[60]; // 0x224 - 0x224
   int32 m_GGProgressiveWeaponKillUpgradeOrderCT[60]; // 0x314 - 0x314
   int32 m_GGProgressiveWeaponKillUpgradeOrderT[60]; // 0x404 - 0x404
   std::int32_t m_MatchDevice; // 0x4F4 - 0x4F4
   bool m_bHasMatchStarted; // 0x4F8 - 0x4F8
   std::float_t m_flDMBonusStartTime; // 0x4FC - 0x4FC
   std::float_t m_flDMBonusTimeLength; // 0x500 - 0x500
   std::uint16_t m_unDMBonusWeaponLoadoutSlot; // 0x504 - 0x504
   bool m_bDMBonusActive; // 0x506 - 0x506
   std::int32_t m_nNextMapInMapgroup; // 0x508 - 0x508
   char m_szTournamentEventName[512]; // 0x50C - 0x50C
   char m_szTournamentEventStage[512]; // 0x70C - 0x70C
   char m_szMatchStatTxt[512]; // 0x90C - 0x90C
   char m_szTournamentPredictionsTxt[512]; // 0xB0C - 0xB0C
   std::int32_t m_nTournamentPredictionsPct; // 0xD0C - 0xD0C
   GameTime_t m_flCMMItemDropRevealStartTime; // 0xD10 - 0xD10
   GameTime_t m_flCMMItemDropRevealEndTime; // 0xD14 - 0xD14
   bool m_bIsDroppingItems; // 0xD18 - 0xD18
   bool m_bIsQuestEligible; // 0xD19 - 0xD19
   std::int32_t m_nGuardianModeWaveNumber; // 0xD1C - 0xD1C
   std::int32_t m_nGuardianModeSpecialKillsRemaining; // 0xD20 - 0xD20
   std::int32_t m_nGuardianModeSpecialWeaponNeeded; // 0xD24 - 0xD24
   std::int32_t m_nGuardianGrenadesToGiveBots; // 0xD28 - 0xD28
   std::int32_t m_nNumHeaviesToSpawn; // 0xD2C - 0xD2C
   std::uint32_t m_numGlobalGiftsGiven; // 0xD30 - 0xD30
   std::uint32_t m_numGlobalGifters; // 0xD34 - 0xD34
   std::uint32_t m_numGlobalGiftsPeriodSeconds; // 0xD38 - 0xD38
   uint32 m_arrFeaturedGiftersAccounts[4]; // 0xD3C - 0xD3C
   uint32 m_arrFeaturedGiftersGifts[4]; // 0xD4C - 0xD4C
   uint16 m_arrProhibitedItemIndices[100]; // 0xD5C - 0xD5C
   uint32 m_arrTournamentActiveCasterAccounts[4]; // 0xE24 - 0xE24
   std::int32_t m_numBestOfMaps; // 0xE34 - 0xE34
   std::int32_t m_nHalloweenMaskListSeed; // 0xE38 - 0xE38
   bool m_bBombDropped; // 0xE3C - 0xE3C
   bool m_bBombPlanted; // 0xE3D - 0xE3D
   std::int32_t m_iRoundWinStatus; // 0xE40 - 0xE40
   std::int32_t m_eRoundWinReason; // 0xE44 - 0xE44
   bool m_bTCantBuy; // 0xE48 - 0xE48
   bool m_bCTCantBuy; // 0xE49 - 0xE49
   GameTime_t m_flGuardianBuyUntilTime; // 0xE4C - 0xE4C
   int32 m_iMatchStats_RoundResults[30]; // 0xE50 - 0xE50
   int32 m_iMatchStats_PlayersAlive_CT[30]; // 0xEC8 - 0xEC8
   int32 m_iMatchStats_PlayersAlive_T[30]; // 0xF40 - 0xF40
   float32 m_TeamRespawnWaveTimes[32]; // 0xFB8 - 0xFB8
   GameTime_t m_flNextRespawnWave[32]; // 0x1038 - 0x1038
   std::int32_t m_nServerQuestID; // 0x10B8 - 0x10B8
   bool m_bDontIncrementCoopWave; // 0x10BC - 0x10BC
   bool m_bSpawnedTerrorHuntHeavy; // 0x10BD - 0x10BD
   int32 m_nEndMatchMapGroupVoteTypes[10]; // 0x10C0 - 0x10C0
   int32 m_nEndMatchMapGroupVoteOptions[10]; // 0x10E8 - 0x10E8
   std::int32_t m_nEndMatchMapVoteWinner; // 0x1110 - 0x1110
   std::int32_t m_iNumConsecutiveCTLoses; // 0x1114 - 0x1114
   std::int32_t m_iNumConsecutiveTerroristLoses; // 0x1118 - 0x1118
   bool m_bHasHostageBeenTouched; // 0x1138 - 0x1138
   GameTime_t m_flIntermissionStartTime; // 0x113C - 0x113C
   GameTime_t m_flIntermissionEndTime; // 0x1140 - 0x1140
   bool m_bLevelInitialized; // 0x1144 - 0x1144
   std::int32_t m_iTotalRoundsPlayed; // 0x1148 - 0x1148
   std::int32_t m_iUnBalancedRounds; // 0x114C - 0x114C
   bool m_endMatchOnRoundReset; // 0x1150 - 0x1150
   bool m_endMatchOnThink; // 0x1151 - 0x1151
   std::int32_t m_iFreezeTime; // 0x1154 - 0x1154
   std::int32_t m_iNumTerrorist; // 0x1158 - 0x1158
   std::int32_t m_iNumCT; // 0x115C - 0x115C
   std::int32_t m_iNumSpawnableTerrorist; // 0x1160 - 0x1160
   std::int32_t m_iNumSpawnableCT; // 0x1164 - 0x1164
   CUtlVector< int32 > m_arrSelectedHostageSpawnIndices; // 0x1168 - 0x1168
   bool m_bFirstConnected; // 0x1180 - 0x1180
   bool m_bCompleteReset; // 0x1181 - 0x1181
   bool m_bPickNewTeamsOnReset; // 0x1182 - 0x1182
   bool m_bScrambleTeamsOnRestart; // 0x1183 - 0x1183
   bool m_bSwapTeamsOnRestart; // 0x1184 - 0x1184
   CUtlVector< int32 > m_nEndMatchTiedVotes; // 0x1190 - 0x1190
   bool m_bNeedToAskPlayersForContinueVote; // 0x11AC - 0x11AC
   std::uint32_t m_numQueuedMatchmakingAccounts; // 0x11B0 - 0x11B0
   char* m_pQueuedMatchmakingReservationString; // 0x11B8 - 0x11B8
   std::uint32_t m_numTotalTournamentDrops; // 0x11C0 - 0x11C0
   std::uint32_t m_numSpectatorsCountMax; // 0x11C4 - 0x11C4
   std::uint32_t m_numSpectatorsCountMaxTV; // 0x11C8 - 0x11C8
   std::uint32_t m_numSpectatorsCountMaxLnk; // 0x11CC - 0x11CC
   bool m_bForceTeamChangeSilent; // 0x11D8 - 0x11D8
   bool m_bLoadingRoundBackupData; // 0x11D9 - 0x11D9
   std::int32_t m_nMatchInfoShowType; // 0x1210 - 0x1210
   std::float_t m_flMatchInfoDecidedTime; // 0x1214 - 0x1214
   std::float_t m_flCoopRespawnAndHealTime; // 0x1230 - 0x1230
   std::int32_t m_coopBonusCoinsFound; // 0x1234 - 0x1234
   bool m_coopBonusPistolsOnly; // 0x1238 - 0x1238
   bool m_coopPlayersInDeploymentZone; // 0x1239 - 0x1239
   bool m_coopMissionDeadPlayerRespawnEnabled; // 0x123A - 0x123A
   std::int32_t mTeamDMLastWinningTeamNumber; // 0x123C - 0x123C
   std::float_t mTeamDMLastThinkTime; // 0x1240 - 0x1240
   std::float_t m_flTeamDMLastAnnouncementTime; // 0x1244 - 0x1244
   std::int32_t m_iAccountTerrorist; // 0x1248 - 0x1248
   std::int32_t m_iAccountCT; // 0x124C - 0x124C
   std::int32_t m_iSpawnPointCount_Terrorist; // 0x1250 - 0x1250
   std::int32_t m_iSpawnPointCount_CT; // 0x1254 - 0x1254
   std::int32_t m_iMaxNumTerrorists; // 0x1258 - 0x1258
   std::int32_t m_iMaxNumCTs; // 0x125C - 0x125C
   std::int32_t m_iLoserBonus; // 0x1260 - 0x1260
   std::int32_t m_iLoserBonusMostRecentTeam; // 0x1264 - 0x1264
   std::float_t m_tmNextPeriodicThink; // 0x1268 - 0x1268
   bool m_bVoiceWonMatchBragFired; // 0x126C - 0x126C
   std::float_t m_fWarmupNextChatNoticeTime; // 0x1270 - 0x1270
   std::int32_t m_iHostagesRescued; // 0x1278 - 0x1278
   std::int32_t m_iHostagesTouched; // 0x127C - 0x127C
   std::float_t m_flNextHostageAnnouncement; // 0x1280 - 0x1280
   bool m_bNoTerroristsKilled; // 0x1284 - 0x1284
   bool m_bNoCTsKilled; // 0x1285 - 0x1285
   bool m_bNoEnemiesKilled; // 0x1286 - 0x1286
   bool m_bCanDonateWeapons; // 0x1287 - 0x1287
   std::float_t m_firstKillTime; // 0x128C - 0x128C
   std::float_t m_firstBloodTime; // 0x1294 - 0x1294
   bool m_hostageWasInjured; // 0x12B0 - 0x12B0
   bool m_hostageWasKilled; // 0x12B1 - 0x12B1
   bool m_bVoteCalled; // 0x12C0 - 0x12C0
   bool m_bServerVoteOnReset; // 0x12C1 - 0x12C1
   std::float_t m_flVoteCheckThrottle; // 0x12C4 - 0x12C4
   bool m_bBuyTimeEnded; // 0x12C8 - 0x12C8
   std::int32_t m_nLastFreezeEndBeep; // 0x12CC - 0x12CC
   std::int32_t m_iHaveEscaped; // 0x12D0 - 0x12D0
   bool m_bMapHasEscapeZone; // 0x12D4 - 0x12D4
   std::int32_t m_iNumEscapers; // 0x12D8 - 0x12D8
   std::int32_t m_iNumEscapeRounds; // 0x12DC - 0x12DC
   bool m_bTargetBombed; // 0x12E0 - 0x12E0
   bool m_bBombDefused; // 0x12E1 - 0x12E1
   bool m_bMapHasBombZone; // 0x12E2 - 0x12E2
   bool m_bGunGameRespawnWithBomb; // 0x12E3 - 0x12E3
   std::float_t m_fGunGameBombRespawnTimer; // 0x12E4 - 0x12E4
   Vector m_vecMainCTSpawnPos; // 0x1304 - 0x1304
   CUtlVector< SpawnPoint* > m_CTSpawnPointsMasterList; // 0x1310 - 0x1310
   CUtlVector< SpawnPoint* > m_TerroristSpawnPointsMasterList; // 0x1328 - 0x1328
   std::int32_t m_iNextCTSpawnPoint; // 0x1340 - 0x1340
   std::int32_t m_iNextTerroristSpawnPoint; // 0x1344 - 0x1344
   CUtlVector< SpawnPoint* > m_CTSpawnPoints; // 0x1348 - 0x1348
   CUtlVector< SpawnPoint* > m_TerroristSpawnPoints; // 0x1360 - 0x1360
   bool m_bIsUnreservedGameServer; // 0x1378 - 0x1378
   std::float_t m_fAutobalanceDisplayTime; // 0x137C - 0x137C
   bool m_bAllowWeaponSwitch; // 0x15E8 - 0x15E8
   bool m_bRoundTimeWarningTriggered; // 0x15E9 - 0x15E9
   GameTime_t m_phaseChangeAnnouncementTime; // 0x15EC - 0x15EC
   std::float_t m_fNextUpdateTeamClanNamesTime; // 0x15F0 - 0x15F0
   GameTime_t m_flLastThinkTime; // 0x15F4 - 0x15F4
   std::float_t m_fAccumulatedRoundOffDamage; // 0x15F8 - 0x15F8
   std::int32_t m_nShorthandedBonusLastEvalRound; // 0x15FC - 0x15FC
   bool m_bHasTriggeredRoundStartMusic; // 0x1860 - 0x1860
   bool m_bHasTriggeredCoopSpawnReset; // 0x1861 - 0x1861
   bool m_bSwitchingTeamsAtRoundReset; // 0x1862 - 0x1862
   std::int32_t m_iMaxGunGameProgressiveWeaponIndex; // 0x1864 - 0x1864
   CSurvivalGameRules m_SurvivalRules; // 0x1880 - 0x1880
   KeyValues3 m_BtGlobalBlackboard; // 0x3518 - 0x3518
   CHandle< CBaseEntity > m_hPlayerResource; // 0x3580 - 0x3580
   CRetakeGameRules m_RetakeRules; // 0x3588 - 0x3588
   std::int32_t m_GuardianBotSkillLevelMax; // 0x376C - 0x376C
   std::int32_t m_GuardianBotSkillLevelMin; // 0x3770 - 0x3770
   CUtlVector< int32 > m_arrTeamUniqueKillWeaponsMatch[4]; // 0x3778 - 0x3778
   bool m_bTeamLastKillUsedUniqueWeaponMatch[4]; // 0x37D8 - 0x37D8
   std::uint8_t m_nMatchEndCount; // 0x3800 - 0x3800
   bool m_bTeamIntroPeriod; // 0x3801 - 0x3801
   GameTime_t m_fTeamIntroPeriodEnd; // 0x3804 - 0x3804

}; // size - 0x3808


class CCSGameRulesProxy : public CGameRulesProxy
{
public:

   CCSGameRules* m_pGameRules; // 0x4A0 - 0x4A0

}; // size - 0x4A8


class CCSObserverPawn : public CCSPlayerPawnBase
{
public:


}; // size - 0x1598


class CCSPlace : public CServerOnlyModelEntity
{
public:

   CUtlSymbolLarge m_name; // 0x6F8 - 0x6F8

}; // size - 0x700


class CCSPlayerController : public CBasePlayerController
{
public:

   CCSPlayerController_InGameMoneyServices* m_pInGameMoneyServices; // 0x678 - 0x678
   CCSPlayerController_InventoryServices* m_pInventoryServices; // 0x680 - 0x680
   CCSPlayerController_ActionTrackingServices* m_pActionTrackingServices; // 0x688 - 0x688
   CCSPlayerController_DamageServices* m_pDamageServices; // 0x690 - 0x690
   std::uint32_t m_iPing; // 0x698 - 0x698
   bool m_bHasCommunicationAbuseMute; // 0x69C - 0x69C
   CUtlSymbolLarge m_szCrosshairCodes; // 0x6A0 - 0x6A0
   std::uint8_t m_iPendingTeamNum; // 0x6A8 - 0x6A8
   GameTime_t m_flForceTeamTime; // 0x6AC - 0x6AC
   std::int32_t m_iCompTeammateColor; // 0x6B0 - 0x6B0
   bool m_bEverPlayedOnTeam; // 0x6B4 - 0x6B4
   bool m_bAttemptedToGetColor; // 0x6B5 - 0x6B5
   std::int32_t m_iTeammatePreferredColor; // 0x6B8 - 0x6B8
   bool m_bTeamChanged; // 0x6BC - 0x6BC
   bool m_bInSwitchTeam; // 0x6BD - 0x6BD
   bool m_bHasSeenJoinGame; // 0x6BE - 0x6BE
   bool m_bJustBecameSpectator; // 0x6BF - 0x6BF
   bool m_bSwitchTeamsOnNextRoundReset; // 0x6C0 - 0x6C0
   CUtlSymbolLarge m_szClan; // 0x6C8 - 0x6C8
   char m_szClanName[32]; // 0x6D0 - 0x6D0
   std::int32_t m_iCoachingTeam; // 0x6F0 - 0x6F0
   std::uint64_t m_nPlayerDominated; // 0x6F8 - 0x6F8
   std::uint64_t m_nPlayerDominatingMe; // 0x700 - 0x700
   std::int32_t m_iCompetitiveRanking; // 0x708 - 0x708
   std::int32_t m_iCompetitiveWins; // 0x70C - 0x70C
   std::int8_t m_iCompetitiveRankType; // 0x710 - 0x710
   std::int32_t m_nEndMatchNextMapVote; // 0x714 - 0x714
   std::uint16_t m_unActiveQuestId; // 0x718 - 0x718
   QuestProgress::Reason m_nQuestProgressReason; // 0x71C - 0x71C
   std::uint32_t m_unPlayerTvControlFlags; // 0x720 - 0x720
   std::int32_t m_iDraftIndex; // 0x790 - 0x790
   std::uint32_t m_msQueuedModeDisconnectionTimestamp; // 0x794 - 0x794
   std::uint32_t m_uiAbandonRecordedReason; // 0x798 - 0x798
   bool m_bEverFullyConnected; // 0x79C - 0x79C
   bool m_bAbandonAllowsSurrender; // 0x79D - 0x79D
   bool m_bDisconnection1MinWarningPrinted; // 0x79E - 0x79E
   bool m_bScoreReported; // 0x79F - 0x79F
   std::int32_t m_nDisconnectionTick; // 0x7A0 - 0x7A0
   bool m_bControllingBot; // 0x7B0 - 0x7B0
   bool m_bHasControlledBotThisRound; // 0x7B1 - 0x7B1
   bool m_bHasBeenControlledByPlayerThisRound; // 0x7B2 - 0x7B2
   std::int32_t m_nBotsControlledThisRound; // 0x7B4 - 0x7B4
   bool m_bCanControlObservedBot; // 0x7B8 - 0x7B8
   CHandle< CCSPlayerPawn > m_hPlayerPawn; // 0x7BC - 0x7BC
   CHandle< CCSObserverPawn > m_hObserverPawn; // 0x7C0 - 0x7C0
   std::int32_t m_DesiredObserverMode; // 0x7C4 - 0x7C4
   CEntityHandle m_hDesiredObserverTarget; // 0x7C8 - 0x7C8
   bool m_bPawnIsAlive; // 0x7CC - 0x7CC
   std::uint32_t m_iPawnHealth; // 0x7D0 - 0x7D0
   std::int32_t m_iPawnArmor; // 0x7D4 - 0x7D4
   bool m_bPawnHasDefuser; // 0x7D8 - 0x7D8
   bool m_bPawnHasHelmet; // 0x7D9 - 0x7D9
   std::uint16_t m_nPawnCharacterDefIndex; // 0x7DA - 0x7DA
   std::int32_t m_iPawnLifetimeStart; // 0x7DC - 0x7DC
   std::int32_t m_iPawnLifetimeEnd; // 0x7E0 - 0x7E0
   std::int32_t m_iPawnGunGameLevel; // 0x7E4 - 0x7E4
   std::int32_t m_iPawnBotDifficulty; // 0x7E8 - 0x7E8
   CHandle< CCSPlayerController > m_hOriginalControllerOfCurrentPawn; // 0x7EC - 0x7EC
   std::int32_t m_iScore; // 0x7F0 - 0x7F0
   std::int32_t m_iRoundScore; // 0x7F4 - 0x7F4
   CNetworkUtlVectorBase< EKillTypes_t > m_vecKills; // 0x7F8 - 0x7F8
   std::int32_t m_iMVPs; // 0x810 - 0x810
   std::int32_t m_nUpdateCounter; // 0x814 - 0x814
   IntervalTimer m_lastHeldVoteTimer; // 0xF8B8 - 0xF8B8
   bool m_bShowHints; // 0xF8D0 - 0xF8D0
   std::int32_t m_iNextTimeCheck; // 0xF8D4 - 0xF8D4

}; // size - 0xF8D8


class CCSPlayerController : public CBasePlayerController
{
public:

   CCSPlayerController_InGameMoneyServices* m_pInGameMoneyServices; // 0x6B0 - 0x6B0
   CCSPlayerController_InventoryServices* m_pInventoryServices; // 0x6B8 - 0x6B8
   CCSPlayerController_ActionTrackingServices* m_pActionTrackingServices; // 0x6C0 - 0x6C0
   CCSPlayerController_DamageServices* m_pDamageServices; // 0x6C8 - 0x6C8
   std::uint32_t m_iPing; // 0x6D0 - 0x6D0
   bool m_bHasCommunicationAbuseMute; // 0x6D4 - 0x6D4
   CUtlSymbolLarge m_szCrosshairCodes; // 0x6D8 - 0x6D8
   std::uint8_t m_iPendingTeamNum; // 0x6E0 - 0x6E0
   GameTime_t m_flForceTeamTime; // 0x6E4 - 0x6E4
   std::int32_t m_iCompTeammateColor; // 0x6E8 - 0x6E8
   bool m_bEverPlayedOnTeam; // 0x6EC - 0x6EC
   GameTime_t m_flPreviousForceJoinTeamTime; // 0x6F0 - 0x6F0
   CUtlSymbolLarge m_szClan; // 0x6F8 - 0x6F8
   CUtlString m_sSanitizedPlayerName; // 0x700 - 0x700
   std::int32_t m_iCoachingTeam; // 0x708 - 0x708
   std::uint64_t m_nPlayerDominated; // 0x710 - 0x710
   std::uint64_t m_nPlayerDominatingMe; // 0x718 - 0x718
   std::int32_t m_iCompetitiveRanking; // 0x720 - 0x720
   std::int32_t m_iCompetitiveWins; // 0x724 - 0x724
   std::int8_t m_iCompetitiveRankType; // 0x728 - 0x728
   std::int32_t m_nEndMatchNextMapVote; // 0x72C - 0x72C
   std::uint16_t m_unActiveQuestId; // 0x730 - 0x730
   QuestProgress::Reason m_nQuestProgressReason; // 0x734 - 0x734
   std::uint32_t m_unPlayerTvControlFlags; // 0x738 - 0x738
   std::int32_t m_iDraftIndex; // 0x7A8 - 0x7A8
   std::uint32_t m_msQueuedModeDisconnectionTimestamp; // 0x7AC - 0x7AC
   std::uint32_t m_uiAbandonRecordedReason; // 0x7B0 - 0x7B0
   bool m_bEverFullyConnected; // 0x7B4 - 0x7B4
   bool m_bAbandonAllowsSurrender; // 0x7B5 - 0x7B5
   bool m_bDisconnection1MinWarningPrinted; // 0x7B6 - 0x7B6
   bool m_bScoreReported; // 0x7B7 - 0x7B7
   std::int32_t m_nDisconnectionTick; // 0x7B8 - 0x7B8
   bool m_bControllingBot; // 0x7C8 - 0x7C8
   bool m_bHasControlledBotThisRound; // 0x7C9 - 0x7C9
   bool m_bHasBeenControlledByPlayerThisRound; // 0x7CA - 0x7CA
   std::int32_t m_nBotsControlledThisRound; // 0x7CC - 0x7CC
   bool m_bCanControlObservedBot; // 0x7D0 - 0x7D0
   CHandle< C_CSPlayerPawn > m_hPlayerPawn; // 0x7D4 - 0x7D4
   CHandle< C_CSObserverPawn > m_hObserverPawn; // 0x7D8 - 0x7D8
   bool m_bPawnIsAlive; // 0x7DC - 0x7DC
   std::uint32_t m_iPawnHealth; // 0x7E0 - 0x7E0
   std::int32_t m_iPawnArmor; // 0x7E4 - 0x7E4
   bool m_bPawnHasDefuser; // 0x7E8 - 0x7E8
   bool m_bPawnHasHelmet; // 0x7E9 - 0x7E9
   std::uint16_t m_nPawnCharacterDefIndex; // 0x7EA - 0x7EA
   std::int32_t m_iPawnLifetimeStart; // 0x7EC - 0x7EC
   std::int32_t m_iPawnLifetimeEnd; // 0x7F0 - 0x7F0
   std::int32_t m_iPawnGunGameLevel; // 0x7F4 - 0x7F4
   std::int32_t m_iPawnBotDifficulty; // 0x7F8 - 0x7F8
   CHandle< CCSPlayerController > m_hOriginalControllerOfCurrentPawn; // 0x7FC - 0x7FC
   std::int32_t m_iScore; // 0x800 - 0x800
   C_NetworkUtlVectorBase< EKillTypes_t > m_vecKills; // 0x808 - 0x808
   std::int32_t m_iMVPs; // 0x820 - 0x820
   bool m_bIsPlayerNameDirty; // 0x824 - 0x824

}; // size - 0x828


class CCSPlayerController_ActionTrackingServices : public CPlayerControllerComponent
{
public:

   CUtlVectorEmbeddedNetworkVar< CSPerRoundStats_t > m_perRoundStats; // 0x40 - 0x40
   CSMatchStats_t m_matchStats; // 0x90 - 0x90
   std::int32_t m_iNumRoundKills; // 0x148 - 0x148
   std::int32_t m_iNumRoundKillsHeadshots; // 0x14C - 0x14C

}; // size - 0x200


class CCSPlayerController_ActionTrackingServices : public CPlayerControllerComponent
{
public:

   C_UtlVectorEmbeddedNetworkVar< CSPerRoundStats_t > m_perRoundStats; // 0x40 - 0x40
   CSMatchStats_t m_matchStats; // 0x90 - 0x90
   std::int32_t m_iNumRoundKills; // 0x108 - 0x108
   std::int32_t m_iNumRoundKillsHeadshots; // 0x10C - 0x10C

}; // size - 0x110


class CCSPlayerController_DamageServices : public CPlayerControllerComponent
{
public:

   std::int32_t m_nSendUpdate; // 0x40 - 0x40
   CUtlVectorEmbeddedNetworkVar< CDamageRecord > m_DamageList; // 0x48 - 0x48

}; // size - 0x98


class CCSPlayerController_DamageServices : public CPlayerControllerComponent
{
public:

   std::int32_t m_nSendUpdate; // 0x40 - 0x40
   std::int32_t m_nCachedSendUpdate; // 0x44 - 0x44
   C_UtlVectorEmbeddedNetworkVar< CDamageRecord > m_DamageList; // 0x48 - 0x48

}; // size - 0x98


class CCSPlayerController_InGameMoneyServices : public CPlayerControllerComponent
{
public:

   std::int32_t m_iAccount; // 0x40 - 0x40
   std::int32_t m_iStartAccount; // 0x44 - 0x44
   std::int32_t m_iTotalCashSpent; // 0x48 - 0x48
   std::int32_t m_iCashSpentThisRound; // 0x4C - 0x4C
   std::int32_t m_nPreviousAccount; // 0x50 - 0x50

}; // size - 0x58


class CCSPlayerController_InGameMoneyServices : public CPlayerControllerComponent
{
public:

   bool m_bReceivesMoneyNextRound; // 0x40 - 0x40
   std::int32_t m_iAccountMoneyEarnedForNextRound; // 0x44 - 0x44
   std::int32_t m_iAccount; // 0x48 - 0x48
   std::int32_t m_iStartAccount; // 0x4C - 0x4C
   std::int32_t m_iTotalCashSpent; // 0x50 - 0x50
   std::int32_t m_iCashSpentThisRound; // 0x54 - 0x54

}; // size - 0x58


class CCSPlayerController_InventoryServices : public CPlayerControllerComponent
{
public:

   std::uint16_t m_unMusicID; // 0x40 - 0x40
   MedalRank_t m_rank[6]; // 0x44 - 0x44
   std::int32_t m_nPersonaDataPublicLevel; // 0x5C - 0x5C
   std::int32_t m_nPersonaDataPublicCommendsLeader; // 0x60 - 0x60
   std::int32_t m_nPersonaDataPublicCommendsTeacher; // 0x64 - 0x64
   std::int32_t m_nPersonaDataPublicCommendsFriendly; // 0x68 - 0x68
   C_UtlVectorEmbeddedNetworkVar< C_EconItemView > m_vecTerroristLoadoutCache; // 0x70 - 0x70
   C_UtlVectorEmbeddedNetworkVar< C_EconItemView > m_vecCounterTerroristLoadoutCache; // 0xC0 - 0xC0

}; // size - 0x110


class CCSPlayerController_InventoryServices : public CPlayerControllerComponent
{
public:

   std::uint16_t m_unMusicID; // 0x40 - 0x40
   MedalRank_t m_rank[6]; // 0x44 - 0x44
   std::int32_t m_nPersonaDataPublicLevel; // 0x5C - 0x5C
   std::int32_t m_nPersonaDataPublicCommendsLeader; // 0x60 - 0x60
   std::int32_t m_nPersonaDataPublicCommendsTeacher; // 0x64 - 0x64
   std::int32_t m_nPersonaDataPublicCommendsFriendly; // 0x68 - 0x68
   uint32 m_unEquippedPlayerSprayIDs[1]; // 0x868 - 0x868
   CUtlVectorEmbeddedNetworkVar< CEconItemView > m_vecTerroristLoadoutCache; // 0x870 - 0x870
   CUtlVectorEmbeddedNetworkVar< CEconItemView > m_vecCounterTerroristLoadoutCache; // 0x8C0 - 0x8C0

}; // size - 0x910


class CCSPlayerPawn : public CCSPlayerPawnBase
{
public:

   CCSPlayer_ParachuteServices* m_pParachuteServices; // 0x1570 - 0x1570
   CCSPlayer_BulletServices* m_pBulletServices; // 0x1578 - 0x1578
   CCSPlayer_HostageServices* m_pHostageServices; // 0x1580 - 0x1580
   CCSPlayer_BuyServices* m_pBuyServices; // 0x1588 - 0x1588
   CCSPlayer_PingServices* m_pPingServices; // 0x1590 - 0x1590
   CCSPlayer_RadioServices* m_pRadioServices; // 0x1598 - 0x1598
   CCSPlayer_DamageReactServices* m_pDamageReactServices; // 0x15A0 - 0x15A0
   std::int32_t m_iRetakesOffering; // 0x1670 - 0x1670
   std::int32_t m_iRetakesOfferingCard; // 0x1674 - 0x1674
   bool m_bRetakesHasDefuseKit; // 0x1678 - 0x1678
   bool m_bRetakesMVPLastRound; // 0x1679 - 0x1679
   std::int32_t m_iRetakesMVPBoostItem; // 0x167C - 0x167C
   loadout_positions_t m_RetakesMVPBoostExtraUtility; // 0x1680 - 0x1680
   bool m_bIsBuyMenuOpen; // 0x1684 - 0x1684
   CTransform m_xLastHeadBoneTransform; // 0x17E0 - 0x17E0
   bool m_bLastHeadBoneTransformIsValid; // 0x1800 - 0x1800
   std::int32_t m_iPlayerLocked; // 0x1804 - 0x1804
   std::float_t m_flNextSprayDecalTime; // 0x180C - 0x180C
   std::int32_t m_nRagdollDamageBone; // 0x1814 - 0x1814
   Vector m_vRagdollDamageForce; // 0x1818 - 0x1818
   Vector m_vRagdollDamagePosition; // 0x1824 - 0x1824
   char m_szRagdollDamageWeaponName[64]; // 0x1830 - 0x1830
   bool m_bRagdollDamageHeadshot; // 0x1870 - 0x1870
   CEconItemView m_EconGloves; // 0x1878 - 0x1878
   QAngle m_qDeathEyeAngles; // 0x1AF0 - 0x1AF0

}; // size - 0x1B00


class CCSPlayerResource : public CBaseEntity
{
public:

   bool m_bHostageAlive[12]; // 0x4A0 - 0x4A0
   bool m_isHostageFollowingSomeone[12]; // 0x4AC - 0x4AC
   CEntityIndex m_iHostageEntityIDs[12]; // 0x4B8 - 0x4B8
   Vector m_bombsiteCenterA; // 0x4E8 - 0x4E8
   Vector m_bombsiteCenterB; // 0x4F4 - 0x4F4
   int32 m_hostageRescueX[4]; // 0x500 - 0x500
   int32 m_hostageRescueY[4]; // 0x510 - 0x510
   int32 m_hostageRescueZ[4]; // 0x520 - 0x520
   bool m_bEndMatchNextMapAllVoted; // 0x530 - 0x530
   bool m_foundGoalPositions; // 0x531 - 0x531

}; // size - 0x538


class CCSPlayer_ActionTrackingServices : public CPlayerPawnComponent
{
public:

   bool m_bIsRescuing; // 0x40 - 0x40
   int32 m_iWeaponPurchasesThisMatch[256]; // 0x44 - 0x44
   int32 m_iWeaponPurchasesThisRound[256]; // 0x444 - 0x444

}; // size - 0x848


class CCSPlayer_ActionTrackingServices : public CPlayerPawnComponent
{
public:

   CBasePlayerWeapon* m_lastWeaponBeforeC4AutoSwitch; // 0x230 - 0x230
   bool m_bIsRescuing; // 0x268 - 0x268
   int32 m_iWeaponPurchasesThisMatch[256]; // 0x26C - 0x26C
   int32 m_iWeaponPurchasesThisRound[256]; // 0x66C - 0x66C

}; // size - 0xA70


class CCSPlayer_BulletServices : public CPlayerPawnComponent
{
public:

   std::int32_t m_totalHitsOnServer; // 0x40 - 0x40

}; // size - 0x48


class CCSPlayer_BulletServices : public CPlayerPawnComponent
{
public:

   std::int32_t m_totalHitsOnServer; // 0x40 - 0x40

}; // size - 0x80


class CCSPlayer_BuyServices : public CPlayerPawnComponent
{
public:

   std::float_t m_flNextAutoBuyAmmoTime; // 0x40 - 0x40

}; // size - 0xC8


class CCSPlayer_CameraServices : public CPlayer_CameraServices
{
public:

   std::float_t m_flLastShotFOV; // 0x248 - 0x248
   std::float_t m_flDeathCamTilt; // 0x24C - 0x24C

}; // size - 0x250


class CCSPlayer_CameraServices : public CPlayer_CameraServices
{
public:

   CUtlVector< CHandle< CBaseEntity > > m_hTriggerFogList; // 0x188 - 0x188
   CHandle< CBaseEntity > m_hLastFogTrigger; // 0x1A0 - 0x1A0

}; // size - 0x1A8


class CCSPlayer_DamageReactServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CCSPlayer_GlowServices : public CPlayerPawnComponent
{
public:


}; // size - 0x70


class CCSPlayer_HostageServices : public CPlayerPawnComponent
{
public:

   CHandle< CBaseEntity > m_hCarriedHostage; // 0x40 - 0x40
   CHandle< CBaseEntity > m_hCarriedHostageProp; // 0x44 - 0x44

}; // size - 0x50


class CCSPlayer_HostageServices : public CPlayerPawnComponent
{
public:

   CHandle< C_BaseEntity > m_hCarriedHostage; // 0x40 - 0x40
   CHandle< C_BaseEntity > m_hCarriedHostageProp; // 0x44 - 0x44

}; // size - 0x48


class CCSPlayer_ItemServices : public CPlayer_ItemServices
{
public:

   bool m_bHasDefuser; // 0x40 - 0x40
   bool m_bHasHelmet; // 0x41 - 0x41
   bool m_bHasHeavyArmor; // 0x42 - 0x42

}; // size - 0x48


class CCSPlayer_ItemServices : public CPlayer_ItemServices
{
public:

   bool m_bHasDefuser; // 0x40 - 0x40
   bool m_bHasHelmet; // 0x41 - 0x41
   bool m_bHasHeavyArmor; // 0x42 - 0x42

}; // size - 0x48


class CCSPlayer_MovementServices : public CPlayer_MovementServices_Humanoid
{
public:

   std::float_t m_flMaxFallVelocity; // 0x208 - 0x208
   Vector m_vecLadderNormal; // 0x20C - 0x20C
   std::int32_t m_nLadderSurfacePropIndex; // 0x218 - 0x218
   bool m_bAllowAutoMovement; // 0x21C - 0x21C
   std::float_t m_flDuckAmount; // 0x220 - 0x220
   std::float_t m_flDuckSpeed; // 0x224 - 0x224
   bool m_bDuckOverride; // 0x228 - 0x228
   std::float_t m_flDuckOffset; // 0x22C - 0x22C
   std::uint32_t m_nDuckTimeMsecs; // 0x230 - 0x230
   std::uint32_t m_nDuckJumpTimeMsecs; // 0x234 - 0x234
   std::uint32_t m_nJumpTimeMsecs; // 0x238 - 0x238
   std::float_t m_flLastDuckTime; // 0x23C - 0x23C
   Vector2D m_vecLastPositionAtFullCrouchSpeed; // 0x248 - 0x248
   bool m_duckUntilOnGround; // 0x250 - 0x250
   bool m_bHasWalkMovedSinceLastJump; // 0x251 - 0x251
   bool m_bInStuckTest; // 0x252 - 0x252
   uint64 m_CachedGetPointContents[64][3]; // 0x258 - 0x258
   Vector m_CachedGetPointContentsPoint[64][3]; // 0x858 - 0x858
   float32 m_flStuckCheckTime[64][2]; // 0x1160 - 0x1160
   std::int32_t m_nTraceCount; // 0x1360 - 0x1360
   std::int32_t m_StuckLast; // 0x1364 - 0x1364
   bool m_bSpeedCropped; // 0x1368 - 0x1368
   std::int32_t m_nOldWaterLevel; // 0x136C - 0x136C
   std::float_t m_flWaterEntryTime; // 0x1370 - 0x1370
   Vector m_vecForward; // 0x1374 - 0x1374
   Vector m_vecLeft; // 0x1380 - 0x1380
   Vector m_vecUp; // 0x138C - 0x138C
   Vector m_vecPreviouslyPredictedOrigin; // 0x1398 - 0x1398
   bool m_bMadeFootstepNoise; // 0x13A4 - 0x13A4
   std::int32_t m_iFootsteps; // 0x13A8 - 0x13A8
   std::int32_t m_nRoundFootstepsMade; // 0x13AC - 0x13AC
   bool m_bOldJumpPressed; // 0x13B0 - 0x13B0
   std::float_t m_flJumpUntil; // 0x13B4 - 0x13B4
   std::float_t m_flJumpVel; // 0x13B8 - 0x13B8
   GameTime_t m_fStashGrenadeParameterWhen; // 0x13BC - 0x13BC

}; // size - 0x13C0


class CCSPlayer_MovementServices : public CPlayer_MovementServices_Humanoid
{
public:

   std::float_t m_flMaxFallVelocity; // 0x1F8 - 0x1F8
   Vector m_vecLadderNormal; // 0x1FC - 0x1FC
   std::int32_t m_nLadderSurfacePropIndex; // 0x208 - 0x208
   bool m_bAllowAutoMovement; // 0x20C - 0x20C
   std::float_t m_flDuckAmount; // 0x210 - 0x210
   std::float_t m_flDuckSpeed; // 0x214 - 0x214
   bool m_bDuckOverride; // 0x218 - 0x218
   std::float_t m_flDuckOffset; // 0x21C - 0x21C
   std::uint32_t m_nDuckTimeMsecs; // 0x220 - 0x220
   std::uint32_t m_nDuckJumpTimeMsecs; // 0x224 - 0x224
   std::uint32_t m_nJumpTimeMsecs; // 0x228 - 0x228
   std::float_t m_flLastDuckTime; // 0x22C - 0x22C
   Vector2D m_vecLastPositionAtFullCrouchSpeed; // 0x238 - 0x238
   bool m_duckUntilOnGround; // 0x240 - 0x240
   bool m_bHasWalkMovedSinceLastJump; // 0x241 - 0x241
   bool m_bInStuckTest; // 0x242 - 0x242
   uint64 m_CachedGetPointContents[64][3]; // 0x248 - 0x248
   Vector m_CachedGetPointContentsPoint[64][3]; // 0x848 - 0x848
   float32 m_flStuckCheckTime[64][2]; // 0x1150 - 0x1150
   std::int32_t m_nTraceCount; // 0x1350 - 0x1350
   std::int32_t m_StuckLast; // 0x1354 - 0x1354
   bool m_bSpeedCropped; // 0x1358 - 0x1358
   std::int32_t m_nOldWaterLevel; // 0x135C - 0x135C
   std::float_t m_flWaterEntryTime; // 0x1360 - 0x1360
   Vector m_vecForward; // 0x1364 - 0x1364
   Vector m_vecLeft; // 0x1370 - 0x1370
   Vector m_vecUp; // 0x137C - 0x137C
   Vector m_vecPreviouslyPredictedOrigin; // 0x1388 - 0x1388
   bool m_bOldJumpPressed; // 0x1394 - 0x1394
   std::float_t m_flJumpUntil; // 0x1398 - 0x1398
   std::float_t m_flJumpVel; // 0x139C - 0x139C
   GameTime_t m_fStashGrenadeParameterWhen; // 0x13A0 - 0x13A0
   bool m_bUpdatePredictedOriginAfterDataUpdate; // 0x13A4 - 0x13A4

}; // size - 0x13A8


class CCSPlayer_ObserverServices : public CPlayer_ObserverServices
{
public:


}; // size - 0x50


class CCSPlayer_ObserverServices : public CPlayer_ObserverServices
{
public:

   CEntityHandle m_hLastObserverTarget; // 0x58 - 0x58
   Vector m_vecObserverInterpolateOffset; // 0x5C - 0x5C
   Vector m_vecObserverInterpStartPos; // 0x68 - 0x68
   std::float_t m_flObsInterp_PathLength; // 0x74 - 0x74
   Quaternion m_qObsInterp_OrientationStart; // 0x80 - 0x80
   Quaternion m_qObsInterp_OrientationTravelDir; // 0x90 - 0x90
   ObserverInterpState_t m_obsInterpState; // 0xA0 - 0xA0
   bool m_bObserverInterpolationNeedsDeferredSetup; // 0xA4 - 0xA4
   std::int32_t m_nLastKillerDamageTaken; // 0xA8 - 0xA8
   std::int32_t m_nLastKillerHitsTaken; // 0xAC - 0xAC
   std::int32_t m_nLastKillerDamageGiven; // 0xB0 - 0xB0
   std::int32_t m_nLastKillerHitsGiven; // 0xB4 - 0xB4
   std::int32_t m_nLastKillerActualDamageGiven; // 0xB8 - 0xB8
   std::int32_t m_nLastKillerActualDamageTaken; // 0xBC - 0xBC
   bool m_bCanShowDeathPanelNow; // 0xC0 - 0xC0
   bool m_bWasShowingDeathPanel; // 0xC1 - 0xC1

}; // size - 0xD0


class CCSPlayer_ParachuteServices : public CPlayerPawnComponent
{
public:


}; // size - 0x78


class CCSPlayer_PingServices : public CPlayerPawnComponent
{
public:

   GameTime_t m_flPlayerPingTokens[5]; // 0x40 - 0x40
   CHandle< CBaseEntity > m_hPlayerPing; // 0x54 - 0x54

}; // size - 0x58


class CCSPlayer_PingServices : public CPlayerPawnComponent
{
public:

   CHandle< C_BaseEntity > m_hPlayerPing; // 0x40 - 0x40

}; // size - 0x48


class CCSPlayer_RadioServices : public CPlayerPawnComponent
{
public:

   GameTime_t m_flGotHostageTalkTimer; // 0x40 - 0x40
   GameTime_t m_flDefusingTalkTimer; // 0x44 - 0x44
   GameTime_t m_flC4PlantTalkTimer; // 0x48 - 0x48
   float32 m_flRadioTokenSlots[3]; // 0x4C - 0x4C
   bool m_bIgnoreRadio; // 0x58 - 0x58

}; // size - 0x60


class CCSPlayer_UseServices : public CPlayer_UseServices
{
public:


}; // size - 0x40


class CCSPlayer_UseServices : public CPlayer_UseServices
{
public:

   CHandle< CBaseEntity > m_hLastKnownUseEntity; // 0x40 - 0x40
   GameTime_t m_flLastUseTimeStamp; // 0x44 - 0x44
   GameTime_t m_flTimeStartedHoldingUse; // 0x48 - 0x48
   GameTime_t m_flTimeLastUsedWindow; // 0x4C - 0x4C

}; // size - 0x50


class CCSPlayer_ViewModelServices : public CPlayerPawnComponent
{
public:

   CHandle< C_BaseViewModel > m_hViewModel[3]; // 0x40 - 0x40

}; // size - 0x50


class CCSPlayer_ViewModelServices : public CPlayerPawnComponent
{
public:

   CHandle< CBaseViewModel > m_hViewModel[3]; // 0x40 - 0x40

}; // size - 0x50


class CCSPlayer_WaterServices : public CPlayer_WaterServices
{
public:

   std::float_t m_NextDrownDamageTime; // 0x40 - 0x40
   std::int32_t m_nDrownDmgRate; // 0x44 - 0x44
   GameTime_t m_AirFinishedTime; // 0x48 - 0x48
   std::float_t m_flWaterJumpTime; // 0x4C - 0x4C
   Vector m_vecWaterJumpVel; // 0x50 - 0x50
   std::float_t m_flSwimSoundTime; // 0x5C - 0x5C

}; // size - 0x68


class CCSPlayer_WaterServices : public CPlayer_WaterServices
{
public:

   std::float_t m_flWaterJumpTime; // 0x40 - 0x40
   Vector m_vecWaterJumpVel; // 0x44 - 0x44
   std::float_t m_flSwimSoundTime; // 0x50 - 0x50

}; // size - 0x60


class CCSPlayer_WeaponServices : public CPlayer_WeaponServices
{
public:

   GameTime_t m_flNextAttack; // 0xB0 - 0xB0
   bool m_bIsLookingAtWeapon; // 0xB4 - 0xB4
   bool m_bIsHoldingLookAtWeapon; // 0xB5 - 0xB5
   CHandle< CBasePlayerWeapon > m_hSavedWeapon; // 0xB8 - 0xB8
   std::int32_t m_nTimeToMelee; // 0xBC - 0xBC
   std::int32_t m_nTimeToSecondary; // 0xC0 - 0xC0
   std::int32_t m_nTimeToPrimary; // 0xC4 - 0xC4
   std::int32_t m_nTimeToSniperRifle; // 0xC8 - 0xC8
   bool m_bIsBeingGivenItem; // 0xCC - 0xCC
   bool m_bPickedUpWeapon; // 0xCD - 0xCD

}; // size - 0x460


class CCSPlayer_WeaponServices : public CPlayer_WeaponServices
{
public:

   GameTime_t m_flNextAttack; // 0xA8 - 0xA8
   bool m_bIsLookingAtWeapon; // 0xAC - 0xAC
   bool m_bIsHoldingLookAtWeapon; // 0xAD - 0xAD

}; // size - 0xB0


class CCSPropExplodingBarrel : public CPhysicsProp
{
public:

   CEntityHandle m_hBarrelTop; // 0xB08 - 0xB08
   bool m_bExploded; // 0xB0C - 0xB0C
   std::int32_t m_nAccumulatedDamage; // 0xB10 - 0xB10

}; // size - 0xB18


class CCSPropExplodingBarrelTop : public CPhysicsProp
{
public:

   std::float_t m_flOverrideAlpha; // 0xB00 - 0xB00

}; // size - 0xB08


class CCSSprite : public CSprite
{
public:


}; // size - 0x760


class CCSTeam : public CTeam
{
public:

   std::int32_t m_nLastRecievedShorthandedRoundBonus; // 0x558 - 0x558
   std::int32_t m_nShorthandedRoundBonusStartRound; // 0x55C - 0x55C
   bool m_bSurrendered; // 0x560 - 0x560
   char m_szTeamMatchStat[512]; // 0x561 - 0x561
   std::int32_t m_numMapVictories; // 0x764 - 0x764
   std::int32_t m_scoreFirstHalf; // 0x768 - 0x768
   std::int32_t m_scoreSecondHalf; // 0x76C - 0x76C
   std::int32_t m_scoreOvertime; // 0x770 - 0x770
   char m_szClanTeamname[129]; // 0x774 - 0x774
   std::uint32_t m_iClanID; // 0x7F8 - 0x7F8
   char m_szTeamFlagImage[8]; // 0x7FC - 0x7FC
   char m_szTeamLogoImage[8]; // 0x804 - 0x804
   std::float_t m_flNextResourceTime; // 0x80C - 0x80C
   std::int32_t m_iLastUpdateSentAt; // 0x810 - 0x810
   std::float_t m_flLastPlayerSortTime; // 0x814 - 0x814
   CPlayerSlot m_nLastGGLeader_CT; // 0x818 - 0x818
   CPlayerSlot m_nLastGGLeader_T; // 0x81C - 0x81C
   CPlayerSlot m_nGGLeaderSlot_CT; // 0x820 - 0x820
   CPlayerSlot m_nGGLeaderSlot_T; // 0x824 - 0x824
   bool m_bGGHasLeader_CT; // 0x828 - 0x828
   bool m_bGGHasLeader_T; // 0x829 - 0x829

}; // size - 0x830


class CCachedPose
{
public:

   CUtlVector< CTransform > m_transforms; // 0x8 - 0x8
   CUtlVector< float32 > m_morphWeights; // 0x20 - 0x20
   HSequence m_hSequence; // 0x38 - 0x38
   std::float_t m_flCycle; // 0x3C - 0x3C

}; // size - 0x40


class CChangeLevel : public CBaseTrigger
{
public:

   CUtlString m_sMapName; // 0x898 - 0x898
   CUtlString m_sLandmarkName; // 0x8A0 - 0x8A0
   CEntityIOOutput m_OnChangeLevel; // 0x8A8 - 0x8A8
   bool m_bTouched; // 0x8D0 - 0x8D0
   bool m_bNoTouch; // 0x8D1 - 0x8D1
   bool m_bNewChapter; // 0x8D2 - 0x8D2
   bool m_bOnChangeLevelFired; // 0x8D3 - 0x8D3

}; // size - 0x8D8


class CChicken : public CDynamicProp
{
public:

   CAttributeContainer m_AttributeManager; // 0xAB8 - 0xAB8
   std::uint32_t m_OriginalOwnerXuidLow; // 0xD80 - 0xD80
   std::uint32_t m_OriginalOwnerXuidHigh; // 0xD84 - 0xD84
   CountdownTimer m_updateTimer; // 0xD88 - 0xD88
   Vector m_stuckAnchor; // 0xDA0 - 0xDA0
   CountdownTimer m_stuckTimer; // 0xDB0 - 0xDB0
   CountdownTimer m_collisionStuckTimer; // 0xDC8 - 0xDC8
   bool m_isOnGround; // 0xDE0 - 0xDE0
   ChickenActivity m_activity; // 0xDE4 - 0xDE4
   CountdownTimer m_activityTimer; // 0xDE8 - 0xDE8
   std::float_t m_turnRate; // 0xE00 - 0xE00
   CHandle< CBaseEntity > m_fleeFrom; // 0xE04 - 0xE04
   CountdownTimer m_moveRateThrottleTimer; // 0xE08 - 0xE08
   CountdownTimer m_startleTimer; // 0xE20 - 0xE20
   CountdownTimer m_vocalizeTimer; // 0xE38 - 0xE38
   GameTime_t m_flWhenZombified; // 0xE50 - 0xE50
   bool m_jumpedThisFrame; // 0xE54 - 0xE54
   CHandle< CCSPlayerPawnBase > m_leader; // 0xE58 - 0xE58
   CountdownTimer m_reuseTimer; // 0xE60 - 0xE60
   bool m_hasBeenUsed; // 0xE78 - 0xE78
   CountdownTimer m_jumpTimer; // 0xE80 - 0xE80
   std::float_t m_flLastJumpTime; // 0xE98 - 0xE98
   bool m_bInJump; // 0xE9C - 0xE9C
   bool m_isWaitingForLeader; // 0xE9D - 0xE9D
   CountdownTimer m_repathTimer; // 0x2EA8 - 0x2EA8
   CountdownTimer m_inhibitDoorTimer; // 0x2EC0 - 0x2EC0
   CountdownTimer m_inhibitObstacleAvoidanceTimer; // 0x2F50 - 0x2F50
   Vector m_vecPathGoal; // 0x2F70 - 0x2F70
   std::float_t m_flActiveFollowStartTime; // 0x2F7C - 0x2F7C
   CountdownTimer m_followMinuteTimer; // 0x2F80 - 0x2F80
   Vector m_vecLastEggPoopPosition; // 0x2F98 - 0x2F98
   CUtlVector< CHandle< CBaseEntity > > m_vecEggsPooped; // 0x2FA8 - 0x2FA8
   CountdownTimer m_BlockDirectionTimer; // 0x2FC8 - 0x2FC8

}; // size - 0x2FE0


class CChoiceAnimNode : public CAnimNodeBase
{
public:

   CUtlVector< CChoiceNodeChild > m_children; // 0x38 - 0x38
   std::int32_t m_seed; // 0x50 - 0x50
   ChoiceMethod m_choiceMethod; // 0x54 - 0x54
   ChoiceChangeMethod m_choiceChangeMethod; // 0x58 - 0x58
   ChoiceBlendMethod m_blendMethod; // 0x5C - 0x5C
   std::float_t m_blendTime; // 0x60 - 0x60
   bool m_bCrossFade; // 0x64 - 0x64
   bool m_bResetChosen; // 0x65 - 0x65
   bool m_bDontResetSameSelection; // 0x66 - 0x66

}; // size - 0x68


class CChoiceNodeChild
{
public:

   CAnimNodeConnection m_inputConnection; // 0x0 - 0x0
   CUtlString m_name; // 0x8 - 0x8
   std::float_t m_weight; // 0x10 - 0x10
   std::float_t m_blendTime; // 0x14 - 0x14

}; // size - 0x18


class CChoiceUpdateNode : public CAnimUpdateNodeBase
{
public:

   CUtlVector< CAnimUpdateNodeRef > m_children; // 0x58 - 0x58
   CUtlVector< float32 > m_weights; // 0x70 - 0x70
   CUtlVector< float32 > m_blendTimes; // 0x88 - 0x88
   ChoiceMethod m_choiceMethod; // 0xA0 - 0xA0
   ChoiceChangeMethod m_choiceChangeMethod; // 0xA4 - 0xA4
   ChoiceBlendMethod m_blendMethod; // 0xA8 - 0xA8
   std::float_t m_blendTime; // 0xAC - 0xAC
   bool m_bCrossFade; // 0xB0 - 0xB0
   bool m_bResetChosen; // 0xB1 - 0xB1
   bool m_bDontResetSameSelection; // 0xB2 - 0xB2

}; // size - 0xB8


class CChoreoAnimNode : public CAnimNodeBase
{
public:

   CAnimNodeConnection m_inputConnection; // 0x38 - 0x38

}; // size - 0x40


class CChoreoUpdateNode : public CUnaryUpdateNode
{
public:


}; // size - 0x70


class CClientAlphaProperty : public IClientAlphaProperty
{
public:

   std::uint8_t m_nRenderFX; // 0x10 - 0x10
   std::uint8_t m_nRenderMode; // 0x11 - 0x11
   bitfield:1 m_bAlphaOverride; // 0x0 - 0x0
   bitfield:1 m_bShadowAlphaOverride; // 0x0 - 0x0
   bitfield:6 m_nReserved; // 0x0 - 0x0
   std::uint8_t m_nAlpha; // 0x13 - 0x13
   std::uint16_t m_nDesyncOffset; // 0x14 - 0x14
   std::uint16_t m_nReserved2; // 0x16 - 0x16
   std::uint16_t m_nDistFadeStart; // 0x18 - 0x18
   std::uint16_t m_nDistFadeEnd; // 0x1A - 0x1A
   std::float_t m_flFadeScale; // 0x1C - 0x1C
   GameTime_t m_flRenderFxStartTime; // 0x20 - 0x20
   std::float_t m_flRenderFxDuration; // 0x24 - 0x24

}; // size - 0x30


class CClothSettingsAnimTag : public CAnimTagBase
{
public:

   std::float_t m_flStiffness; // 0x40 - 0x40
   std::float_t m_flEaseIn; // 0x44 - 0x44
   std::float_t m_flEaseOut; // 0x48 - 0x48
   CUtlString m_nVertexSet; // 0x50 - 0x50

}; // size - 0x58


class CCollisionProperty
{
public:

   VPhysicsCollisionAttribute_t m_collisionAttribute; // 0x10 - 0x10
   Vector m_vecMins; // 0x40 - 0x40
   Vector m_vecMaxs; // 0x4C - 0x4C
   std::uint8_t m_usSolidFlags; // 0x5A - 0x5A
   SolidType_t m_nSolidType; // 0x5B - 0x5B
   std::uint8_t m_triggerBloat; // 0x5C - 0x5C
   SurroundingBoundsType_t m_nSurroundType; // 0x5D - 0x5D
   std::uint8_t m_CollisionGroup; // 0x5E - 0x5E
   std::uint8_t m_nEnablePhysics; // 0x5F - 0x5F
   std::float_t m_flBoundingRadius; // 0x60 - 0x60
   Vector m_vecSpecifiedSurroundingMins; // 0x64 - 0x64
   Vector m_vecSpecifiedSurroundingMaxs; // 0x70 - 0x70
   Vector m_vecSurroundingMaxs; // 0x7C - 0x7C
   Vector m_vecSurroundingMins; // 0x88 - 0x88
   Vector m_vCapsuleCenter1; // 0x94 - 0x94
   Vector m_vCapsuleCenter2; // 0xA0 - 0xA0
   std::float_t m_flCapsuleRadius; // 0xAC - 0xAC

}; // size - 0xB0


class CCollisionProperty
{
public:

   VPhysicsCollisionAttribute_t m_collisionAttribute; // 0x10 - 0x10
   Vector m_vecMins; // 0x40 - 0x40
   Vector m_vecMaxs; // 0x4C - 0x4C
   std::uint8_t m_usSolidFlags; // 0x5A - 0x5A
   SolidType_t m_nSolidType; // 0x5B - 0x5B
   std::uint8_t m_triggerBloat; // 0x5C - 0x5C
   SurroundingBoundsType_t m_nSurroundType; // 0x5D - 0x5D
   std::uint8_t m_CollisionGroup; // 0x5E - 0x5E
   std::uint8_t m_nEnablePhysics; // 0x5F - 0x5F
   std::float_t m_flBoundingRadius; // 0x60 - 0x60
   Vector m_vecSpecifiedSurroundingMins; // 0x64 - 0x64
   Vector m_vecSpecifiedSurroundingMaxs; // 0x70 - 0x70
   Vector m_vecSurroundingMaxs; // 0x7C - 0x7C
   Vector m_vecSurroundingMins; // 0x88 - 0x88
   Vector m_vCapsuleCenter1; // 0x94 - 0x94
   Vector m_vCapsuleCenter2; // 0xA0 - 0xA0
   std::float_t m_flCapsuleRadius; // 0xAC - 0xAC

}; // size - 0xB0


class CColorCorrection : public CBaseEntity
{
public:

   std::float_t m_flFadeInDuration; // 0x4A0 - 0x4A0
   std::float_t m_flFadeOutDuration; // 0x4A4 - 0x4A4
   std::float_t m_flStartFadeInWeight; // 0x4A8 - 0x4A8
   std::float_t m_flStartFadeOutWeight; // 0x4AC - 0x4AC
   GameTime_t m_flTimeStartFadeIn; // 0x4B0 - 0x4B0
   GameTime_t m_flTimeStartFadeOut; // 0x4B4 - 0x4B4
   std::float_t m_flMaxWeight; // 0x4B8 - 0x4B8
   bool m_bStartDisabled; // 0x4BC - 0x4BC
   bool m_bEnabled; // 0x4BD - 0x4BD
   bool m_bMaster; // 0x4BE - 0x4BE
   bool m_bClientSide; // 0x4BF - 0x4BF
   bool m_bExclusive; // 0x4C0 - 0x4C0
   std::float_t m_MinFalloff; // 0x4C4 - 0x4C4
   std::float_t m_MaxFalloff; // 0x4C8 - 0x4C8
   std::float_t m_flCurWeight; // 0x4CC - 0x4CC
   char m_netlookupFilename[512]; // 0x4D0 - 0x4D0
   CUtlSymbolLarge m_lookupFilename; // 0x6D0 - 0x6D0

}; // size - 0x6D8


class CColorCorrectionVolume : public CBaseTrigger
{
public:

   bool m_bEnabled; // 0x898 - 0x898
   std::float_t m_MaxWeight; // 0x89C - 0x89C
   std::float_t m_FadeDuration; // 0x8A0 - 0x8A0
   bool m_bStartDisabled; // 0x8A4 - 0x8A4
   std::float_t m_Weight; // 0x8A8 - 0x8A8
   char m_lookupFilename[512]; // 0x8AC - 0x8AC
   std::float_t m_LastEnterWeight; // 0xAAC - 0xAAC
   GameTime_t m_LastEnterTime; // 0xAB0 - 0xAB0
   std::float_t m_LastExitWeight; // 0xAB4 - 0xAB4
   GameTime_t m_LastExitTime; // 0xAB8 - 0xAB8

}; // size - 0xAC0


class CCommentAnimNode : public CAnimNodeBase
{
public:

   CUtlString m_commentText; // 0x40 - 0x40
   Vector2D m_size; // 0x48 - 0x48
   Color m_color; // 0x50 - 0x50

}; // size - 0x58


class CCommentaryAuto : public CBaseEntity
{
public:

   CEntityIOOutput m_OnCommentaryNewGame; // 0x4A0 - 0x4A0
   CEntityIOOutput m_OnCommentaryMidGame; // 0x4C8 - 0x4C8
   CEntityIOOutput m_OnCommentaryMultiplayerSpawn; // 0x4F0 - 0x4F0

}; // size - 0x518


class CCommentarySystem
{
public:

   bool m_bCommentaryConvarsChanging; // 0x11 - 0x11
   bool m_bCommentaryEnabledMidGame; // 0x12 - 0x12
   GameTime_t m_flNextTeleportTime; // 0x14 - 0x14
   std::int32_t m_iTeleportStage; // 0x18 - 0x18
   bool m_bCheatState; // 0x1C - 0x1C
   bool m_bIsFirstSpawnGroupToLoad; // 0x1D - 0x1D
   CHandle< CPointCommentaryNode > m_hCurrentNode; // 0x38 - 0x38
   CHandle< CPointCommentaryNode > m_hActiveCommentaryNode; // 0x3C - 0x3C
   CHandle< CPointCommentaryNode > m_hLastCommentaryNode; // 0x40 - 0x40
   CUtlVector< CHandle< CPointCommentaryNode > > m_vecNodes; // 0x48 - 0x48

}; // size - 0x60


class CCommentaryViewPosition : public CSprite
{
public:


}; // size - 0x760


class CCompositeMaterialEditorDoc
{
public:

   std::int32_t m_nVersion; // 0x8 - 0x8
   CUtlVector< CompositeMaterialEditorPoint_t > m_Points; // 0x10 - 0x10
   KeyValues3 m_KVthumbnail; // 0x28 - 0x28

}; // size - 0x38


class CCompressorGroup
{
public:

   std::int32_t m_nTotalElementCount; // 0x0 - 0x0
   CUtlVector< char* > m_szChannelClass; // 0x8 - 0x8
   CUtlVector< char* > m_szVariableName; // 0x20 - 0x20
   CUtlVector< fieldtype_t > m_nType; // 0x38 - 0x38
   CUtlVector< int32 > m_nFlags; // 0x50 - 0x50
   CUtlVector< CUtlString > m_szGrouping; // 0x68 - 0x68
   CUtlVector< int32 > m_nCompressorIndex; // 0x80 - 0x80
   CUtlVector< CUtlVector< char* > > m_szElementNames; // 0x98 - 0x98
   CUtlVector< CUtlVector< int32 > > m_nElementUniqueID; // 0xB0 - 0xB0
   CUtlVector< uint32 > m_nElementMask; // 0xC8 - 0xC8
   CUtlVector< CCompressor< Vector >* > m_vectorCompressor; // 0xF8 - 0xF8
   CUtlVector< CCompressor< QuaternionStorage >* > m_quaternionCompressor; // 0x110 - 0x110
   CUtlVector< CCompressor< int32 >* > m_intCompressor; // 0x128 - 0x128
   CUtlVector< CCompressor< bool >* > m_boolCompressor; // 0x140 - 0x140
   CUtlVector< CCompressor< Color >* > m_colorCompressor; // 0x158 - 0x158
   CUtlVector< CCompressor< Vector2D >* > m_vector2DCompressor; // 0x170 - 0x170
   CUtlVector< CCompressor< Vector4D >* > m_vector4DCompressor; // 0x188 - 0x188

}; // size - 0x1A0


class CConditionContainer
{
public:

   CUtlVector< CSmartPtr< CConditionBase > > m_conditions; // 0x10 - 0x10

}; // size - 0x38


class CConnectionProxyItem
{
public:

   CUtlString m_name; // 0x0 - 0x0
   AnimNodeOutputID m_outputID; // 0x8 - 0x8
   CAnimNodeConnection m_inputConnection; // 0xC - 0xC

}; // size - 0x18


class CConstantForceController
{
public:

   Vector m_linear; // 0xC - 0xC
   RotationVector m_angular; // 0x18 - 0x18
   Vector m_linearSave; // 0x24 - 0x24
   RotationVector m_angularSave; // 0x30 - 0x30

}; // size - 0x40


class CConstraintAnchor : public CBaseAnimGraph
{
public:

   std::float_t m_massScale; // 0x820 - 0x820

}; // size - 0x828


class CConstraintSlave
{
public:

   Quaternion m_qBaseOrientation; // 0x0 - 0x0
   Vector m_vBasePosition; // 0x10 - 0x10
   std::uint32_t m_nBoneHash; // 0x1C - 0x1C
   std::float_t m_flWeight; // 0x20 - 0x20
   CUtlString m_sName; // 0x28 - 0x28

}; // size - 0x60


class CConstraintTarget
{
public:

   Quaternion m_qOffset; // 0x20 - 0x20
   Vector m_vOffset; // 0x30 - 0x30
   std::uint32_t m_nBoneHash; // 0x3C - 0x3C
   CUtlString m_sName; // 0x40 - 0x40
   std::float_t m_flWeight; // 0x48 - 0x48
   bool m_bIsAttachment; // 0x59 - 0x59

}; // size - 0x60


class CCoopBonusCoin : public CDynamicProp
{
public:


}; // size - 0xA98


class CCopyRecipientFilter
{
public:

   std::int32_t m_Flags; // 0x8 - 0x8
   CUtlVector< CPlayerSlot > m_Recipients; // 0x10 - 0x10

}; // size - 0x28


class CCredits : public CPointEntity
{
public:

   CEntityIOOutput m_OnCreditsDone; // 0x4A0 - 0x4A0
   bool m_bRolledOutroCredits; // 0x4C8 - 0x4C8
   std::float_t m_flLogoLength; // 0x4CC - 0x4CC

}; // size - 0x4D0


class CCurrentRotationVelocityMetric : public CMotionMetricBase
{
public:


}; // size - 0x28


class CCurrentRotationVelocityMetricEvaluator : public CMotionMetricEvaluator
{
public:


}; // size - 0x50


class CCurrentVelocityMetric : public CMotionMetricBase
{
public:


}; // size - 0x28


class CCurrentVelocityMetricEvaluator : public CMotionMetricEvaluator
{
public:


}; // size - 0x50


class CCycleCondition : public CConditionBase
{
public:

   Comparison_t m_comparisonOp; // 0x28 - 0x28
   CUtlString m_comparisonString; // 0x30 - 0x30
   std::float_t m_comparisonValue; // 0x38 - 0x38
   ComparisonValueType m_comparisonValueType; // 0x3C - 0x3C
   AnimParamID m_comparisonParamID; // 0x40 - 0x40

}; // size - 0x48


class CCycleControlAnimNode : public CAnimNodeBase
{
public:

   CAnimNodeConnection m_inputConnection; // 0x38 - 0x38
   AnimValueSource m_valueSource; // 0x40 - 0x40
   AnimParamID m_param; // 0x44 - 0x44

}; // size - 0x48


class CCycleControlClipAnimNode : public CAnimNodeBase
{
public:

   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x50 - 0x50
   CUtlString m_sequenceName; // 0x68 - 0x68
   AnimValueSource m_valueSource; // 0x70 - 0x70
   AnimParamID m_param; // 0x74 - 0x74

}; // size - 0x78


class CCycleControlClipUpdateNode : public CLeafUpdateNode
{
public:

   CUtlVector< TagSpan_t > m_tags; // 0x60 - 0x60
   HSequence m_hSequence; // 0x7C - 0x7C
   std::float_t m_duration; // 0x80 - 0x80
   AnimValueSource m_valueSource; // 0x84 - 0x84
   CAnimParamHandle m_paramIndex; // 0x88 - 0x88

}; // size - 0x90


class CCycleControlUpdateNode : public CUnaryUpdateNode
{
public:

   AnimValueSource m_valueSource; // 0x68 - 0x68
   CAnimParamHandle m_paramIndex; // 0x6C - 0x6C

}; // size - 0x70


class CDEagle : public CWeaponCSBaseGun
{
public:


}; // size - 0xD70


class CDSPMixgroupModifier
{
public:

   CUtlString m_mixgroup; // 0x0 - 0x0
   std::float_t m_flModifier; // 0x8 - 0x8
   std::float_t m_flModifierMin; // 0xC - 0xC
   std::float_t m_flSourceModifier; // 0x10 - 0x10
   std::float_t m_flSourceModifierMin; // 0x14 - 0x14
   std::float_t m_flListenerReverbModifierWhenSourceReverbIsActive; // 0x18 - 0x18

}; // size - 0x20
