#pragma once

#include "SDK.hpp"

class CEntityInstance /* "entity2" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlSymbolLarge m_iszPrivateVScripts; // 0x8 - 0x10
   CEntityIdentity* m_pEntity; // 0x10 - 0x18
   unsigned char pad_18[0x10]; // 0x18 - 0x28
   CScriptComponent* m_CScriptComponent; // 0x28 - 0x30
   bool m_bVisibleinPVS; // 0x30 - 0x31
   unsigned char pad_31[0x7]; // 0x31 - 0x38
}; // size - 0x38


class CBaseEntity /* "server" */ : public CEntityInstance /* "server" */
{
public:
   CBodyComponent* m_CBodyComponent; // 0x38 - 0x40
   CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x40 - 0x1E0
   unsigned char pad_1E0[0x40]; // 0x1E0 - 0x220
   CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x220 - 0x238
   int32_t m_iCurrentThinkContext; // 0x238 - 0x23C
   GameTick_t m_nLastThinkTick; // 0x23C - 0x240
   bool m_bDisabledContextThinks; // 0x240 - 0x241
   unsigned char pad_241[0xF]; // 0x241 - 0x250
   CBitVec< 64 > m_isSteadyState; // 0x250 - 0x258
   float m_lastNetworkChange; // 0x258 - 0x25C
   unsigned char pad_25C[0xC]; // 0x25C - 0x268
   CUtlVector< ResponseContext_t > m_ResponseContexts; // 0x268 - 0x280
   CUtlSymbolLarge m_iszResponseContext; // 0x280 - 0x288
   unsigned char pad_288[0x20]; // 0x288 - 0x2A8
   int32_t m_iHealth; // 0x2A8 - 0x2AC
   int32_t m_iMaxHealth; // 0x2AC - 0x2B0
   uint8_t m_lifeState; // 0x2B0 - 0x2B1
   unsigned char pad_2B1[0x3]; // 0x2B1 - 0x2B4
   float m_flDamageAccumulator; // 0x2B4 - 0x2B8
   bool m_bTakesDamage; // 0x2B8 - 0x2B9
   unsigned char pad_2B9[0x7]; // 0x2B9 - 0x2C0
   TakeDamageFlags_t m_nTakeDamageFlags; // 0x2C0 - 0x2C8
   bool m_bIsPlatform; // 0x2C8 - 0x2C9
   unsigned char pad_2C9[0x1]; // 0x2C9 - 0x2CA
   MoveCollide_t m_MoveCollide; // 0x2CA - 0x2CB
   MoveType_t m_MoveType; // 0x2CB - 0x2CC
   MoveType_t m_nActualMoveType; // 0x2CC - 0x2CD
   uint8_t m_nWaterTouch; // 0x2CD - 0x2CE
   uint8_t m_nSlimeTouch; // 0x2CE - 0x2CF
   bool m_bRestoreInHierarchy; // 0x2CF - 0x2D0
   CUtlSymbolLarge m_target; // 0x2D0 - 0x2D8
   CHandle< CBaseFilter > m_hDamageFilter; // 0x2D8 - 0x2DC
   unsigned char pad_2DC[0x4]; // 0x2DC - 0x2E0
   CUtlSymbolLarge m_iszDamageFilterName; // 0x2E0 - 0x2E8
   float m_flMoveDoneTime; // 0x2E8 - 0x2EC
   CUtlStringToken m_nSubclassID; // 0x2EC - 0x2F0
   unsigned char pad_2F0[0x8]; // 0x2F0 - 0x2F8
   float m_flAnimTime; // 0x2F8 - 0x2FC
   float m_flSimulationTime; // 0x2FC - 0x300
   GameTime_t m_flCreateTime; // 0x300 - 0x304
   bool m_bClientSideRagdoll; // 0x304 - 0x305
   uint8_t m_ubInterpolationFrame; // 0x305 - 0x306
   unsigned char pad_306[0x2]; // 0x306 - 0x308
   Vector m_vPrevVPhysicsUpdatePos; // 0x308 - 0x314
   uint8_t m_iTeamNum; // 0x314 - 0x315
   unsigned char pad_315[0x3]; // 0x315 - 0x318
   CUtlSymbolLarge m_iGlobalname; // 0x318 - 0x320
   int32_t m_iSentToClients; // 0x320 - 0x324
   float m_flSpeed; // 0x324 - 0x328
   CUtlString m_sUniqueHammerID; // 0x328 - 0x330
   uint32_t m_spawnflags; // 0x330 - 0x334
   GameTick_t m_nNextThinkTick; // 0x334 - 0x338
   int32_t m_nSimulationTick; // 0x338 - 0x33C
   unsigned char pad_33C[0x4]; // 0x33C - 0x340
   CEntityIOOutput m_OnKilled; // 0x340 - 0x368
   uint32_t m_fFlags; // 0x368 - 0x36C
   Vector m_vecAbsVelocity; // 0x36C - 0x378
   CNetworkVelocityVector m_vecVelocity; // 0x378 - 0x3A0
   unsigned char pad_3A0[0x8]; // 0x3A0 - 0x3A8
   Vector m_vecBaseVelocity; // 0x3A8 - 0x3B4
   int32_t m_nPushEnumCount; // 0x3B4 - 0x3B8
   CCollisionProperty* m_pCollision; // 0x3B8 - 0x3C0
   CHandle< CBaseEntity > m_hEffectEntity; // 0x3C0 - 0x3C4
   CHandle< CBaseEntity > m_hOwnerEntity; // 0x3C4 - 0x3C8
   uint32_t m_fEffects; // 0x3C8 - 0x3CC
   CHandle< CBaseEntity > m_hGroundEntity; // 0x3CC - 0x3D0
   int32_t m_nGroundBodyIndex; // 0x3D0 - 0x3D4
   float m_flFriction; // 0x3D4 - 0x3D8
   float m_flElasticity; // 0x3D8 - 0x3DC
   float m_flGravityScale; // 0x3DC - 0x3E0
   float m_flTimeScale; // 0x3E0 - 0x3E4
   float m_flWaterLevel; // 0x3E4 - 0x3E8
   bool m_bAnimatedEveryTick; // 0x3E8 - 0x3E9
   bool m_bDisableLowViolence; // 0x3E9 - 0x3EA
   uint8_t m_nWaterType; // 0x3EA - 0x3EB
   unsigned char pad_3EB[0x1]; // 0x3EB - 0x3EC
   int32_t m_iEFlags; // 0x3EC - 0x3F0
   CEntityIOOutput m_OnUser1; // 0x3F0 - 0x418
   CEntityIOOutput m_OnUser2; // 0x418 - 0x440
   CEntityIOOutput m_OnUser3; // 0x440 - 0x468
   CEntityIOOutput m_OnUser4; // 0x468 - 0x490
   int32_t m_iInitialTeamNum; // 0x490 - 0x494
   GameTime_t m_flNavIgnoreUntilTime; // 0x494 - 0x498
   QAngle m_vecAngVelocity; // 0x498 - 0x4A4
   bool m_bNetworkQuantizeOriginAndAngles; // 0x4A4 - 0x4A5
   bool m_bLagCompensate; // 0x4A5 - 0x4A6
   unsigned char pad_4A6[0x2]; // 0x4A6 - 0x4A8
   float m_flOverriddenFriction; // 0x4A8 - 0x4AC
   CHandle< CBaseEntity > m_pBlocker; // 0x4AC - 0x4B0
   float m_flLocalTime; // 0x4B0 - 0x4B4
   float m_flVPhysicsUpdateLocalTime; // 0x4B4 - 0x4B8
   BloodType m_nBloodType; // 0x4B8 - 0x4BC
   unsigned char pad_4BC[0x4]; // 0x4BC - 0x4C0
}; // size - 0x4C0


class CEntityInstance /* "entity2" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlSymbolLarge m_iszPrivateVScripts; // 0x8 - 0x10
   CEntityIdentity* m_pEntity; // 0x10 - 0x18
   unsigned char pad_18[0x10]; // 0x18 - 0x28
   CScriptComponent* m_CScriptComponent; // 0x28 - 0x30
   bool m_bVisibleinPVS; // 0x30 - 0x31
   unsigned char pad_31[0x7]; // 0x31 - 0x38
}; // size - 0x38


class C_BaseEntity /* "client" */ : public CEntityInstance /* "client" */
{
public:
   CBodyComponent* m_CBodyComponent; // 0x38 - 0x40
   CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x40 - 0x1E0
   unsigned char pad_1E0[0x120]; // 0x1E0 - 0x300
   GameTick_t m_nLastThinkTick; // 0x300 - 0x304
   unsigned char pad_304[0x4]; // 0x304 - 0x308
   CGameSceneNode* m_pGameSceneNode; // 0x308 - 0x310
   CRenderComponent* m_pRenderComponent; // 0x310 - 0x318
   CCollisionProperty* m_pCollision; // 0x318 - 0x320
   int32_t m_iMaxHealth; // 0x320 - 0x324
   int32_t m_iHealth; // 0x324 - 0x328
   uint8_t m_lifeState; // 0x328 - 0x329
   bool m_bTakesDamage; // 0x329 - 0x32A
   unsigned char pad_32A[0x6]; // 0x32A - 0x330
   TakeDamageFlags_t m_nTakeDamageFlags; // 0x330 - 0x338
   bool m_bIsPlatform; // 0x338 - 0x339
   uint8_t m_ubInterpolationFrame; // 0x339 - 0x33A
   unsigned char pad_33A[0x2]; // 0x33A - 0x33C
   CHandle< C_BaseEntity > m_hSceneObjectController; // 0x33C - 0x340
   int32_t m_nNoInterpolationTick; // 0x340 - 0x344
   int32_t m_nVisibilityNoInterpolationTick; // 0x344 - 0x348
   float m_flProxyRandomValue; // 0x348 - 0x34C
   int32_t m_iEFlags; // 0x34C - 0x350
   uint8_t m_nWaterType; // 0x350 - 0x351
   bool m_bInterpolateEvenWithNoModel; // 0x351 - 0x352
   bool m_bPredictionEligible; // 0x352 - 0x353
   bool m_bApplyLayerMatchIDToModel; // 0x353 - 0x354
   CUtlStringToken m_tokLayerMatchID; // 0x354 - 0x358
   CUtlStringToken m_nSubclassID; // 0x358 - 0x35C
   unsigned char pad_35C[0xC]; // 0x35C - 0x368
   int32_t m_nSimulationTick; // 0x368 - 0x36C
   int32_t m_iCurrentThinkContext; // 0x36C - 0x370
   CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x370 - 0x388
   bool m_bDisabledContextThinks; // 0x388 - 0x389
   unsigned char pad_389[0x3]; // 0x389 - 0x38C
   float m_flAnimTime; // 0x38C - 0x390
   float m_flSimulationTime; // 0x390 - 0x394
   uint8_t m_nSceneObjectOverrideFlags; // 0x394 - 0x395
   bool m_bHasSuccessfullyInterpolated; // 0x395 - 0x396
   bool m_bHasAddedVarsToInterpolation; // 0x396 - 0x397
   bool m_bRenderEvenWhenNotSuccessfullyInterpolated; // 0x397 - 0x398
   int32 m_nInterpolationLatchDirtyFlags[2]; // 0x398 - 0x3A0
   uint16 m_ListEntry[11]; // 0x3A0 - 0x3B6
   unsigned char pad_3B6[0x2]; // 0x3B6 - 0x3B8
   GameTime_t m_flCreateTime; // 0x3B8 - 0x3BC
   float m_flSpeed; // 0x3BC - 0x3C0
   uint16_t m_EntClientFlags; // 0x3C0 - 0x3C2
   bool m_bClientSideRagdoll; // 0x3C2 - 0x3C3
   uint8_t m_iTeamNum; // 0x3C3 - 0x3C4
   uint32_t m_spawnflags; // 0x3C4 - 0x3C8
   GameTick_t m_nNextThinkTick; // 0x3C8 - 0x3CC
   uint32_t m_fFlags; // 0x3CC - 0x3D0
   Vector m_vecAbsVelocity; // 0x3D0 - 0x3DC
   unsigned char pad_3DC[0x4]; // 0x3DC - 0x3E0
   CNetworkVelocityVector m_vecVelocity; // 0x3E0 - 0x408
   unsigned char pad_408[0x8]; // 0x408 - 0x410
   Vector m_vecBaseVelocity; // 0x410 - 0x41C
   CHandle< C_BaseEntity > m_hEffectEntity; // 0x41C - 0x420
   CHandle< C_BaseEntity > m_hOwnerEntity; // 0x420 - 0x424
   MoveCollide_t m_MoveCollide; // 0x424 - 0x425
   MoveType_t m_MoveType; // 0x425 - 0x426
   MoveType_t m_nActualMoveType; // 0x426 - 0x427
   unsigned char pad_427[0x1]; // 0x427 - 0x428
   float m_flWaterLevel; // 0x428 - 0x42C
   uint32_t m_fEffects; // 0x42C - 0x430
   CHandle< C_BaseEntity > m_hGroundEntity; // 0x430 - 0x434
   int32_t m_nGroundBodyIndex; // 0x434 - 0x438
   float m_flFriction; // 0x438 - 0x43C
   float m_flElasticity; // 0x43C - 0x440
   float m_flGravityScale; // 0x440 - 0x444
   float m_flTimeScale; // 0x444 - 0x448
   bool m_bAnimatedEveryTick; // 0x448 - 0x449
   unsigned char pad_449[0x3]; // 0x449 - 0x44C
   GameTime_t m_flNavIgnoreUntilTime; // 0x44C - 0x450
   uint16_t m_hThink; // 0x450 - 0x452
   unsigned char pad_452[0xE]; // 0x452 - 0x460
   uint8_t m_fBBoxVisFlags; // 0x460 - 0x461
   bool m_bPredictable; // 0x461 - 0x462
   bool m_bRenderWithViewModels; // 0x462 - 0x463
   unsigned char pad_463[0x1]; // 0x463 - 0x464
   CSplitScreenSlot m_nSplitUserPlayerPredictionSlot; // 0x464 - 0x468
   int32_t m_nFirstPredictableCommand; // 0x468 - 0x46C
   int32_t m_nLastPredictableCommand; // 0x46C - 0x470
   CHandle< C_BaseEntity > m_hOldMoveParent; // 0x470 - 0x474
   unsigned char pad_474[0x4]; // 0x474 - 0x478
   CParticleProperty m_Particles; // 0x478 - 0x4A0
   CUtlVector< float32 > m_vecPredictedScriptFloats; // 0x4A0 - 0x4B8
   CUtlVector< int32 > m_vecPredictedScriptFloatIDs; // 0x4B8 - 0x4D0
   unsigned char pad_4D0[0x18]; // 0x4D0 - 0x4E8
   int32_t m_nNextScriptVarRecordID; // 0x4E8 - 0x4EC
   unsigned char pad_4EC[0xC]; // 0x4EC - 0x4F8
   QAngle m_vecAngVelocity; // 0x4F8 - 0x504
   int32_t m_DataChangeEventRef; // 0x504 - 0x508
   CUtlVector< CEntityHandle > m_dependencies; // 0x508 - 0x520
   int32_t m_nCreationTick; // 0x520 - 0x524
   unsigned char pad_524[0x9]; // 0x524 - 0x52D
   bool m_bAnimTimeChanged; // 0x52D - 0x52E
   bool m_bSimulationTimeChanged; // 0x52E - 0x52F
   unsigned char pad_52F[0x9]; // 0x52F - 0x538
   CUtlString m_sUniqueHammerID; // 0x538 - 0x540
   BloodType m_nBloodType; // 0x540 - 0x544
   unsigned char pad_544[0x4]; // 0x544 - 0x548
}; // size - 0x548


class CParticleFunction /* "particles" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CParticleCollectionFloatInput m_flOpStrength; // 0x8 - 0x160
   ParticleEndcapMode_t m_nOpEndCapState; // 0x160 - 0x164
   float m_flOpStartFadeInTime; // 0x164 - 0x168
   float m_flOpEndFadeInTime; // 0x168 - 0x16C
   float m_flOpStartFadeOutTime; // 0x16C - 0x170
   float m_flOpEndFadeOutTime; // 0x170 - 0x174
   float m_flOpFadeOscillatePeriod; // 0x174 - 0x178
   bool m_bNormalizeToStopTime; // 0x178 - 0x179
   unsigned char pad_179[0x3]; // 0x179 - 0x17C
   float m_flOpTimeOffsetMin; // 0x17C - 0x180
   float m_flOpTimeOffsetMax; // 0x180 - 0x184
   int32_t m_nOpTimeOffsetSeed; // 0x184 - 0x188
   int32_t m_nOpTimeScaleSeed; // 0x188 - 0x18C
   float m_flOpTimeScaleMin; // 0x18C - 0x190
   float m_flOpTimeScaleMax; // 0x190 - 0x194
   unsigned char pad_194[0x2]; // 0x194 - 0x196
   bool m_bDisableOperator; // 0x196 - 0x197
   unsigned char pad_197[0x1]; // 0x197 - 0x198
   CUtlString m_Notes; // 0x198 - 0x1A0
   unsigned char pad_1A0[0x18]; // 0x1A0 - 0x1B8
}; // size - 0x1B8


class CBaseModelEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   CRenderComponent* m_CRenderComponent; // 0x4C0 - 0x4C8
   CHitboxComponent m_CHitboxComponent; // 0x4C8 - 0x4F0
   GameTime_t m_flDissolveStartTime; // 0x4F0 - 0x4F4
   unsigned char pad_4F4[0x4]; // 0x4F4 - 0x4F8
   CEntityIOOutput m_OnIgnite; // 0x4F8 - 0x520
   RenderMode_t m_nRenderMode; // 0x520 - 0x521
   RenderFx_t m_nRenderFX; // 0x521 - 0x522
   bool m_bAllowFadeInView; // 0x522 - 0x523
   Color m_clrRender; // 0x523 - 0x527
   unsigned char pad_527[0x1]; // 0x527 - 0x528
   CUtlVectorEmbeddedNetworkVar< EntityRenderAttribute_t > m_vecRenderAttributes; // 0x528 - 0x578
   bool m_bRenderToCubemaps; // 0x578 - 0x579
   unsigned char pad_579[0x7]; // 0x579 - 0x580
   CCollisionProperty m_Collision; // 0x580 - 0x630
   CGlowProperty m_Glow; // 0x630 - 0x688
   float m_flGlowBackfaceMult; // 0x688 - 0x68C
   float m_fadeMinDist; // 0x68C - 0x690
   float m_fadeMaxDist; // 0x690 - 0x694
   float m_flFadeScale; // 0x694 - 0x698
   float m_flShadowStrength; // 0x698 - 0x69C
   uint8_t m_nObjectCulling; // 0x69C - 0x69D
   unsigned char pad_69D[0x3]; // 0x69D - 0x6A0
   int32_t m_nAddDecal; // 0x6A0 - 0x6A4
   Vector m_vDecalPosition; // 0x6A4 - 0x6B0
   Vector m_vDecalForwardAxis; // 0x6B0 - 0x6BC
   float m_flDecalHealBloodRate; // 0x6BC - 0x6C0
   float m_flDecalHealHeightRate; // 0x6C0 - 0x6C4
   unsigned char pad_6C4[0x4]; // 0x6C4 - 0x6C8
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_ConfigEntitiesToPropagateMaterialDecalsTo; // 0x6C8 - 0x6E0
   CNetworkViewOffsetVector m_vecViewOffset; // 0x6E0 - 0x708
   unsigned char pad_708[0x8]; // 0x708 - 0x710
}; // size - 0x710


class C_BaseModelEntity /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_548[0x4D0]; // 0x548 - 0xA18
   CRenderComponent* m_CRenderComponent; // 0xA18 - 0xA20
   CHitboxComponent m_CHitboxComponent; // 0xA20 - 0xA48
   unsigned char pad_A48[0x20]; // 0xA48 - 0xA68
   bool m_bInitModelEffects; // 0xA68 - 0xA69
   bool m_bIsStaticProp; // 0xA69 - 0xA6A
   unsigned char pad_A6A[0x2]; // 0xA6A - 0xA6C
   int32_t m_nLastAddDecal; // 0xA6C - 0xA70
   int32_t m_nDecalsAdded; // 0xA70 - 0xA74
   int32_t m_iOldHealth; // 0xA74 - 0xA78
   RenderMode_t m_nRenderMode; // 0xA78 - 0xA79
   RenderFx_t m_nRenderFX; // 0xA79 - 0xA7A
   bool m_bAllowFadeInView; // 0xA7A - 0xA7B
   Color m_clrRender; // 0xA7B - 0xA7F
   unsigned char pad_A7F[0x1]; // 0xA7F - 0xA80
   C_UtlVectorEmbeddedNetworkVar< EntityRenderAttribute_t > m_vecRenderAttributes; // 0xA80 - 0xAD0
   unsigned char pad_AD0[0x18]; // 0xAD0 - 0xAE8
   bool m_bRenderToCubemaps; // 0xAE8 - 0xAE9
   unsigned char pad_AE9[0x7]; // 0xAE9 - 0xAF0
   CCollisionProperty m_Collision; // 0xAF0 - 0xBA0
   CGlowProperty m_Glow; // 0xBA0 - 0xBF8
   float m_flGlowBackfaceMult; // 0xBF8 - 0xBFC
   float m_fadeMinDist; // 0xBFC - 0xC00
   float m_fadeMaxDist; // 0xC00 - 0xC04
   float m_flFadeScale; // 0xC04 - 0xC08
   float m_flShadowStrength; // 0xC08 - 0xC0C
   uint8_t m_nObjectCulling; // 0xC0C - 0xC0D
   unsigned char pad_C0D[0x3]; // 0xC0D - 0xC10
   int32_t m_nAddDecal; // 0xC10 - 0xC14
   Vector m_vDecalPosition; // 0xC14 - 0xC20
   Vector m_vDecalForwardAxis; // 0xC20 - 0xC2C
   float m_flDecalHealBloodRate; // 0xC2C - 0xC30
   float m_flDecalHealHeightRate; // 0xC30 - 0xC34
   unsigned char pad_C34[0x4]; // 0xC34 - 0xC38
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_ConfigEntitiesToPropagateMaterialDecalsTo; // 0xC38 - 0xC50
   CNetworkViewOffsetVector m_vecViewOffset; // 0xC50 - 0xC78
   unsigned char pad_C78[0x8]; // 0xC78 - 0xC80
   CClientAlphaProperty* m_pClientAlphaProperty; // 0xC80 - 0xC88
   Color m_ClientOverrideTint; // 0xC88 - 0xC8C
   bool m_bUseClientOverrideTint; // 0xC8C - 0xC8D
   unsigned char pad_C8D[0x3B]; // 0xC8D - 0xCC8
}; // size - 0xCC8


class CBaseAnimGraph /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_710[0x78]; // 0x710 - 0x788
   bool m_bInitiallyPopulateInterpHistory; // 0x788 - 0x789
   unsigned char pad_789[0x7]; // 0x789 - 0x790
   IChoreoServices* m_pChoreoServices; // 0x790 - 0x798
   bool m_bAnimGraphUpdateEnabled; // 0x798 - 0x799
   unsigned char pad_799[0x3]; // 0x799 - 0x79C
   float m_flMaxSlopeDistance; // 0x79C - 0x7A0
   Vector m_vLastSlopeCheckPos; // 0x7A0 - 0x7AC
   bool m_bAnimationUpdateScheduled; // 0x7AC - 0x7AD
   unsigned char pad_7AD[0x3]; // 0x7AD - 0x7B0
   Vector m_vecForce; // 0x7B0 - 0x7BC
   int32_t m_nForceBone; // 0x7BC - 0x7C0
   unsigned char pad_7C0[0x10]; // 0x7C0 - 0x7D0
   PhysicsRagdollPose_t* m_pRagdollPose; // 0x7D0 - 0x7D8
   bool m_bRagdollClientSide; // 0x7D8 - 0x7D9
   unsigned char pad_7D9[0x10F]; // 0x7D9 - 0x8E8
}; // size - 0x8E8


class CBaseAnimGraph /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_CC8[0x78]; // 0xCC8 - 0xD40
   bool m_bInitiallyPopulateInterpHistory; // 0xD40 - 0xD41
   unsigned char pad_D41[0x1]; // 0xD41 - 0xD42
   bool m_bSuppressAnimEventSounds; // 0xD42 - 0xD43
   unsigned char pad_D43[0xD]; // 0xD43 - 0xD50
   bool m_bAnimGraphUpdateEnabled; // 0xD50 - 0xD51
   unsigned char pad_D51[0x3]; // 0xD51 - 0xD54
   float m_flMaxSlopeDistance; // 0xD54 - 0xD58
   Vector m_vLastSlopeCheckPos; // 0xD58 - 0xD64
   bool m_bAnimationUpdateScheduled; // 0xD64 - 0xD65
   unsigned char pad_D65[0x3]; // 0xD65 - 0xD68
   Vector m_vecForce; // 0xD68 - 0xD74
   int32_t m_nForceBone; // 0xD74 - 0xD78
   CBaseAnimGraph* m_pClientsideRagdoll; // 0xD78 - 0xD80
   bool m_bBuiltRagdoll; // 0xD80 - 0xD81
   unsigned char pad_D81[0x17]; // 0xD81 - 0xD98
   PhysicsRagdollPose_t* m_pRagdollPose; // 0xD98 - 0xDA0
   bool m_bRagdollClientSide; // 0xDA0 - 0xDA1
   unsigned char pad_DA1[0xF]; // 0xDA1 - 0xDB0
   bool m_bHasAnimatedMaterialAttributes; // 0xDB0 - 0xDB1
   unsigned char pad_DB1[0x11F]; // 0xDB1 - 0xED0
}; // size - 0xED0


class CParticleFunctionOperator /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   unsigned char pad_0[0x1B8]; // 0x0 - 0x1B8
}; // size - 0x1B8


class C_BaseFlex /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   class Emphasized_Phoneme /* "client" */
   {
   public:
      CUtlString m_sClassName; // 0x0 - 0x8
      unsigned char pad_8[0x10]; // 0x8 - 0x18
      float m_flAmount; // 0x18 - 0x1C
      bool m_bRequired; // 0x1C - 0x1D
      bool m_bBasechecked; // 0x1D - 0x1E
      bool m_bValid; // 0x1E - 0x1F
      unsigned char pad_1F[0x1]; // 0x1F - 0x20
   }; // size - 0x20

   unsigned char pad_ED0[0x10]; // 0xED0 - 0xEE0
   C_NetworkUtlVectorBase< float32 > m_flexWeight; // 0xEE0 - 0xEF8
   Vector m_vLookTargetPosition; // 0xEF8 - 0xF04
   unsigned char pad_F04[0xC]; // 0xF04 - 0xF10
   bool m_blinktoggle; // 0xF10 - 0xF11
   unsigned char pad_F11[0x5F]; // 0xF11 - 0xF70
   int32_t m_nLastFlexUpdateFrameCount; // 0xF70 - 0xF74
   Vector m_CachedViewTarget; // 0xF74 - 0xF80
   SceneEventId_t m_nNextSceneEventId; // 0xF80 - 0xF84
   int32_t m_iBlink; // 0xF84 - 0xF88
   float m_blinktime; // 0xF88 - 0xF8C
   bool m_prevblinktoggle; // 0xF8C - 0xF8D
   unsigned char pad_F8D[0x3]; // 0xF8D - 0xF90
   int32_t m_iJawOpen; // 0xF90 - 0xF94
   float m_flJawOpenAmount; // 0xF94 - 0xF98
   float m_flBlinkAmount; // 0xF98 - 0xF9C
   AttachmentHandle_t m_iMouthAttachment; // 0xF9C - 0xF9D
   AttachmentHandle_t m_iEyeAttachment; // 0xF9D - 0xF9E
   bool m_bResetFlexWeightsOnModelChange; // 0xF9E - 0xF9F
   unsigned char pad_F9F[0x19]; // 0xF9F - 0xFB8
   int32_t m_nEyeOcclusionRendererBone; // 0xFB8 - 0xFBC
   matrix3x4_t m_mEyeOcclusionRendererCameraToBoneTransform; // 0xFBC - 0xFEC
   Vector m_vEyeOcclusionRendererHalfExtent; // 0xFEC - 0xFF8
   unsigned char pad_FF8[0x10]; // 0xFF8 - 0x1008
   C_BaseFlex::Emphasized_Phoneme m_PhonemeClasses[3]; // 0x1008 - 0x1068
}; // size - 0x1068


class CBaseFlex /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   CNetworkUtlVectorBase< float32 > m_flexWeight; // 0x8E8 - 0x900
   Vector m_vLookTargetPosition; // 0x900 - 0x90C
   bool m_blinktoggle; // 0x90C - 0x90D
   unsigned char pad_90D[0x53]; // 0x90D - 0x960
   GameTime_t m_flAllowResponsesEndTime; // 0x960 - 0x964
   GameTime_t m_flLastFlexAnimationTime; // 0x964 - 0x968
   SceneEventId_t m_nNextSceneEventId; // 0x968 - 0x96C
   bool m_bUpdateLayerPriorities; // 0x96C - 0x96D
   unsigned char pad_96D[0xB]; // 0x96D - 0x978
}; // size - 0x978


class C_EconEntity /* "client" */ : public C_BaseFlex /* "client" */
{
public:
   class AttachedModelData_t /* "client" */
   {
   public:
      int32_t m_iModelDisplayFlags; // 0x0 - 0x4
   }; // size - 0x4

   unsigned char pad_1068[0x10]; // 0x1068 - 0x1078
   float m_flFlexDelayTime; // 0x1078 - 0x107C
   unsigned char pad_107C[0x4]; // 0x107C - 0x1080
   float32* m_flFlexDelayedWeight; // 0x1080 - 0x1088
   bool m_bAttributesInitialized; // 0x1088 - 0x1089
   unsigned char pad_1089[0x7]; // 0x1089 - 0x1090
   C_AttributeContainer m_AttributeManager; // 0x1090 - 0x1538
   uint32_t m_OriginalOwnerXuidLow; // 0x1538 - 0x153C
   uint32_t m_OriginalOwnerXuidHigh; // 0x153C - 0x1540
   int32_t m_nFallbackPaintKit; // 0x1540 - 0x1544
   int32_t m_nFallbackSeed; // 0x1544 - 0x1548
   float m_flFallbackWear; // 0x1548 - 0x154C
   int32_t m_nFallbackStatTrak; // 0x154C - 0x1550
   bool m_bClientside; // 0x1550 - 0x1551
   bool m_bParticleSystemsCreated; // 0x1551 - 0x1552
   unsigned char pad_1552[0x6]; // 0x1552 - 0x1558
   CUtlVector< int32 > m_vecAttachedParticles; // 0x1558 - 0x1570
   CHandle< CBaseAnimGraph > m_hViewmodelAttachment; // 0x1570 - 0x1574
   int32_t m_iOldTeam; // 0x1574 - 0x1578
   bool m_bAttachmentDirty; // 0x1578 - 0x1579
   unsigned char pad_1579[0x3]; // 0x1579 - 0x157C
   int32_t m_nUnloadedModelIndex; // 0x157C - 0x1580
   int32_t m_iNumOwnerValidationRetries; // 0x1580 - 0x1584
   unsigned char pad_1584[0xC]; // 0x1584 - 0x1590
   CHandle< C_BaseEntity > m_hOldProvidee; // 0x1590 - 0x1594
   unsigned char pad_1594[0x4]; // 0x1594 - 0x1598
   CUtlVector< C_EconEntity::AttachedModelData_t > m_vecAttachedModels; // 0x1598 - 0x15B0
}; // size - 0x15B0


class CEconEntity /* "server" */ : public CBaseFlex /* "server" */
{
public:
   unsigned char pad_978[0x10]; // 0x978 - 0x988
   CAttributeContainer m_AttributeManager; // 0x988 - 0xC50
   uint32_t m_OriginalOwnerXuidLow; // 0xC50 - 0xC54
   uint32_t m_OriginalOwnerXuidHigh; // 0xC54 - 0xC58
   int32_t m_nFallbackPaintKit; // 0xC58 - 0xC5C
   int32_t m_nFallbackSeed; // 0xC5C - 0xC60
   float m_flFallbackWear; // 0xC60 - 0xC64
   int32_t m_nFallbackStatTrak; // 0xC64 - 0xC68
   CHandle< CBaseEntity > m_hOldProvidee; // 0xC68 - 0xC6C
   int32_t m_iOldOwnerClass; // 0xC6C - 0xC70
}; // size - 0xC70


class CServerOnlyEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_0[0x4C0]; // 0x0 - 0x4C0
}; // size - 0x4C0


class CParticleFunctionInitializer /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   int32_t m_nAssociatedEmitterIndex; // 0x1B8 - 0x1BC
   unsigned char pad_1BC[0x4]; // 0x1BC - 0x1C0
}; // size - 0x1C0


class CBasePlayerWeapon /* "server" */ : public CEconEntity /* "server" */
{
public:
   GameTick_t m_nNextPrimaryAttackTick; // 0xC70 - 0xC74
   float m_flNextPrimaryAttackTickRatio; // 0xC74 - 0xC78
   GameTick_t m_nNextSecondaryAttackTick; // 0xC78 - 0xC7C
   float m_flNextSecondaryAttackTickRatio; // 0xC7C - 0xC80
   int32_t m_iClip1; // 0xC80 - 0xC84
   int32_t m_iClip2; // 0xC84 - 0xC88
   int32 m_pReserveAmmo[2]; // 0xC88 - 0xC90
   CEntityIOOutput m_OnPlayerUse; // 0xC90 - 0xCB8
}; // size - 0xCB8


class C_BasePlayerWeapon /* "client" */ : public C_EconEntity /* "client" */
{
public:
   GameTick_t m_nNextPrimaryAttackTick; // 0x15B0 - 0x15B4
   float m_flNextPrimaryAttackTickRatio; // 0x15B4 - 0x15B8
   GameTick_t m_nNextSecondaryAttackTick; // 0x15B8 - 0x15BC
   float m_flNextSecondaryAttackTickRatio; // 0x15BC - 0x15C0
   int32_t m_iClip1; // 0x15C0 - 0x15C4
   int32_t m_iClip2; // 0x15C4 - 0x15C8
   int32 m_pReserveAmmo[2]; // 0x15C8 - 0x15D0
   unsigned char pad_15D0[0x18]; // 0x15D0 - 0x15E8
}; // size - 0x15E8


class CPulseCell_Base /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   PulseDocNodeID_t m_nEditorNodeID; // 0x8 - 0xC
   unsigned char pad_C[0x3C]; // 0xC - 0x48
}; // size - 0x48


class CBaseToggle /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   TOGGLE_STATE m_toggle_state; // 0x710 - 0x714
   float m_flMoveDistance; // 0x714 - 0x718
   float m_flWait; // 0x718 - 0x71C
   float m_flLip; // 0x71C - 0x720
   bool m_bAlwaysFireBlockedOutputs; // 0x720 - 0x721
   unsigned char pad_721[0x3]; // 0x721 - 0x724
   Vector m_vecPosition1; // 0x724 - 0x730
   Vector m_vecPosition2; // 0x730 - 0x73C
   QAngle m_vecMoveAng; // 0x73C - 0x748
   QAngle m_vecAngle1; // 0x748 - 0x754
   QAngle m_vecAngle2; // 0x754 - 0x760
   float m_flHeight; // 0x760 - 0x764
   CHandle< CBaseEntity > m_hActivator; // 0x764 - 0x768
   Vector m_vecFinalDest; // 0x768 - 0x774
   QAngle m_vecFinalAngle; // 0x774 - 0x780
   int32_t m_movementType; // 0x780 - 0x784
   unsigned char pad_784[0x4]; // 0x784 - 0x788
   CUtlSymbolLarge m_sMaster; // 0x788 - 0x790
}; // size - 0x790


class CCSWeaponBase /* "server" */ : public CBasePlayerWeapon /* "server" */
{
public:
   unsigned char pad_CB8[0x28]; // 0xCB8 - 0xCE0
   bool m_bRemoveable; // 0xCE0 - 0xCE1
   unsigned char pad_CE1[0x7]; // 0xCE1 - 0xCE8
   float m_flFireSequenceStartTime; // 0xCE8 - 0xCEC
   int32_t m_nFireSequenceStartTimeChange; // 0xCEC - 0xCF0
   int32_t m_nFireSequenceStartTimeAck; // 0xCF0 - 0xCF4
   PlayerAnimEvent_t m_ePlayerFireEvent; // 0xCF4 - 0xCF8
   WeaponAttackType_t m_ePlayerFireEventAttackType; // 0xCF8 - 0xCFC
   HSequence m_seqIdle; // 0xCFC - 0xD00
   HSequence m_seqFirePrimary; // 0xD00 - 0xD04
   HSequence m_seqFireSecondary; // 0xD04 - 0xD08
   CUtlVector< HSequence > m_thirdPersonFireSequences; // 0xD08 - 0xD20
   HSequence m_hCurrentThirdPersonSequence; // 0xD20 - 0xD24
   int32_t m_nSilencerBoneIndex; // 0xD24 - 0xD28
   HSequence m_thirdPersonSequences[7]; // 0xD28 - 0xD44
   unsigned char pad_D44[0xC]; // 0xD44 - 0xD50
   bool m_bPlayerAmmoStockOnPickup; // 0xD50 - 0xD51
   bool m_bRequireUseToTouch; // 0xD51 - 0xD52
   unsigned char pad_D52[0x2]; // 0xD52 - 0xD54
   CSWeaponState_t m_iState; // 0xD54 - 0xD58
   GameTime_t m_flLastTimeInAir; // 0xD58 - 0xD5C
   GameTime_t m_flLastDeployTime; // 0xD5C - 0xD60
   int32_t m_nLastEmptySoundCmdNum; // 0xD60 - 0xD64
   uint32_t m_nViewModelIndex; // 0xD64 - 0xD68
   bool m_bReloadsWithClips; // 0xD68 - 0xD69
   unsigned char pad_D69[0x1F]; // 0xD69 - 0xD88
   GameTime_t m_flTimeWeaponIdle; // 0xD88 - 0xD8C
   bool m_bFireOnEmpty; // 0xD8C - 0xD8D
   unsigned char pad_D8D[0x3]; // 0xD8D - 0xD90
   CEntityIOOutput m_OnPlayerPickup; // 0xD90 - 0xDB8
   CSWeaponMode m_weaponMode; // 0xDB8 - 0xDBC
   float m_flTurningInaccuracyDelta; // 0xDBC - 0xDC0
   Vector m_vecTurningInaccuracyEyeDirLast; // 0xDC0 - 0xDCC
   float m_flTurningInaccuracy; // 0xDCC - 0xDD0
   float m_fAccuracyPenalty; // 0xDD0 - 0xDD4
   GameTime_t m_flLastAccuracyUpdateTime; // 0xDD4 - 0xDD8
   float m_fAccuracySmoothedForZoom; // 0xDD8 - 0xDDC
   GameTime_t m_fScopeZoomEndTime; // 0xDDC - 0xDE0
   int32_t m_iRecoilIndex; // 0xDE0 - 0xDE4
   float m_flRecoilIndex; // 0xDE4 - 0xDE8
   bool m_bBurstMode; // 0xDE8 - 0xDE9
   unsigned char pad_DE9[0x3]; // 0xDE9 - 0xDEC
   GameTick_t m_nPostponeFireReadyTicks; // 0xDEC - 0xDF0
   float m_flPostponeFireReadyFrac; // 0xDF0 - 0xDF4
   bool m_bInReload; // 0xDF4 - 0xDF5
   bool m_bReloadVisuallyComplete; // 0xDF5 - 0xDF6
   unsigned char pad_DF6[0x2]; // 0xDF6 - 0xDF8
   GameTime_t m_flDroppedAtTime; // 0xDF8 - 0xDFC
   bool m_bIsHauledBack; // 0xDFC - 0xDFD
   bool m_bSilencerOn; // 0xDFD - 0xDFE
   unsigned char pad_DFE[0x2]; // 0xDFE - 0xE00
   GameTime_t m_flTimeSilencerSwitchComplete; // 0xE00 - 0xE04
   int32_t m_iOriginalTeamNumber; // 0xE04 - 0xE08
   int32_t m_iMostRecentTeamNumber; // 0xE08 - 0xE0C
   bool m_bDroppedNearBuyZone; // 0xE0C - 0xE0D
   unsigned char pad_E0D[0x3]; // 0xE0D - 0xE10
   float m_flNextAttackRenderTimeOffset; // 0xE10 - 0xE14
   unsigned char pad_E14[0x14]; // 0xE14 - 0xE28
   bool m_bCanBePickedUp; // 0xE28 - 0xE29
   bool m_bUseCanOverrideNextOwnerTouchTime; // 0xE29 - 0xE2A
   unsigned char pad_E2A[0x2]; // 0xE2A - 0xE2C
   GameTime_t m_nextOwnerTouchTime; // 0xE2C - 0xE30
   GameTime_t m_nextPrevOwnerTouchTime; // 0xE30 - 0xE34
   unsigned char pad_E34[0x4]; // 0xE34 - 0xE38
   CHandle< CCSPlayerPawn > m_hPrevOwner; // 0xE38 - 0xE3C
   GameTick_t m_nDropTick; // 0xE3C - 0xE40
   unsigned char pad_E40[0x1C]; // 0xE40 - 0xE5C
   bool m_donated; // 0xE5C - 0xE5D
   unsigned char pad_E5D[0x3]; // 0xE5D - 0xE60
   GameTime_t m_fLastShotTime; // 0xE60 - 0xE64
   bool m_bWasOwnedByCT; // 0xE64 - 0xE65
   bool m_bWasOwnedByTerrorist; // 0xE65 - 0xE66
   bool m_bFiredOutOfAmmoEvent; // 0xE66 - 0xE67
   unsigned char pad_E67[0x1]; // 0xE67 - 0xE68
   int32_t m_numRemoveUnownedWeaponThink; // 0xE68 - 0xE6C
   unsigned char pad_E6C[0x4]; // 0xE6C - 0xE70
   CIronSightController m_IronSightController; // 0xE70 - 0xE88
   int32_t m_iIronSightMode; // 0xE88 - 0xE8C
   GameTime_t m_flLastLOSTraceFailureTime; // 0xE8C - 0xE90
   int32_t m_iNumEmptyAttacks; // 0xE90 - 0xE94
   float m_flWatTickOffset; // 0xE94 - 0xE98
}; // size - 0xE98


class C_CSWeaponBase /* "client" */ : public C_BasePlayerWeapon /* "client" */
{
public:
   unsigned char pad_15E8[0x3C]; // 0x15E8 - 0x1624
   float m_flFireSequenceStartTime; // 0x1624 - 0x1628
   int32_t m_nFireSequenceStartTimeChange; // 0x1628 - 0x162C
   int32_t m_nFireSequenceStartTimeAck; // 0x162C - 0x1630
   PlayerAnimEvent_t m_ePlayerFireEvent; // 0x1630 - 0x1634
   WeaponAttackType_t m_ePlayerFireEventAttackType; // 0x1634 - 0x1638
   HSequence m_seqIdle; // 0x1638 - 0x163C
   HSequence m_seqFirePrimary; // 0x163C - 0x1640
   HSequence m_seqFireSecondary; // 0x1640 - 0x1644
   unsigned char pad_1644[0x4]; // 0x1644 - 0x1648
   CUtlVector< HSequence > m_thirdPersonFireSequences; // 0x1648 - 0x1660
   HSequence m_hCurrentThirdPersonSequence; // 0x1660 - 0x1664
   int32_t m_nSilencerBoneIndex; // 0x1664 - 0x1668
   HSequence m_thirdPersonSequences[7]; // 0x1668 - 0x1684
   unsigned char pad_1684[0x1C]; // 0x1684 - 0x16A0
   CSWeaponState_t m_ClientPreviousWeaponState; // 0x16A0 - 0x16A4
   CSWeaponState_t m_iState; // 0x16A4 - 0x16A8
   float m_flCrosshairDistance; // 0x16A8 - 0x16AC
   int32_t m_iAmmoLastCheck; // 0x16AC - 0x16B0
   int32_t m_iAlpha; // 0x16B0 - 0x16B4
   int32_t m_iScopeTextureID; // 0x16B4 - 0x16B8
   int32_t m_iCrosshairTextureID; // 0x16B8 - 0x16BC
   float m_flGunAccuracyPositionDeprecated; // 0x16BC - 0x16C0
   int32_t m_nLastEmptySoundCmdNum; // 0x16C0 - 0x16C4
   uint32_t m_nViewModelIndex; // 0x16C4 - 0x16C8
   bool m_bReloadsWithClips; // 0x16C8 - 0x16C9
   unsigned char pad_16C9[0x3]; // 0x16C9 - 0x16CC
   GameTime_t m_flTimeWeaponIdle; // 0x16CC - 0x16D0
   bool m_bFireOnEmpty; // 0x16D0 - 0x16D1
   unsigned char pad_16D1[0x7]; // 0x16D1 - 0x16D8
   CEntityIOOutput m_OnPlayerPickup; // 0x16D8 - 0x1700
   CSWeaponMode m_weaponMode; // 0x1700 - 0x1704
   float m_flTurningInaccuracyDelta; // 0x1704 - 0x1708
   Vector m_vecTurningInaccuracyEyeDirLast; // 0x1708 - 0x1714
   float m_flTurningInaccuracy; // 0x1714 - 0x1718
   float m_fAccuracyPenalty; // 0x1718 - 0x171C
   GameTime_t m_flLastAccuracyUpdateTime; // 0x171C - 0x1720
   float m_fAccuracySmoothedForZoom; // 0x1720 - 0x1724
   GameTime_t m_fScopeZoomEndTime; // 0x1724 - 0x1728
   int32_t m_iRecoilIndex; // 0x1728 - 0x172C
   float m_flRecoilIndex; // 0x172C - 0x1730
   bool m_bBurstMode; // 0x1730 - 0x1731
   unsigned char pad_1731[0x3]; // 0x1731 - 0x1734
   GameTime_t m_flLastBurstModeChangeTime; // 0x1734 - 0x1738
   GameTick_t m_nPostponeFireReadyTicks; // 0x1738 - 0x173C
   float m_flPostponeFireReadyFrac; // 0x173C - 0x1740
   bool m_bInReload; // 0x1740 - 0x1741
   bool m_bReloadVisuallyComplete; // 0x1741 - 0x1742
   unsigned char pad_1742[0x2]; // 0x1742 - 0x1744
   GameTime_t m_flDroppedAtTime; // 0x1744 - 0x1748
   bool m_bIsHauledBack; // 0x1748 - 0x1749
   bool m_bSilencerOn; // 0x1749 - 0x174A
   unsigned char pad_174A[0x2]; // 0x174A - 0x174C
   GameTime_t m_flTimeSilencerSwitchComplete; // 0x174C - 0x1750
   int32_t m_iOriginalTeamNumber; // 0x1750 - 0x1754
   int32_t m_iMostRecentTeamNumber; // 0x1754 - 0x1758
   bool m_bDroppedNearBuyZone; // 0x1758 - 0x1759
   unsigned char pad_1759[0x3]; // 0x1759 - 0x175C
   float m_flNextAttackRenderTimeOffset; // 0x175C - 0x1760
   unsigned char pad_1760[0x88]; // 0x1760 - 0x17E8
   bool m_bClearWeaponIdentifyingUGC; // 0x17E8 - 0x17E9
   bool m_bVisualsDataSet; // 0x17E9 - 0x17EA
   bool m_bOldFirstPersonSpectatedState; // 0x17EA - 0x17EB
   unsigned char pad_17EB[0x1]; // 0x17EB - 0x17EC
   CHandle< C_BaseEntity > m_hOurPing; // 0x17EC - 0x17F0
   CEntityIndex m_nOurPingIndex; // 0x17F0 - 0x17F4
   Vector m_vecOurPingPos; // 0x17F4 - 0x1800
   bool m_bGlowForPing; // 0x1800 - 0x1801
   bool m_bUIWeapon; // 0x1801 - 0x1802
   unsigned char pad_1802[0x2]; // 0x1802 - 0x1804
   int32_t m_nCustomEconReloadEventId; // 0x1804 - 0x1808
   unsigned char pad_1808[0x8]; // 0x1808 - 0x1810
   CHandle< C_CSPlayerPawn > m_hPrevOwner; // 0x1810 - 0x1814
   GameTick_t m_nDropTick; // 0x1814 - 0x1818
   unsigned char pad_1818[0x1C]; // 0x1818 - 0x1834
   bool m_donated; // 0x1834 - 0x1835
   unsigned char pad_1835[0x3]; // 0x1835 - 0x1838
   GameTime_t m_fLastShotTime; // 0x1838 - 0x183C
   bool m_bWasOwnedByCT; // 0x183C - 0x183D
   bool m_bWasOwnedByTerrorist; // 0x183D - 0x183E
   unsigned char pad_183E[0x2]; // 0x183E - 0x1840
   float m_gunHeat; // 0x1840 - 0x1844
   uint32_t m_smokeAttachments; // 0x1844 - 0x1848
   GameTime_t m_lastSmokeTime; // 0x1848 - 0x184C
   float m_flNextClientFireBulletTime; // 0x184C - 0x1850
   float m_flNextClientFireBulletTime_Repredict; // 0x1850 - 0x1854
   unsigned char pad_1854[0xDC]; // 0x1854 - 0x1930
   C_IronSightController m_IronSightController; // 0x1930 - 0x19E0
   int32_t m_iIronSightMode; // 0x19E0 - 0x19E4
   unsigned char pad_19E4[0xC]; // 0x19E4 - 0x19F0
   GameTime_t m_flLastLOSTraceFailureTime; // 0x19F0 - 0x19F4
   int32_t m_iNumEmptyAttacks; // 0x19F4 - 0x19F8
   unsigned char pad_19F8[0x78]; // 0x19F8 - 0x1A70
   GameTime_t m_flLastMagDropRequestTime; // 0x1A70 - 0x1A74
   float m_flWatTickOffset; // 0x1A74 - 0x1A78
   unsigned char pad_1A78[0x8]; // 0x1A78 - 0x1A80
}; // size - 0x1A80


class CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30
   unsigned char pad_30[0x10]; // 0x30 - 0x40
}; // size - 0x40


class CLogicalEntity /* "server" */ : public CServerOnlyEntity /* "server" */
{
public:
   unsigned char pad_0[0x4C0]; // 0x0 - 0x4C0
}; // size - 0x4C0


class CPointEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_0[0x4C0]; // 0x0 - 0x4C0
}; // size - 0x4C0


class CAnimUpdateNodeBase /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CAnimNodePath m_nodePath; // 0x18 - 0x48
   AnimNodeNetworkMode m_networkMode; // 0x48 - 0x4C
   unsigned char pad_4C[0x4]; // 0x4C - 0x50
   CUtlString m_name; // 0x50 - 0x58
}; // size - 0x58


class CPulseCell_BaseFlow /* "pulse_runtime_lib" */ : public CPulseCell_Base /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x48]; // 0x0 - 0x48
}; // size - 0x48


class CBaseTrigger /* "server" */ : public CBaseToggle /* "server" */
{
public:
   bool m_bDisabled; // 0x790 - 0x791
   unsigned char pad_791[0x7]; // 0x791 - 0x798
   CUtlSymbolLarge m_iFilterName; // 0x798 - 0x7A0
   CHandle< CBaseFilter > m_hFilter; // 0x7A0 - 0x7A4
   unsigned char pad_7A4[0x4]; // 0x7A4 - 0x7A8
   CEntityIOOutput m_OnStartTouch; // 0x7A8 - 0x7D0
   CEntityIOOutput m_OnStartTouchAll; // 0x7D0 - 0x7F8
   CEntityIOOutput m_OnEndTouch; // 0x7F8 - 0x820
   CEntityIOOutput m_OnEndTouchAll; // 0x820 - 0x848
   CEntityIOOutput m_OnTouching; // 0x848 - 0x870
   CEntityIOOutput m_OnTouchingEachEntity; // 0x870 - 0x898
   CEntityIOOutput m_OnNotTouching; // 0x898 - 0x8C0
   CUtlVector< CHandle< CBaseEntity > > m_hTouchingEntities; // 0x8C0 - 0x8D8
   bool m_bClientSidePredicted; // 0x8D8 - 0x8D9
   unsigned char pad_8D9[0x7]; // 0x8D9 - 0x8E0
}; // size - 0x8E0


class CParticleFunctionPreEmission /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   bool m_bRunOnce; // 0x1B8 - 0x1B9
   unsigned char pad_1B9[0x7]; // 0x1B9 - 0x1C0
}; // size - 0x1C0



class CParticleFunctionRenderer /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   CParticleVisibilityInputs VisibilityInputs; // 0x1B8 - 0x200
   bool m_bCannotBeRefracted; // 0x200 - 0x201
   bool m_bSkipRenderingOnMobile; // 0x201 - 0x202
   unsigned char pad_202[0x6]; // 0x202 - 0x208
}; // size - 0x208


class CCSWeaponBaseGun /* "server" */ : public CCSWeaponBase /* "server" */
{
public:
   int32_t m_zoomLevel; // 0xE98 - 0xE9C
   int32_t m_iBurstShotsRemaining; // 0xE9C - 0xEA0
   unsigned char pad_EA0[0x8]; // 0xEA0 - 0xEA8
   int32_t m_silencedModelIndex; // 0xEA8 - 0xEAC
   bool m_inPrecache; // 0xEAC - 0xEAD
   bool m_bNeedsBoltAction; // 0xEAD - 0xEAE
   bool m_bSkillReloadAvailable; // 0xEAE - 0xEAF
   bool m_bSkillReloadLiftedReloadKey; // 0xEAF - 0xEB0
   bool m_bSkillBoltInterruptAvailable; // 0xEB0 - 0xEB1
   bool m_bSkillBoltLiftedFireKey; // 0xEB1 - 0xEB2
   unsigned char pad_EB2[0x6]; // 0xEB2 - 0xEB8
}; // size - 0xEB8


class C_CSWeaponBaseGun /* "client" */ : public C_CSWeaponBase /* "client" */
{
public:
   int32_t m_zoomLevel; // 0x1A80 - 0x1A84
   int32_t m_iBurstShotsRemaining; // 0x1A84 - 0x1A88
   int32_t m_iSilencerBodygroup; // 0x1A88 - 0x1A8C
   unsigned char pad_1A8C[0xC]; // 0x1A8C - 0x1A98
   int32_t m_silencedModelIndex; // 0x1A98 - 0x1A9C
   bool m_inPrecache; // 0x1A9C - 0x1A9D
   bool m_bNeedsBoltAction; // 0x1A9D - 0x1A9E
   unsigned char pad_1A9E[0x2]; // 0x1A9E - 0x1AA0
}; // size - 0x1AA0


class CBaseProp /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   bool m_bModelOverrodeBlockLOS; // 0x8E8 - 0x8E9
   unsigned char pad_8E9[0x3]; // 0x8E9 - 0x8EC
   int32_t m_iShapeType; // 0x8EC - 0x8F0
   bool m_bConformToCollisionBounds; // 0x8F0 - 0x8F1
   unsigned char pad_8F1[0x3]; // 0x8F1 - 0x8F4
   matrix3x4_t m_mPreferredCatchTransform; // 0x8F4 - 0x924
   unsigned char pad_924[0x4]; // 0x924 - 0x928
}; // size - 0x928


class CUnaryUpdateNode /* "animgraphlib" */ : public CAnimUpdateNodeBase /* "animgraphlib" */
{
public:
   CAnimUpdateNodeRef m_pChildNode; // 0x58 - 0x68
}; // size - 0x68



class C_BaseToggle /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_0[0xCC8]; // 0x0 - 0xCC8
}; // size - 0xCC8


class CBreakableProp /* "server" */ : public CBaseProp /* "server" */
{
public:
   unsigned char pad_928[0x8]; // 0x928 - 0x930
   CPropDataComponent m_CPropDataComponent; // 0x930 - 0x970
   CEntityIOOutput m_OnBreak; // 0x970 - 0x998
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0x998 - 0x9C0
   CEntityIOOutput m_OnTakeDamage; // 0x9C0 - 0x9E8
   float m_impactEnergyScale; // 0x9E8 - 0x9EC
   int32_t m_iMinHealthDmg; // 0x9EC - 0x9F0
   QAngle m_preferredCarryAngles; // 0x9F0 - 0x9FC
   float m_flPressureDelay; // 0x9FC - 0xA00
   float m_flDefBurstScale; // 0xA00 - 0xA04
   Vector m_vDefBurstOffset; // 0xA04 - 0xA10
   CHandle< CBaseEntity > m_hBreaker; // 0xA10 - 0xA14
   PerformanceMode_t m_PerformanceMode; // 0xA14 - 0xA18
   GameTime_t m_flPreventDamageBeforeTime; // 0xA18 - 0xA1C
   bool m_bHasBreakPiecesOrCommands; // 0xA1C - 0xA1D
   unsigned char pad_A1D[0x3]; // 0xA1D - 0xA20
   float m_explodeDamage; // 0xA20 - 0xA24
   float m_explodeRadius; // 0xA24 - 0xA28
   unsigned char pad_A28[0x4]; // 0xA28 - 0xA2C
   float m_explosionDelay; // 0xA2C - 0xA30
   CUtlSymbolLarge m_explosionBuildupSound; // 0xA30 - 0xA38
   CUtlSymbolLarge m_explosionCustomEffect; // 0xA38 - 0xA40
   CUtlSymbolLarge m_explosionCustomSound; // 0xA40 - 0xA48
   CUtlSymbolLarge m_explosionModifier; // 0xA48 - 0xA50
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0xA50 - 0xA54
   GameTime_t m_flLastPhysicsInfluenceTime; // 0xA54 - 0xA58
   bool m_bOriginalBlockLOS; // 0xA58 - 0xA59
   unsigned char pad_A59[0x3]; // 0xA59 - 0xA5C
   float m_flDefaultFadeScale; // 0xA5C - 0xA60
   CHandle< CBaseEntity > m_hLastAttacker; // 0xA60 - 0xA64
   CHandle< CBaseEntity > m_hFlareEnt; // 0xA64 - 0xA68
   bool m_bUsePuntSound; // 0xA68 - 0xA69
   unsigned char pad_A69[0x7]; // 0xA69 - 0xA70
   CUtlSymbolLarge m_iszPuntSound; // 0xA70 - 0xA78
   bool m_noGhostCollision; // 0xA78 - 0xA79
   unsigned char pad_A79[0x7]; // 0xA79 - 0xA80
}; // size - 0xA80


class CBaseProp /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   bool m_bModelOverrodeBlockLOS; // 0xED0 - 0xED1
   unsigned char pad_ED1[0x3]; // 0xED1 - 0xED4
   int32_t m_iShapeType; // 0xED4 - 0xED8
   bool m_bConformToCollisionBounds; // 0xED8 - 0xED9
   unsigned char pad_ED9[0x3]; // 0xED9 - 0xEDC
   matrix3x4_t m_mPreferredCatchTransform; // 0xEDC - 0xF0C
   unsigned char pad_F0C[0x4]; // 0xF0C - 0xF10
}; // size - 0xF10


class CPulseCell_BaseYieldingInflow /* "pulse_runtime_lib" */ : public CPulseCell_BaseFlow /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x48]; // 0x0 - 0x48
}; // size - 0x48


class CBasePulseGraphInstance /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0xF8]; // 0x0 - 0xF8
}; // size - 0xF8


class C_BaseCombatCharacter /* "client" */ : public C_BaseFlex /* "client" */
{
public:

   enum class WaterWakeMode_t : std::uint32_t
   {
      WATER_WAKE_NONE = 0,
      WATER_WAKE_IDLE = 1,
      WATER_WAKE_WALKING = 2,
      WATER_WAKE_RUNNING = 3,
      WATER_WAKE_WATER_OVERHEAD = 4
   };
   C_NetworkUtlVectorBase< CHandle< C_EconWearable > > m_hMyWearables; // 0x1068 - 0x1080
   AttachmentHandle_t m_leftFootAttachment; // 0x1080 - 0x1081
   AttachmentHandle_t m_rightFootAttachment; // 0x1081 - 0x1082
   unsigned char pad_1082[0x2]; // 0x1082 - 0x1084
   C_BaseCombatCharacter::WaterWakeMode_t m_nWaterWakeMode; // 0x1084 - 0x1088
   float m_flWaterWorldZ; // 0x1088 - 0x108C
   float m_flWaterNextTraceTime; // 0x108C - 0x1090
   float m_flFieldOfView; // 0x1090 - 0x1094
   unsigned char pad_1094[0x64]; // 0x1094 - 0x10F8
}; // size - 0x10F8


class CParticleFunctionForce /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   unsigned char pad_0[0x1C8]; // 0x0 - 0x1C8
}; // size - 0x1C8


class EventSimulate_t /* "engine2" */
{
public:
   EngineLoopState_t m_LoopState; // 0x0 - 0x28
   bool m_bFirstTick; // 0x28 - 0x29
   bool m_bLastTick; // 0x29 - 0x2A
   unsigned char pad_2A[0x6]; // 0x2A - 0x30
}; // size - 0x30


class CAnimTagBase /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CGlobalSymbol m_name; // 0x18 - 0x20
   CUtlString m_sComment; // 0x20 - 0x28
   CGlobalSymbol m_group; // 0x28 - 0x30
   AnimTagID m_tagID; // 0x30 - 0x34
   unsigned char pad_34[0x14]; // 0x34 - 0x48
   bool m_bIsReferenced; // 0x48 - 0x49
   unsigned char pad_49[0x7]; // 0x49 - 0x50
}; // size - 0x50


class C_BreakableProp /* "client" */ : public CBaseProp /* "client" */
{
public:
   CPropDataComponent m_CPropDataComponent; // 0xF10 - 0xF50
   CEntityIOOutput m_OnBreak; // 0xF50 - 0xF78
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0xF78 - 0xFA0
   CEntityIOOutput m_OnTakeDamage; // 0xFA0 - 0xFC8
   float m_impactEnergyScale; // 0xFC8 - 0xFCC
   int32_t m_iMinHealthDmg; // 0xFCC - 0xFD0
   float m_flPressureDelay; // 0xFD0 - 0xFD4
   float m_flDefBurstScale; // 0xFD4 - 0xFD8
   Vector m_vDefBurstOffset; // 0xFD8 - 0xFE4
   CHandle< C_BaseEntity > m_hBreaker; // 0xFE4 - 0xFE8
   PerformanceMode_t m_PerformanceMode; // 0xFE8 - 0xFEC
   GameTime_t m_flPreventDamageBeforeTime; // 0xFEC - 0xFF0
   bool m_bHasBreakPiecesOrCommands; // 0xFF0 - 0xFF1
   unsigned char pad_FF1[0x3]; // 0xFF1 - 0xFF4
   float m_explodeDamage; // 0xFF4 - 0xFF8
   float m_explodeRadius; // 0xFF8 - 0xFFC
   unsigned char pad_FFC[0x4]; // 0xFFC - 0x1000
   float m_explosionDelay; // 0x1000 - 0x1004
   unsigned char pad_1004[0x4]; // 0x1004 - 0x1008
   CUtlSymbolLarge m_explosionBuildupSound; // 0x1008 - 0x1010
   CUtlSymbolLarge m_explosionCustomEffect; // 0x1010 - 0x1018
   CUtlSymbolLarge m_explosionCustomSound; // 0x1018 - 0x1020
   CUtlSymbolLarge m_explosionModifier; // 0x1020 - 0x1028
   CHandle< C_BasePlayerPawn > m_hPhysicsAttacker; // 0x1028 - 0x102C
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x102C - 0x1030
   float m_flDefaultFadeScale; // 0x1030 - 0x1034
   CHandle< C_BaseEntity > m_hLastAttacker; // 0x1034 - 0x1038
   CHandle< C_BaseEntity > m_hFlareEnt; // 0x1038 - 0x103C
   bool m_noGhostCollision; // 0x103C - 0x103D
   unsigned char pad_103D[0x3]; // 0x103D - 0x1040
}; // size - 0x1040


class CBoneConstraintBase /* "modellib" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
}; // size - 0x28


class CParticleInput /* "particleslib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
}; // size - 0x10


class C_CSGO_TeamPreviewCharacterPosition /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   int32_t m_nVariant; // 0x548 - 0x54C
   int32_t m_nRandom; // 0x54C - 0x550
   int32_t m_nOrdinal; // 0x550 - 0x554
   unsigned char pad_554[0x4]; // 0x554 - 0x558
   CUtlString m_sWeaponName; // 0x558 - 0x560
   uint64_t m_xuid; // 0x560 - 0x568
   C_EconItemView m_agentItem; // 0x568 - 0x9B0
   C_EconItemView m_glovesItem; // 0x9B0 - 0xDF8
   C_EconItemView m_weaponItem; // 0xDF8 - 0x1240
   unsigned char pad_1240[0x38]; // 0x1240 - 0x1278
}; // size - 0x1278


class CParticleFunctionConstraint /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   unsigned char pad_0[0x1B8]; // 0x0 - 0x1B8
}; // size - 0x1B8


class CEntityComponent /* "entity2" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class CBaseFilter /* "server" */ : public CLogicalEntity /* "server" */
{
public:
   bool m_bNegated; // 0x4C0 - 0x4C1
   unsigned char pad_4C1[0x7]; // 0x4C1 - 0x4C8
   CEntityIOOutput m_OnPass; // 0x4C8 - 0x4F0
   CEntityIOOutput m_OnFail; // 0x4F0 - 0x518
}; // size - 0x518


class CCSGO_TeamPreviewCharacterPosition /* "server" */ : public CBaseEntity /* "server" */
{
public:
   int32_t m_nVariant; // 0x4C0 - 0x4C4
   int32_t m_nRandom; // 0x4C4 - 0x4C8
   int32_t m_nOrdinal; // 0x4C8 - 0x4CC
   unsigned char pad_4CC[0x4]; // 0x4CC - 0x4D0
   CUtlString m_sWeaponName; // 0x4D0 - 0x4D8
   uint64_t m_xuid; // 0x4D8 - 0x4E0
   CEconItemView m_agentItem; // 0x4E0 - 0x758
   CEconItemView m_glovesItem; // 0x758 - 0x9D0
   CEconItemView m_weaponItem; // 0x9D0 - 0xC48
}; // size - 0xC48


class CMotionMetricEvaluator /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< float32 > m_means; // 0x18 - 0x30
   CUtlVector< float32 > m_standardDeviations; // 0x30 - 0x48
   float m_flWeight; // 0x48 - 0x4C
   int32_t m_nDimensionStartIndex; // 0x4C - 0x50
}; // size - 0x50


class CAnimParameterBase /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CGlobalSymbol m_name; // 0x18 - 0x20
   CUtlString m_sComment; // 0x20 - 0x28
   CUtlString m_group; // 0x28 - 0x30
   AnimParamID m_id; // 0x30 - 0x34
   unsigned char pad_34[0x14]; // 0x34 - 0x48
   CUtlString m_componentName; // 0x48 - 0x50
   unsigned char pad_50[0x18]; // 0x50 - 0x68
   bool m_bNetworkingRequested; // 0x68 - 0x69
   bool m_bIsReferenced; // 0x69 - 0x6A
   unsigned char pad_6A[0x6]; // 0x6A - 0x70
}; // size - 0x70


class CBaseGrenade /* "server" */ : public CBaseFlex /* "server" */
{
public:
   unsigned char pad_978[0x8]; // 0x978 - 0x980
   CEntityIOOutput m_OnPlayerPickup; // 0x980 - 0x9A8
   CEntityIOOutput m_OnExplode; // 0x9A8 - 0x9D0
   bool m_bHasWarnedAI; // 0x9D0 - 0x9D1
   bool m_bIsSmokeGrenade; // 0x9D1 - 0x9D2
   bool m_bIsLive; // 0x9D2 - 0x9D3
   unsigned char pad_9D3[0x1]; // 0x9D3 - 0x9D4
   float m_DmgRadius; // 0x9D4 - 0x9D8
   GameTime_t m_flDetonateTime; // 0x9D8 - 0x9DC
   float m_flWarnAITime; // 0x9DC - 0x9E0
   float m_flDamage; // 0x9E0 - 0x9E4
   unsigned char pad_9E4[0x4]; // 0x9E4 - 0x9E8
   CUtlSymbolLarge m_iszBounceSound; // 0x9E8 - 0x9F0
   CUtlString m_ExplosionSound; // 0x9F0 - 0x9F8
   unsigned char pad_9F8[0x4]; // 0x9F8 - 0x9FC
   CHandle< CCSPlayerPawn > m_hThrower; // 0x9FC - 0xA00
   unsigned char pad_A00[0x14]; // 0xA00 - 0xA14
   GameTime_t m_flNextAttack; // 0xA14 - 0xA18
   CHandle< CCSPlayerPawn > m_hOriginalThrower; // 0xA18 - 0xA1C
   unsigned char pad_A1C[0x4]; // 0xA1C - 0xA20
}; // size - 0xA20


class CEntityComponent /* "entity2" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class C_BaseGrenade /* "client" */ : public C_BaseFlex /* "client" */
{
public:
   bool m_bHasWarnedAI; // 0x1068 - 0x1069
   bool m_bIsSmokeGrenade; // 0x1069 - 0x106A
   bool m_bIsLive; // 0x106A - 0x106B
   unsigned char pad_106B[0x1]; // 0x106B - 0x106C
   float m_DmgRadius; // 0x106C - 0x1070
   GameTime_t m_flDetonateTime; // 0x1070 - 0x1074
   float m_flWarnAITime; // 0x1074 - 0x1078
   float m_flDamage; // 0x1078 - 0x107C
   unsigned char pad_107C[0x4]; // 0x107C - 0x1080
   CUtlSymbolLarge m_iszBounceSound; // 0x1080 - 0x1088
   CUtlString m_ExplosionSound; // 0x1088 - 0x1090
   unsigned char pad_1090[0x4]; // 0x1090 - 0x1094
   CHandle< C_CSPlayerPawn > m_hThrower; // 0x1094 - 0x1098
   unsigned char pad_1098[0x14]; // 0x1098 - 0x10AC
   GameTime_t m_flNextAttack; // 0x10AC - 0x10B0
   CHandle< C_CSPlayerPawn > m_hOriginalThrower; // 0x10B0 - 0x10B4
   unsigned char pad_10B4[0x4]; // 0x10B4 - 0x10B8
}; // size - 0x10B8


class CLeafUpdateNode /* "animgraphlib" */ : public CAnimUpdateNodeBase /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x58]; // 0x0 - 0x58
}; // size - 0x58


class CPhysConstraint /* "server" */ : public CLogicalEntity /* "server" */
{
public:
   unsigned char pad_4C0[0x8]; // 0x4C0 - 0x4C8
   CUtlSymbolLarge m_nameAttach1; // 0x4C8 - 0x4D0
   CUtlSymbolLarge m_nameAttach2; // 0x4D0 - 0x4D8
   CHandle< CBaseEntity > m_hAttach1; // 0x4D8 - 0x4DC
   CHandle< CBaseEntity > m_hAttach2; // 0x4DC - 0x4E0
   CUtlSymbolLarge m_nameAttachment1; // 0x4E0 - 0x4E8
   CUtlSymbolLarge m_nameAttachment2; // 0x4E8 - 0x4F0
   CUtlSymbolLarge m_breakSound; // 0x4F0 - 0x4F8
   float m_forceLimit; // 0x4F8 - 0x4FC
   float m_torqueLimit; // 0x4FC - 0x500
   uint32_t m_teleportTick; // 0x500 - 0x504
   float m_minTeleportDistance; // 0x504 - 0x508
   bool m_bSnapObjectPositions; // 0x508 - 0x509
   unsigned char pad_509[0x7]; // 0x509 - 0x510
   CEntityIOOutput m_OnBreak; // 0x510 - 0x538
}; // size - 0x538


class C_BaseTrigger /* "client" */ : public C_BaseToggle /* "client" */
{
public:
   bool m_bDisabled; // 0xCC8 - 0xCC9
   bool m_bClientSidePredicted; // 0xCC9 - 0xCCA
   unsigned char pad_CCA[0x6]; // 0xCCA - 0xCD0
}; // size - 0xCD0


class CAnimComponentUpdater /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlString m_name; // 0x18 - 0x20
   AnimComponentID m_id; // 0x20 - 0x24
   AnimNodeNetworkMode m_networkMode; // 0x24 - 0x28
   bool m_bStartEnabled; // 0x28 - 0x29
   unsigned char pad_29[0x7]; // 0x29 - 0x30
}; // size - 0x30


class CBaseCombatCharacter /* "server" */ : public CBaseFlex /* "server" */
{
public:
   bool m_bForceServerRagdoll; // 0x978 - 0x979
   unsigned char pad_979[0x7]; // 0x979 - 0x980
   CNetworkUtlVectorBase< CHandle< CEconWearable > > m_hMyWearables; // 0x980 - 0x998
   float m_flFieldOfView; // 0x998 - 0x99C
   float m_impactEnergyScale; // 0x99C - 0x9A0
   HitGroup_t m_LastHitGroup; // 0x9A0 - 0x9A4
   bool m_bApplyStressDamage; // 0x9A4 - 0x9A5
   unsigned char pad_9A5[0x43]; // 0x9A5 - 0x9E8
   int32_t m_iDamageCount; // 0x9E8 - 0x9EC
   unsigned char pad_9EC[0x4]; // 0x9EC - 0x9F0
   CUtlVector< RelationshipOverride_t >* m_pVecRelationships; // 0x9F0 - 0x9F8
   CUtlSymbolLarge m_strRelationships; // 0x9F8 - 0xA00
   Hull_t m_eHull; // 0xA00 - 0xA04
   uint32_t m_nNavHullIdx; // 0xA04 - 0xA08
}; // size - 0xA08


class CModelConfigElement /* "modellib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlString m_ElementName; // 0x8 - 0x10
   CUtlVector< CModelConfigElement* > m_NestedElements; // 0x10 - 0x28
   unsigned char pad_28[0x20]; // 0x28 - 0x48
}; // size - 0x48


class CVoiceContainerBase /* "soundsystem_voicecontainers" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
   CVSound m_vSound; // 0x20 - 0xA0
   unsigned char pad_A0[0x30]; // 0xA0 - 0xD0
   bool m_bHideAnalyzers; // 0xD0 - 0xD1
   unsigned char pad_D1[0x7]; // 0xD1 - 0xD8
   CUtlVector< CVoiceContainerAnalysisBase* > m_analysisContainers; // 0xD8 - 0xF0
}; // size - 0xF0


class C_BasePlayerPawn /* "client" */ : public C_BaseCombatCharacter /* "client" */
{
public:
   CPlayer_WeaponServices* m_pWeaponServices; // 0x10F8 - 0x1100
   CPlayer_ItemServices* m_pItemServices; // 0x1100 - 0x1108
   CPlayer_AutoaimServices* m_pAutoaimServices; // 0x1108 - 0x1110
   CPlayer_ObserverServices* m_pObserverServices; // 0x1110 - 0x1118
   CPlayer_WaterServices* m_pWaterServices; // 0x1118 - 0x1120
   CPlayer_UseServices* m_pUseServices; // 0x1120 - 0x1128
   CPlayer_FlashlightServices* m_pFlashlightServices; // 0x1128 - 0x1130
   CPlayer_CameraServices* m_pCameraServices; // 0x1130 - 0x1138
   CPlayer_MovementServices* m_pMovementServices; // 0x1138 - 0x1140
   unsigned char pad_1140[0x8]; // 0x1140 - 0x1148
   C_UtlVectorEmbeddedNetworkVar< ViewAngleServerChange_t > m_ServerViewAngleChanges; // 0x1148 - 0x1198
   uint32_t m_nHighestConsumedServerViewAngleChangeIndex; // 0x1198 - 0x119C
   QAngle v_angle; // 0x119C - 0x11A8
   QAngle v_anglePrevious; // 0x11A8 - 0x11B4
   uint32_t m_iHideHUD; // 0x11B4 - 0x11B8
   sky3dparams_t m_skybox3d; // 0x11B8 - 0x1248
   GameTime_t m_flDeathTime; // 0x1248 - 0x124C
   Vector m_vecPredictionError; // 0x124C - 0x1258
   GameTime_t m_flPredictionErrorTime; // 0x1258 - 0x125C
   Vector m_vecLastCameraSetupLocalOrigin; // 0x125C - 0x1268
   GameTime_t m_flLastCameraSetupTime; // 0x1268 - 0x126C
   float m_flFOVSensitivityAdjust; // 0x126C - 0x1270
   float m_flMouseSensitivity; // 0x1270 - 0x1274
   Vector m_vOldOrigin; // 0x1274 - 0x1280
   float m_flOldSimulationTime; // 0x1280 - 0x1284
   int32_t m_nLastExecutedCommandNumber; // 0x1284 - 0x1288
   int32_t m_nLastExecutedCommandTick; // 0x1288 - 0x128C
   CHandle< CBasePlayerController > m_hController; // 0x128C - 0x1290
   bool m_bIsSwappingToPredictableController; // 0x1290 - 0x1291
   unsigned char pad_1291[0x7]; // 0x1291 - 0x1298
}; // size - 0x1298


class C_CSGO_MapPreviewCameraPath /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   float m_flZFar; // 0x548 - 0x54C
   float m_flZNear; // 0x54C - 0x550
   bool m_bLoop; // 0x550 - 0x551
   bool m_bVerticalFOV; // 0x551 - 0x552
   bool m_bConstantSpeed; // 0x552 - 0x553
   unsigned char pad_553[0x1]; // 0x553 - 0x554
   float m_flDuration; // 0x554 - 0x558
   unsigned char pad_558[0x40]; // 0x558 - 0x598
   float m_flPathLength; // 0x598 - 0x59C
   float m_flPathDuration; // 0x59C - 0x5A0
   unsigned char pad_5A0[0x10]; // 0x5A0 - 0x5B0
}; // size - 0x5B0


class CDynamicProp /* "server" */ : public CBreakableProp /* "server" */
{
public:
   unsigned char pad_A80[0x8]; // 0xA80 - 0xA88
   bool m_bCreateNavObstacle; // 0xA88 - 0xA89
   bool m_bUseHitboxesForRenderBox; // 0xA89 - 0xA8A
   bool m_bUseAnimGraph; // 0xA8A - 0xA8B
   unsigned char pad_A8B[0x5]; // 0xA8B - 0xA90
   CEntityIOOutput m_pOutputAnimBegun; // 0xA90 - 0xAB8
   CEntityIOOutput m_pOutputAnimOver; // 0xAB8 - 0xAE0
   CEntityIOOutput m_pOutputAnimLoopCycleOver; // 0xAE0 - 0xB08
   CEntityIOOutput m_OnAnimReachedStart; // 0xB08 - 0xB30
   CEntityIOOutput m_OnAnimReachedEnd; // 0xB30 - 0xB58
   CUtlSymbolLarge m_iszIdleAnim; // 0xB58 - 0xB60
   AnimLoopMode_t m_nIdleAnimLoopMode; // 0xB60 - 0xB64
   bool m_bRandomizeCycle; // 0xB64 - 0xB65
   bool m_bStartDisabled; // 0xB65 - 0xB66
   bool m_bFiredStartEndOutput; // 0xB66 - 0xB67
   bool m_bForceNpcExclude; // 0xB67 - 0xB68
   bool m_bCreateNonSolid; // 0xB68 - 0xB69
   bool m_bIsOverrideProp; // 0xB69 - 0xB6A
   unsigned char pad_B6A[0x2]; // 0xB6A - 0xB6C
   int32_t m_iInitialGlowState; // 0xB6C - 0xB70
   int32_t m_nGlowRange; // 0xB70 - 0xB74
   int32_t m_nGlowRangeMin; // 0xB74 - 0xB78
   Color m_glowColor; // 0xB78 - 0xB7C
   int32_t m_nGlowTeam; // 0xB7C - 0xB80
}; // size - 0xB80


class CRuleEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   CUtlSymbolLarge m_iszMaster; // 0x710 - 0x718
}; // size - 0x718


class CBaseCSGrenade /* "server" */ : public CCSWeaponBase /* "server" */
{
public:
   bool m_bRedraw; // 0xE98 - 0xE99
   bool m_bIsHeldByPlayer; // 0xE99 - 0xE9A
   bool m_bPinPulled; // 0xE9A - 0xE9B
   bool m_bJumpThrow; // 0xE9B - 0xE9C
   bool m_bThrowAnimating; // 0xE9C - 0xE9D
   unsigned char pad_E9D[0x3]; // 0xE9D - 0xEA0
   GameTime_t m_fThrowTime; // 0xEA0 - 0xEA4
   float m_flThrowStrength; // 0xEA4 - 0xEA8
   float m_flThrowStrengthApproach; // 0xEA8 - 0xEAC
   GameTime_t m_fDropTime; // 0xEAC - 0xEB0
   GameTime_t m_fPinPullTime; // 0xEB0 - 0xEB4
   bool m_bJustPulledPin; // 0xEB4 - 0xEB5
   unsigned char pad_EB5[0x3]; // 0xEB5 - 0xEB8
   GameTick_t m_nNextHoldTick; // 0xEB8 - 0xEBC
   float m_flNextHoldFrac; // 0xEBC - 0xEC0
   CHandle< CCSWeaponBase > m_hSwitchToWeaponAfterThrow; // 0xEC0 - 0xEC4
   unsigned char pad_EC4[0xC]; // 0xEC4 - 0xED0
}; // size - 0xED0


class CEntitySubclassVDataBase /* "server" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
}; // size - 0x28


class CBtNode /* "server" */
{
public:
   unsigned char pad_0[0x58]; // 0x0 - 0x58
}; // size - 0x58


class CItem /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   unsigned char pad_8E8[0x8]; // 0x8E8 - 0x8F0
   CEntityIOOutput m_OnPlayerTouch; // 0x8F0 - 0x918
   CEntityIOOutput m_OnPlayerPickup; // 0x918 - 0x940
   bool m_bActivateWhenAtRest; // 0x940 - 0x941
   unsigned char pad_941[0x7]; // 0x941 - 0x948
   CEntityIOOutput m_OnCacheInteraction; // 0x948 - 0x970
   CEntityIOOutput m_OnGlovePulled; // 0x970 - 0x998
   Vector m_vOriginalSpawnOrigin; // 0x998 - 0x9A4
   QAngle m_vOriginalSpawnAngles; // 0x9A4 - 0x9B0
   bool m_bPhysStartAsleep; // 0x9B0 - 0x9B1
   unsigned char pad_9B1[0xF]; // 0x9B1 - 0x9C0
}; // size - 0x9C0


class CNavVolume /* "navlib" */
{
public:
   unsigned char pad_0[0x70]; // 0x0 - 0x70
}; // size - 0x70


class CServerOnlyPointEntity /* "server" */ : public CServerOnlyEntity /* "server" */
{
public:
   unsigned char pad_0[0x4C0]; // 0x0 - 0x4C0
}; // size - 0x4C0


class CSoundOpvarSetPointBase /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x4C0 - 0x4C1
   unsigned char pad_4C1[0x3]; // 0x4C1 - 0x4C4
   CEntityHandle m_hSource; // 0x4C4 - 0x4C8
   unsigned char pad_4C8[0x8]; // 0x4C8 - 0x4D0
   CUtlSymbolLarge m_iszSourceEntityName; // 0x4D0 - 0x4D8
   unsigned char pad_4D8[0x50]; // 0x4D8 - 0x528
   Vector m_vLastPosition; // 0x528 - 0x534
   unsigned char pad_534[0x4]; // 0x534 - 0x538
   CUtlSymbolLarge m_iszStackName; // 0x538 - 0x540
   CUtlSymbolLarge m_iszOperatorName; // 0x540 - 0x548
   CUtlSymbolLarge m_iszOpvarName; // 0x548 - 0x550
   int32_t m_iOpvarIndex; // 0x550 - 0x554
   bool m_bUseAutoCompare; // 0x554 - 0x555
   unsigned char pad_555[0x3]; // 0x555 - 0x558
}; // size - 0x558


class C_BaseCSGrenade /* "client" */ : public C_CSWeaponBase /* "client" */
{
public:
   bool m_bClientPredictDelete; // 0x1A80 - 0x1A81
   bool m_bRedraw; // 0x1A81 - 0x1A82
   bool m_bIsHeldByPlayer; // 0x1A82 - 0x1A83
   bool m_bPinPulled; // 0x1A83 - 0x1A84
   bool m_bJumpThrow; // 0x1A84 - 0x1A85
   bool m_bThrowAnimating; // 0x1A85 - 0x1A86
   unsigned char pad_1A86[0x2]; // 0x1A86 - 0x1A88
   GameTime_t m_fThrowTime; // 0x1A88 - 0x1A8C
   float m_flThrowStrength; // 0x1A8C - 0x1A90
   float m_flThrowStrengthApproach; // 0x1A90 - 0x1A94
   GameTime_t m_fDropTime; // 0x1A94 - 0x1A98
   GameTime_t m_fPinPullTime; // 0x1A98 - 0x1A9C
   bool m_bJustPulledPin; // 0x1A9C - 0x1A9D
   unsigned char pad_1A9D[0x3]; // 0x1A9D - 0x1AA0
   GameTick_t m_nNextHoldTick; // 0x1AA0 - 0x1AA4
   float m_flNextHoldFrac; // 0x1AA4 - 0x1AA8
   CHandle< C_CSWeaponBase > m_hSwitchToWeaponAfterThrow; // 0x1AA8 - 0x1AAC
   unsigned char pad_1AAC[0x14]; // 0x1AAC - 0x1AC0
}; // size - 0x1AC0


class C_PointEntity /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x548]; // 0x0 - 0x548
}; // size - 0x548


class CBaseConstraint /* "modellib" */ : public CBoneConstraintBase /* "modellib" */
{
public:
   CUtlString m_name; // 0x28 - 0x30
   Vector m_vUpVector; // 0x30 - 0x3C
   unsigned char pad_3C[0x4]; // 0x3C - 0x40
   CUtlVector< CConstraintSlave > m_slaves; // 0x40 - 0x58
   CUtlVector< CConstraintTarget > m_targets; // 0x58 - 0x70
}; // size - 0x70



class CPlayerControllerComponent /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30
   unsigned char pad_30[0x10]; // 0x30 - 0x40
}; // size - 0x40


class C_SoundOpvarSetPointBase /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   CUtlSymbolLarge m_iszStackName; // 0x548 - 0x550
   CUtlSymbolLarge m_iszOperatorName; // 0x550 - 0x558
   CUtlSymbolLarge m_iszOpvarName; // 0x558 - 0x560
   int32_t m_iOpvarIndex; // 0x560 - 0x564
   bool m_bUseAutoCompare; // 0x564 - 0x565
   unsigned char pad_565[0x3]; // 0x565 - 0x568
}; // size - 0x568


class C_CSPlayerPawnBase /* "client" */ : public C_BasePlayerPawn /* "client" */
{
public:
   unsigned char pad_1298[0x18]; // 0x1298 - 0x12B0
   CCSPlayer_PingServices* m_pPingServices; // 0x12B0 - 0x12B8
   CPlayer_ViewModelServices* m_pViewModelServices; // 0x12B8 - 0x12C0
   float32 m_fRenderingClipPlane[4]; // 0x12C0 - 0x12D0
   int32_t m_nLastClipPlaneSetupFrame; // 0x12D0 - 0x12D4
   Vector m_vecLastClipCameraPos; // 0x12D4 - 0x12E0
   Vector m_vecLastClipCameraForward; // 0x12E0 - 0x12EC
   bool m_bClipHitStaticWorld; // 0x12EC - 0x12ED
   bool m_bCachedPlaneIsValid; // 0x12ED - 0x12EE
   unsigned char pad_12EE[0x2]; // 0x12EE - 0x12F0
   C_CSWeaponBase* m_pClippingWeapon; // 0x12F0 - 0x12F8
   CSPlayerState m_previousPlayerState; // 0x12F8 - 0x12FC
   CSPlayerState m_iPlayerState; // 0x12FC - 0x1300
   bool m_bIsRescuing; // 0x1300 - 0x1301
   unsigned char pad_1301[0x3]; // 0x1301 - 0x1304
   GameTime_t m_fImmuneToGunGameDamageTime; // 0x1304 - 0x1308
   GameTime_t m_fImmuneToGunGameDamageTimeLast; // 0x1308 - 0x130C
   bool m_bGunGameImmunity; // 0x130C - 0x130D
   bool m_bHasMovedSinceSpawn; // 0x130D - 0x130E
   unsigned char pad_130E[0x2]; // 0x130E - 0x1310
   float m_fMolotovUseTime; // 0x1310 - 0x1314
   float m_fMolotovDamageTime; // 0x1314 - 0x1318
   int32_t m_iThrowGrenadeCounter; // 0x1318 - 0x131C
   GameTime_t m_flLastSpawnTimeIndex; // 0x131C - 0x1320
   int32_t m_iProgressBarDuration; // 0x1320 - 0x1324
   float m_flProgressBarStartTime; // 0x1324 - 0x1328
   Vector m_vecIntroStartEyePosition; // 0x1328 - 0x1334
   Vector m_vecIntroStartPlayerForward; // 0x1334 - 0x1340
   GameTime_t m_flClientDeathTime; // 0x1340 - 0x1344
   bool m_bScreenTearFrameCaptured; // 0x1344 - 0x1345
   unsigned char pad_1345[0x3]; // 0x1345 - 0x1348
   float m_flFlashBangTime; // 0x1348 - 0x134C
   float m_flFlashScreenshotAlpha; // 0x134C - 0x1350
   float m_flFlashOverlayAlpha; // 0x1350 - 0x1354
   bool m_bFlashBuildUp; // 0x1354 - 0x1355
   bool m_bFlashDspHasBeenCleared; // 0x1355 - 0x1356
   bool m_bFlashScreenshotHasBeenGrabbed; // 0x1356 - 0x1357
   unsigned char pad_1357[0x1]; // 0x1357 - 0x1358
   float m_flFlashMaxAlpha; // 0x1358 - 0x135C
   float m_flFlashDuration; // 0x135C - 0x1360
   int32_t m_iHealthBarRenderMaskIndex; // 0x1360 - 0x1364
   float m_flHealthFadeValue; // 0x1364 - 0x1368
   float m_flHealthFadeAlpha; // 0x1368 - 0x136C
   unsigned char pad_136C[0xC]; // 0x136C - 0x1378
   float m_flDeathCCWeight; // 0x1378 - 0x137C
   float m_flPrevRoundEndTime; // 0x137C - 0x1380
   float m_flPrevMatchEndTime; // 0x1380 - 0x1384
   unsigned char pad_1384[0x4]; // 0x1384 - 0x1388
   QAngle m_angEyeAngles; // 0x1388 - 0x1394
   unsigned char pad_1394[0xC]; // 0x1394 - 0x13A0
   float m_fNextThinkPushAway; // 0x13A0 - 0x13A4
   bool m_bShouldAutobuyDMWeapons; // 0x13A4 - 0x13A5
   bool m_bShouldAutobuyNow; // 0x13A5 - 0x13A6
   unsigned char pad_13A6[0x2]; // 0x13A6 - 0x13A8
   CEntityIndex m_iIDEntIndex; // 0x13A8 - 0x13AC
   unsigned char pad_13AC[0x4]; // 0x13AC - 0x13B0
   CountdownTimer m_delayTargetIDTimer; // 0x13B0 - 0x13C8
   CEntityIndex m_iTargetItemEntIdx; // 0x13C8 - 0x13CC
   CEntityIndex m_iOldIDEntIndex; // 0x13CC - 0x13D0
   CountdownTimer m_holdTargetIDTimer; // 0x13D0 - 0x13E8
   unsigned char pad_13E8[0x4]; // 0x13E8 - 0x13EC
   float m_flCurrentMusicStartTime; // 0x13EC - 0x13F0
   float m_flMusicRoundStartTime; // 0x13F0 - 0x13F4
   bool m_bDeferStartMusicOnWarmup; // 0x13F4 - 0x13F5
   unsigned char pad_13F5[0x3]; // 0x13F5 - 0x13F8
   int32_t m_cycleLatch; // 0x13F8 - 0x13FC
   float m_serverIntendedCycle; // 0x13FC - 0x1400
   float m_flLastSmokeOverlayAlpha; // 0x1400 - 0x1404
   float m_flLastSmokeAge; // 0x1404 - 0x1408
   Vector m_vLastSmokeOverlayColor; // 0x1408 - 0x1414
   ParticleIndex_t m_nPlayerSmokedFx; // 0x1414 - 0x1418
   ParticleIndex_t m_nPlayerInfernoBodyFx; // 0x1418 - 0x141C
   ParticleIndex_t m_nPlayerInfernoFootFx; // 0x141C - 0x1420
   float m_flNextMagDropTime; // 0x1420 - 0x1424
   int32_t m_nLastMagDropAttachmentIndex; // 0x1424 - 0x1428
   Vector m_vecLastAliveLocalVelocity; // 0x1428 - 0x1434
   unsigned char pad_1434[0x1C]; // 0x1434 - 0x1450
   bool m_bGuardianShouldSprayCustomXMark; // 0x1450 - 0x1451
   unsigned char pad_1451[0x7]; // 0x1451 - 0x1458
   CHandle< CCSPlayerController > m_hOriginalController; // 0x1458 - 0x145C
   unsigned char pad_145C[0x4]; // 0x145C - 0x1460
}; // size - 0x1460


class CConcreteAnimParameter /* "animgraphlib" */ : public CAnimParameterBase /* "animgraphlib" */
{
public:
   AnimParamButton_t m_previewButton; // 0x70 - 0x74
   AnimParamNetworkSetting m_eNetworkSetting; // 0x74 - 0x78
   bool m_bUseMostRecentValue; // 0x78 - 0x79
   bool m_bAutoReset; // 0x79 - 0x7A
   bool m_bGameWritable; // 0x7A - 0x7B
   bool m_bGraphWritable; // 0x7B - 0x7C
   unsigned char pad_7C[0x4]; // 0x7C - 0x80
}; // size - 0x80


class CMarkupVolume /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x710 - 0x711
   unsigned char pad_711[0x7]; // 0x711 - 0x718
}; // size - 0x718


class CSimpleSimTimer /* "server" */
{
public:
   GameTime_t m_next; // 0x0 - 0x4
   WorldGroupId_t m_nWorldGroupId; // 0x4 - 0x8
}; // size - 0x8


class CSosGroupActionSchema /* "soundsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlString m_name; // 0x8 - 0x10
   ActionType_t m_actionType; // 0x10 - 0x14
   ActionType_t m_actionInstanceType; // 0x14 - 0x18
}; // size - 0x18


class CBasePlatTrain /* "server" */ : public CBaseToggle /* "server" */
{
public:
   CUtlSymbolLarge m_NoiseMoving; // 0x790 - 0x798
   CUtlSymbolLarge m_NoiseArrived; // 0x798 - 0x7A0
   unsigned char pad_7A0[0x8]; // 0x7A0 - 0x7A8
   float m_volume; // 0x7A8 - 0x7AC
   float m_flTWidth; // 0x7AC - 0x7B0
   float m_flTLength; // 0x7B0 - 0x7B4
   unsigned char pad_7B4[0x4]; // 0x7B4 - 0x7B8
}; // size - 0x7B8


class CPulseCell_BaseValue /* "pulse_runtime_lib" */ : public CPulseCell_Base /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x48]; // 0x0 - 0x48
}; // size - 0x48


class CTriggerMultiple /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   CEntityIOOutput m_OnTrigger; // 0x8E0 - 0x908
}; // size - 0x908


class C_DynamicProp /* "client" */ : public C_BreakableProp /* "client" */
{
public:
   bool m_bUseHitboxesForRenderBox; // 0x1040 - 0x1041
   bool m_bUseAnimGraph; // 0x1041 - 0x1042
   unsigned char pad_1042[0x6]; // 0x1042 - 0x1048
   CEntityIOOutput m_pOutputAnimBegun; // 0x1048 - 0x1070
   CEntityIOOutput m_pOutputAnimOver; // 0x1070 - 0x1098
   CEntityIOOutput m_pOutputAnimLoopCycleOver; // 0x1098 - 0x10C0
   CEntityIOOutput m_OnAnimReachedStart; // 0x10C0 - 0x10E8
   CEntityIOOutput m_OnAnimReachedEnd; // 0x10E8 - 0x1110
   CUtlSymbolLarge m_iszIdleAnim; // 0x1110 - 0x1118
   AnimLoopMode_t m_nIdleAnimLoopMode; // 0x1118 - 0x111C
   bool m_bRandomizeCycle; // 0x111C - 0x111D
   bool m_bStartDisabled; // 0x111D - 0x111E
   bool m_bFiredStartEndOutput; // 0x111E - 0x111F
   bool m_bForceNpcExclude; // 0x111F - 0x1120
   bool m_bCreateNonSolid; // 0x1120 - 0x1121
   bool m_bIsOverrideProp; // 0x1121 - 0x1122
   unsigned char pad_1122[0x2]; // 0x1122 - 0x1124
   int32_t m_iInitialGlowState; // 0x1124 - 0x1128
   int32_t m_nGlowRange; // 0x1128 - 0x112C
   int32_t m_nGlowRangeMin; // 0x112C - 0x1130
   Color m_glowColor; // 0x1130 - 0x1134
   int32_t m_nGlowTeam; // 0x1134 - 0x1138
   int32_t m_iCachedFrameCount; // 0x1138 - 0x113C
   Vector m_vecCachedRenderMins; // 0x113C - 0x1148
   Vector m_vecCachedRenderMaxs; // 0x1148 - 0x1154
   unsigned char pad_1154[0x4]; // 0x1154 - 0x1158
}; // size - 0x1158


class CBaseCSGrenadeProjectile /* "server" */ : public CBaseGrenade /* "server" */
{
public:
   Vector m_vInitialPosition; // 0xA20 - 0xA2C
   Vector m_vInitialVelocity; // 0xA2C - 0xA38
   int32_t m_nBounces; // 0xA38 - 0xA3C
   unsigned char pad_A3C[0x4]; // 0xA3C - 0xA40
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_nExplodeEffectIndex; // 0xA40 - 0xA48
   int32_t m_nExplodeEffectTickBegin; // 0xA48 - 0xA4C
   Vector m_vecExplodeEffectOrigin; // 0xA4C - 0xA58
   GameTime_t m_flSpawnTime; // 0xA58 - 0xA5C
   uint8_t m_unOGSExtraFlags; // 0xA5C - 0xA5D
   bool m_bDetonationRecorded; // 0xA5D - 0xA5E
   uint16_t m_nItemIndex; // 0xA5E - 0xA60
   Vector m_vecOriginalSpawnLocation; // 0xA60 - 0xA6C
   GameTime_t m_flLastBounceSoundTime; // 0xA6C - 0xA70
   RotationVector m_vecGrenadeSpin; // 0xA70 - 0xA7C
   Vector m_vecLastHitSurfaceNormal; // 0xA7C - 0xA88
   int32_t m_nTicksAtZeroVelocity; // 0xA88 - 0xA8C
   bool m_bHasEverHitPlayer; // 0xA8C - 0xA8D
   bool m_bClearFromPlayers; // 0xA8D - 0xA8E
   unsigned char pad_A8E[0x2]; // 0xA8E - 0xA90
}; // size - 0xA90


class CEnvSoundscape /* "server" */ : public CServerOnlyEntity /* "server" */
{
public:
   CEntityIOOutput m_OnPlay; // 0x4C0 - 0x4E8
   float m_flRadius; // 0x4E8 - 0x4EC
   unsigned char pad_4EC[0x4]; // 0x4EC - 0x4F0
   CUtlSymbolLarge m_soundscapeName; // 0x4F0 - 0x4F8
   CUtlSymbolLarge m_soundEventName; // 0x4F8 - 0x500
   bool m_bOverrideWithEvent; // 0x500 - 0x501
   unsigned char pad_501[0x3]; // 0x501 - 0x504
   int32_t m_soundscapeIndex; // 0x504 - 0x508
   int32_t m_soundscapeEntityListId; // 0x508 - 0x50C
   uint32_t m_soundEventHash; // 0x50C - 0x510
   CUtlSymbolLarge m_positionNames[8]; // 0x510 - 0x550
   CHandle< CEnvSoundscape > m_hProxySoundscape; // 0x550 - 0x554
   bool m_bDisabled; // 0x554 - 0x555
   unsigned char pad_555[0x3]; // 0x555 - 0x558
}; // size - 0x558


class CModelPointEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_0[0x710]; // 0x0 - 0x710
}; // size - 0x710


class C_BaseCSGrenadeProjectile /* "client" */ : public C_BaseGrenade /* "client" */
{
public:
   Vector m_vInitialPosition; // 0x10B8 - 0x10C4
   Vector m_vInitialVelocity; // 0x10C4 - 0x10D0
   int32_t m_nBounces; // 0x10D0 - 0x10D4
   unsigned char pad_10D4[0x4]; // 0x10D4 - 0x10D8
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_nExplodeEffectIndex; // 0x10D8 - 0x10E0
   int32_t m_nExplodeEffectTickBegin; // 0x10E0 - 0x10E4
   Vector m_vecExplodeEffectOrigin; // 0x10E4 - 0x10F0
   GameTime_t m_flSpawnTime; // 0x10F0 - 0x10F4
   Vector vecLastTrailLinePos; // 0x10F4 - 0x1100
   GameTime_t flNextTrailLineTime; // 0x1100 - 0x1104
   bool m_bExplodeEffectBegan; // 0x1104 - 0x1105
   bool m_bCanCreateGrenadeTrail; // 0x1105 - 0x1106
   unsigned char pad_1106[0x2]; // 0x1106 - 0x1108
   ParticleIndex_t m_nSnapshotTrajectoryEffectIndex; // 0x1108 - 0x110C
   unsigned char pad_110C[0x4]; // 0x110C - 0x1110
   CStrongHandle< InfoForResourceTypeIParticleSnapshot > m_hSnapshotTrajectoryParticleSnapshot; // 0x1110 - 0x1118
   CUtlVector< Vector > m_arrTrajectoryTrailPoints; // 0x1118 - 0x1130
   CUtlVector< float32 > m_arrTrajectoryTrailPointCreationTimes; // 0x1130 - 0x1148
   float m_flTrajectoryTrailEffectCreationTime; // 0x1148 - 0x114C
   unsigned char pad_114C[0x4]; // 0x114C - 0x1150
}; // size - 0x1150


class C_BaseClientUIEntity /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_CC8[0x8]; // 0xCC8 - 0xCD0
   bool m_bEnabled; // 0xCD0 - 0xCD1
   unsigned char pad_CD1[0x7]; // 0xCD1 - 0xCD8
   CUtlSymbolLarge m_DialogXMLName; // 0xCD8 - 0xCE0
   CUtlSymbolLarge m_PanelClassName; // 0xCE0 - 0xCE8
   CUtlSymbolLarge m_PanelID; // 0xCE8 - 0xCF0
   unsigned char pad_CF0[0x8]; // 0xCF0 - 0xCF8
}; // size - 0xCF8


class C_CSGO_TeamPreviewCamera /* "client" */ : public C_CSGO_MapPreviewCameraPath /* "client" */
{
public:
   int32_t m_nVariant; // 0x5B0 - 0x5B4
   bool m_bDofEnabled; // 0x5B4 - 0x5B5
   unsigned char pad_5B5[0x3]; // 0x5B5 - 0x5B8
   float m_flDofNearBlurry; // 0x5B8 - 0x5BC
   float m_flDofNearCrisp; // 0x5BC - 0x5C0
   float m_flDofFarCrisp; // 0x5C0 - 0x5C4
   float m_flDofFarBlurry; // 0x5C4 - 0x5C8
   float m_flDofTiltToGround; // 0x5C8 - 0x5CC
   unsigned char pad_5CC[0x4]; // 0x5CC - 0x5D0
}; // size - 0x5D0


class MaterialParam_t /* "materialsystem2" */
{
public:
   CUtlString m_name; // 0x0 - 0x8
}; // size - 0x8


class CCSGO_TeamIntroCharacterPosition /* "server" */ : public CCSGO_TeamPreviewCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC48]; // 0x0 - 0xC48
}; // size - 0xC48


class CGameRules /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30
   char m_szQuestName[128]; // 0x30 - 0xB0
   int32_t m_nQuestPhase; // 0xB0 - 0xB4
   int32_t m_nTotalPausedTicks; // 0xB4 - 0xB8
   int32_t m_nPauseStartTick; // 0xB8 - 0xBC
   bool m_bGamePaused; // 0xBC - 0xBD
   unsigned char pad_BD[0x3]; // 0xBD - 0xC0
}; // size - 0xC0


class CPulseCell_Inflow_BaseEntrypoint /* "pulse_runtime_lib" */ : public CPulseCell_BaseFlow /* "pulse_runtime_lib" */
{
public:
   PulseRuntimeChunkIndex_t m_EntryChunk; // 0x48 - 0x4C
   unsigned char pad_4C[0x4]; // 0x4C - 0x50
   PulseRegisterMap_t m_RegisterMap; // 0x50 - 0x70
}; // size - 0x70


class CSoundEventEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bStartOnSpawn; // 0x4C0 - 0x4C1
   bool m_bToLocalPlayer; // 0x4C1 - 0x4C2
   bool m_bStopOnNew; // 0x4C2 - 0x4C3
   bool m_bSaveRestore; // 0x4C3 - 0x4C4
   bool m_bSavedIsPlaying; // 0x4C4 - 0x4C5
   unsigned char pad_4C5[0x3]; // 0x4C5 - 0x4C8
   float m_flSavedElapsedTime; // 0x4C8 - 0x4CC
   unsigned char pad_4CC[0x4]; // 0x4CC - 0x4D0
   CUtlSymbolLarge m_iszSourceEntityName; // 0x4D0 - 0x4D8
   CUtlSymbolLarge m_iszAttachmentName; // 0x4D8 - 0x4E0
   CEntityOutputTemplate< uint64 > m_onGUIDChanged; // 0x4E0 - 0x508
   CEntityIOOutput m_onSoundFinished; // 0x508 - 0x530
   unsigned char pad_530[0x28]; // 0x530 - 0x558
   CUtlSymbolLarge m_iszSoundName; // 0x558 - 0x560
   unsigned char pad_560[0x8]; // 0x560 - 0x568
   CEntityHandle m_hSource; // 0x568 - 0x56C
   int32_t m_nEntityIndexSelection; // 0x56C - 0x570
}; // size - 0x570


class C_CSGO_TeamIntroCharacterPosition /* "client" */ : public C_CSGO_TeamPreviewCharacterPosition /* "client" */
{
public:
   unsigned char pad_0[0x1278]; // 0x0 - 0x1278
}; // size - 0x1278


class CAnimationGraphVisualizerPrimitiveBase /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CAnimationGraphVisualizerPrimitiveType m_Type; // 0x8 - 0xC
   AnimNodeID m_OwningAnimNodePaths[11]; // 0xC - 0x38
   int32_t m_nOwningAnimNodePathCount; // 0x38 - 0x3C
   unsigned char pad_3C[0x4]; // 0x3C - 0x40
}; // size - 0x40


class CBodyComponent /* "server" */ : public CEntityComponent /* "server" */
{
public:
   CGameSceneNode* m_pSceneNode; // 0x8 - 0x10
   unsigned char pad_10[0x10]; // 0x10 - 0x20
   CNetworkVarChainer __m_pChainEntity; // 0x20 - 0x48
   unsigned char pad_48[0x8]; // 0x48 - 0x50
}; // size - 0x50


class CBodyComponent /* "client" */ : public CEntityComponent /* "client" */
{
public:
   CGameSceneNode* m_pSceneNode; // 0x8 - 0x10
   unsigned char pad_10[0x10]; // 0x10 - 0x20
   CNetworkVarChainer __m_pChainEntity; // 0x20 - 0x48
   unsigned char pad_48[0x8]; // 0x48 - 0x50
}; // size - 0x50


class CNmEvent /* "animlib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   float m_flStartTime; // 0x8 - 0xC
   float m_flDuration; // 0xC - 0x10
}; // size - 0x10


class CSoundOpvarSetPointEntity /* "server" */ : public CSoundOpvarSetPointBase /* "server" */
{
public:
   CEntityIOOutput m_OnEnter; // 0x558 - 0x580
   CEntityIOOutput m_OnExit; // 0x580 - 0x5A8
   bool m_bAutoDisable; // 0x5A8 - 0x5A9
   unsigned char pad_5A9[0x43]; // 0x5A9 - 0x5EC
   float m_flDistanceMin; // 0x5EC - 0x5F0
   float m_flDistanceMax; // 0x5F0 - 0x5F4
   float m_flDistanceMapMin; // 0x5F4 - 0x5F8
   float m_flDistanceMapMax; // 0x5F8 - 0x5FC
   float m_flOcclusionRadius; // 0x5FC - 0x600
   float m_flOcclusionMin; // 0x600 - 0x604
   float m_flOcclusionMax; // 0x604 - 0x608
   float m_flValSetOnDisable; // 0x608 - 0x60C
   bool m_bSetValueOnDisable; // 0x60C - 0x60D
   unsigned char pad_60D[0x3]; // 0x60D - 0x610
   int32_t m_nSimulationMode; // 0x610 - 0x614
   int32_t m_nVisibilitySamples; // 0x614 - 0x618
   Vector m_vDynamicProxyPoint; // 0x618 - 0x624
   float m_flDynamicMaximumOcclusion; // 0x624 - 0x628
   CEntityHandle m_hDynamicEntity; // 0x628 - 0x62C
   unsigned char pad_62C[0x4]; // 0x62C - 0x630
   CUtlSymbolLarge m_iszDynamicEntityName; // 0x630 - 0x638
   float m_flPathingDistanceNormFactor; // 0x638 - 0x63C
   Vector m_vPathingSourcePos; // 0x63C - 0x648
   Vector m_vPathingListenerPos; // 0x648 - 0x654
   Vector m_vPathingDirection; // 0x654 - 0x660
   int32_t m_nPathingSourceIndex; // 0x660 - 0x664
   unsigned char pad_664[0x4]; // 0x664 - 0x668
}; // size - 0x668


class C_INIT_RemapParticleCountToScalar /* "particles" */ : public CParticleFunctionInitializer /* "particles" */
{
public:
   ParticleAttributeIndex_t m_nFieldOutput; // 0x1C0 - 0x1C4
   int32_t m_nInputMin; // 0x1C4 - 0x1C8
   int32_t m_nInputMax; // 0x1C8 - 0x1CC
   int32_t m_nScaleControlPoint; // 0x1CC - 0x1D0
   int32_t m_nScaleControlPointField; // 0x1D0 - 0x1D4
   float m_flOutputMin; // 0x1D4 - 0x1D8
   float m_flOutputMax; // 0x1D8 - 0x1DC
   ParticleSetMethod_t m_nSetMethod; // 0x1DC - 0x1E0
   bool m_bActiveRange; // 0x1E0 - 0x1E1
   bool m_bInvert; // 0x1E1 - 0x1E2
   bool m_bWrap; // 0x1E2 - 0x1E3
   unsigned char pad_1E3[0x1]; // 0x1E3 - 0x1E4
   float m_flRemapBias; // 0x1E4 - 0x1E8
   unsigned char pad_1E8[0x8]; // 0x1E8 - 0x1F0
}; // size - 0x1F0


class C_SoundEventEntity /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x548]; // 0x0 - 0x548
}; // size - 0x548


class CAnimActionUpdater /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
}; // size - 0x18


class CAnimMotorUpdaterBase /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlString m_name; // 0x10 - 0x18
   bool m_bDefault; // 0x18 - 0x19
   unsigned char pad_19[0x7]; // 0x19 - 0x20
}; // size - 0x20


class CBaseRendererSource2 /* "particles" */ : public CParticleFunctionRenderer /* "particles" */
{
public:
   CParticleCollectionRendererFloatInput m_flRadiusScale; // 0x208 - 0x360
   CParticleCollectionRendererFloatInput m_flAlphaScale; // 0x360 - 0x4B8
   CParticleCollectionRendererFloatInput m_flRollScale; // 0x4B8 - 0x610
   ParticleAttributeIndex_t m_nAlpha2Field; // 0x610 - 0x614
   unsigned char pad_614[0x4]; // 0x614 - 0x618
   CParticleCollectionRendererVecInput m_vecColorScale; // 0x618 - 0xC70
   ParticleColorBlendType_t m_nColorBlendType; // 0xC70 - 0xC74
   SpriteCardShaderType_t m_nShaderType; // 0xC74 - 0xC78
   CUtlString m_strShaderOverride; // 0xC78 - 0xC80
   CParticleCollectionRendererFloatInput m_flCenterXOffset; // 0xC80 - 0xDD8
   CParticleCollectionRendererFloatInput m_flCenterYOffset; // 0xDD8 - 0xF30
   float m_flBumpStrength; // 0xF30 - 0xF34
   ParticleSequenceCropOverride_t m_nCropTextureOverride; // 0xF34 - 0xF38
   CUtlVector< TextureGroup_t > m_vecTexturesInput; // 0xF38 - 0xF50
   float m_flAnimationRate; // 0xF50 - 0xF54
   AnimationType_t m_nAnimationType; // 0xF54 - 0xF58
   bool m_bAnimateInFPS; // 0xF58 - 0xF59
   unsigned char pad_F59[0x7]; // 0xF59 - 0xF60
   CParticleCollectionRendererFloatInput m_flSelfIllumAmount; // 0xF60 - 0x10B8
   CParticleCollectionRendererFloatInput m_flDiffuseAmount; // 0x10B8 - 0x1210
   CParticleCollectionRendererFloatInput m_flDiffuseClamp; // 0x1210 - 0x1368
   int32_t m_nLightingControlPoint; // 0x1368 - 0x136C
   ParticleAttributeIndex_t m_nSelfIllumPerParticle; // 0x136C - 0x1370
   ParticleOutputBlendMode_t m_nOutputBlendMode; // 0x1370 - 0x1374
   bool m_bGammaCorrectVertexColors; // 0x1374 - 0x1375
   bool m_bSaturateColorPreAlphaBlend; // 0x1375 - 0x1376
   unsigned char pad_1376[0x2]; // 0x1376 - 0x1378
   CParticleCollectionRendererFloatInput m_flAddSelfAmount; // 0x1378 - 0x14D0
   CParticleCollectionRendererFloatInput m_flDesaturation; // 0x14D0 - 0x1628
   CParticleCollectionRendererFloatInput m_flOverbrightFactor; // 0x1628 - 0x1780
   int32_t m_nHSVShiftControlPoint; // 0x1780 - 0x1784
   ParticleFogType_t m_nFogType; // 0x1784 - 0x1788
   CParticleCollectionRendererFloatInput m_flFogAmount; // 0x1788 - 0x18E0
   bool m_bTintByFOW; // 0x18E0 - 0x18E1
   bool m_bTintByGlobalLight; // 0x18E1 - 0x18E2
   unsigned char pad_18E2[0x2]; // 0x18E2 - 0x18E4
   SpriteCardPerParticleScale_t m_nPerParticleAlphaReference; // 0x18E4 - 0x18E8
   SpriteCardPerParticleScale_t m_nPerParticleAlphaRefWindow; // 0x18E8 - 0x18EC
   ParticleAlphaReferenceType_t m_nAlphaReferenceType; // 0x18EC - 0x18F0
   CParticleCollectionRendererFloatInput m_flAlphaReferenceSoftness; // 0x18F0 - 0x1A48
   CParticleCollectionRendererFloatInput m_flSourceAlphaValueToMapToZero; // 0x1A48 - 0x1BA0
   CParticleCollectionRendererFloatInput m_flSourceAlphaValueToMapToOne; // 0x1BA0 - 0x1CF8
   bool m_bRefract; // 0x1CF8 - 0x1CF9
   bool m_bRefractSolid; // 0x1CF9 - 0x1CFA
   unsigned char pad_1CFA[0x6]; // 0x1CFA - 0x1D00
   CParticleCollectionRendererFloatInput m_flRefractAmount; // 0x1D00 - 0x1E58
   int32_t m_nRefractBlurRadius; // 0x1E58 - 0x1E5C
   BlurFilterType_t m_nRefractBlurType; // 0x1E5C - 0x1E60
   bool m_bOnlyRenderInEffectsBloomPass; // 0x1E60 - 0x1E61
   bool m_bOnlyRenderInEffectsWaterPass; // 0x1E61 - 0x1E62
   bool m_bUseMixedResolutionRendering; // 0x1E62 - 0x1E63
   bool m_bOnlyRenderInEffecsGameOverlay; // 0x1E63 - 0x1E64
   char m_stencilTestID[128]; // 0x1E64 - 0x1EE4
   bool m_bStencilTestExclude; // 0x1EE4 - 0x1EE5
   char m_stencilWriteID[128]; // 0x1EE5 - 0x1F65
   bool m_bWriteStencilOnDepthPass; // 0x1F65 - 0x1F66
   bool m_bWriteStencilOnDepthFail; // 0x1F66 - 0x1F67
   bool m_bReverseZBuffering; // 0x1F67 - 0x1F68
   bool m_bDisableZBuffering; // 0x1F68 - 0x1F69
   unsigned char pad_1F69[0x3]; // 0x1F69 - 0x1F6C
   ParticleDepthFeatheringMode_t m_nFeatheringMode; // 0x1F6C - 0x1F70
   CParticleCollectionRendererFloatInput m_flFeatheringMinDist; // 0x1F70 - 0x20C8
   CParticleCollectionRendererFloatInput m_flFeatheringMaxDist; // 0x20C8 - 0x2220
   CParticleCollectionRendererFloatInput m_flFeatheringFilter; // 0x2220 - 0x2378
   CParticleCollectionRendererFloatInput m_flDepthBias; // 0x2378 - 0x24D0
   ParticleSortingChoiceList_t m_nSortMethod; // 0x24D0 - 0x24D4
   bool m_bBlendFramesSeq0; // 0x24D4 - 0x24D5
   bool m_bMaxLuminanceBlendingSequence0; // 0x24D5 - 0x24D6
   unsigned char pad_24D6[0x242]; // 0x24D6 - 0x2718
}; // size - 0x2718


class CLightEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   CLightComponent* m_CLightComponent; // 0x710 - 0x718
}; // size - 0x718


class CMarkupVolumeTagged /* "server" */ : public CMarkupVolume /* "server" */
{
public:
   unsigned char pad_718[0x30]; // 0x718 - 0x748
   bool m_bIsGroup; // 0x748 - 0x749
   bool m_bGroupByPrefab; // 0x749 - 0x74A
   bool m_bGroupByVolume; // 0x74A - 0x74B
   bool m_bGroupOtherGroups; // 0x74B - 0x74C
   bool m_bIsInGroup; // 0x74C - 0x74D
   unsigned char pad_74D[0x3]; // 0x74D - 0x750
}; // size - 0x750


class CPlayer_CameraServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   QAngle m_vecCsViewPunchAngle; // 0x40 - 0x4C
   GameTick_t m_nCsViewPunchAngleTick; // 0x4C - 0x50
   float m_flCsViewPunchAngleTickRatio; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
   C_fogplayerparams_t m_PlayerFog; // 0x58 - 0x98
   CHandle< C_ColorCorrection > m_hColorCorrectionCtrl; // 0x98 - 0x9C
   CHandle< C_BaseEntity > m_hViewEntity; // 0x9C - 0xA0
   CHandle< C_TonemapController2 > m_hTonemapController; // 0xA0 - 0xA4
   unsigned char pad_A4[0x4]; // 0xA4 - 0xA8
   audioparams_t m_audio; // 0xA8 - 0x120
   C_NetworkUtlVectorBase< CHandle< C_PostProcessingVolume > > m_PostProcessingVolumes; // 0x120 - 0x138
   float m_flOldPlayerZ; // 0x138 - 0x13C
   float m_flOldPlayerViewOffsetZ; // 0x13C - 0x140
   fogparams_t m_CurrentFog; // 0x140 - 0x1A8
   CHandle< C_FogController > m_hOldFogController; // 0x1A8 - 0x1AC
   bool m_bOverrideFogColor[5]; // 0x1AC - 0x1B1
   Color m_OverrideFogColor[5]; // 0x1B1 - 0x1C5
   bool m_bOverrideFogStartEnd[5]; // 0x1C5 - 0x1CA
   unsigned char pad_1CA[0x2]; // 0x1CA - 0x1CC
   float32 m_fOverrideFogStart[5]; // 0x1CC - 0x1E0
   float32 m_fOverrideFogEnd[5]; // 0x1E0 - 0x1F4
   CHandle< C_PostProcessingVolume > m_hActivePostProcessingVolume; // 0x1F4 - 0x1F8
   QAngle m_angDemoViewAngles; // 0x1F8 - 0x204
   unsigned char pad_204[0xC]; // 0x204 - 0x210
}; // size - 0x210


class CPlayer_CameraServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   QAngle m_vecCsViewPunchAngle; // 0x40 - 0x4C
   GameTick_t m_nCsViewPunchAngleTick; // 0x4C - 0x50
   float m_flCsViewPunchAngleTickRatio; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
   fogplayerparams_t m_PlayerFog; // 0x58 - 0x98
   CHandle< CColorCorrection > m_hColorCorrectionCtrl; // 0x98 - 0x9C
   CHandle< CBaseEntity > m_hViewEntity; // 0x9C - 0xA0
   CHandle< CTonemapController2 > m_hTonemapController; // 0xA0 - 0xA4
   unsigned char pad_A4[0x4]; // 0xA4 - 0xA8
   audioparams_t m_audio; // 0xA8 - 0x120
   CNetworkUtlVectorBase< CHandle< CPostProcessingVolume > > m_PostProcessingVolumes; // 0x120 - 0x138
   float m_flOldPlayerZ; // 0x138 - 0x13C
   float m_flOldPlayerViewOffsetZ; // 0x13C - 0x140
   unsigned char pad_140[0x18]; // 0x140 - 0x158
   CUtlVector< CHandle< CEnvSoundscapeTriggerable > > m_hTriggerSoundscapeList; // 0x158 - 0x170
}; // size - 0x170


class CRulePointEntity /* "server" */ : public CRuleEntity /* "server" */
{
public:
   int32_t m_Score; // 0x718 - 0x71C
   unsigned char pad_71C[0x4]; // 0x71C - 0x720
}; // size - 0x720


class C_CSPlayerPawn /* "client" */ : public C_CSPlayerPawnBase /* "client" */
{
public:
   unsigned char pad_1460[0x8]; // 0x1460 - 0x1468
   CCSPlayer_BulletServices* m_pBulletServices; // 0x1468 - 0x1470
   CCSPlayer_HostageServices* m_pHostageServices; // 0x1470 - 0x1478
   CCSPlayer_BuyServices* m_pBuyServices; // 0x1478 - 0x1480
   CCSPlayer_GlowServices* m_pGlowServices; // 0x1480 - 0x1488
   CCSPlayer_ActionTrackingServices* m_pActionTrackingServices; // 0x1488 - 0x1490
   GameTime_t m_flHealthShotBoostExpirationTime; // 0x1490 - 0x1494
   GameTime_t m_flLastFiredWeaponTime; // 0x1494 - 0x1498
   bool m_bHasFemaleVoice; // 0x1498 - 0x1499
   unsigned char pad_1499[0x3]; // 0x1499 - 0x149C
   float m_flLandingTimeSeconds; // 0x149C - 0x14A0
   float m_flOldFallVelocity; // 0x14A0 - 0x14A4
   char m_szLastPlaceName[18]; // 0x14A4 - 0x14B6
   bool m_bPrevDefuser; // 0x14B6 - 0x14B7
   bool m_bPrevHelmet; // 0x14B7 - 0x14B8
   int32_t m_nPrevArmorVal; // 0x14B8 - 0x14BC
   int32_t m_nPrevGrenadeAmmoCount; // 0x14BC - 0x14C0
   uint32_t m_unPreviousWeaponHash; // 0x14C0 - 0x14C4
   uint32_t m_unWeaponHash; // 0x14C4 - 0x14C8
   bool m_bInBuyZone; // 0x14C8 - 0x14C9
   bool m_bPreviouslyInBuyZone; // 0x14C9 - 0x14CA
   unsigned char pad_14CA[0x2]; // 0x14CA - 0x14CC
   QAngle m_aimPunchAngle; // 0x14CC - 0x14D8
   QAngle m_aimPunchAngleVel; // 0x14D8 - 0x14E4
   int32_t m_aimPunchTickBase; // 0x14E4 - 0x14E8
   float m_aimPunchTickFraction; // 0x14E8 - 0x14EC
   unsigned char pad_14EC[0x4]; // 0x14EC - 0x14F0
   CUtlVector< QAngle > m_aimPunchCache; // 0x14F0 - 0x1508
   unsigned char pad_1508[0x8]; // 0x1508 - 0x1510
   bool m_bInLanding; // 0x1510 - 0x1511
   unsigned char pad_1511[0x3]; // 0x1511 - 0x1514
   float m_flLandingStartTime; // 0x1514 - 0x1518
   bool m_bInHostageRescueZone; // 0x1518 - 0x1519
   bool m_bInBombZone; // 0x1519 - 0x151A
   bool m_bIsBuyMenuOpen; // 0x151A - 0x151B
   unsigned char pad_151B[0x1]; // 0x151B - 0x151C
   GameTime_t m_flTimeOfLastInjury; // 0x151C - 0x1520
   GameTime_t m_flNextSprayDecalTime; // 0x1520 - 0x1524
   unsigned char pad_1524[0x11C]; // 0x1524 - 0x1640
   int32_t m_iRetakesOffering; // 0x1640 - 0x1644
   int32_t m_iRetakesOfferingCard; // 0x1644 - 0x1648
   bool m_bRetakesHasDefuseKit; // 0x1648 - 0x1649
   bool m_bRetakesMVPLastRound; // 0x1649 - 0x164A
   unsigned char pad_164A[0x2]; // 0x164A - 0x164C
   int32_t m_iRetakesMVPBoostItem; // 0x164C - 0x1650
   loadout_slot_t m_RetakesMVPBoostExtraUtility; // 0x1650 - 0x1654
   unsigned char pad_1654[0x1C]; // 0x1654 - 0x1670
   bool m_bNeedToReApplyGloves; // 0x1670 - 0x1671
   unsigned char pad_1671[0x7]; // 0x1671 - 0x1678
   C_EconItemView m_EconGloves; // 0x1678 - 0x1AC0
   uint8_t m_nEconGlovesChanged; // 0x1AC0 - 0x1AC1
   bool m_bMustSyncRagdollState; // 0x1AC1 - 0x1AC2
   unsigned char pad_1AC2[0x2]; // 0x1AC2 - 0x1AC4
   int32_t m_nRagdollDamageBone; // 0x1AC4 - 0x1AC8
   Vector m_vRagdollDamageForce; // 0x1AC8 - 0x1AD4
   Vector m_vRagdollDamagePosition; // 0x1AD4 - 0x1AE0
   char m_szRagdollDamageWeaponName[64]; // 0x1AE0 - 0x1B20
   bool m_bRagdollDamageHeadshot; // 0x1B20 - 0x1B21
   unsigned char pad_1B21[0x3]; // 0x1B21 - 0x1B24
   Vector m_vRagdollServerOrigin; // 0x1B24 - 0x1B30
   unsigned char pad_1B30[0x608]; // 0x1B30 - 0x2138
   bool m_bLastHeadBoneTransformIsValid; // 0x2138 - 0x2139
   unsigned char pad_2139[0x3]; // 0x2139 - 0x213C
   GameTime_t m_lastLandTime; // 0x213C - 0x2140
   bool m_bOnGroundLastTick; // 0x2140 - 0x2141
   unsigned char pad_2141[0x1B]; // 0x2141 - 0x215C
   QAngle m_qDeathEyeAngles; // 0x215C - 0x2168
   bool m_bSkipOneHeadConstraintUpdate; // 0x2168 - 0x2169
   bool m_bLeftHanded; // 0x2169 - 0x216A
   unsigned char pad_216A[0x2]; // 0x216A - 0x216C
   GameTime_t m_fSwitchedHandednessTime; // 0x216C - 0x2170
   float m_flViewmodelOffsetX; // 0x2170 - 0x2174
   float m_flViewmodelOffsetY; // 0x2174 - 0x2178
   float m_flViewmodelOffsetZ; // 0x2178 - 0x217C
   float m_flViewmodelFOV; // 0x217C - 0x2180
   uint32 m_vecPlayerPatchEconIndices[5]; // 0x2180 - 0x2194
   unsigned char pad_2194[0x24]; // 0x2194 - 0x21B8
   Color m_GunGameImmunityColor; // 0x21B8 - 0x21BC
   unsigned char pad_21BC[0x4C]; // 0x21BC - 0x2208
   CUtlVector< C_BulletHitModel* > m_vecBulletHitModels; // 0x2208 - 0x2220
   bool m_bIsWalking; // 0x2220 - 0x2221
   unsigned char pad_2221[0x7]; // 0x2221 - 0x2228
   QAngle m_thirdPersonHeading; // 0x2228 - 0x2234
   unsigned char pad_2234[0xC]; // 0x2234 - 0x2240
   float m_flSlopeDropOffset; // 0x2240 - 0x2244
   unsigned char pad_2244[0xC]; // 0x2244 - 0x2250
   float m_flSlopeDropHeight; // 0x2250 - 0x2254
   unsigned char pad_2254[0xC]; // 0x2254 - 0x2260
   Vector m_vHeadConstraintOffset; // 0x2260 - 0x226C
   unsigned char pad_226C[0xC]; // 0x226C - 0x2278
   EntitySpottedState_t m_entitySpottedState; // 0x2278 - 0x2290
   bool m_bIsScoped; // 0x2290 - 0x2291
   bool m_bResumeZoom; // 0x2291 - 0x2292
   bool m_bIsDefusing; // 0x2292 - 0x2293
   bool m_bIsGrabbingHostage; // 0x2293 - 0x2294
   CSPlayerBlockingUseAction_t m_iBlockingUseActionInProgress; // 0x2294 - 0x2298
   GameTime_t m_flEmitSoundTime; // 0x2298 - 0x229C
   bool m_bInNoDefuseArea; // 0x229C - 0x229D
   unsigned char pad_229D[0x3]; // 0x229D - 0x22A0
   int32_t m_nWhichBombZone; // 0x22A0 - 0x22A4
   int32_t m_iShotsFired; // 0x22A4 - 0x22A8
   float m_flVelocityModifier; // 0x22A8 - 0x22AC
   float m_flHitHeading; // 0x22AC - 0x22B0
   int32_t m_nHitBodyPart; // 0x22B0 - 0x22B4
   bool m_bWaitForNoAttack; // 0x22B4 - 0x22B5
   unsigned char pad_22B5[0x3]; // 0x22B5 - 0x22B8
   float m_ignoreLadderJumpTime; // 0x22B8 - 0x22BC
   unsigned char pad_22BC[0x1]; // 0x22BC - 0x22BD
   bool m_bKilledByHeadshot; // 0x22BD - 0x22BE
   unsigned char pad_22BE[0x2]; // 0x22BE - 0x22C0
   int32_t m_ArmorValue; // 0x22C0 - 0x22C4
   uint16_t m_unCurrentEquipmentValue; // 0x22C4 - 0x22C6
   uint16_t m_unRoundStartEquipmentValue; // 0x22C6 - 0x22C8
   uint16_t m_unFreezetimeEndEquipmentValue; // 0x22C8 - 0x22CA
   unsigned char pad_22CA[0x2]; // 0x22CA - 0x22CC
   CEntityIndex m_nLastKillerIndex; // 0x22CC - 0x22D0
   bool m_bOldIsScoped; // 0x22D0 - 0x22D1
   bool m_bHasDeathInfo; // 0x22D1 - 0x22D2
   unsigned char pad_22D2[0x2]; // 0x22D2 - 0x22D4
   float m_flDeathInfoTime; // 0x22D4 - 0x22D8
   Vector m_vecDeathInfoOrigin; // 0x22D8 - 0x22E4
   GameTime_t m_grenadeParameterStashTime; // 0x22E4 - 0x22E8
   bool m_bGrenadeParametersStashed; // 0x22E8 - 0x22E9
   unsigned char pad_22E9[0x3]; // 0x22E9 - 0x22EC
   QAngle m_angStashedShootAngles; // 0x22EC - 0x22F8
   Vector m_vecStashedGrenadeThrowPosition; // 0x22F8 - 0x2304
   Vector m_vecStashedVelocity; // 0x2304 - 0x2310
   QAngle m_angShootAngleHistory[2]; // 0x2310 - 0x2328
   Vector m_vecThrowPositionHistory[2]; // 0x2328 - 0x2340
   Vector m_vecVelocityHistory[2]; // 0x2340 - 0x2358
}; // size - 0x2358


class C_GameRules /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30
   int32_t m_nTotalPausedTicks; // 0x30 - 0x34
   int32_t m_nPauseStartTick; // 0x34 - 0x38
   bool m_bGamePaused; // 0x38 - 0x39
   unsigned char pad_39[0x7]; // 0x39 - 0x40
}; // size - 0x40


class C_LightEntity /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   CLightComponent* m_CLightComponent; // 0xCC8 - 0xCD0
}; // size - 0xCD0


class C_SoundOpvarSetPointEntity /* "client" */ : public C_SoundOpvarSetPointBase /* "client" */
{
public:
   unsigned char pad_0[0x568]; // 0x0 - 0x568
}; // size - 0x568


class CAnimGraphControllerBase /* "server" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
}; // size - 0x18


class CBaseClientUIEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bEnabled; // 0x710 - 0x711
   unsigned char pad_711[0x7]; // 0x711 - 0x718
   CUtlSymbolLarge m_DialogXMLName; // 0x718 - 0x720
   CUtlSymbolLarge m_PanelClassName; // 0x720 - 0x728
   CUtlSymbolLarge m_PanelID; // 0x728 - 0x730
   CEntityIOOutput m_CustomOutput0; // 0x730 - 0x758
   CEntityIOOutput m_CustomOutput1; // 0x758 - 0x780
   CEntityIOOutput m_CustomOutput2; // 0x780 - 0x7A8
   CEntityIOOutput m_CustomOutput3; // 0x7A8 - 0x7D0
   CEntityIOOutput m_CustomOutput4; // 0x7D0 - 0x7F8
   CEntityIOOutput m_CustomOutput5; // 0x7F8 - 0x820
   CEntityIOOutput m_CustomOutput6; // 0x820 - 0x848
   CEntityIOOutput m_CustomOutput7; // 0x848 - 0x870
   CEntityIOOutput m_CustomOutput8; // 0x870 - 0x898
   CEntityIOOutput m_CustomOutput9; // 0x898 - 0x8C0
}; // size - 0x8C0


class CParticleFloatInput /* "particleslib" */ : public CParticleInput /* "particleslib" */
{
public:
   ParticleFloatType_t m_nType; // 0x10 - 0x14
   ParticleFloatMapType_t m_nMapType; // 0x14 - 0x18
   float m_flLiteralValue; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
   CParticleNamedValueRef m_NamedValue; // 0x20 - 0x60
   int32_t m_nControlPoint; // 0x60 - 0x64
   ParticleAttributeIndex_t m_nScalarAttribute; // 0x64 - 0x68
   ParticleAttributeIndex_t m_nVectorAttribute; // 0x68 - 0x6C
   int32_t m_nVectorComponent; // 0x6C - 0x70
   float m_flRandomMin; // 0x70 - 0x74
   float m_flRandomMax; // 0x74 - 0x78
   bool m_bHasRandomSignFlip; // 0x78 - 0x79
   unsigned char pad_79[0x3]; // 0x79 - 0x7C
   int32_t m_nRandomSeed; // 0x7C - 0x80
   ParticleFloatRandomMode_t m_nRandomMode; // 0x80 - 0x84
   unsigned char pad_84[0x4]; // 0x84 - 0x88
   float m_flLOD0; // 0x88 - 0x8C
   float m_flLOD1; // 0x8C - 0x90
   float m_flLOD2; // 0x90 - 0x94
   float m_flLOD3; // 0x94 - 0x98
   ParticleAttributeIndex_t m_nNoiseInputVectorAttribute; // 0x98 - 0x9C
   float m_flNoiseOutputMin; // 0x9C - 0xA0
   float m_flNoiseOutputMax; // 0xA0 - 0xA4
   float m_flNoiseScale; // 0xA4 - 0xA8
   Vector m_vecNoiseOffsetRate; // 0xA8 - 0xB4
   float m_flNoiseOffset; // 0xB4 - 0xB8
   int32_t m_nNoiseOctaves; // 0xB8 - 0xBC
   PFNoiseTurbulence_t m_nNoiseTurbulence; // 0xBC - 0xC0
   PFNoiseType_t m_nNoiseType; // 0xC0 - 0xC4
   PFNoiseModifier_t m_nNoiseModifier; // 0xC4 - 0xC8
   float m_flNoiseTurbulenceScale; // 0xC8 - 0xCC
   float m_flNoiseTurbulenceMix; // 0xCC - 0xD0
   float m_flNoiseImgPreviewScale; // 0xD0 - 0xD4
   bool m_bNoiseImgPreviewLive; // 0xD4 - 0xD5
   unsigned char pad_D5[0xB]; // 0xD5 - 0xE0
   float m_flNoCameraFallback; // 0xE0 - 0xE4
   bool m_bUseBoundsCenter; // 0xE4 - 0xE5
   unsigned char pad_E5[0x3]; // 0xE5 - 0xE8
   ParticleFloatInputMode_t m_nInputMode; // 0xE8 - 0xEC
   float m_flMultFactor; // 0xEC - 0xF0
   float m_flInput0; // 0xF0 - 0xF4
   float m_flInput1; // 0xF4 - 0xF8
   float m_flOutput0; // 0xF8 - 0xFC
   float m_flOutput1; // 0xFC - 0x100
   float m_flNotchedRangeMin; // 0x100 - 0x104
   float m_flNotchedRangeMax; // 0x104 - 0x108
   float m_flNotchedOutputOutside; // 0x108 - 0x10C
   float m_flNotchedOutputInside; // 0x10C - 0x110
   ParticleFloatBiasType_t m_nBiasType; // 0x110 - 0x114
   float m_flBiasParameter; // 0x114 - 0x118
   CPiecewiseCurve m_Curve; // 0x118 - 0x158
}; // size - 0x158


class CParticleFunctionEmitter /* "particles" */ : public CParticleFunction /* "particles" */
{
public:
   int32_t m_nEmitterIndex; // 0x1B8 - 0x1BC
   unsigned char pad_1BC[0x4]; // 0x1BC - 0x1C0
}; // size - 0x1C0


class CParticleVecInput /* "particleslib" */ : public CParticleInput /* "particleslib" */
{
public:
   ParticleVecType_t m_nType; // 0x10 - 0x14
   Vector m_vLiteralValue; // 0x14 - 0x20
   Color m_LiteralColor; // 0x20 - 0x24
   unsigned char pad_24[0x4]; // 0x24 - 0x28
   CParticleNamedValueRef m_NamedValue; // 0x28 - 0x68
   bool m_bFollowNamedValue; // 0x68 - 0x69
   unsigned char pad_69[0x3]; // 0x69 - 0x6C
   ParticleAttributeIndex_t m_nVectorAttribute; // 0x6C - 0x70
   Vector m_vVectorAttributeScale; // 0x70 - 0x7C
   int32_t m_nControlPoint; // 0x7C - 0x80
   int32_t m_nDeltaControlPoint; // 0x80 - 0x84
   Vector m_vCPValueScale; // 0x84 - 0x90
   Vector m_vCPRelativePosition; // 0x90 - 0x9C
   Vector m_vCPRelativeDir; // 0x9C - 0xA8
   CParticleFloatInput m_FloatComponentX; // 0xA8 - 0x200
   CParticleFloatInput m_FloatComponentY; // 0x200 - 0x358
   CParticleFloatInput m_FloatComponentZ; // 0x358 - 0x4B0
   CParticleFloatInput m_FloatInterp; // 0x4B0 - 0x608
   float m_flInterpInput0; // 0x608 - 0x60C
   float m_flInterpInput1; // 0x60C - 0x610
   Vector m_vInterpOutput0; // 0x610 - 0x61C
   Vector m_vInterpOutput1; // 0x61C - 0x628
   CColorGradient m_Gradient; // 0x628 - 0x640
   Vector m_vRandomMin; // 0x640 - 0x64C
   Vector m_vRandomMax; // 0x64C - 0x658
}; // size - 0x658


class CPhysicsProp /* "server" */ : public CBreakableProp /* "server" */
{
public:
   unsigned char pad_A80[0x8]; // 0xA80 - 0xA88
   CEntityIOOutput m_MotionEnabled; // 0xA88 - 0xAB0
   CEntityIOOutput m_OnAwakened; // 0xAB0 - 0xAD8
   CEntityIOOutput m_OnAwake; // 0xAD8 - 0xB00
   CEntityIOOutput m_OnAsleep; // 0xB00 - 0xB28
   CEntityIOOutput m_OnPlayerUse; // 0xB28 - 0xB50
   CEntityIOOutput m_OnOutOfWorld; // 0xB50 - 0xB78
   CEntityIOOutput m_OnPlayerPickup; // 0xB78 - 0xBA0
   bool m_bForceNavIgnore; // 0xBA0 - 0xBA1
   bool m_bNoNavmeshBlocker; // 0xBA1 - 0xBA2
   bool m_bForceNpcExclude; // 0xBA2 - 0xBA3
   unsigned char pad_BA3[0x1]; // 0xBA3 - 0xBA4
   float m_massScale; // 0xBA4 - 0xBA8
   float m_inertiaScale; // 0xBA8 - 0xBAC
   float m_buoyancyScale; // 0xBAC - 0xBB0
   int32_t m_damageType; // 0xBB0 - 0xBB4
   int32_t m_damageToEnableMotion; // 0xBB4 - 0xBB8
   float m_flForceToEnableMotion; // 0xBB8 - 0xBBC
   bool m_bThrownByPlayer; // 0xBBC - 0xBBD
   bool m_bDroppedByPlayer; // 0xBBD - 0xBBE
   bool m_bTouchedByPlayer; // 0xBBE - 0xBBF
   bool m_bFirstCollisionAfterLaunch; // 0xBBF - 0xBC0
   int32_t m_iExploitableByPlayer; // 0xBC0 - 0xBC4
   bool m_bHasBeenAwakened; // 0xBC4 - 0xBC5
   bool m_bIsOverrideProp; // 0xBC5 - 0xBC6
   unsigned char pad_BC6[0x2]; // 0xBC6 - 0xBC8
   GameTime_t m_fNextCheckDisableMotionContactsTime; // 0xBC8 - 0xBCC
   int32_t m_iInitialGlowState; // 0xBCC - 0xBD0
   int32_t m_nGlowRange; // 0xBD0 - 0xBD4
   int32_t m_nGlowRangeMin; // 0xBD4 - 0xBD8
   Color m_glowColor; // 0xBD8 - 0xBDC
   bool m_bShouldAutoConvertBackFromDebris; // 0xBDC - 0xBDD
   bool m_bMuteImpactEffects; // 0xBDD - 0xBDE
   unsigned char pad_BDE[0x6]; // 0xBDE - 0xBE4
   bool m_bAcceptDamageFromHeldObjects; // 0xBE4 - 0xBE5
   bool m_bEnableUseOutput; // 0xBE5 - 0xBE6
   bool m_bAwake; // 0xBE6 - 0xBE7
   unsigned char pad_BE7[0x1]; // 0xBE7 - 0xBE8
}; // size - 0xBE8


class CSprite /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hSpriteMaterial; // 0x710 - 0x718
   CHandle< CBaseEntity > m_hAttachedToEntity; // 0x718 - 0x71C
   AttachmentHandle_t m_nAttachment; // 0x71C - 0x71D
   unsigned char pad_71D[0x3]; // 0x71D - 0x720
   float m_flSpriteFramerate; // 0x720 - 0x724
   float m_flFrame; // 0x724 - 0x728
   GameTime_t m_flDieTime; // 0x728 - 0x72C
   unsigned char pad_72C[0xC]; // 0x72C - 0x738
   uint32_t m_nBrightness; // 0x738 - 0x73C
   float m_flBrightnessDuration; // 0x73C - 0x740
   float m_flSpriteScale; // 0x740 - 0x744
   float m_flScaleDuration; // 0x744 - 0x748
   bool m_bWorldSpaceScale; // 0x748 - 0x749
   unsigned char pad_749[0x3]; // 0x749 - 0x74C
   float m_flGlowProxySize; // 0x74C - 0x750
   float m_flHDRColorScale; // 0x750 - 0x754
   GameTime_t m_flLastTime; // 0x754 - 0x758
   float m_flMaxFrame; // 0x758 - 0x75C
   float m_flStartScale; // 0x75C - 0x760
   float m_flDestScale; // 0x760 - 0x764
   GameTime_t m_flScaleTimeStart; // 0x764 - 0x768
   int32_t m_nStartBrightness; // 0x768 - 0x76C
   int32_t m_nDestBrightness; // 0x76C - 0x770
   GameTime_t m_flBrightnessTimeStart; // 0x770 - 0x774
   int32_t m_nSpriteWidth; // 0x774 - 0x778
   int32_t m_nSpriteHeight; // 0x778 - 0x77C
   unsigned char pad_77C[0x4]; // 0x77C - 0x780
}; // size - 0x780


class RnShapeDesc_t /* "physicslib" */
{
public:
   uint32_t m_nCollisionAttributeIndex; // 0x0 - 0x4
   uint32_t m_nSurfacePropertyIndex; // 0x4 - 0x8
   CUtlString m_UserFriendlyName; // 0x8 - 0x10
}; // size - 0x10


class CBaseButton /* "server" */ : public CBaseToggle /* "server" */
{
public:
   QAngle m_angMoveEntitySpace; // 0x790 - 0x79C
   bool m_fStayPushed; // 0x79C - 0x79D
   bool m_fRotating; // 0x79D - 0x79E
   unsigned char pad_79E[0x2]; // 0x79E - 0x7A0
   locksound_t m_ls; // 0x7A0 - 0x7C0
   CUtlSymbolLarge m_sUseSound; // 0x7C0 - 0x7C8
   CUtlSymbolLarge m_sLockedSound; // 0x7C8 - 0x7D0
   CUtlSymbolLarge m_sUnlockedSound; // 0x7D0 - 0x7D8
   CUtlSymbolLarge m_sOverrideAnticipationName; // 0x7D8 - 0x7E0
   bool m_bLocked; // 0x7E0 - 0x7E1
   bool m_bDisabled; // 0x7E1 - 0x7E2
   unsigned char pad_7E2[0x2]; // 0x7E2 - 0x7E4
   GameTime_t m_flUseLockedTime; // 0x7E4 - 0x7E8
   bool m_bSolidBsp; // 0x7E8 - 0x7E9
   unsigned char pad_7E9[0x7]; // 0x7E9 - 0x7F0
   CEntityIOOutput m_OnDamaged; // 0x7F0 - 0x818
   CEntityIOOutput m_OnPressed; // 0x818 - 0x840
   CEntityIOOutput m_OnUseLocked; // 0x840 - 0x868
   CEntityIOOutput m_OnIn; // 0x868 - 0x890
   CEntityIOOutput m_OnOut; // 0x890 - 0x8B8
   int32_t m_nState; // 0x8B8 - 0x8BC
   CEntityHandle m_hConstraint; // 0x8BC - 0x8C0
   CEntityHandle m_hConstraintParent; // 0x8C0 - 0x8C4
   bool m_bForceNpcExclude; // 0x8C4 - 0x8C5
   unsigned char pad_8C5[0x3]; // 0x8C5 - 0x8C8
   CUtlSymbolLarge m_sGlowEntity; // 0x8C8 - 0x8D0
   CHandle< CBaseModelEntity > m_glowEntity; // 0x8D0 - 0x8D4
   bool m_usable; // 0x8D4 - 0x8D5
   unsigned char pad_8D5[0x3]; // 0x8D5 - 0x8D8
   CUtlSymbolLarge m_szDisplayText; // 0x8D8 - 0x8E0
}; // size - 0x8E0


class CBasePlayerPawn /* "server" */ : public CBaseCombatCharacter /* "server" */
{
public:
   CPlayer_WeaponServices* m_pWeaponServices; // 0xA08 - 0xA10
   CPlayer_ItemServices* m_pItemServices; // 0xA10 - 0xA18
   CPlayer_AutoaimServices* m_pAutoaimServices; // 0xA18 - 0xA20
   CPlayer_ObserverServices* m_pObserverServices; // 0xA20 - 0xA28
   CPlayer_WaterServices* m_pWaterServices; // 0xA28 - 0xA30
   CPlayer_UseServices* m_pUseServices; // 0xA30 - 0xA38
   CPlayer_FlashlightServices* m_pFlashlightServices; // 0xA38 - 0xA40
   CPlayer_CameraServices* m_pCameraServices; // 0xA40 - 0xA48
   CPlayer_MovementServices* m_pMovementServices; // 0xA48 - 0xA50
   unsigned char pad_A50[0x8]; // 0xA50 - 0xA58
   CUtlVectorEmbeddedNetworkVar< ViewAngleServerChange_t > m_ServerViewAngleChanges; // 0xA58 - 0xAA8
   uint32_t m_nHighestGeneratedServerViewAngleChangeIndex; // 0xAA8 - 0xAAC
   QAngle v_angle; // 0xAAC - 0xAB8
   QAngle v_anglePrevious; // 0xAB8 - 0xAC4
   uint32_t m_iHideHUD; // 0xAC4 - 0xAC8
   sky3dparams_t m_skybox3d; // 0xAC8 - 0xB58
   GameTime_t m_fTimeLastHurt; // 0xB58 - 0xB5C
   GameTime_t m_flDeathTime; // 0xB5C - 0xB60
   GameTime_t m_fNextSuicideTime; // 0xB60 - 0xB64
   bool m_fInitHUD; // 0xB64 - 0xB65
   unsigned char pad_B65[0x3]; // 0xB65 - 0xB68
   CAI_Expresser* m_pExpresser; // 0xB68 - 0xB70
   CHandle< CBasePlayerController > m_hController; // 0xB70 - 0xB74
   unsigned char pad_B74[0x4]; // 0xB74 - 0xB78
   float m_fHltvReplayDelay; // 0xB78 - 0xB7C
   float m_fHltvReplayEnd; // 0xB7C - 0xB80
   CEntityIndex m_iHltvReplayEntity; // 0xB80 - 0xB84
   unsigned char pad_B84[0x4]; // 0xB84 - 0xB88
   CUtlVector< sndopvarlatchdata_t > m_sndOpvarLatchData; // 0xB88 - 0xBA0
}; // size - 0xBA0


class CFuncPlat /* "server" */ : public CBasePlatTrain /* "server" */
{
public:
   CUtlSymbolLarge m_sNoise; // 0x7B8 - 0x7C0
}; // size - 0x7C0


class CGeneralRandomRotation /* "particles" */ : public CParticleFunctionInitializer /* "particles" */
{
public:
   ParticleAttributeIndex_t m_nFieldOutput; // 0x1C0 - 0x1C4
   float m_flDegrees; // 0x1C4 - 0x1C8
   float m_flDegreesMin; // 0x1C8 - 0x1CC
   float m_flDegreesMax; // 0x1CC - 0x1D0
   float m_flRotationRandExponent; // 0x1D0 - 0x1D4
   bool m_bRandomlyFlipDirection; // 0x1D4 - 0x1D5
   unsigned char pad_1D5[0xB]; // 0x1D5 - 0x1E0
}; // size - 0x1E0


class CPulse_OutflowConnection /* "pulse_runtime_lib" */
{
public:
   CUtlSymbolLarge m_SourceOutflowName; // 0x0 - 0x8
   PulseRuntimeChunkIndex_t m_nDestChunk; // 0x8 - 0xC
   int32_t m_nInstruction; // 0xC - 0x10
   PulseRegisterMap_t m_OutflowRegisterMap; // 0x10 - 0x30
}; // size - 0x30


class C_INIT_RandomNamedModelElement /* "particles" */ : public CParticleFunctionInitializer /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1C0 - 0x1C8
   CUtlVector< CUtlString > m_names; // 0x1C8 - 0x1E0
   bool m_bShuffle; // 0x1E0 - 0x1E1
   bool m_bLinear; // 0x1E1 - 0x1E2
   bool m_bModelFromRenderer; // 0x1E2 - 0x1E3
   unsigned char pad_1E3[0x1]; // 0x1E3 - 0x1E4
   ParticleAttributeIndex_t m_nFieldOutput; // 0x1E4 - 0x1E8
}; // size - 0x1E8


class ISkeletonAnimationController /* "server" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class CBaseViewModel /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   unsigned char pad_8E8[0x8]; // 0x8E8 - 0x8F0
   Vector m_vecLastFacing; // 0x8F0 - 0x8FC
   uint32_t m_nViewModelIndex; // 0x8FC - 0x900
   uint32_t m_nAnimationParity; // 0x900 - 0x904
   float m_flAnimationStartTime; // 0x904 - 0x908
   CHandle< CBasePlayerWeapon > m_hWeapon; // 0x908 - 0x90C
   unsigned char pad_90C[0x4]; // 0x90C - 0x910
   CUtlSymbolLarge m_sVMName; // 0x910 - 0x918
   CUtlSymbolLarge m_sAnimationPrefix; // 0x918 - 0x920
   HSequence m_hOldLayerSequence; // 0x920 - 0x924
   int32_t m_oldLayer; // 0x924 - 0x928
   float m_oldLayerStartTime; // 0x928 - 0x92C
   CHandle< CBaseEntity > m_hControlPanel; // 0x92C - 0x930
}; // size - 0x930


class CBinaryUpdateNode /* "animgraphlib" */ : public CAnimUpdateNodeBase /* "animgraphlib" */
{
public:
   CAnimUpdateNodeRef m_pChild1; // 0x58 - 0x68
   CAnimUpdateNodeRef m_pChild2; // 0x68 - 0x78
   BinaryNodeTiming m_timingBehavior; // 0x78 - 0x7C
   float m_flTimingBlend; // 0x7C - 0x80
   bool m_bResetChild1; // 0x80 - 0x81
   bool m_bResetChild2; // 0x81 - 0x82
   unsigned char pad_82[0x6]; // 0x82 - 0x88
}; // size - 0x88


class CCSGameModeRules /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30
   unsigned char pad_30[0x8]; // 0x30 - 0x38
}; // size - 0x38


class CCSGameModeRules /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30
   unsigned char pad_30[0x8]; // 0x30 - 0x38
}; // size - 0x38


class CGlowOverlay /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   Vector m_vPos; // 0x8 - 0x14
   bool m_bDirectional; // 0x14 - 0x15
   unsigned char pad_15[0x3]; // 0x15 - 0x18
   Vector m_vDirection; // 0x18 - 0x24
   bool m_bInSky; // 0x24 - 0x25
   unsigned char pad_25[0x3]; // 0x25 - 0x28
   float m_skyObstructionScale; // 0x28 - 0x2C
   unsigned char pad_2C[0x4]; // 0x2C - 0x30
   CGlowSprite m_Sprites[4]; // 0x30 - 0xB0
   int32_t m_nSprites; // 0xB0 - 0xB4
   float m_flProxyRadius; // 0xB4 - 0xB8
   float m_flHDRColorScale; // 0xB8 - 0xBC
   float m_flGlowObstructionScale; // 0xBC - 0xC0
   bool m_bCacheGlowObstruction; // 0xC0 - 0xC1
   bool m_bCacheSkyObstruction; // 0xC1 - 0xC2
   int16_t m_bActivated; // 0xC2 - 0xC4
   uint16_t m_ListIndex; // 0xC4 - 0xC6
   unsigned char pad_C6[0x2]; // 0xC6 - 0xC8
   int32_t m_queryHandle; // 0xC8 - 0xCC
   unsigned char pad_CC[0x4]; // 0xCC - 0xD0
}; // size - 0xD0


class CHostageExpresserShim /* "server" */ : public CBaseCombatCharacter /* "server" */
{
public:
   CAI_Expresser* m_pExpresser; // 0xA08 - 0xA10
}; // size - 0xA10


class CMultiplayRules /* "server" */ : public CGameRules /* "server" */
{
public:
   unsigned char pad_0[0xC0]; // 0x0 - 0xC0
}; // size - 0xC0


class CPlayer_MovementServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   int32_t m_nImpulse; // 0x40 - 0x44
   unsigned char pad_44[0x4]; // 0x44 - 0x48
   CInButtonState m_nButtons; // 0x48 - 0x68
   uint64_t m_nQueuedButtonDownMask; // 0x68 - 0x70
   uint64_t m_nQueuedButtonChangeMask; // 0x70 - 0x78
   uint64_t m_nButtonDoublePressed; // 0x78 - 0x80
   uint32 m_pButtonPressedCmdNumber[64]; // 0x80 - 0x180
   uint32_t m_nLastCommandNumberProcessed; // 0x180 - 0x184
   unsigned char pad_184[0x4]; // 0x184 - 0x188
   uint64_t m_nToggleButtonDownMask; // 0x188 - 0x190
   unsigned char pad_190[0x8]; // 0x190 - 0x198
   float m_flMaxspeed; // 0x198 - 0x19C
   float32 m_arrForceSubtickMoveWhen[4]; // 0x19C - 0x1AC
   float m_flForwardMove; // 0x1AC - 0x1B0
   float m_flLeftMove; // 0x1B0 - 0x1B4
   float m_flUpMove; // 0x1B4 - 0x1B8
   Vector m_vecLastMovementImpulses; // 0x1B8 - 0x1C4
   QAngle m_vecOldViewAngles; // 0x1C4 - 0x1D0
   unsigned char pad_1D0[0x8]; // 0x1D0 - 0x1D8
}; // size - 0x1D8


class CPlayer_MovementServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   int32_t m_nImpulse; // 0x40 - 0x44
   unsigned char pad_44[0x4]; // 0x44 - 0x48
   CInButtonState m_nButtons; // 0x48 - 0x68
   uint64_t m_nQueuedButtonDownMask; // 0x68 - 0x70
   uint64_t m_nQueuedButtonChangeMask; // 0x70 - 0x78
   uint64_t m_nButtonDoublePressed; // 0x78 - 0x80
   uint32 m_pButtonPressedCmdNumber[64]; // 0x80 - 0x180
   uint32_t m_nLastCommandNumberProcessed; // 0x180 - 0x184
   unsigned char pad_184[0x4]; // 0x184 - 0x188
   uint64_t m_nToggleButtonDownMask; // 0x188 - 0x190
   unsigned char pad_190[0x8]; // 0x190 - 0x198
   float m_flMaxspeed; // 0x198 - 0x19C
   float32 m_arrForceSubtickMoveWhen[4]; // 0x19C - 0x1AC
   float m_flForwardMove; // 0x1AC - 0x1B0
   float m_flLeftMove; // 0x1B0 - 0x1B4
   float m_flUpMove; // 0x1B4 - 0x1B8
   Vector m_vecLastMovementImpulses; // 0x1B8 - 0x1C4
   QAngle m_vecOldViewAngles; // 0x1C4 - 0x1D0
   unsigned char pad_1D0[0x8]; // 0x1D0 - 0x1D8
}; // size - 0x1D8


class CPulseExecCursor /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0xA0]; // 0x0 - 0xA0
}; // size - 0xA0


class CStopwatchBase /* "server" */ : public CSimpleSimTimer /* "server" */
{
public:
   bool m_fIsRunning; // 0x8 - 0x9
   unsigned char pad_9[0x3]; // 0x9 - 0xC
}; // size - 0xC


class C_INIT_RemapNamedModelElementToScalar /* "particles" */ : public CParticleFunctionInitializer /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1C0 - 0x1C8
   CUtlVector< CUtlString > m_names; // 0x1C8 - 0x1E0
   CUtlVector< float32 > m_values; // 0x1E0 - 0x1F8
   ParticleAttributeIndex_t m_nFieldInput; // 0x1F8 - 0x1FC
   ParticleAttributeIndex_t m_nFieldOutput; // 0x1FC - 0x200
   ParticleSetMethod_t m_nSetMethod; // 0x200 - 0x204
   bool m_bModelFromRenderer; // 0x204 - 0x205
   unsigned char pad_205[0x3]; // 0x205 - 0x208
}; // size - 0x208


class C_INIT_RemapParticleCountToNamedModelElementScalar /* "particles" */ : public C_INIT_RemapParticleCountToScalar /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1F0 - 0x1F8
   CUtlString m_outputMinName; // 0x1F8 - 0x200
   CUtlString m_outputMaxName; // 0x200 - 0x208
   bool m_bModelFromRenderer; // 0x208 - 0x209
   unsigned char pad_209[0x7]; // 0x209 - 0x210
}; // size - 0x210


class C_ModelPointEntity /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_0[0xCC8]; // 0x0 - 0xCC8
}; // size - 0xCC8


class C_OP_RemapNamedModelElementEndCap /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1B8 - 0x1C0
   CUtlVector< CUtlString > m_inNames; // 0x1C0 - 0x1D8
   CUtlVector< CUtlString > m_outNames; // 0x1D8 - 0x1F0
   CUtlVector< CUtlString > m_fallbackNames; // 0x1F0 - 0x208
   bool m_bModelFromRenderer; // 0x208 - 0x209
   unsigned char pad_209[0x3]; // 0x209 - 0x20C
   ParticleAttributeIndex_t m_nFieldInput; // 0x20C - 0x210
   ParticleAttributeIndex_t m_nFieldOutput; // 0x210 - 0x214
   unsigned char pad_214[0x4]; // 0x214 - 0x218
}; // size - 0x218


class C_OP_RemapNamedModelElementOnceTimed /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1B8 - 0x1C0
   CUtlVector< CUtlString > m_inNames; // 0x1C0 - 0x1D8
   CUtlVector< CUtlString > m_outNames; // 0x1D8 - 0x1F0
   CUtlVector< CUtlString > m_fallbackNames; // 0x1F0 - 0x208
   bool m_bModelFromRenderer; // 0x208 - 0x209
   bool m_bProportional; // 0x209 - 0x20A
   unsigned char pad_20A[0x2]; // 0x20A - 0x20C
   ParticleAttributeIndex_t m_nFieldInput; // 0x20C - 0x210
   ParticleAttributeIndex_t m_nFieldOutput; // 0x210 - 0x214
   float m_flRemapTime; // 0x214 - 0x218
}; // size - 0x218


class C_Sprite /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hSpriteMaterial; // 0xCC8 - 0xCD0
   CHandle< C_BaseEntity > m_hAttachedToEntity; // 0xCD0 - 0xCD4
   AttachmentHandle_t m_nAttachment; // 0xCD4 - 0xCD5
   unsigned char pad_CD5[0x3]; // 0xCD5 - 0xCD8
   float m_flSpriteFramerate; // 0xCD8 - 0xCDC
   float m_flFrame; // 0xCDC - 0xCE0
   GameTime_t m_flDieTime; // 0xCE0 - 0xCE4
   unsigned char pad_CE4[0xC]; // 0xCE4 - 0xCF0
   uint32_t m_nBrightness; // 0xCF0 - 0xCF4
   float m_flBrightnessDuration; // 0xCF4 - 0xCF8
   float m_flSpriteScale; // 0xCF8 - 0xCFC
   float m_flScaleDuration; // 0xCFC - 0xD00
   bool m_bWorldSpaceScale; // 0xD00 - 0xD01
   unsigned char pad_D01[0x3]; // 0xD01 - 0xD04
   float m_flGlowProxySize; // 0xD04 - 0xD08
   float m_flHDRColorScale; // 0xD08 - 0xD0C
   GameTime_t m_flLastTime; // 0xD0C - 0xD10
   float m_flMaxFrame; // 0xD10 - 0xD14
   float m_flStartScale; // 0xD14 - 0xD18
   float m_flDestScale; // 0xD18 - 0xD1C
   GameTime_t m_flScaleTimeStart; // 0xD1C - 0xD20
   int32_t m_nStartBrightness; // 0xD20 - 0xD24
   int32_t m_nDestBrightness; // 0xD24 - 0xD28
   GameTime_t m_flBrightnessTimeStart; // 0xD28 - 0xD2C
   unsigned char pad_D2C[0x4]; // 0xD2C - 0xD30
   CWeakHandle< InfoForResourceTypeIMaterial2 > m_hOldSpriteMaterial; // 0xD30 - 0xD38
   unsigned char pad_D38[0x98]; // 0xD38 - 0xDD0
   int32_t m_nSpriteWidth; // 0xDD0 - 0xDD4
   int32_t m_nSpriteHeight; // 0xDD4 - 0xDD8
}; // size - 0xDD8


class SpawnPoint /* "server" */ : public CServerOnlyPointEntity /* "server" */
{
public:
   int32_t m_iPriority; // 0x4C0 - 0x4C4
   bool m_bEnabled; // 0x4C4 - 0x4C5
   unsigned char pad_4C5[0x3]; // 0x4C5 - 0x4C8
   int32_t m_nType; // 0x4C8 - 0x4CC
   unsigned char pad_4CC[0x4]; // 0x4CC - 0x4D0
}; // size - 0x4D0


class BaseSceneObjectOverride_t /* "worldrenderer" */
{
public:
   uint32_t m_nSceneObjectIndex; // 0x0 - 0x4
}; // size - 0x4


class CBarnLight /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bEnabled; // 0x710 - 0x711
   unsigned char pad_711[0x3]; // 0x711 - 0x714
   int32_t m_nColorMode; // 0x714 - 0x718
   Color m_Color; // 0x718 - 0x71C
   float m_flColorTemperature; // 0x71C - 0x720
   float m_flBrightness; // 0x720 - 0x724
   float m_flBrightnessScale; // 0x724 - 0x728
   int32_t m_nDirectLight; // 0x728 - 0x72C
   int32_t m_nBakedShadowIndex; // 0x72C - 0x730
   int32_t m_nLuminaireShape; // 0x730 - 0x734
   float m_flLuminaireSize; // 0x734 - 0x738
   float m_flLuminaireAnisotropy; // 0x738 - 0x73C
   unsigned char pad_73C[0x4]; // 0x73C - 0x740
   CUtlString m_LightStyleString; // 0x740 - 0x748
   GameTime_t m_flLightStyleStartTime; // 0x748 - 0x74C
   unsigned char pad_74C[0x4]; // 0x74C - 0x750
   CNetworkUtlVectorBase< CUtlString > m_QueuedLightStyleStrings; // 0x750 - 0x768
   CNetworkUtlVectorBase< CUtlString > m_LightStyleEvents; // 0x768 - 0x780
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_LightStyleTargets; // 0x780 - 0x798
   CEntityIOOutput m_StyleEvent[4]; // 0x798 - 0x838
   unsigned char pad_838[0x20]; // 0x838 - 0x858
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; // 0x858 - 0x860
   float m_flShape; // 0x860 - 0x864
   float m_flSoftX; // 0x864 - 0x868
   float m_flSoftY; // 0x868 - 0x86C
   float m_flSkirt; // 0x86C - 0x870
   float m_flSkirtNear; // 0x870 - 0x874
   Vector m_vSizeParams; // 0x874 - 0x880
   float m_flRange; // 0x880 - 0x884
   Vector m_vShear; // 0x884 - 0x890
   int32_t m_nBakeSpecularToCubemaps; // 0x890 - 0x894
   Vector m_vBakeSpecularToCubemapsSize; // 0x894 - 0x8A0
   int32_t m_nCastShadows; // 0x8A0 - 0x8A4
   int32_t m_nShadowMapSize; // 0x8A4 - 0x8A8
   int32_t m_nShadowPriority; // 0x8A8 - 0x8AC
   bool m_bContactShadow; // 0x8AC - 0x8AD
   unsigned char pad_8AD[0x3]; // 0x8AD - 0x8B0
   int32_t m_nBounceLight; // 0x8B0 - 0x8B4
   float m_flBounceScale; // 0x8B4 - 0x8B8
   float m_flMinRoughness; // 0x8B8 - 0x8BC
   Vector m_vAlternateColor; // 0x8BC - 0x8C8
   float m_fAlternateColorBrightness; // 0x8C8 - 0x8CC
   int32_t m_nFog; // 0x8CC - 0x8D0
   float m_flFogStrength; // 0x8D0 - 0x8D4
   int32_t m_nFogShadows; // 0x8D4 - 0x8D8
   float m_flFogScale; // 0x8D8 - 0x8DC
   float m_flFadeSizeStart; // 0x8DC - 0x8E0
   float m_flFadeSizeEnd; // 0x8E0 - 0x8E4
   float m_flShadowFadeSizeStart; // 0x8E4 - 0x8E8
   float m_flShadowFadeSizeEnd; // 0x8E8 - 0x8EC
   bool m_bPrecomputedFieldsValid; // 0x8EC - 0x8ED
   unsigned char pad_8ED[0x3]; // 0x8ED - 0x8F0
   Vector m_vPrecomputedBoundsMins; // 0x8F0 - 0x8FC
   Vector m_vPrecomputedBoundsMaxs; // 0x8FC - 0x908
   Vector m_vPrecomputedOBBOrigin; // 0x908 - 0x914
   QAngle m_vPrecomputedOBBAngles; // 0x914 - 0x920
   Vector m_vPrecomputedOBBExtent; // 0x920 - 0x92C
   bool m_bPvsModifyEntity; // 0x92C - 0x92D
   unsigned char pad_92D[0xB]; // 0x92D - 0x938
}; // size - 0x938


class CBasePropDoor /* "server" */ : public CDynamicProp /* "server" */
{
public:
   unsigned char pad_B80[0x10]; // 0xB80 - 0xB90
   float m_flAutoReturnDelay; // 0xB90 - 0xB94
   unsigned char pad_B94[0x4]; // 0xB94 - 0xB98
   CUtlVector< CHandle< CBasePropDoor > > m_hDoorList; // 0xB98 - 0xBB0
   int32_t m_nHardwareType; // 0xBB0 - 0xBB4
   bool m_bNeedsHardware; // 0xBB4 - 0xBB5
   unsigned char pad_BB5[0x3]; // 0xBB5 - 0xBB8
   DoorState_t m_eDoorState; // 0xBB8 - 0xBBC
   bool m_bLocked; // 0xBBC - 0xBBD
   unsigned char pad_BBD[0x3]; // 0xBBD - 0xBC0
   Vector m_closedPosition; // 0xBC0 - 0xBCC
   QAngle m_closedAngles; // 0xBCC - 0xBD8
   CHandle< CBaseEntity > m_hBlocker; // 0xBD8 - 0xBDC
   bool m_bFirstBlocked; // 0xBDC - 0xBDD
   unsigned char pad_BDD[0x3]; // 0xBDD - 0xBE0
   locksound_t m_ls; // 0xBE0 - 0xC00
   bool m_bForceClosed; // 0xC00 - 0xC01
   unsigned char pad_C01[0x3]; // 0xC01 - 0xC04
   Vector m_vecLatchWorldPosition; // 0xC04 - 0xC10
   CHandle< CBaseEntity > m_hActivator; // 0xC10 - 0xC14
   unsigned char pad_C14[0xC]; // 0xC14 - 0xC20
   CUtlSymbolLarge m_SoundMoving; // 0xC20 - 0xC28
   CUtlSymbolLarge m_SoundOpen; // 0xC28 - 0xC30
   CUtlSymbolLarge m_SoundClose; // 0xC30 - 0xC38
   CUtlSymbolLarge m_SoundLock; // 0xC38 - 0xC40
   CUtlSymbolLarge m_SoundUnlock; // 0xC40 - 0xC48
   CUtlSymbolLarge m_SoundLatch; // 0xC48 - 0xC50
   CUtlSymbolLarge m_SoundPound; // 0xC50 - 0xC58
   CUtlSymbolLarge m_SoundJiggle; // 0xC58 - 0xC60
   CUtlSymbolLarge m_SoundLockedAnim; // 0xC60 - 0xC68
   int32_t m_numCloseAttempts; // 0xC68 - 0xC6C
   CUtlStringToken m_nPhysicsMaterial; // 0xC6C - 0xC70
   CUtlSymbolLarge m_SlaveName; // 0xC70 - 0xC78
   CHandle< CBasePropDoor > m_hMaster; // 0xC78 - 0xC7C
   unsigned char pad_C7C[0x4]; // 0xC7C - 0xC80
   CEntityIOOutput m_OnBlockedClosing; // 0xC80 - 0xCA8
   CEntityIOOutput m_OnBlockedOpening; // 0xCA8 - 0xCD0
   CEntityIOOutput m_OnUnblockedClosing; // 0xCD0 - 0xCF8
   CEntityIOOutput m_OnUnblockedOpening; // 0xCF8 - 0xD20
   CEntityIOOutput m_OnFullyClosed; // 0xD20 - 0xD48
   CEntityIOOutput m_OnFullyOpen; // 0xD48 - 0xD70
   CEntityIOOutput m_OnClose; // 0xD70 - 0xD98
   CEntityIOOutput m_OnOpen; // 0xD98 - 0xDC0
   CEntityIOOutput m_OnLockedUse; // 0xDC0 - 0xDE8
   CEntityIOOutput m_OnAjarOpen; // 0xDE8 - 0xE10
}; // size - 0xE10


class CBodyComponentSkeletonInstance /* "client" */ : public CBodyComponent /* "client" */
{
public:
   CSkeletonInstance m_skeletonInstance; // 0x50 - 0x460
}; // size - 0x460


class CBodyComponentSkeletonInstance /* "server" */ : public CBodyComponent /* "server" */
{
public:
   CSkeletonInstance m_skeletonInstance; // 0x50 - 0x460
}; // size - 0x460


class CCSGameModeScript /* "server" */ : public CBasePulseGraphInstance /* "server" */
{
public:
   unsigned char pad_0[0xF8]; // 0x0 - 0xF8
}; // size - 0xF8


class CCSGameModeScript /* "client" */ : public CBasePulseGraphInstance /* "client" */
{
public:
   unsigned char pad_0[0xF8]; // 0x0 - 0xF8
}; // size - 0xF8


class CCSPlayerBase_CameraServices /* "client" */ : public CPlayer_CameraServices /* "client" */
{
public:
   uint32_t m_iFOV; // 0x210 - 0x214
   uint32_t m_iFOVStart; // 0x214 - 0x218
   GameTime_t m_flFOVTime; // 0x218 - 0x21C
   float m_flFOVRate; // 0x21C - 0x220
   CHandle< C_BaseEntity > m_hZoomOwner; // 0x220 - 0x224
   float m_flLastShotFOV; // 0x224 - 0x228
}; // size - 0x228


class CCSPlayerBase_CameraServices /* "server" */ : public CPlayer_CameraServices /* "server" */
{
public:
   uint32_t m_iFOV; // 0x170 - 0x174
   uint32_t m_iFOVStart; // 0x174 - 0x178
   GameTime_t m_flFOVTime; // 0x178 - 0x17C
   float m_flFOVRate; // 0x17C - 0x180
   CHandle< CBaseEntity > m_hZoomOwner; // 0x180 - 0x184
   unsigned char pad_184[0x4]; // 0x184 - 0x188
   CUtlVector< CHandle< CBaseEntity > > m_hTriggerFogList; // 0x188 - 0x1A0
   CHandle< CBaseEntity > m_hLastFogTrigger; // 0x1A0 - 0x1A4
   unsigned char pad_1A4[0x4]; // 0x1A4 - 0x1A8
}; // size - 0x1A8


class CHandshakeAnimTagBase /* "animgraphlib" */ : public CAnimTagBase /* "animgraphlib" */
{
public:
   bool m_bIsDisableTag; // 0x50 - 0x51
   unsigned char pad_51[0x7]; // 0x51 - 0x58
}; // size - 0x58


class CLogicalEntity /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x548]; // 0x0 - 0x548
}; // size - 0x548




class CPlayer_UseServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_UseServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_ViewModelServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_ViewModelServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPulseCell_Outflow_PlaySceneBase /* "server" */ : public CPulseCell_BaseYieldingInflow /* "server" */
{
public:
   class CursorState_t /* "server" */
   {
   public:
      CHandle< CBaseEntity > m_sceneInstance; // 0x0 - 0x4
      CHandle< CBaseEntity > m_mainActor; // 0x4 - 0x8
   }; // size - 0x8

   CPulse_ResumePoint m_OnFinished; // 0x48 - 0x78
   CPulse_ResumePoint m_OnCanceled; // 0x78 - 0xA8
   CUtlVector< CPulse_OutflowConnection > m_Triggers; // 0xA8 - 0xC0
}; // size - 0xC0


class CPulseGraphComponentBase /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CHandle< CBaseEntity > m_hOwner; // 0x8 - 0xC
   bool m_bActivated; // 0xC - 0xD
   unsigned char pad_D[0x3]; // 0xD - 0x10
   CUtlSymbolLarge m_sNameFixupStaticPrefix; // 0x10 - 0x18
   CUtlSymbolLarge m_sNameFixupParent; // 0x18 - 0x20
   CUtlSymbolLarge m_sNameFixupLocal; // 0x20 - 0x28
}; // size - 0x28


class CSSDSMsg_LayerBase /* "scenesystem" */
{
public:
   SceneViewId_t m_viewId; // 0x0 - 0x10
   CUtlString m_ViewName; // 0x10 - 0x18
   int32_t m_nLayerIndex; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
   uint64_t m_nLayerId; // 0x20 - 0x28
   CUtlString m_LayerName; // 0x28 - 0x30
   CUtlString m_displayText; // 0x30 - 0x38
}; // size - 0x38


class CServerOnlyModelEntity /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_0[0x710]; // 0x0 - 0x710
}; // size - 0x710


class C_BarnLight /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   bool m_bEnabled; // 0xCC8 - 0xCC9
   unsigned char pad_CC9[0x3]; // 0xCC9 - 0xCCC
   int32_t m_nColorMode; // 0xCCC - 0xCD0
   Color m_Color; // 0xCD0 - 0xCD4
   float m_flColorTemperature; // 0xCD4 - 0xCD8
   float m_flBrightness; // 0xCD8 - 0xCDC
   float m_flBrightnessScale; // 0xCDC - 0xCE0
   int32_t m_nDirectLight; // 0xCE0 - 0xCE4
   int32_t m_nBakedShadowIndex; // 0xCE4 - 0xCE8
   int32_t m_nLuminaireShape; // 0xCE8 - 0xCEC
   float m_flLuminaireSize; // 0xCEC - 0xCF0
   float m_flLuminaireAnisotropy; // 0xCF0 - 0xCF4
   unsigned char pad_CF4[0x4]; // 0xCF4 - 0xCF8
   CUtlString m_LightStyleString; // 0xCF8 - 0xD00
   GameTime_t m_flLightStyleStartTime; // 0xD00 - 0xD04
   unsigned char pad_D04[0x4]; // 0xD04 - 0xD08
   C_NetworkUtlVectorBase< CUtlString > m_QueuedLightStyleStrings; // 0xD08 - 0xD20
   C_NetworkUtlVectorBase< CUtlString > m_LightStyleEvents; // 0xD20 - 0xD38
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_LightStyleTargets; // 0xD38 - 0xD50
   CEntityIOOutput m_StyleEvent[4]; // 0xD50 - 0xDF0
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; // 0xDF0 - 0xDF8
   float m_flShape; // 0xDF8 - 0xDFC
   float m_flSoftX; // 0xDFC - 0xE00
   float m_flSoftY; // 0xE00 - 0xE04
   float m_flSkirt; // 0xE04 - 0xE08
   float m_flSkirtNear; // 0xE08 - 0xE0C
   Vector m_vSizeParams; // 0xE0C - 0xE18
   float m_flRange; // 0xE18 - 0xE1C
   Vector m_vShear; // 0xE1C - 0xE28
   int32_t m_nBakeSpecularToCubemaps; // 0xE28 - 0xE2C
   Vector m_vBakeSpecularToCubemapsSize; // 0xE2C - 0xE38
   int32_t m_nCastShadows; // 0xE38 - 0xE3C
   int32_t m_nShadowMapSize; // 0xE3C - 0xE40
   int32_t m_nShadowPriority; // 0xE40 - 0xE44
   bool m_bContactShadow; // 0xE44 - 0xE45
   unsigned char pad_E45[0x3]; // 0xE45 - 0xE48
   int32_t m_nBounceLight; // 0xE48 - 0xE4C
   float m_flBounceScale; // 0xE4C - 0xE50
   float m_flMinRoughness; // 0xE50 - 0xE54
   Vector m_vAlternateColor; // 0xE54 - 0xE60
   float m_fAlternateColorBrightness; // 0xE60 - 0xE64
   int32_t m_nFog; // 0xE64 - 0xE68
   float m_flFogStrength; // 0xE68 - 0xE6C
   int32_t m_nFogShadows; // 0xE6C - 0xE70
   float m_flFogScale; // 0xE70 - 0xE74
   float m_flFadeSizeStart; // 0xE74 - 0xE78
   float m_flFadeSizeEnd; // 0xE78 - 0xE7C
   float m_flShadowFadeSizeStart; // 0xE7C - 0xE80
   float m_flShadowFadeSizeEnd; // 0xE80 - 0xE84
   bool m_bPrecomputedFieldsValid; // 0xE84 - 0xE85
   unsigned char pad_E85[0x3]; // 0xE85 - 0xE88
   Vector m_vPrecomputedBoundsMins; // 0xE88 - 0xE94
   Vector m_vPrecomputedBoundsMaxs; // 0xE94 - 0xEA0
   Vector m_vPrecomputedOBBOrigin; // 0xEA0 - 0xEAC
   QAngle m_vPrecomputedOBBAngles; // 0xEAC - 0xEB8
   Vector m_vPrecomputedOBBExtent; // 0xEB8 - 0xEC4
   unsigned char pad_EC4[0x4C]; // 0xEC4 - 0xF10
}; // size - 0xF10


class C_CSGO_PreviewPlayer /* "client" */ : public C_CSPlayerPawn /* "client" */
{
public:
   CUtlString m_animgraph; // 0x2358 - 0x2360
   CGlobalSymbol m_animgraphCharacterModeString; // 0x2360 - 0x2368
   float m_flInitialModelScale; // 0x2368 - 0x236C
   unsigned char pad_236C[0x84]; // 0x236C - 0x23F0
}; // size - 0x23F0


class C_CSGO_TeamSelectCharacterPosition /* "client" */ : public C_CSGO_TeamPreviewCharacterPosition /* "client" */
{
public:
   unsigned char pad_0[0x1278]; // 0x0 - 0x1278
}; // size - 0x1278


class C_OP_RemapDistanceToLineSegmentBase /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   int32_t m_nCP0; // 0x1B8 - 0x1BC
   int32_t m_nCP1; // 0x1BC - 0x1C0
   float m_flMinInputValue; // 0x1C0 - 0x1C4
   float m_flMaxInputValue; // 0x1C4 - 0x1C8
   bool m_bInfiniteLine; // 0x1C8 - 0x1C9
   unsigned char pad_1C9[0x7]; // 0x1C9 - 0x1D0
}; // size - 0x1D0


class C_ParticleSystem /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   char m_szSnapshotFileName[512]; // 0xCC8 - 0xEC8
   bool m_bActive; // 0xEC8 - 0xEC9
   bool m_bFrozen; // 0xEC9 - 0xECA
   unsigned char pad_ECA[0x2]; // 0xECA - 0xECC
   float m_flFreezeTransitionDuration; // 0xECC - 0xED0
   int32_t m_nStopType; // 0xED0 - 0xED4
   bool m_bAnimateDuringGameplayPause; // 0xED4 - 0xED5
   unsigned char pad_ED5[0x3]; // 0xED5 - 0xED8
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0xED8 - 0xEE0
   GameTime_t m_flStartTime; // 0xEE0 - 0xEE4
   float m_flPreSimTime; // 0xEE4 - 0xEE8
   Vector m_vServerControlPoints[4]; // 0xEE8 - 0xF18
   uint8 m_iServerControlPointAssignments[4]; // 0xF18 - 0xF1C
   CHandle< C_BaseEntity > m_hControlPointEnts[64]; // 0xF1C - 0x101C
   bool m_bNoSave; // 0x101C - 0x101D
   bool m_bNoFreeze; // 0x101D - 0x101E
   bool m_bNoRamp; // 0x101E - 0x101F
   bool m_bStartActive; // 0x101F - 0x1020
   CUtlSymbolLarge m_iszEffectName; // 0x1020 - 0x1028
   CUtlSymbolLarge m_iszControlPointNames[64]; // 0x1028 - 0x1228
   int32_t m_nDataCP; // 0x1228 - 0x122C
   Vector m_vecDataCPValue; // 0x122C - 0x1238
   int32_t m_nTintCP; // 0x1238 - 0x123C
   Color m_clrTint; // 0x123C - 0x1240
   unsigned char pad_1240[0x20]; // 0x1240 - 0x1260
   bool m_bOldActive; // 0x1260 - 0x1261
   bool m_bOldFrozen; // 0x1261 - 0x1262
   unsigned char pad_1262[0x16]; // 0x1262 - 0x1278
}; // size - 0x1278


class C_PointClientUIWorldPanel /* "client" */ : public C_BaseClientUIEntity /* "client" */
{
public:
   unsigned char pad_CF8[0x8]; // 0xCF8 - 0xD00
   bool m_bForceRecreateNextUpdate; // 0xD00 - 0xD01
   bool m_bMoveViewToPlayerNextThink; // 0xD01 - 0xD02
   bool m_bCheckCSSClasses; // 0xD02 - 0xD03
   unsigned char pad_D03[0xD]; // 0xD03 - 0xD10
   CTransform m_anchorDeltaTransform; // 0xD10 - 0xD30
   unsigned char pad_D30[0x178]; // 0xD30 - 0xEA8
   CPointOffScreenIndicatorUi* m_pOffScreenIndicator; // 0xEA8 - 0xEB0
   unsigned char pad_EB0[0x20]; // 0xEB0 - 0xED0
   bool m_bIgnoreInput; // 0xED0 - 0xED1
   bool m_bLit; // 0xED1 - 0xED2
   bool m_bFollowPlayerAcrossTeleport; // 0xED2 - 0xED3
   unsigned char pad_ED3[0x1]; // 0xED3 - 0xED4
   float m_flWidth; // 0xED4 - 0xED8
   float m_flHeight; // 0xED8 - 0xEDC
   float m_flDPI; // 0xEDC - 0xEE0
   float m_flInteractDistance; // 0xEE0 - 0xEE4
   float m_flDepthOffset; // 0xEE4 - 0xEE8
   uint32_t m_unOwnerContext; // 0xEE8 - 0xEEC
   uint32_t m_unHorizontalAlign; // 0xEEC - 0xEF0
   uint32_t m_unVerticalAlign; // 0xEF0 - 0xEF4
   uint32_t m_unOrientation; // 0xEF4 - 0xEF8
   bool m_bAllowInteractionFromAllSceneWorlds; // 0xEF8 - 0xEF9
   unsigned char pad_EF9[0x7]; // 0xEF9 - 0xF00
   C_NetworkUtlVectorBase< CUtlSymbolLarge > m_vecCSSClasses; // 0xF00 - 0xF18
   bool m_bOpaque; // 0xF18 - 0xF19
   bool m_bNoDepth; // 0xF19 - 0xF1A
   bool m_bRenderBackface; // 0xF1A - 0xF1B
   bool m_bUseOffScreenIndicator; // 0xF1B - 0xF1C
   bool m_bExcludeFromSaveGames; // 0xF1C - 0xF1D
   bool m_bGrabbable; // 0xF1D - 0xF1E
   bool m_bOnlyRenderToTexture; // 0xF1E - 0xF1F
   bool m_bDisableMipGen; // 0xF1F - 0xF20
   int32_t m_nExplicitImageLayout; // 0xF20 - 0xF24
   unsigned char pad_F24[0xC]; // 0xF24 - 0xF30
}; // size - 0xF30


class CAI_Expresser /* "server" */
{
public:
   unsigned char pad_0[0x38]; // 0x0 - 0x38
   GameTime_t m_flStopTalkTime; // 0x38 - 0x3C
   GameTime_t m_flStopTalkTimeWithoutDelay; // 0x3C - 0x40
   GameTime_t m_flBlockedTalkTime; // 0x40 - 0x44
   int32_t m_voicePitch; // 0x44 - 0x48
   GameTime_t m_flLastTimeAcceptedSpeak; // 0x48 - 0x4C
   bool m_bAllowSpeakingInterrupts; // 0x4C - 0x4D
   bool m_bConsiderSceneInvolvementAsSpeech; // 0x4D - 0x4E
   bool m_bSceneEntityDisabled; // 0x4E - 0x4F
   unsigned char pad_4F[0x1]; // 0x4F - 0x50
   int32_t m_nLastSpokenPriority; // 0x50 - 0x54
   unsigned char pad_54[0x1C]; // 0x54 - 0x70
   CBaseFlex* m_pOuter; // 0x70 - 0x78
}; // size - 0x78


class CAnimEventListenerBase /* "server" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
}; // size - 0x20


class CBeam /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   float m_flFrameRate; // 0x710 - 0x714
   float m_flHDRColorScale; // 0x714 - 0x718
   GameTime_t m_flFireTime; // 0x718 - 0x71C
   float m_flDamage; // 0x71C - 0x720
   uint8_t m_nNumBeamEnts; // 0x720 - 0x721
   unsigned char pad_721[0x7]; // 0x721 - 0x728
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hBaseMaterial; // 0x728 - 0x730
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_nHaloIndex; // 0x730 - 0x738
   BeamType_t m_nBeamType; // 0x738 - 0x73C
   uint32_t m_nBeamFlags; // 0x73C - 0x740
   CHandle< CBaseEntity > m_hAttachEntity[10]; // 0x740 - 0x768
   AttachmentHandle_t m_nAttachIndex[10]; // 0x768 - 0x772
   unsigned char pad_772[0x2]; // 0x772 - 0x774
   float m_fWidth; // 0x774 - 0x778
   float m_fEndWidth; // 0x778 - 0x77C
   float m_fFadeLength; // 0x77C - 0x780
   float m_fHaloScale; // 0x780 - 0x784
   float m_fAmplitude; // 0x784 - 0x788
   float m_fStartFrame; // 0x788 - 0x78C
   float m_fSpeed; // 0x78C - 0x790
   float m_flFrame; // 0x790 - 0x794
   BeamClipStyle_t m_nClipStyle; // 0x794 - 0x798
   bool m_bTurnedOff; // 0x798 - 0x799
   unsigned char pad_799[0x3]; // 0x799 - 0x79C
   Vector m_vecEndPos; // 0x79C - 0x7A8
   CHandle< CBaseEntity > m_hEndEntity; // 0x7A8 - 0x7AC
   int32_t m_nDissolveType; // 0x7AC - 0x7B0
}; // size - 0x7B0


class CBreakable /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_710[0x8]; // 0x710 - 0x718
   CPropDataComponent m_CPropDataComponent; // 0x718 - 0x758
   Materials m_Material; // 0x758 - 0x75C
   CHandle< CBaseEntity > m_hBreaker; // 0x75C - 0x760
   Explosions m_Explosion; // 0x760 - 0x764
   unsigned char pad_764[0x4]; // 0x764 - 0x768
   CUtlSymbolLarge m_iszSpawnObject; // 0x768 - 0x770
   float m_flPressureDelay; // 0x770 - 0x774
   int32_t m_iMinHealthDmg; // 0x774 - 0x778
   CUtlSymbolLarge m_iszPropData; // 0x778 - 0x780
   float m_impactEnergyScale; // 0x780 - 0x784
   EOverrideBlockLOS_t m_nOverrideBlockLOS; // 0x784 - 0x788
   CEntityIOOutput m_OnBreak; // 0x788 - 0x7B0
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0x7B0 - 0x7D8
   PerformanceMode_t m_PerformanceMode; // 0x7D8 - 0x7DC
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x7DC - 0x7E0
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x7E0 - 0x7E4
   unsigned char pad_7E4[0x4]; // 0x7E4 - 0x7E8
}; // size - 0x7E8


class CBtNodeDecorator /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_0[0x58]; // 0x0 - 0x58
}; // size - 0x58


class CCSGO_TeamSelectCharacterPosition /* "server" */ : public CCSGO_TeamPreviewCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC48]; // 0x0 - 0xC48
}; // size - 0xC48


class CCSGO_WingmanIntroCharacterPosition /* "client" */ : public C_CSGO_TeamIntroCharacterPosition /* "client" */
{
public:
   unsigned char pad_0[0x1278]; // 0x0 - 0x1278
}; // size - 0x1278


class CCSGO_WingmanIntroCharacterPosition /* "server" */ : public CCSGO_TeamIntroCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC48]; // 0x0 - 0xC48
}; // size - 0xC48


class CCSPlayerPawnBase /* "server" */ : public CBasePlayerPawn /* "server" */
{
public:
   unsigned char pad_BA0[0x10]; // 0xBA0 - 0xBB0
   CTouchExpansionComponent m_CTouchExpansionComponent; // 0xBB0 - 0xC00
   CCSPlayer_PingServices* m_pPingServices; // 0xC00 - 0xC08
   CPlayer_ViewModelServices* m_pViewModelServices; // 0xC08 - 0xC10
   GameTime_t m_blindUntilTime; // 0xC10 - 0xC14
   GameTime_t m_blindStartTime; // 0xC14 - 0xC18
   CSPlayerState m_iPlayerState; // 0xC18 - 0xC1C
   unsigned char pad_C1C[0xAC]; // 0xC1C - 0xCC8
   bool m_bRespawning; // 0xCC8 - 0xCC9
   unsigned char pad_CC9[0x3]; // 0xCC9 - 0xCCC
   GameTime_t m_fImmuneToGunGameDamageTime; // 0xCCC - 0xCD0
   bool m_bGunGameImmunity; // 0xCD0 - 0xCD1
   unsigned char pad_CD1[0x3]; // 0xCD1 - 0xCD4
   float m_fMolotovDamageTime; // 0xCD4 - 0xCD8
   bool m_bHasMovedSinceSpawn; // 0xCD8 - 0xCD9
   unsigned char pad_CD9[0x3]; // 0xCD9 - 0xCDC
   int32_t m_iNumSpawns; // 0xCDC - 0xCE0
   unsigned char pad_CE0[0x4]; // 0xCE0 - 0xCE4
   float m_flIdleTimeSinceLastAction; // 0xCE4 - 0xCE8
   float m_fNextRadarUpdateTime; // 0xCE8 - 0xCEC
   float m_flFlashDuration; // 0xCEC - 0xCF0
   float m_flFlashMaxAlpha; // 0xCF0 - 0xCF4
   float m_flProgressBarStartTime; // 0xCF4 - 0xCF8
   int32_t m_iProgressBarDuration; // 0xCF8 - 0xCFC
   QAngle m_angEyeAngles; // 0xCFC - 0xD08
   int32_t m_NumEnemiesAtRoundStart; // 0xD08 - 0xD0C
   bool m_wasNotKilledNaturally; // 0xD0C - 0xD0D
   bool m_bCommittingSuicideOnTeamChange; // 0xD0D - 0xD0E
   unsigned char pad_D0E[0x2]; // 0xD0E - 0xD10
   CHandle< CCSPlayerController > m_hOriginalController; // 0xD10 - 0xD14
   unsigned char pad_D14[0x4]; // 0xD14 - 0xD18
}; // size - 0xD18


class CCycleBase /* "modellib" */
{
public:
   float m_flCycle; // 0x0 - 0x4
}; // size - 0x4


class CExampleSchemaVData_PolymorphicBase /* "resourcefile" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   int32_t m_nBase; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
}; // size - 0x10


class CFuncBrush /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   BrushSolidities_e m_iSolidity; // 0x710 - 0x714
   int32_t m_iDisabled; // 0x714 - 0x718
   bool m_bSolidBsp; // 0x718 - 0x719
   unsigned char pad_719[0x7]; // 0x719 - 0x720
   CUtlSymbolLarge m_iszExcludedClass; // 0x720 - 0x728
   bool m_bInvertExclusion; // 0x728 - 0x729
   bool m_bScriptedMovement; // 0x729 - 0x72A
   unsigned char pad_72A[0x6]; // 0x72A - 0x730
}; // size - 0x730


class CFuncPlatRot /* "server" */ : public CFuncPlat /* "server" */
{
public:
   QAngle m_end; // 0x7C0 - 0x7CC
   QAngle m_start; // 0x7CC - 0x7D8
}; // size - 0x7D8


class CGeneralSpin /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   int32_t m_nSpinRateDegrees; // 0x1B8 - 0x1BC
   int32_t m_nSpinRateMinDegrees; // 0x1BC - 0x1C0
   unsigned char pad_1C0[0x4]; // 0x1C0 - 0x1C4
   float m_fSpinRateStopTime; // 0x1C4 - 0x1C8
   unsigned char pad_1C8[0x8]; // 0x1C8 - 0x1D0
}; // size - 0x1D0


class CLogicNPCCounter /* "server" */ : public CBaseEntity /* "server" */
{
public:
   CEntityIOOutput m_OnMinCountAll; // 0x4C0 - 0x4E8
   CEntityIOOutput m_OnMaxCountAll; // 0x4E8 - 0x510
   CEntityOutputTemplate< float32 > m_OnFactorAll; // 0x510 - 0x538
   CEntityOutputTemplate< float32 > m_OnMinPlayerDistAll; // 0x538 - 0x560
   CEntityIOOutput m_OnMinCount_1; // 0x560 - 0x588
   CEntityIOOutput m_OnMaxCount_1; // 0x588 - 0x5B0
   CEntityOutputTemplate< float32 > m_OnFactor_1; // 0x5B0 - 0x5D8
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_1; // 0x5D8 - 0x600
   CEntityIOOutput m_OnMinCount_2; // 0x600 - 0x628
   CEntityIOOutput m_OnMaxCount_2; // 0x628 - 0x650
   CEntityOutputTemplate< float32 > m_OnFactor_2; // 0x650 - 0x678
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_2; // 0x678 - 0x6A0
   CEntityIOOutput m_OnMinCount_3; // 0x6A0 - 0x6C8
   CEntityIOOutput m_OnMaxCount_3; // 0x6C8 - 0x6F0
   CEntityOutputTemplate< float32 > m_OnFactor_3; // 0x6F0 - 0x718
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_3; // 0x718 - 0x740
   CEntityHandle m_hSource; // 0x740 - 0x744
   unsigned char pad_744[0x4]; // 0x744 - 0x748
   CUtlSymbolLarge m_iszSourceEntityName; // 0x748 - 0x750
   float m_flDistanceMax; // 0x750 - 0x754
   bool m_bDisabled; // 0x754 - 0x755
   unsigned char pad_755[0x3]; // 0x755 - 0x758
   int32_t m_nMinCountAll; // 0x758 - 0x75C
   int32_t m_nMaxCountAll; // 0x75C - 0x760
   int32_t m_nMinFactorAll; // 0x760 - 0x764
   int32_t m_nMaxFactorAll; // 0x764 - 0x768
   unsigned char pad_768[0x8]; // 0x768 - 0x770
   CUtlSymbolLarge m_iszNPCClassname_1; // 0x770 - 0x778
   int32_t m_nNPCState_1; // 0x778 - 0x77C
   bool m_bInvertState_1; // 0x77C - 0x77D
   unsigned char pad_77D[0x3]; // 0x77D - 0x780
   int32_t m_nMinCount_1; // 0x780 - 0x784
   int32_t m_nMaxCount_1; // 0x784 - 0x788
   int32_t m_nMinFactor_1; // 0x788 - 0x78C
   int32_t m_nMaxFactor_1; // 0x78C - 0x790
   unsigned char pad_790[0x4]; // 0x790 - 0x794
   float m_flDefaultDist_1; // 0x794 - 0x798
   CUtlSymbolLarge m_iszNPCClassname_2; // 0x798 - 0x7A0
   int32_t m_nNPCState_2; // 0x7A0 - 0x7A4
   bool m_bInvertState_2; // 0x7A4 - 0x7A5
   unsigned char pad_7A5[0x3]; // 0x7A5 - 0x7A8
   int32_t m_nMinCount_2; // 0x7A8 - 0x7AC
   int32_t m_nMaxCount_2; // 0x7AC - 0x7B0
   int32_t m_nMinFactor_2; // 0x7B0 - 0x7B4
   int32_t m_nMaxFactor_2; // 0x7B4 - 0x7B8
   unsigned char pad_7B8[0x4]; // 0x7B8 - 0x7BC
   float m_flDefaultDist_2; // 0x7BC - 0x7C0
   CUtlSymbolLarge m_iszNPCClassname_3; // 0x7C0 - 0x7C8
   int32_t m_nNPCState_3; // 0x7C8 - 0x7CC
   bool m_bInvertState_3; // 0x7CC - 0x7CD
   unsigned char pad_7CD[0x3]; // 0x7CD - 0x7D0
   int32_t m_nMinCount_3; // 0x7D0 - 0x7D4
   int32_t m_nMaxCount_3; // 0x7D4 - 0x7D8
   int32_t m_nMinFactor_3; // 0x7D8 - 0x7DC
   int32_t m_nMaxFactor_3; // 0x7DC - 0x7E0
   unsigned char pad_7E0[0x4]; // 0x7E0 - 0x7E4
   float m_flDefaultDist_3; // 0x7E4 - 0x7E8
   unsigned char pad_7E8[0x18]; // 0x7E8 - 0x800
}; // size - 0x800


class CMotionNode /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlString m_name; // 0x18 - 0x20
   AnimNodeID m_id; // 0x20 - 0x24
   unsigned char pad_24[0x4]; // 0x24 - 0x28
}; // size - 0x28





class CPathAnimMotorUpdaterBase /* "animgraphlib" */ : public CAnimMotorUpdaterBase /* "animgraphlib" */
{
public:
   bool m_bLockToPath; // 0x20 - 0x21
   unsigned char pad_21[0x7]; // 0x21 - 0x28
}; // size - 0x28


class CPhysForce /* "server" */ : public CPointEntity /* "server" */
{
public:
   unsigned char pad_4C0[0x8]; // 0x4C0 - 0x4C8
   CUtlSymbolLarge m_nameAttach; // 0x4C8 - 0x4D0
   float m_force; // 0x4D0 - 0x4D4
   float m_forceTime; // 0x4D4 - 0x4D8
   CHandle< CBaseEntity > m_attachedObject; // 0x4D8 - 0x4DC
   bool m_wasRestored; // 0x4DC - 0x4DD
   unsigned char pad_4DD[0x3]; // 0x4DD - 0x4E0
   CConstantForceController m_integrator; // 0x4E0 - 0x520
}; // size - 0x520


class CPulseCell_WaitForCursorsWithTagBase /* "pulse_system" */ : public CPulseCell_BaseYieldingInflow /* "pulse_system" */
{
public:
   class CursorState_t /* "pulse_system" */
   {
   public:
      CUtlSymbolLarge m_TagName; // 0x0 - 0x8
      unsigned char pad_8[0x28]; // 0x8 - 0x30
   }; // size - 0x30

   int32_t m_nCursorsAllowedToWait; // 0x48 - 0x4C
   unsigned char pad_4C[0x4]; // 0x4C - 0x50
   CPulse_ResumePoint m_WaitComplete; // 0x50 - 0x80
}; // size - 0x80


class CRagdollProp /* "server" */ : public CBaseAnimGraph /* "server" */
{
public:
   unsigned char pad_8E8[0x8]; // 0x8E8 - 0x8F0
   ragdoll_t m_ragdoll; // 0x8F0 - 0x928
   bool m_bStartDisabled; // 0x928 - 0x929
   unsigned char pad_929[0x7]; // 0x929 - 0x930
   CNetworkUtlVectorBase< Vector > m_ragPos; // 0x930 - 0x948
   CNetworkUtlVectorBase< QAngle > m_ragAngles; // 0x948 - 0x960
   CHandle< CBaseEntity > m_hRagdollSource; // 0x960 - 0x964
   uint32_t m_lastUpdateTickCount; // 0x964 - 0x968
   bool m_allAsleep; // 0x968 - 0x969
   bool m_bFirstCollisionAfterLaunch; // 0x969 - 0x96A
   unsigned char pad_96A[0x2]; // 0x96A - 0x96C
   CHandle< CBaseEntity > m_hDamageEntity; // 0x96C - 0x970
   CHandle< CBaseEntity > m_hKiller; // 0x970 - 0x974
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x974 - 0x978
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x978 - 0x97C
   GameTime_t m_flFadeOutStartTime; // 0x97C - 0x980
   float m_flFadeTime; // 0x980 - 0x984
   Vector m_vecLastOrigin; // 0x984 - 0x990
   GameTime_t m_flAwakeTime; // 0x990 - 0x994
   GameTime_t m_flLastOriginChangeTime; // 0x994 - 0x998
   CUtlSymbolLarge m_strOriginClassName; // 0x998 - 0x9A0
   CUtlSymbolLarge m_strSourceClassName; // 0x9A0 - 0x9A8
   bool m_bHasBeenPhysgunned; // 0x9A8 - 0x9A9
   bool m_bShouldTeleportPhysics; // 0x9A9 - 0x9AA
   unsigned char pad_9AA[0x2]; // 0x9AA - 0x9AC
   float m_flBlendWeight; // 0x9AC - 0x9B0
   float m_flDefaultFadeScale; // 0x9B0 - 0x9B4
   unsigned char pad_9B4[0x4]; // 0x9B4 - 0x9B8
   CUtlVector< Vector > m_ragdollMins; // 0x9B8 - 0x9D0
   CUtlVector< Vector > m_ragdollMaxs; // 0x9D0 - 0x9E8
   bool m_bShouldDeleteActivationRecord; // 0x9E8 - 0x9E9
   unsigned char pad_9E9[0x5F]; // 0x9E9 - 0xA48
   bool m_bValidatePoweredRagdollPose; // 0xA48 - 0xA49
   unsigned char pad_A49[0x3F]; // 0xA49 - 0xA88
}; // size - 0xA88


class CSceneEntity /* "server" */ : public CPointEntity /* "server" */
{
public:
   unsigned char pad_4C0[0x8]; // 0x4C0 - 0x4C8
   CUtlSymbolLarge m_iszSceneFile; // 0x4C8 - 0x4D0
   CUtlSymbolLarge m_iszResumeSceneFile; // 0x4D0 - 0x4D8
   CUtlSymbolLarge m_iszTarget1; // 0x4D8 - 0x4E0
   CUtlSymbolLarge m_iszTarget2; // 0x4E0 - 0x4E8
   CUtlSymbolLarge m_iszTarget3; // 0x4E8 - 0x4F0
   CUtlSymbolLarge m_iszTarget4; // 0x4F0 - 0x4F8
   CUtlSymbolLarge m_iszTarget5; // 0x4F8 - 0x500
   CUtlSymbolLarge m_iszTarget6; // 0x500 - 0x508
   CUtlSymbolLarge m_iszTarget7; // 0x508 - 0x510
   CUtlSymbolLarge m_iszTarget8; // 0x510 - 0x518
   CHandle< CBaseEntity > m_hTarget1; // 0x518 - 0x51C
   CHandle< CBaseEntity > m_hTarget2; // 0x51C - 0x520
   CHandle< CBaseEntity > m_hTarget3; // 0x520 - 0x524
   CHandle< CBaseEntity > m_hTarget4; // 0x524 - 0x528
   CHandle< CBaseEntity > m_hTarget5; // 0x528 - 0x52C
   CHandle< CBaseEntity > m_hTarget6; // 0x52C - 0x530
   CHandle< CBaseEntity > m_hTarget7; // 0x530 - 0x534
   CHandle< CBaseEntity > m_hTarget8; // 0x534 - 0x538
   CUtlSymbolLarge m_sTargetAttachment; // 0x538 - 0x540
   bool m_bIsPlayingBack; // 0x540 - 0x541
   bool m_bPaused; // 0x541 - 0x542
   bool m_bMultiplayer; // 0x542 - 0x543
   bool m_bAutogenerated; // 0x543 - 0x544
   float m_flForceClientTime; // 0x544 - 0x548
   float m_flCurrentTime; // 0x548 - 0x54C
   float m_flFrameTime; // 0x54C - 0x550
   bool m_bCancelAtNextInterrupt; // 0x550 - 0x551
   unsigned char pad_551[0x3]; // 0x551 - 0x554
   float m_fPitch; // 0x554 - 0x558
   bool m_bAutomated; // 0x558 - 0x559
   unsigned char pad_559[0x3]; // 0x559 - 0x55C
   int32_t m_nAutomatedAction; // 0x55C - 0x560
   float m_flAutomationDelay; // 0x560 - 0x564
   float m_flAutomationTime; // 0x564 - 0x568
   CHandle< CBaseEntity > m_hWaitingForThisResumeScene; // 0x568 - 0x56C
   bool m_bWaitingForResumeScene; // 0x56C - 0x56D
   bool m_bPausedViaInput; // 0x56D - 0x56E
   bool m_bPauseAtNextInterrupt; // 0x56E - 0x56F
   bool m_bWaitingForActor; // 0x56F - 0x570
   bool m_bWaitingForInterrupt; // 0x570 - 0x571
   bool m_bInterruptedActorsScenes; // 0x571 - 0x572
   bool m_bBreakOnNonIdle; // 0x572 - 0x573
   bool m_bSceneFinished; // 0x573 - 0x574
   unsigned char pad_574[0x4]; // 0x574 - 0x578
   CNetworkUtlVectorBase< CHandle< CBaseFlex > > m_hActorList; // 0x578 - 0x590
   CUtlVector< CHandle< CBaseEntity > > m_hRemoveActorList; // 0x590 - 0x5A8
   unsigned char pad_5A8[0x30]; // 0x5A8 - 0x5D8
   int32_t m_nSceneFlushCounter; // 0x5D8 - 0x5DC
   uint16_t m_nSceneStringIndex; // 0x5DC - 0x5DE
   unsigned char pad_5DE[0x2]; // 0x5DE - 0x5E0
   CEntityIOOutput m_OnStart; // 0x5E0 - 0x608
   CEntityIOOutput m_OnCompletion; // 0x608 - 0x630
   CEntityIOOutput m_OnCanceled; // 0x630 - 0x658
   CEntityIOOutput m_OnPaused; // 0x658 - 0x680
   CEntityIOOutput m_OnResumed; // 0x680 - 0x6A8
   CEntityIOOutput m_OnTrigger[16]; // 0x6A8 - 0x928
   unsigned char pad_928[0x90]; // 0x928 - 0x9B8
   CHandle< CSceneEntity > m_hInterruptScene; // 0x9B8 - 0x9BC
   int32_t m_nInterruptCount; // 0x9BC - 0x9C0
   bool m_bSceneMissing; // 0x9C0 - 0x9C1
   bool m_bInterrupted; // 0x9C1 - 0x9C2
   bool m_bCompletedEarly; // 0x9C2 - 0x9C3
   bool m_bInterruptSceneFinished; // 0x9C3 - 0x9C4
   bool m_bRestoring; // 0x9C4 - 0x9C5
   unsigned char pad_9C5[0x3]; // 0x9C5 - 0x9C8
   CUtlVector< CHandle< CSceneEntity > > m_hNotifySceneCompletion; // 0x9C8 - 0x9E0
   CUtlVector< CHandle< CSceneListManager > > m_hListManagers; // 0x9E0 - 0x9F8
   CUtlSymbolLarge m_iszSoundName; // 0x9F8 - 0xA00
   CUtlSymbolLarge m_iszSequenceName; // 0xA00 - 0xA08
   CHandle< CBaseFlex > m_hActor; // 0xA08 - 0xA0C
   CHandle< CBaseEntity > m_hActivator; // 0xA0C - 0xA10
   int32_t m_BusyActor; // 0xA10 - 0xA14
   SceneOnPlayerDeath_t m_iPlayerDeathBehavior; // 0xA14 - 0xA18
   unsigned char pad_A18[0x8]; // 0xA18 - 0xA20
}; // size - 0xA20


class CSkeletonAnimationController /* "server" */ : public ISkeletonAnimationController /* "server" */
{
public:
   CSkeletonInstance* m_pSkeletonInstance; // 0x8 - 0x10
}; // size - 0x10


class CSoundAreaEntityBase /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x4C0 - 0x4C1
   unsigned char pad_4C1[0x7]; // 0x4C1 - 0x4C8
   CUtlSymbolLarge m_iszSoundAreaType; // 0x4C8 - 0x4D0
   Vector m_vPos; // 0x4D0 - 0x4DC
   unsigned char pad_4DC[0x4]; // 0x4DC - 0x4E0
}; // size - 0x4E0


class CTriggerOnce /* "server" */ : public CTriggerMultiple /* "server" */
{
public:
   unsigned char pad_0[0x908]; // 0x0 - 0x908
}; // size - 0x908


class C_BaseViewModel /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   unsigned char pad_ED0[0x8]; // 0xED0 - 0xED8
   Vector m_vecLastFacing; // 0xED8 - 0xEE4
   uint32_t m_nViewModelIndex; // 0xEE4 - 0xEE8
   uint32_t m_nAnimationParity; // 0xEE8 - 0xEEC
   float m_flAnimationStartTime; // 0xEEC - 0xEF0
   CHandle< C_BasePlayerWeapon > m_hWeapon; // 0xEF0 - 0xEF4
   unsigned char pad_EF4[0x4]; // 0xEF4 - 0xEF8
   CUtlSymbolLarge m_sVMName; // 0xEF8 - 0xF00
   CUtlSymbolLarge m_sAnimationPrefix; // 0xF00 - 0xF08
   CHandle< C_ViewmodelWeapon > m_hWeaponModel; // 0xF08 - 0xF0C
   AttachmentHandle_t m_iCameraAttachment; // 0xF0C - 0xF0D
   unsigned char pad_F0D[0x3]; // 0xF0D - 0xF10
   QAngle m_vecLastCameraAngles; // 0xF10 - 0xF1C
   float m_previousElapsedDuration; // 0xF1C - 0xF20
   float m_previousCycle; // 0xF20 - 0xF24
   int32_t m_nOldAnimationParity; // 0xF24 - 0xF28
   HSequence m_hOldLayerSequence; // 0xF28 - 0xF2C
   int32_t m_oldLayer; // 0xF2C - 0xF30
   float m_oldLayerStartTime; // 0xF30 - 0xF34
   CHandle< C_BaseEntity > m_hControlPanel; // 0xF34 - 0xF38
}; // size - 0xF38


class C_CSGO_EndOfMatchLineupEndpoint /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x548]; // 0x0 - 0x548
}; // size - 0x548


class C_FuncBrush /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_0[0xCC8]; // 0x0 - 0xCC8
}; // size - 0xCC8


class C_MultiplayRules /* "client" */ : public C_GameRules /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class C_PhysicsProp /* "client" */ : public C_BreakableProp /* "client" */
{
public:
   bool m_bAwake; // 0x1040 - 0x1041
   unsigned char pad_1041[0x7]; // 0x1041 - 0x1048
}; // size - 0x1048


class C_SoundAreaEntityBase /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   bool m_bDisabled; // 0x548 - 0x549
   unsigned char pad_549[0x7]; // 0x549 - 0x550
   bool m_bWasEnabled; // 0x550 - 0x551
   unsigned char pad_551[0x7]; // 0x551 - 0x558
   CUtlSymbolLarge m_iszSoundAreaType; // 0x558 - 0x560
   Vector m_vPos; // 0x560 - 0x56C
   unsigned char pad_56C[0x4]; // 0x56C - 0x570
}; // size - 0x570


class EventAdvanceTick_t /* "engine2" */ : public EventSimulate_t /* "engine2" */
{
public:
   int32_t m_nCurrentTick; // 0x30 - 0x34
   int32_t m_nCurrentTickThisFrame; // 0x34 - 0x38
   int32_t m_nTotalTicksThisFrame; // 0x38 - 0x3C
   int32_t m_nTotalTicks; // 0x3C - 0x40
}; // size - 0x40


class EventPostAdvanceTick_t /* "engine2" */ : public EventSimulate_t /* "engine2" */
{
public:
   int32_t m_nCurrentTick; // 0x30 - 0x34
   int32_t m_nCurrentTickThisFrame; // 0x34 - 0x38
   int32_t m_nTotalTicksThisFrame; // 0x38 - 0x3C
   int32_t m_nTotalTicks; // 0x3C - 0x40
}; // size - 0x40


class IEconItemInterface /* "server" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class CAnimGraphSettingsGroup /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
}; // size - 0x20


class CBasePlayerController /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_548[0x8]; // 0x548 - 0x550
   int32_t m_nFinalPredictedTick; // 0x550 - 0x554
   unsigned char pad_554[0x4]; // 0x554 - 0x558
   C_CommandContext m_CommandContext; // 0x558 - 0x5F0
   uint64_t m_nInButtonsWhichAreToggles; // 0x5F0 - 0x5F8
   uint32_t m_nTickBase; // 0x5F8 - 0x5FC
   CHandle< C_BasePlayerPawn > m_hPawn; // 0x5FC - 0x600
   bool m_bKnownTeamMismatch; // 0x600 - 0x601
   unsigned char pad_601[0x3]; // 0x601 - 0x604
   CHandle< C_BasePlayerPawn > m_hPredictedPawn; // 0x604 - 0x608
   CSplitScreenSlot m_nSplitScreenSlot; // 0x608 - 0x60C
   CHandle< CBasePlayerController > m_hSplitOwner; // 0x60C - 0x610
   CUtlVector< CHandle< CBasePlayerController > > m_hSplitScreenPlayers; // 0x610 - 0x628
   bool m_bIsHLTV; // 0x628 - 0x629
   unsigned char pad_629[0x3]; // 0x629 - 0x62C
   PlayerConnectedState m_iConnected; // 0x62C - 0x630
   char m_iszPlayerName[128]; // 0x630 - 0x6B0
   unsigned char pad_6B0[0x8]; // 0x6B0 - 0x6B8
   uint64_t m_steamID; // 0x6B8 - 0x6C0
   bool m_bIsLocalPlayerController; // 0x6C0 - 0x6C1
   unsigned char pad_6C1[0x3]; // 0x6C1 - 0x6C4
   uint32_t m_iDesiredFOV; // 0x6C4 - 0x6C8
   unsigned char pad_6C8[0x18]; // 0x6C8 - 0x6E0
}; // size - 0x6E0


class CBasePlayerController /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_4C0[0x8]; // 0x4C0 - 0x4C8
   uint64_t m_nInButtonsWhichAreToggles; // 0x4C8 - 0x4D0
   uint32_t m_nTickBase; // 0x4D0 - 0x4D4
   unsigned char pad_4D4[0x2C]; // 0x4D4 - 0x500
   CHandle< CBasePlayerPawn > m_hPawn; // 0x500 - 0x504
   bool m_bKnownTeamMismatch; // 0x504 - 0x505
   unsigned char pad_505[0x3]; // 0x505 - 0x508
   CSplitScreenSlot m_nSplitScreenSlot; // 0x508 - 0x50C
   CHandle< CBasePlayerController > m_hSplitOwner; // 0x50C - 0x510
   CUtlVector< CHandle< CBasePlayerController > > m_hSplitScreenPlayers; // 0x510 - 0x528
   bool m_bIsHLTV; // 0x528 - 0x529
   unsigned char pad_529[0x3]; // 0x529 - 0x52C
   PlayerConnectedState m_iConnected; // 0x52C - 0x530
   char m_iszPlayerName[128]; // 0x530 - 0x5B0
   CUtlString m_szNetworkIDString; // 0x5B0 - 0x5B8
   float m_fLerpTime; // 0x5B8 - 0x5BC
   bool m_bLagCompensation; // 0x5BC - 0x5BD
   bool m_bPredict; // 0x5BD - 0x5BE
   bool m_bAutoKickDisabled; // 0x5BE - 0x5BF
   bool m_bIsLowViolence; // 0x5BF - 0x5C0
   bool m_bGamePaused; // 0x5C0 - 0x5C1
   unsigned char pad_5C1[0x93]; // 0x5C1 - 0x654
   int32_t m_nLastRealCommandNumberExecuted; // 0x654 - 0x658
   int32_t m_nLastLateCommandExecuted; // 0x658 - 0x65C
   unsigned char pad_65C[0x14]; // 0x65C - 0x670
   ChatIgnoreType_t m_iIgnoreGlobalChat; // 0x670 - 0x674
   float m_flLastPlayerTalkTime; // 0x674 - 0x678
   float m_flLastEntitySteadyState; // 0x678 - 0x67C
   int32_t m_nAvailableEntitySteadyState; // 0x67C - 0x680
   bool m_bHasAnySteadyStateEnts; // 0x680 - 0x681
   unsigned char pad_681[0xF]; // 0x681 - 0x690
   uint64_t m_steamID; // 0x690 - 0x698
   uint32_t m_iDesiredFOV; // 0x698 - 0x69C
   unsigned char pad_69C[0x1C]; // 0x69C - 0x6B8
}; // size - 0x6B8


class CBasePlayerWeaponVData /* "server" */ : public CEntitySubclassVDataBase /* "server" */
{
public:
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_szWorldModel; // 0x28 - 0x108
   bool m_bBuiltRightHanded; // 0x108 - 0x109
   bool m_bAllowFlipping; // 0x109 - 0x10A
   unsigned char pad_10A[0x6]; // 0x10A - 0x110
   CUtlString m_sMuzzleAttachment; // 0x110 - 0x118
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szMuzzleFlashParticle; // 0x118 - 0x1F8
   ItemFlagTypes_t m_iFlags; // 0x1F8 - 0x1F9
   AmmoIndex_t m_nPrimaryAmmoType; // 0x1F9 - 0x1FA
   AmmoIndex_t m_nSecondaryAmmoType; // 0x1FA - 0x1FB
   unsigned char pad_1FB[0x1]; // 0x1FB - 0x1FC
   int32_t m_iMaxClip1; // 0x1FC - 0x200
   int32_t m_iMaxClip2; // 0x200 - 0x204
   int32_t m_iDefaultClip1; // 0x204 - 0x208
   int32_t m_iDefaultClip2; // 0x208 - 0x20C
   int32_t m_iWeight; // 0x20C - 0x210
   bool m_bAutoSwitchTo; // 0x210 - 0x211
   bool m_bAutoSwitchFrom; // 0x211 - 0x212
   unsigned char pad_212[0x2]; // 0x212 - 0x214
   RumbleEffect_t m_iRumbleEffect; // 0x214 - 0x218
   bool m_bLinkedCooldowns; // 0x218 - 0x219
   unsigned char pad_219[0x7]; // 0x219 - 0x220
   CUtlOrderedMap< WeaponSound_t, CSoundEventName > m_aShootSounds; // 0x220 - 0x248
   int32_t m_iSlot; // 0x248 - 0x24C
   int32_t m_iPosition; // 0x24C - 0x250
}; // size - 0x250


class CBasePlayerWeaponVData /* "client" */ : public CEntitySubclassVDataBase /* "client" */
{
public:
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_szWorldModel; // 0x28 - 0x108
   bool m_bBuiltRightHanded; // 0x108 - 0x109
   bool m_bAllowFlipping; // 0x109 - 0x10A
   unsigned char pad_10A[0x6]; // 0x10A - 0x110
   CUtlString m_sMuzzleAttachment; // 0x110 - 0x118
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szMuzzleFlashParticle; // 0x118 - 0x1F8
   ItemFlagTypes_t m_iFlags; // 0x1F8 - 0x1F9
   AmmoIndex_t m_nPrimaryAmmoType; // 0x1F9 - 0x1FA
   AmmoIndex_t m_nSecondaryAmmoType; // 0x1FA - 0x1FB
   unsigned char pad_1FB[0x1]; // 0x1FB - 0x1FC
   int32_t m_iMaxClip1; // 0x1FC - 0x200
   int32_t m_iMaxClip2; // 0x200 - 0x204
   int32_t m_iDefaultClip1; // 0x204 - 0x208
   int32_t m_iDefaultClip2; // 0x208 - 0x20C
   int32_t m_iWeight; // 0x20C - 0x210
   bool m_bAutoSwitchTo; // 0x210 - 0x211
   bool m_bAutoSwitchFrom; // 0x211 - 0x212
   unsigned char pad_212[0x2]; // 0x212 - 0x214
   RumbleEffect_t m_iRumbleEffect; // 0x214 - 0x218
   bool m_bLinkedCooldowns; // 0x218 - 0x219
   unsigned char pad_219[0x7]; // 0x219 - 0x220
   CUtlOrderedMap< WeaponSound_t, CSoundEventName > m_aShootSounds; // 0x220 - 0x248
   int32_t m_iSlot; // 0x248 - 0x24C
   int32_t m_iPosition; // 0x24C - 0x250
}; // size - 0x250


class CBaseTrailRenderer /* "particles" */ : public CBaseRendererSource2 /* "particles" */
{
public:
   ParticleOrientationChoiceList_t m_nOrientationType; // 0x2718 - 0x271C
   int32_t m_nOrientationControlPoint; // 0x271C - 0x2720
   float m_flMinSize; // 0x2720 - 0x2724
   float m_flMaxSize; // 0x2724 - 0x2728
   CParticleCollectionRendererFloatInput m_flStartFadeSize; // 0x2728 - 0x2880
   CParticleCollectionRendererFloatInput m_flEndFadeSize; // 0x2880 - 0x29D8
   bool m_bClampV; // 0x29D8 - 0x29D9
   unsigned char pad_29D9[0x7]; // 0x29D9 - 0x29E0
}; // size - 0x29E0


class CCSPointScriptEntity /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x550]; // 0x0 - 0x550
}; // size - 0x550


class CEnvSoundscapeTriggerable /* "server" */ : public CEnvSoundscape /* "server" */
{
public:
   unsigned char pad_0[0x558]; // 0x0 - 0x558
}; // size - 0x558


class CFuncNavBlocker /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x710 - 0x711
   unsigned char pad_711[0x3]; // 0x711 - 0x714
   int32_t m_nBlockedTeamNumber; // 0x714 - 0x718
   unsigned char pad_718[0x8]; // 0x718 - 0x720
}; // size - 0x720


class CFuncTrackTrain /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   CHandle< CPathTrack > m_ppath; // 0x710 - 0x714
   float m_length; // 0x714 - 0x718
   Vector m_vPosPrev; // 0x718 - 0x724
   QAngle m_angPrev; // 0x724 - 0x730
   Vector m_controlMins; // 0x730 - 0x73C
   Vector m_controlMaxs; // 0x73C - 0x748
   Vector m_lastBlockPos; // 0x748 - 0x754
   int32_t m_lastBlockTick; // 0x754 - 0x758
   float m_flVolume; // 0x758 - 0x75C
   float m_flBank; // 0x75C - 0x760
   float m_oldSpeed; // 0x760 - 0x764
   float m_flBlockDamage; // 0x764 - 0x768
   float m_height; // 0x768 - 0x76C
   float m_maxSpeed; // 0x76C - 0x770
   float m_dir; // 0x770 - 0x774
   unsigned char pad_774[0x4]; // 0x774 - 0x778
   CUtlSymbolLarge m_iszSoundMove; // 0x778 - 0x780
   CUtlSymbolLarge m_iszSoundMovePing; // 0x780 - 0x788
   CUtlSymbolLarge m_iszSoundStart; // 0x788 - 0x790
   CUtlSymbolLarge m_iszSoundStop; // 0x790 - 0x798
   CUtlSymbolLarge m_strPathTarget; // 0x798 - 0x7A0
   float m_flMoveSoundMinDuration; // 0x7A0 - 0x7A4
   float m_flMoveSoundMaxDuration; // 0x7A4 - 0x7A8
   GameTime_t m_flNextMoveSoundTime; // 0x7A8 - 0x7AC
   float m_flMoveSoundMinPitch; // 0x7AC - 0x7B0
   float m_flMoveSoundMaxPitch; // 0x7B0 - 0x7B4
   TrainOrientationType_t m_eOrientationType; // 0x7B4 - 0x7B8
   TrainVelocityType_t m_eVelocityType; // 0x7B8 - 0x7BC
   unsigned char pad_7BC[0xC]; // 0x7BC - 0x7C8
   CEntityIOOutput m_OnStart; // 0x7C8 - 0x7F0
   CEntityIOOutput m_OnNext; // 0x7F0 - 0x818
   CEntityIOOutput m_OnArrivedAtDestinationNode; // 0x818 - 0x840
   bool m_bManualSpeedChanges; // 0x840 - 0x841
   unsigned char pad_841[0x3]; // 0x841 - 0x844
   float m_flDesiredSpeed; // 0x844 - 0x848
   GameTime_t m_flSpeedChangeTime; // 0x848 - 0x84C
   float m_flAccelSpeed; // 0x84C - 0x850
   float m_flDecelSpeed; // 0x850 - 0x854
   bool m_bAccelToSpeed; // 0x854 - 0x855
   unsigned char pad_855[0x3]; // 0x855 - 0x858
   GameTime_t m_flNextMPSoundTime; // 0x858 - 0x85C
   unsigned char pad_85C[0x4]; // 0x85C - 0x860
}; // size - 0x860


class CHostageRescueZoneShim /* "client" */ : public C_BaseTrigger /* "client" */
{
public:
   unsigned char pad_0[0xCD0]; // 0x0 - 0xCD0
}; // size - 0xCD0


class CHostageRescueZoneShim /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   unsigned char pad_0[0x8E0]; // 0x0 - 0x8E0
}; // size - 0x8E0


class CInfoDynamicShadowHint /* "server" */ : public CPointEntity /* "server" */
{
public:
   bool m_bDisabled; // 0x4C0 - 0x4C1
   unsigned char pad_4C1[0x3]; // 0x4C1 - 0x4C4
   float m_flRange; // 0x4C4 - 0x4C8
   int32_t m_nImportance; // 0x4C8 - 0x4CC
   int32_t m_nLightChoice; // 0x4CC - 0x4D0
   CHandle< CBaseEntity > m_hLight; // 0x4D0 - 0x4D4
   unsigned char pad_4D4[0x4]; // 0x4D4 - 0x4D8
}; // size - 0x4D8


class CInfoDynamicShadowHint /* "client" */ : public C_PointEntity /* "client" */
{
public:
   bool m_bDisabled; // 0x548 - 0x549
   unsigned char pad_549[0x3]; // 0x549 - 0x54C
   float m_flRange; // 0x54C - 0x550
   int32_t m_nImportance; // 0x550 - 0x554
   int32_t m_nLightChoice; // 0x554 - 0x558
   CHandle< C_BaseEntity > m_hLight; // 0x558 - 0x55C
   unsigned char pad_55C[0x4]; // 0x55C - 0x560
}; // size - 0x560


class CLightDirectionalEntity /* "server" */ : public CLightEntity /* "server" */
{
public:
   unsigned char pad_0[0x718]; // 0x0 - 0x718
}; // size - 0x718


class CLogicAutosave /* "server" */ : public CLogicalEntity /* "server" */
{
public:
   bool m_bForceNewLevelUnit; // 0x4C0 - 0x4C1
   unsigned char pad_4C1[0x3]; // 0x4C1 - 0x4C4
   int32_t m_minHitPoints; // 0x4C4 - 0x4C8
   int32_t m_minHitPointsToCommit; // 0x4C8 - 0x4CC
   unsigned char pad_4CC[0x4]; // 0x4CC - 0x4D0
}; // size - 0x4D0


class CNavVolumeCalculatedVector /* "server" */ : public CNavVolume /* "server" */
{
public:
   unsigned char pad_0[0x98]; // 0x0 - 0x98
}; // size - 0x98


class CNavVolumeVector /* "navlib" */ : public CNavVolume /* "navlib" */
{
public:
   unsigned char pad_70[0x8]; // 0x70 - 0x78
   bool m_bHasBeenPreFiltered; // 0x78 - 0x79
   unsigned char pad_79[0x1F]; // 0x79 - 0x98
}; // size - 0x98



class CParticleCollectionVecInput /* "particleslib" */ : public CParticleVecInput /* "particleslib" */
{
public:
   unsigned char pad_0[0x658]; // 0x0 - 0x658
}; // size - 0x658


class CParticleSystem /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   char m_szSnapshotFileName[512]; // 0x710 - 0x910
   bool m_bActive; // 0x910 - 0x911
   bool m_bFrozen; // 0x911 - 0x912
   unsigned char pad_912[0x2]; // 0x912 - 0x914
   float m_flFreezeTransitionDuration; // 0x914 - 0x918
   int32_t m_nStopType; // 0x918 - 0x91C
   bool m_bAnimateDuringGameplayPause; // 0x91C - 0x91D
   unsigned char pad_91D[0x3]; // 0x91D - 0x920
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x920 - 0x928
   GameTime_t m_flStartTime; // 0x928 - 0x92C
   float m_flPreSimTime; // 0x92C - 0x930
   Vector m_vServerControlPoints[4]; // 0x930 - 0x960
   uint8 m_iServerControlPointAssignments[4]; // 0x960 - 0x964
   CHandle< CBaseEntity > m_hControlPointEnts[64]; // 0x964 - 0xA64
   bool m_bNoSave; // 0xA64 - 0xA65
   bool m_bNoFreeze; // 0xA65 - 0xA66
   bool m_bNoRamp; // 0xA66 - 0xA67
   bool m_bStartActive; // 0xA67 - 0xA68
   CUtlSymbolLarge m_iszEffectName; // 0xA68 - 0xA70
   CUtlSymbolLarge m_iszControlPointNames[64]; // 0xA70 - 0xC70
   int32_t m_nDataCP; // 0xC70 - 0xC74
   Vector m_vecDataCPValue; // 0xC74 - 0xC80
   int32_t m_nTintCP; // 0xC80 - 0xC84
   Color m_clrTint; // 0xC84 - 0xC88
}; // size - 0xC88


class CPathCorner /* "server" */ : public CPointEntity /* "server" */
{
public:
   float m_flWait; // 0x4C0 - 0x4C4
   float m_flRadius; // 0x4C4 - 0x4C8
   CEntityIOOutput m_OnPass; // 0x4C8 - 0x4F0
}; // size - 0x4F0


class CPathParticleRope /* "server" */ : public CBaseEntity /* "server" */
{
public:
   bool m_bStartActive; // 0x4C0 - 0x4C1
   unsigned char pad_4C1[0x3]; // 0x4C1 - 0x4C4
   float m_flMaxSimulationTime; // 0x4C4 - 0x4C8
   CUtlSymbolLarge m_iszEffectName; // 0x4C8 - 0x4D0
   CUtlVector< CUtlSymbolLarge > m_PathNodes_Name; // 0x4D0 - 0x4E8
   float m_flParticleSpacing; // 0x4E8 - 0x4EC
   float m_flSlack; // 0x4EC - 0x4F0
   float m_flRadius; // 0x4F0 - 0x4F4
   Color m_ColorTint; // 0x4F4 - 0x4F8
   int32_t m_nEffectState; // 0x4F8 - 0x4FC
   unsigned char pad_4FC[0x4]; // 0x4FC - 0x500
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x500 - 0x508
   CNetworkUtlVectorBase< Vector > m_PathNodes_Position; // 0x508 - 0x520
   CNetworkUtlVectorBase< Vector > m_PathNodes_TangentIn; // 0x520 - 0x538
   CNetworkUtlVectorBase< Vector > m_PathNodes_TangentOut; // 0x538 - 0x550
   CNetworkUtlVectorBase< Vector > m_PathNodes_Color; // 0x550 - 0x568
   CNetworkUtlVectorBase< bool > m_PathNodes_PinEnabled; // 0x568 - 0x580
   CNetworkUtlVectorBase< float32 > m_PathNodes_RadiusScale; // 0x580 - 0x598
   unsigned char pad_598[0x8]; // 0x598 - 0x5A0
}; // size - 0x5A0


class CPlayer_ObserverServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   uint8_t m_iObserverMode; // 0x40 - 0x41
   unsigned char pad_41[0x3]; // 0x41 - 0x44
   CHandle< CBaseEntity > m_hObserverTarget; // 0x44 - 0x48
   ObserverMode_t m_iObserverLastMode; // 0x48 - 0x4C
   bool m_bForcedObserverMode; // 0x4C - 0x4D
   unsigned char pad_4D[0x3]; // 0x4D - 0x50
}; // size - 0x50


class CPlayer_ObserverServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   uint8_t m_iObserverMode; // 0x40 - 0x41
   unsigned char pad_41[0x3]; // 0x41 - 0x44
   CHandle< C_BaseEntity > m_hObserverTarget; // 0x44 - 0x48
   ObserverMode_t m_iObserverLastMode; // 0x48 - 0x4C
   bool m_bForcedObserverMode; // 0x4C - 0x4D
   unsigned char pad_4D[0x3]; // 0x4D - 0x50
   float m_flObserverChaseDistance; // 0x50 - 0x54
   GameTime_t m_flObserverChaseDistanceCalcTime; // 0x54 - 0x58
}; // size - 0x58


class CPlayer_WeaponServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   CNetworkUtlVectorBase< CHandle< CBasePlayerWeapon > > m_hMyWeapons; // 0x40 - 0x58
   CHandle< CBasePlayerWeapon > m_hActiveWeapon; // 0x58 - 0x5C
   CHandle< CBasePlayerWeapon > m_hLastWeapon; // 0x5C - 0x60
   uint16 m_iAmmo[32]; // 0x60 - 0xA0
   bool m_bPreventWeaponPickup; // 0xA0 - 0xA1
   unsigned char pad_A1[0x7]; // 0xA1 - 0xA8
}; // size - 0xA8


class CPlayer_WeaponServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   C_NetworkUtlVectorBase< CHandle< C_BasePlayerWeapon > > m_hMyWeapons; // 0x40 - 0x58
   CHandle< C_BasePlayerWeapon > m_hActiveWeapon; // 0x58 - 0x5C
   CHandle< C_BasePlayerWeapon > m_hLastWeapon; // 0x5C - 0x60
   uint16 m_iAmmo[32]; // 0x60 - 0xA0
}; // size - 0xA0


class CPointCamera /* "server" */ : public CBaseEntity /* "server" */
{
public:
   float m_FOV; // 0x4C0 - 0x4C4
   float m_Resolution; // 0x4C4 - 0x4C8
   bool m_bFogEnable; // 0x4C8 - 0x4C9
   Color m_FogColor; // 0x4C9 - 0x4CD
   unsigned char pad_4CD[0x3]; // 0x4CD - 0x4D0
   float m_flFogStart; // 0x4D0 - 0x4D4
   float m_flFogEnd; // 0x4D4 - 0x4D8
   float m_flFogMaxDensity; // 0x4D8 - 0x4DC
   bool m_bActive; // 0x4DC - 0x4DD
   bool m_bUseScreenAspectRatio; // 0x4DD - 0x4DE
   unsigned char pad_4DE[0x2]; // 0x4DE - 0x4E0
   float m_flAspectRatio; // 0x4E0 - 0x4E4
   bool m_bNoSky; // 0x4E4 - 0x4E5
   unsigned char pad_4E5[0x3]; // 0x4E5 - 0x4E8
   float m_fBrightness; // 0x4E8 - 0x4EC
   float m_flZFar; // 0x4EC - 0x4F0
   float m_flZNear; // 0x4F0 - 0x4F4
   bool m_bCanHLTVUse; // 0x4F4 - 0x4F5
   bool m_bDofEnabled; // 0x4F5 - 0x4F6
   unsigned char pad_4F6[0x2]; // 0x4F6 - 0x4F8
   float m_flDofNearBlurry; // 0x4F8 - 0x4FC
   float m_flDofNearCrisp; // 0x4FC - 0x500
   float m_flDofFarCrisp; // 0x500 - 0x504
   float m_flDofFarBlurry; // 0x504 - 0x508
   float m_flDofTiltToGround; // 0x508 - 0x50C
   float m_TargetFOV; // 0x50C - 0x510
   float m_DegreesPerSecond; // 0x510 - 0x514
   bool m_bIsOn; // 0x514 - 0x515
   unsigned char pad_515[0x3]; // 0x515 - 0x518
   CPointCamera* m_pNext; // 0x518 - 0x520
}; // size - 0x520


class CPointClientUIWorldPanel /* "server" */ : public CBaseClientUIEntity /* "server" */
{
public:
   bool m_bIgnoreInput; // 0x8C0 - 0x8C1
   bool m_bLit; // 0x8C1 - 0x8C2
   bool m_bFollowPlayerAcrossTeleport; // 0x8C2 - 0x8C3
   unsigned char pad_8C3[0x1]; // 0x8C3 - 0x8C4
   float m_flWidth; // 0x8C4 - 0x8C8
   float m_flHeight; // 0x8C8 - 0x8CC
   float m_flDPI; // 0x8CC - 0x8D0
   float m_flInteractDistance; // 0x8D0 - 0x8D4
   float m_flDepthOffset; // 0x8D4 - 0x8D8
   uint32_t m_unOwnerContext; // 0x8D8 - 0x8DC
   uint32_t m_unHorizontalAlign; // 0x8DC - 0x8E0
   uint32_t m_unVerticalAlign; // 0x8E0 - 0x8E4
   uint32_t m_unOrientation; // 0x8E4 - 0x8E8
   bool m_bAllowInteractionFromAllSceneWorlds; // 0x8E8 - 0x8E9
   unsigned char pad_8E9[0x7]; // 0x8E9 - 0x8F0
   CNetworkUtlVectorBase< CUtlSymbolLarge > m_vecCSSClasses; // 0x8F0 - 0x908
   bool m_bOpaque; // 0x908 - 0x909
   bool m_bNoDepth; // 0x909 - 0x90A
   bool m_bRenderBackface; // 0x90A - 0x90B
   bool m_bUseOffScreenIndicator; // 0x90B - 0x90C
   bool m_bExcludeFromSaveGames; // 0x90C - 0x90D
   bool m_bGrabbable; // 0x90D - 0x90E
   bool m_bOnlyRenderToTexture; // 0x90E - 0x90F
   bool m_bDisableMipGen; // 0x90F - 0x910
   int32_t m_nExplicitImageLayout; // 0x910 - 0x914
   unsigned char pad_914[0x4]; // 0x914 - 0x918
}; // size - 0x918


class CPredictedViewModel /* "server" */ : public CBaseViewModel /* "server" */
{
public:
   unsigned char pad_0[0x930]; // 0x0 - 0x930
}; // size - 0x930


class CPropDoorRotating /* "server" */ : public CBasePropDoor /* "server" */
{
public:
   Vector m_vecAxis; // 0xE10 - 0xE1C
   float m_flDistance; // 0xE1C - 0xE20
   PropDoorRotatingSpawnPos_t m_eSpawnPosition; // 0xE20 - 0xE24
   PropDoorRotatingOpenDirection_e m_eOpenDirection; // 0xE24 - 0xE28
   PropDoorRotatingOpenDirection_e m_eCurrentOpenDirection; // 0xE28 - 0xE2C
   float m_flAjarAngle; // 0xE2C - 0xE30
   QAngle m_angRotationAjarDeprecated; // 0xE30 - 0xE3C
   QAngle m_angRotationClosed; // 0xE3C - 0xE48
   QAngle m_angRotationOpenForward; // 0xE48 - 0xE54
   QAngle m_angRotationOpenBack; // 0xE54 - 0xE60
   QAngle m_angGoal; // 0xE60 - 0xE6C
   Vector m_vecForwardBoundsMin; // 0xE6C - 0xE78
   Vector m_vecForwardBoundsMax; // 0xE78 - 0xE84
   Vector m_vecBackBoundsMin; // 0xE84 - 0xE90
   Vector m_vecBackBoundsMax; // 0xE90 - 0xE9C
   bool m_bAjarDoorShouldntAlwaysOpen; // 0xE9C - 0xE9D
   unsigned char pad_E9D[0x3]; // 0xE9D - 0xEA0
   CHandle< CEntityBlocker > m_hEntityBlocker; // 0xEA0 - 0xEA4
   unsigned char pad_EA4[0x4]; // 0xEA4 - 0xEA8
}; // size - 0xEA8



class CPulseCell_BaseRequirement /* "pulse_runtime_lib" */ : public CPulseCell_Base /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x48]; // 0x0 - 0x48
}; // size - 0x48


class CPulseGraphInstance_ServerEntity /* "server" */ : public CBasePulseGraphInstance /* "server" */
{
public:
   unsigned char pad_F8[0x8]; // 0xF8 - 0x100
   CPulseGraphComponentBase* m_pComponent; // 0x100 - 0x108
   unsigned char pad_108[0x48]; // 0x108 - 0x150
}; // size - 0x150


class CPulse_ResumePoint /* "pulse_runtime_lib" */ : public CPulse_OutflowConnection /* "pulse_runtime_lib" */
{
public:
   unsigned char pad_0[0x30]; // 0x0 - 0x30
}; // size - 0x30


class CRopeKeyframe /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_710[0x8]; // 0x710 - 0x718
   uint16_t m_RopeFlags; // 0x718 - 0x71A
   unsigned char pad_71A[0x6]; // 0x71A - 0x720
   CUtlSymbolLarge m_iNextLinkName; // 0x720 - 0x728
   int16_t m_Slack; // 0x728 - 0x72A
   unsigned char pad_72A[0x2]; // 0x72A - 0x72C
   float m_Width; // 0x72C - 0x730
   float m_TextureScale; // 0x730 - 0x734
   uint8_t m_nSegments; // 0x734 - 0x735
   bool m_bConstrainBetweenEndpoints; // 0x735 - 0x736
   unsigned char pad_736[0x2]; // 0x736 - 0x738
   CUtlSymbolLarge m_strRopeMaterialModel; // 0x738 - 0x740
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_iRopeMaterialModelIndex; // 0x740 - 0x748
   uint8_t m_Subdiv; // 0x748 - 0x749
   uint8_t m_nChangeCount; // 0x749 - 0x74A
   int16_t m_RopeLength; // 0x74A - 0x74C
   uint8_t m_fLockedPoints; // 0x74C - 0x74D
   bool m_bCreatedFromMapFile; // 0x74D - 0x74E
   unsigned char pad_74E[0x2]; // 0x74E - 0x750
   float m_flScrollSpeed; // 0x750 - 0x754
   bool m_bStartPointValid; // 0x754 - 0x755
   bool m_bEndPointValid; // 0x755 - 0x756
   unsigned char pad_756[0x2]; // 0x756 - 0x758
   CHandle< CBaseEntity > m_hStartPoint; // 0x758 - 0x75C
   CHandle< CBaseEntity > m_hEndPoint; // 0x75C - 0x760
   AttachmentHandle_t m_iStartAttachment; // 0x760 - 0x761
   AttachmentHandle_t m_iEndAttachment; // 0x761 - 0x762
   unsigned char pad_762[0x6]; // 0x762 - 0x768
}; // size - 0x768


class CRotButton /* "server" */ : public CBaseButton /* "server" */
{
public:
   unsigned char pad_0[0x8E0]; // 0x0 - 0x8E0
}; // size - 0x8E0


class CRuleBrushEntity /* "server" */ : public CRuleEntity /* "server" */
{
public:
   unsigned char pad_0[0x718]; // 0x0 - 0x718
}; // size - 0x718


class CSAdditionalPerRoundStats_t /* "server" */
{
public:
   int32_t m_numChickensKilled; // 0x0 - 0x4
   int32_t m_killsWhileBlind; // 0x4 - 0x8
   int32_t m_bombCarrierkills; // 0x8 - 0xC
   int32_t m_iBurnDamageInflicted; // 0xC - 0x10
   int32_t m_iBlastDamageInflicted; // 0x10 - 0x14
   int32_t m_iDinks; // 0x14 - 0x18
}; // size - 0x18


class CSPerRoundStats_t /* "server" */
{
public:
   unsigned char pad_0[0x30]; // 0x0 - 0x30
   int32_t m_iKills; // 0x30 - 0x34
   int32_t m_iDeaths; // 0x34 - 0x38
   int32_t m_iAssists; // 0x38 - 0x3C
   int32_t m_iDamage; // 0x3C - 0x40
   int32_t m_iEquipmentValue; // 0x40 - 0x44
   int32_t m_iMoneySaved; // 0x44 - 0x48
   int32_t m_iKillReward; // 0x48 - 0x4C
   int32_t m_iLiveTime; // 0x4C - 0x50
   int32_t m_iHeadShotKills; // 0x50 - 0x54
   int32_t m_iObjective; // 0x54 - 0x58
   int32_t m_iCashEarned; // 0x58 - 0x5C
   int32_t m_iUtilityDamage; // 0x5C - 0x60
   int32_t m_iEnemiesFlashed; // 0x60 - 0x64
   unsigned char pad_64[0x4]; // 0x64 - 0x68
}; // size - 0x68


class CSPerRoundStats_t /* "client" */
{
public:
   unsigned char pad_0[0x30]; // 0x0 - 0x30
   int32_t m_iKills; // 0x30 - 0x34
   int32_t m_iDeaths; // 0x34 - 0x38
   int32_t m_iAssists; // 0x38 - 0x3C
   int32_t m_iDamage; // 0x3C - 0x40
   int32_t m_iEquipmentValue; // 0x40 - 0x44
   int32_t m_iMoneySaved; // 0x44 - 0x48
   int32_t m_iKillReward; // 0x48 - 0x4C
   int32_t m_iLiveTime; // 0x4C - 0x50
   int32_t m_iHeadShotKills; // 0x50 - 0x54
   int32_t m_iObjective; // 0x54 - 0x58
   int32_t m_iCashEarned; // 0x58 - 0x5C
   int32_t m_iUtilityDamage; // 0x5C - 0x60
   int32_t m_iEnemiesFlashed; // 0x60 - 0x64
   unsigned char pad_64[0x4]; // 0x64 - 0x68
}; // size - 0x68


class CSpinUpdateBase /* "particles" */ : public CParticleFunctionOperator /* "particles" */
{
public:
   unsigned char pad_0[0x1B8]; // 0x0 - 0x1B8
}; // size - 0x1B8


class CStaticPoseCache /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CCachedPose > m_poses; // 0x10 - 0x28
   int32_t m_nBoneCount; // 0x28 - 0x2C
   int32_t m_nMorphCount; // 0x2C - 0x30
}; // size - 0x30


class CTeamplayRules /* "server" */ : public CMultiplayRules /* "server" */
{
public:
   unsigned char pad_0[0xC0]; // 0x0 - 0xC0
}; // size - 0xC0


class CTonemapController2 /* "server" */ : public CBaseEntity /* "server" */
{
public:
   float m_flAutoExposureMin; // 0x4C0 - 0x4C4
   float m_flAutoExposureMax; // 0x4C4 - 0x4C8
   float m_flTonemapPercentTarget; // 0x4C8 - 0x4CC
   float m_flTonemapPercentBrightPixels; // 0x4CC - 0x4D0
   float m_flTonemapMinAvgLum; // 0x4D0 - 0x4D4
   float m_flExposureAdaptationSpeedUp; // 0x4D4 - 0x4D8
   float m_flExposureAdaptationSpeedDown; // 0x4D8 - 0x4DC
   float m_flTonemapEVSmoothingRange; // 0x4DC - 0x4E0
   unsigned char pad_4E0[0x8]; // 0x4E0 - 0x4E8
}; // size - 0x4E8


class CTriggerHurt /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   float m_flOriginalDamage; // 0x8E0 - 0x8E4
   float m_flDamage; // 0x8E4 - 0x8E8
   float m_flDamageCap; // 0x8E8 - 0x8EC
   GameTime_t m_flLastDmgTime; // 0x8EC - 0x8F0
   float m_flForgivenessDelay; // 0x8F0 - 0x8F4
   int32_t m_bitsDamageInflict; // 0x8F4 - 0x8F8
   int32_t m_damageModel; // 0x8F8 - 0x8FC
   bool m_bNoDmgForce; // 0x8FC - 0x8FD
   unsigned char pad_8FD[0x3]; // 0x8FD - 0x900
   Vector m_vDamageForce; // 0x900 - 0x90C
   bool m_thinkAlways; // 0x90C - 0x90D
   unsigned char pad_90D[0x3]; // 0x90D - 0x910
   float m_hurtThinkPeriod; // 0x910 - 0x914
   unsigned char pad_914[0x4]; // 0x914 - 0x918
   CEntityIOOutput m_OnHurt; // 0x918 - 0x940
   CEntityIOOutput m_OnHurtPlayer; // 0x940 - 0x968
   CUtlVector< CHandle< CBaseEntity > > m_hurtEntities; // 0x968 - 0x980
}; // size - 0x980


class CTriggerPush /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   QAngle m_angPushEntitySpace; // 0x8E0 - 0x8EC
   Vector m_vecPushDirEntitySpace; // 0x8EC - 0x8F8
   bool m_bTriggerOnStartTouch; // 0x8F8 - 0x8F9
   bool m_bUsePathSimple; // 0x8F9 - 0x8FA
   unsigned char pad_8FA[0x6]; // 0x8FA - 0x900
   CUtlSymbolLarge m_iszPathSimpleName; // 0x900 - 0x908
   CPathSimple* m_PathSimple; // 0x908 - 0x910
   uint32_t m_splinePushType; // 0x910 - 0x914
   unsigned char pad_914[0x4]; // 0x914 - 0x918
}; // size - 0x918


class C_BaseFire /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   float m_flScale; // 0x548 - 0x54C
   float m_flStartScale; // 0x54C - 0x550
   float m_flScaleTime; // 0x550 - 0x554
   uint32_t m_nFlags; // 0x554 - 0x558
}; // size - 0x558


class C_EnvCubemap /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_548[0x80]; // 0x548 - 0x5C8
   CStrongHandle< InfoForResourceTypeCTextureBase > m_Entity_hCubemapTexture; // 0x5C8 - 0x5D0
   bool m_Entity_bCustomCubemapTexture; // 0x5D0 - 0x5D1
   unsigned char pad_5D1[0x3]; // 0x5D1 - 0x5D4
   float m_Entity_flInfluenceRadius; // 0x5D4 - 0x5D8
   Vector m_Entity_vBoxProjectMins; // 0x5D8 - 0x5E4
   Vector m_Entity_vBoxProjectMaxs; // 0x5E4 - 0x5F0
   bool m_Entity_bMoveable; // 0x5F0 - 0x5F1
   unsigned char pad_5F1[0x3]; // 0x5F1 - 0x5F4
   int32_t m_Entity_nHandshake; // 0x5F4 - 0x5F8
   int32_t m_Entity_nEnvCubeMapArrayIndex; // 0x5F8 - 0x5FC
   int32_t m_Entity_nPriority; // 0x5FC - 0x600
   float m_Entity_flEdgeFadeDist; // 0x600 - 0x604
   Vector m_Entity_vEdgeFadeDists; // 0x604 - 0x610
   float m_Entity_flDiffuseScale; // 0x610 - 0x614
   bool m_Entity_bStartDisabled; // 0x614 - 0x615
   bool m_Entity_bDefaultEnvMap; // 0x615 - 0x616
   bool m_Entity_bDefaultSpecEnvMap; // 0x616 - 0x617
   bool m_Entity_bIndoorCubeMap; // 0x617 - 0x618
   bool m_Entity_bCopyDiffuseFromDefaultCubemap; // 0x618 - 0x619
   unsigned char pad_619[0xF]; // 0x619 - 0x628
   bool m_Entity_bEnabled; // 0x628 - 0x629
   unsigned char pad_629[0x7]; // 0x629 - 0x630
}; // size - 0x630


class C_GameRulesProxy /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   unsigned char pad_0[0x548]; // 0x0 - 0x548
}; // size - 0x548


class C_Inferno /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_CC8[0x40]; // 0xCC8 - 0xD08
   ParticleIndex_t m_nfxFireDamageEffect; // 0xD08 - 0xD0C
   unsigned char pad_D0C[0x4]; // 0xD0C - 0xD10
   CStrongHandle< InfoForResourceTypeIParticleSnapshot > m_hInfernoPointsSnapshot; // 0xD10 - 0xD18
   CStrongHandle< InfoForResourceTypeIParticleSnapshot > m_hInfernoFillerPointsSnapshot; // 0xD18 - 0xD20
   CStrongHandle< InfoForResourceTypeIParticleSnapshot > m_hInfernoOutlinePointsSnapshot; // 0xD20 - 0xD28
   CStrongHandle< InfoForResourceTypeIParticleSnapshot > m_hInfernoClimbingOutlinePointsSnapshot; // 0xD28 - 0xD30
   CStrongHandle< InfoForResourceTypeIParticleSnapshot > m_hInfernoDecalsSnapshot; // 0xD30 - 0xD38
   Vector m_firePositions[64]; // 0xD38 - 0x1038
   Vector m_fireParentPositions[64]; // 0x1038 - 0x1338
   bool m_bFireIsBurning[64]; // 0x1338 - 0x1378
   Vector m_BurnNormal[64]; // 0x1378 - 0x1678
   int32_t m_fireCount; // 0x1678 - 0x167C
   int32_t m_nInfernoType; // 0x167C - 0x1680
   float m_nFireLifetime; // 0x1680 - 0x1684
   bool m_bInPostEffectTime; // 0x1684 - 0x1685
   unsigned char pad_1685[0x3]; // 0x1685 - 0x1688
   int32_t m_lastFireCount; // 0x1688 - 0x168C
   int32_t m_nFireEffectTickBegin; // 0x168C - 0x1690
   unsigned char pad_1690[0x6C00]; // 0x1690 - 0x8290
   int32_t m_drawableCount; // 0x8290 - 0x8294
   bool m_blosCheck; // 0x8294 - 0x8295
   unsigned char pad_8295[0x3]; // 0x8295 - 0x8298
   int32_t m_nlosperiod; // 0x8298 - 0x829C
   float m_maxFireHalfWidth; // 0x829C - 0x82A0
   float m_maxFireHeight; // 0x82A0 - 0x82A4
   Vector m_minBounds; // 0x82A4 - 0x82B0
   Vector m_maxBounds; // 0x82B0 - 0x82BC
   float m_flLastGrassBurnThink; // 0x82BC - 0x82C0
   unsigned char pad_82C0[0x10]; // 0x82C0 - 0x82D0
}; // size - 0x82D0


class C_Item /* "client" */ : public C_EconEntity /* "client" */
{
public:
   bool m_bShouldGlow; // 0x15B0 - 0x15B1
   char m_pReticleHintTextName[256]; // 0x15B1 - 0x16B1
   unsigned char pad_16B1[0x7]; // 0x16B1 - 0x16B8
}; // size - 0x16B8


class C_LightDirectionalEntity /* "client" */ : public C_LightEntity /* "client" */
{
public:
   unsigned char pad_0[0xCD0]; // 0x0 - 0xCD0
}; // size - 0xCD0


class C_MolotovGrenade /* "client" */ : public C_BaseCSGrenade /* "client" */
{
public:
   unsigned char pad_0[0x1AD0]; // 0x0 - 0x1AD0
}; // size - 0x1AD0


class C_OP_RenderPoints /* "particles" */ : public CParticleFunctionRenderer /* "particles" */
{
public:
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x208 - 0x210
}; // size - 0x210


class C_PointCamera /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   float m_FOV; // 0x548 - 0x54C
   float m_Resolution; // 0x54C - 0x550
   bool m_bFogEnable; // 0x550 - 0x551
   Color m_FogColor; // 0x551 - 0x555
   unsigned char pad_555[0x3]; // 0x555 - 0x558
   float m_flFogStart; // 0x558 - 0x55C
   float m_flFogEnd; // 0x55C - 0x560
   float m_flFogMaxDensity; // 0x560 - 0x564
   bool m_bActive; // 0x564 - 0x565
   bool m_bUseScreenAspectRatio; // 0x565 - 0x566
   unsigned char pad_566[0x2]; // 0x566 - 0x568
   float m_flAspectRatio; // 0x568 - 0x56C
   bool m_bNoSky; // 0x56C - 0x56D
   unsigned char pad_56D[0x3]; // 0x56D - 0x570
   float m_fBrightness; // 0x570 - 0x574
   float m_flZFar; // 0x574 - 0x578
   float m_flZNear; // 0x578 - 0x57C
   bool m_bCanHLTVUse; // 0x57C - 0x57D
   bool m_bDofEnabled; // 0x57D - 0x57E
   unsigned char pad_57E[0x2]; // 0x57E - 0x580
   float m_flDofNearBlurry; // 0x580 - 0x584
   float m_flDofNearCrisp; // 0x584 - 0x588
   float m_flDofFarCrisp; // 0x588 - 0x58C
   float m_flDofFarBlurry; // 0x58C - 0x590
   float m_flDofTiltToGround; // 0x590 - 0x594
   float m_TargetFOV; // 0x594 - 0x598
   float m_DegreesPerSecond; // 0x598 - 0x59C
   bool m_bIsOn; // 0x59C - 0x59D
   unsigned char pad_59D[0x3]; // 0x59D - 0x5A0
   C_PointCamera* m_pNext; // 0x5A0 - 0x5A8
}; // size - 0x5A8


class C_SoundOpvarSetAABBEntity /* "client" */ : public C_SoundOpvarSetPointEntity /* "client" */
{
public:
   unsigned char pad_0[0x568]; // 0x0 - 0x568
}; // size - 0x568


class C_WeaponBaseItem /* "client" */ : public C_CSWeaponBase /* "client" */
{
public:
   CountdownTimer m_SequenceCompleteTimer; // 0x1A80 - 0x1A98
   bool m_bRedraw; // 0x1A98 - 0x1A99
   unsigned char pad_1A99[0x7]; // 0x1A99 - 0x1AA0
}; // size - 0x1AA0


class FeBoxRigid_t /* "physicslib" */
{
public:
   CTransform tmFrame2; // 0x0 - 0x20
   uint16_t nNode; // 0x20 - 0x22
   uint16_t nCollisionMask; // 0x22 - 0x24
   Vector vSize; // 0x24 - 0x30
   uint16_t nVertexMapIndex; // 0x30 - 0x32
   uint16_t nFlags; // 0x32 - 0x34
   unsigned char pad_34[0xC]; // 0x34 - 0x40
}; // size - 0x40


class IParticleEffect /* "particleslib" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class RnBodyDesc_t /* "physicslib" */
{
public:
   CUtlString m_sDebugName; // 0x0 - 0x8
   Vector m_vPosition; // 0x8 - 0x14
   QuaternionStorage m_qOrientation; // 0x14 - 0x24
   Vector m_vLinearVelocity; // 0x24 - 0x30
   Vector m_vAngularVelocity; // 0x30 - 0x3C
   Vector m_vLocalMassCenter; // 0x3C - 0x48
   Vector m_LocalInertiaInv[3]; // 0x48 - 0x6C
   float m_flMassInv; // 0x6C - 0x70
   float m_flGameMass; // 0x70 - 0x74
   float m_flInertiaScaleInv; // 0x74 - 0x78
   float m_flLinearDamping; // 0x78 - 0x7C
   float m_flAngularDamping; // 0x7C - 0x80
   float m_flLinearDrag; // 0x80 - 0x84
   float m_flAngularDrag; // 0x84 - 0x88
   float m_flLinearBuoyancyDrag; // 0x88 - 0x8C
   float m_flAngularBuoyancyDrag; // 0x8C - 0x90
   Vector m_vLastAwakeForceAccum; // 0x90 - 0x9C
   Vector m_vLastAwakeTorqueAccum; // 0x9C - 0xA8
   float m_flBuoyancyFactor; // 0xA8 - 0xAC
   float m_flGravityScale; // 0xAC - 0xB0
   float m_flTimeScale; // 0xB0 - 0xB4
   int32_t m_nBodyType; // 0xB4 - 0xB8
   uint32_t m_nGameIndex; // 0xB8 - 0xBC
   uint32_t m_nGameFlags; // 0xBC - 0xC0
   int8_t m_nMinVelocityIterations; // 0xC0 - 0xC1
   int8_t m_nMinPositionIterations; // 0xC1 - 0xC2
   int8_t m_nMassPriority; // 0xC2 - 0xC3
   bool m_bEnabled; // 0xC3 - 0xC4
   bool m_bSleeping; // 0xC4 - 0xC5
   bool m_bIsContinuousEnabled; // 0xC5 - 0xC6
   bool m_bDragEnabled; // 0xC6 - 0xC7
   bool m_bBuoyancyDragEnabled; // 0xC7 - 0xC8
   bool m_bGravityDisabled; // 0xC8 - 0xC9
   bool m_bSpeculativeEnabled; // 0xC9 - 0xCA
   bool m_bHasShadowController; // 0xCA - 0xCB
   unsigned char pad_CB[0x5]; // 0xCB - 0xD0
}; // size - 0xD0


class AmmoTypeInfo_t /* "server" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   int32_t m_nMaxCarry; // 0x10 - 0x14
   unsigned char pad_14[0x8]; // 0x14 - 0x1C
   CRangeInt m_nSplashSize; // 0x1C - 0x24
   AmmoFlags_t m_nFlags; // 0x24 - 0x28
   float m_flMass; // 0x28 - 0x2C
   CRangeFloat m_flSpeed; // 0x2C - 0x34
   unsigned char pad_34[0x4]; // 0x34 - 0x38
}; // size - 0x38


class AnimationSnapshotBase_t /* "animationsystem" */
{
public:
   float m_flRealTime; // 0x0 - 0x4
   unsigned char pad_4[0xC]; // 0x4 - 0x10
   matrix3x4a_t m_rootToWorld; // 0x10 - 0x40
   bool m_bBonesInWorldSpace; // 0x40 - 0x41
   unsigned char pad_41[0x7]; // 0x41 - 0x48
   CUtlVector< uint32 > m_boneSetupMask; // 0x48 - 0x60
   CUtlVector< matrix3x4a_t > m_boneTransforms; // 0x60 - 0x78
   CUtlVector< float32 > m_flexControllers; // 0x78 - 0x90
   AnimationSnapshotType_t m_SnapshotType; // 0x90 - 0x94
   bool m_bHasDecodeDump; // 0x94 - 0x95
   unsigned char pad_95[0x3]; // 0x95 - 0x98
   AnimationDecodeDebugDumpElement_t m_DecodeDump; // 0x98 - 0x108
   unsigned char pad_108[0x8]; // 0x108 - 0x110
}; // size - 0x110


class CAI_ExpresserWithFollowup /* "server" */ : public CAI_Expresser /* "server" */
{
public:
   ResponseFollowup* m_pPostponedFollowup; // 0x78 - 0x80
   unsigned char pad_80[0x8]; // 0x80 - 0x88
}; // size - 0x88


class CAnimScriptBase /* "host" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   bool m_bIsValid; // 0x8 - 0x9
   unsigned char pad_9[0x7]; // 0x9 - 0x10
}; // size - 0x10


class CAttributeManager /* "client" */
{
public:
   class cached_attribute_float_t /* "client" */
   {
   public:
      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4]; // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14
      unsigned char pad_14[0x4]; // 0x14 - 0x18
   }; // size - 0x18

   class cached_attribute_float_t /* "server" */
   {
   public:
      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4]; // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14
      unsigned char pad_14[0x4]; // 0x14 - 0x18
   }; // size - 0x18

   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVector< CHandle< C_BaseEntity > > m_Providers; // 0x8 - 0x20
   int32_t m_iReapplyProvisionParity; // 0x20 - 0x24
   CHandle< C_BaseEntity > m_hOuter; // 0x24 - 0x28
   bool m_bPreventLoopback; // 0x28 - 0x29
   unsigned char pad_29[0x3]; // 0x29 - 0x2C
   attributeprovidertypes_t m_ProviderType; // 0x2C - 0x30
   CUtlVector< CAttributeManager::cached_attribute_float_t > m_CachedResults; // 0x30 - 0x48
   unsigned char pad_48[0x8]; // 0x48 - 0x50
}; // size - 0x50


class CAttributeManager /* "server" */
{
public:
   class cached_attribute_float_t /* "client" */
   {
   public:
      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4]; // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14
      unsigned char pad_14[0x4]; // 0x14 - 0x18
   }; // size - 0x18

   class cached_attribute_float_t /* "server" */
   {
   public:
      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4]; // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14
      unsigned char pad_14[0x4]; // 0x14 - 0x18
   }; // size - 0x18

   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVector< CHandle< CBaseEntity > > m_Providers; // 0x8 - 0x20
   int32_t m_iReapplyProvisionParity; // 0x20 - 0x24
   CHandle< CBaseEntity > m_hOuter; // 0x24 - 0x28
   bool m_bPreventLoopback; // 0x28 - 0x29
   unsigned char pad_29[0x3]; // 0x29 - 0x2C
   attributeprovidertypes_t m_ProviderType; // 0x2C - 0x30
   CUtlVector< CAttributeManager::cached_attribute_float_t > m_CachedResults; // 0x30 - 0x48
   unsigned char pad_48[0x8]; // 0x48 - 0x50
}; // size - 0x50


class CBaseDoor /* "server" */ : public CBaseToggle /* "server" */
{
public:
   unsigned char pad_790[0x10]; // 0x790 - 0x7A0
   QAngle m_angMoveEntitySpace; // 0x7A0 - 0x7AC
   Vector m_vecMoveDirParentSpace; // 0x7AC - 0x7B8
   locksound_t m_ls; // 0x7B8 - 0x7D8
   bool m_bForceClosed; // 0x7D8 - 0x7D9
   bool m_bDoorGroup; // 0x7D9 - 0x7DA
   bool m_bLocked; // 0x7DA - 0x7DB
   bool m_bIgnoreDebris; // 0x7DB - 0x7DC
   FuncDoorSpawnPos_t m_eSpawnPosition; // 0x7DC - 0x7E0
   float m_flBlockDamage; // 0x7E0 - 0x7E4
   unsigned char pad_7E4[0x4]; // 0x7E4 - 0x7E8
   CUtlSymbolLarge m_NoiseMoving; // 0x7E8 - 0x7F0
   CUtlSymbolLarge m_NoiseArrived; // 0x7F0 - 0x7F8
   CUtlSymbolLarge m_NoiseMovingClosed; // 0x7F8 - 0x800
   CUtlSymbolLarge m_NoiseArrivedClosed; // 0x800 - 0x808
   CUtlSymbolLarge m_ChainTarget; // 0x808 - 0x810
   CEntityIOOutput m_OnBlockedClosing; // 0x810 - 0x838
   CEntityIOOutput m_OnBlockedOpening; // 0x838 - 0x860
   CEntityIOOutput m_OnUnblockedClosing; // 0x860 - 0x888
   CEntityIOOutput m_OnUnblockedOpening; // 0x888 - 0x8B0
   CEntityIOOutput m_OnFullyClosed; // 0x8B0 - 0x8D8
   CEntityIOOutput m_OnFullyOpen; // 0x8D8 - 0x900
   CEntityIOOutput m_OnClose; // 0x900 - 0x928
   CEntityIOOutput m_OnOpen; // 0x928 - 0x950
   CEntityIOOutput m_OnLockedUse; // 0x950 - 0x978
   bool m_bLoopMoveSound; // 0x978 - 0x979
   unsigned char pad_979[0x17]; // 0x979 - 0x990
   bool m_bCreateNavObstacle; // 0x990 - 0x991
   bool m_isChaining; // 0x991 - 0x992
   bool m_bIsUsable; // 0x992 - 0x993
   unsigned char pad_993[0x5]; // 0x993 - 0x998
}; // size - 0x998


class CBaseFire /* "server" */ : public CBaseEntity /* "server" */
{
public:
   float m_flScale; // 0x4C0 - 0x4C4
   float m_flStartScale; // 0x4C4 - 0x4C8
   float m_flScaleTime; // 0x4C8 - 0x4CC
   uint32_t m_nFlags; // 0x4CC - 0x4D0
}; // size - 0x4D0


class CBot /* "server" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CCSPlayerController* m_pController; // 0x10 - 0x18
   CCSPlayerPawn* m_pPlayer; // 0x18 - 0x20
   bool m_bHasSpawned; // 0x20 - 0x21
   unsigned char pad_21[0x3]; // 0x21 - 0x24
   uint32_t m_id; // 0x24 - 0x28
   unsigned char pad_28[0x88]; // 0x28 - 0xB0
   bool m_isRunning; // 0xB0 - 0xB1
   bool m_isCrouching; // 0xB1 - 0xB2
   unsigned char pad_B2[0x2]; // 0xB2 - 0xB4
   float m_forwardSpeed; // 0xB4 - 0xB8
   float m_leftSpeed; // 0xB8 - 0xBC
   float m_verticalSpeed; // 0xBC - 0xC0
   uint64_t m_buttonFlags; // 0xC0 - 0xC8
   float m_jumpTimestamp; // 0xC8 - 0xCC
   Vector m_viewForward; // 0xCC - 0xD8
   unsigned char pad_D8[0x10]; // 0xD8 - 0xE8
   int32_t m_postureStackIndex; // 0xE8 - 0xEC
   unsigned char pad_EC[0x4]; // 0xEC - 0xF0
}; // size - 0xF0


class CBtNodeCondition /* "server" */ : public CBtNodeDecorator /* "server" */
{
public:
   bool m_bNegated; // 0x58 - 0x59
   unsigned char pad_59[0x7]; // 0x59 - 0x60
}; // size - 0x60


class CCSPointScriptEntity /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_0[0x4C8]; // 0x0 - 0x4C8
}; // size - 0x4C8


class CEntityComponent /* "entity2" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class CEntityComponent /* "entity2" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class CEnvCubemap /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_4C0[0x80]; // 0x4C0 - 0x540
   CStrongHandle< InfoForResourceTypeCTextureBase > m_Entity_hCubemapTexture; // 0x540 - 0x548
   bool m_Entity_bCustomCubemapTexture; // 0x548 - 0x549
   unsigned char pad_549[0x3]; // 0x549 - 0x54C
   float m_Entity_flInfluenceRadius; // 0x54C - 0x550
   Vector m_Entity_vBoxProjectMins; // 0x550 - 0x55C
   Vector m_Entity_vBoxProjectMaxs; // 0x55C - 0x568
   bool m_Entity_bMoveable; // 0x568 - 0x569
   unsigned char pad_569[0x3]; // 0x569 - 0x56C
   int32_t m_Entity_nHandshake; // 0x56C - 0x570
   int32_t m_Entity_nEnvCubeMapArrayIndex; // 0x570 - 0x574
   int32_t m_Entity_nPriority; // 0x574 - 0x578
   float m_Entity_flEdgeFadeDist; // 0x578 - 0x57C
   Vector m_Entity_vEdgeFadeDists; // 0x57C - 0x588
   float m_Entity_flDiffuseScale; // 0x588 - 0x58C
   bool m_Entity_bStartDisabled; // 0x58C - 0x58D
   bool m_Entity_bDefaultEnvMap; // 0x58D - 0x58E
   bool m_Entity_bDefaultSpecEnvMap; // 0x58E - 0x58F
   bool m_Entity_bIndoorCubeMap; // 0x58F - 0x590
   bool m_Entity_bCopyDiffuseFromDefaultCubemap; // 0x590 - 0x591
   unsigned char pad_591[0xF]; // 0x591 - 0x5A0
   bool m_Entity_bEnabled; // 0x5A0 - 0x5A1
   unsigned char pad_5A1[0x7]; // 0x5A1 - 0x5A8
}; // size - 0x5A8


class CEnvSoundscapeProxy /* "server" */ : public CEnvSoundscape /* "server" */
{
public:
   CUtlSymbolLarge m_MainSoundscapeName; // 0x558 - 0x560
}; // size - 0x560


class CFuncLadder /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   Vector m_vecLadderDir; // 0x710 - 0x71C
   unsigned char pad_71C[0x4]; // 0x71C - 0x720
   CUtlVector< CHandle< CInfoLadderDismount > > m_Dismounts; // 0x720 - 0x738
   Vector m_vecLocalTop; // 0x738 - 0x744
   Vector m_vecPlayerMountPositionTop; // 0x744 - 0x750
   Vector m_vecPlayerMountPositionBottom; // 0x750 - 0x75C
   float m_flAutoRideSpeed; // 0x75C - 0x760
   bool m_bDisabled; // 0x760 - 0x761
   bool m_bFakeLadder; // 0x761 - 0x762
   bool m_bHasSlack; // 0x762 - 0x763
   unsigned char pad_763[0x5]; // 0x763 - 0x768
   CUtlSymbolLarge m_surfacePropName; // 0x768 - 0x770
   CEntityIOOutput m_OnPlayerGotOnLadder; // 0x770 - 0x798
   CEntityIOOutput m_OnPlayerGotOffLadder; // 0x798 - 0x7C0
}; // size - 0x7C0


class CFuncMoveLinear /* "server" */ : public CBaseToggle /* "server" */
{
public:
   MoveLinearAuthoredPos_t m_authoredPosition; // 0x790 - 0x794
   QAngle m_angMoveEntitySpace; // 0x794 - 0x7A0
   Vector m_vecMoveDirParentSpace; // 0x7A0 - 0x7AC
   unsigned char pad_7AC[0x4]; // 0x7AC - 0x7B0
   CUtlSymbolLarge m_soundStart; // 0x7B0 - 0x7B8
   CUtlSymbolLarge m_soundStop; // 0x7B8 - 0x7C0
   CUtlSymbolLarge m_currentSound; // 0x7C0 - 0x7C8
   float m_flBlockDamage; // 0x7C8 - 0x7CC
   float m_flStartPosition; // 0x7CC - 0x7D0
   unsigned char pad_7D0[0x8]; // 0x7D0 - 0x7D8
   CEntityIOOutput m_OnFullyOpen; // 0x7D8 - 0x800
   CEntityIOOutput m_OnFullyClosed; // 0x800 - 0x828
   bool m_bCreateMovableNavMesh; // 0x828 - 0x829
   bool m_bCreateNavObstacle; // 0x829 - 0x82A
   unsigned char pad_82A[0xE]; // 0x82A - 0x838
}; // size - 0x838


class CFuncTrackChange /* "server" */ : public CFuncPlatRot /* "server" */
{
public:
   CPathTrack* m_trackTop; // 0x7D8 - 0x7E0
   CPathTrack* m_trackBottom; // 0x7E0 - 0x7E8
   CFuncTrackTrain* m_train; // 0x7E8 - 0x7F0
   CUtlSymbolLarge m_trackTopName; // 0x7F0 - 0x7F8
   CUtlSymbolLarge m_trackBottomName; // 0x7F8 - 0x800
   CUtlSymbolLarge m_trainName; // 0x800 - 0x808
   TRAIN_CODE m_code; // 0x808 - 0x80C
   int32_t m_targetState; // 0x80C - 0x810
   int32_t m_use; // 0x810 - 0x814
   unsigned char pad_814[0x4]; // 0x814 - 0x818
}; // size - 0x818


class CFuncWall /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   int32_t m_nState; // 0x710 - 0x714
   unsigned char pad_714[0x4]; // 0x714 - 0x718
}; // size - 0x718


class CGameRulesProxy /* "server" */ : public CBaseEntity /* "server" */
{
public:
   unsigned char pad_0[0x4C0]; // 0x0 - 0x4C0
}; // size - 0x4C0


class CGameSceneNode /* "client" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CTransform m_nodeToWorld; // 0x10 - 0x30
   CEntityInstance* m_pOwner; // 0x30 - 0x38
   CGameSceneNode* m_pParent; // 0x38 - 0x40
   CGameSceneNode* m_pChild; // 0x40 - 0x48
   CGameSceneNode* m_pNextSibling; // 0x48 - 0x50
   unsigned char pad_50[0x28]; // 0x50 - 0x78
   CGameSceneNodeHandle m_hParent; // 0x78 - 0x88
   CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x88 - 0xB8
   unsigned char pad_B8[0x8]; // 0xB8 - 0xC0
   QAngle m_angRotation; // 0xC0 - 0xCC
   float m_flScale; // 0xCC - 0xD0
   Vector m_vecAbsOrigin; // 0xD0 - 0xDC
   QAngle m_angAbsRotation; // 0xDC - 0xE8
   float m_flAbsScale; // 0xE8 - 0xEC
   int16_t m_nParentAttachmentOrBone; // 0xEC - 0xEE
   bool m_bDebugAbsOriginChanges; // 0xEE - 0xEF
   bool m_bDormant; // 0xEF - 0xF0
   bool m_bForceParentToBeNetworked; // 0xF0 - 0xF1
   unsigned char m_bDirtyHierarchy : 1; // 0xF1 - 0xF2
   unsigned char m_bDirtyBoneMergeInfo : 1; // 0xF1 - 0xF2
   unsigned char m_bNetworkedPositionChanged : 1; // 0xF1 - 0xF2
   unsigned char m_bNetworkedAnglesChanged : 1; // 0xF1 - 0xF2
   unsigned char m_bNetworkedScaleChanged : 1; // 0xF1 - 0xF2
   unsigned char m_bWillBeCallingPostDataUpdate : 1; // 0xF1 - 0xF2
   unsigned char m_bBoneMergeFlex : 1; // 0xF1 - 0xF2
   unsigned char m_nLatchAbsOrigin : 2; // 0xF1 - 0xF3
   unsigned char m_bDirtyBoneMergeBoneToRoot : 1; // 0xF2 - 0xF3
   uint8_t m_nHierarchicalDepth; // 0xF3 - 0xF4
   uint8_t m_nHierarchyType; // 0xF4 - 0xF5
   uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0xF5 - 0xF6
   unsigned char pad_F6[0x2]; // 0xF6 - 0xF8
   CUtlStringToken m_name; // 0xF8 - 0xFC
   unsigned char pad_FC[0x3C]; // 0xFC - 0x138
   CUtlStringToken m_hierarchyAttachName; // 0x138 - 0x13C
   float m_flZOffset; // 0x13C - 0x140
   float m_flClientLocalScale; // 0x140 - 0x144
   Vector m_vRenderOrigin; // 0x144 - 0x150
   unsigned char pad_150[0x10]; // 0x150 - 0x160
}; // size - 0x160


class CGameSceneNode /* "server" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CTransform m_nodeToWorld; // 0x10 - 0x30
   CEntityInstance* m_pOwner; // 0x30 - 0x38
   CGameSceneNode* m_pParent; // 0x38 - 0x40
   CGameSceneNode* m_pChild; // 0x40 - 0x48
   CGameSceneNode* m_pNextSibling; // 0x48 - 0x50
   unsigned char pad_50[0x28]; // 0x50 - 0x78
   CGameSceneNodeHandle m_hParent; // 0x78 - 0x88
   CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x88 - 0xB8
   unsigned char pad_B8[0x8]; // 0xB8 - 0xC0
   QAngle m_angRotation; // 0xC0 - 0xCC
   float m_flScale; // 0xCC - 0xD0
   Vector m_vecAbsOrigin; // 0xD0 - 0xDC
   QAngle m_angAbsRotation; // 0xDC - 0xE8
   float m_flAbsScale; // 0xE8 - 0xEC
   int16_t m_nParentAttachmentOrBone; // 0xEC - 0xEE
   bool m_bDebugAbsOriginChanges; // 0xEE - 0xEF
   bool m_bDormant; // 0xEF - 0xF0
   bool m_bForceParentToBeNetworked; // 0xF0 - 0xF1
   unsigned char m_bDirtyHierarchy : 1; // 0xF1 - 0xF2
   unsigned char m_bDirtyBoneMergeInfo : 1; // 0xF1 - 0xF2
   unsigned char m_bNetworkedPositionChanged : 1; // 0xF1 - 0xF2
   unsigned char m_bNetworkedAnglesChanged : 1; // 0xF1 - 0xF2
   unsigned char m_bNetworkedScaleChanged : 1; // 0xF1 - 0xF2
   unsigned char m_bWillBeCallingPostDataUpdate : 1; // 0xF1 - 0xF2
   unsigned char m_bBoneMergeFlex : 1; // 0xF1 - 0xF2
   unsigned char m_nLatchAbsOrigin : 2; // 0xF1 - 0xF3
   unsigned char m_bDirtyBoneMergeBoneToRoot : 1; // 0xF2 - 0xF3
   uint8_t m_nHierarchicalDepth; // 0xF3 - 0xF4
   uint8_t m_nHierarchyType; // 0xF4 - 0xF5
   uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0xF5 - 0xF6
   unsigned char pad_F6[0x2]; // 0xF6 - 0xF8
   CUtlStringToken m_name; // 0xF8 - 0xFC
   unsigned char pad_FC[0x3C]; // 0xFC - 0x138
   CUtlStringToken m_hierarchyAttachName; // 0x138 - 0x13C
   float m_flZOffset; // 0x13C - 0x140
   float m_flClientLocalScale; // 0x140 - 0x144
   Vector m_vRenderOrigin; // 0x144 - 0x150
   unsigned char pad_150[0x10]; // 0x150 - 0x160
}; // size - 0x160


class CHostage /* "server" */ : public CHostageExpresserShim /* "server" */
{
public:
   unsigned char pad_A10[0x10]; // 0xA10 - 0xA20
   CEntityIOOutput m_OnHostageBeginGrab; // 0xA20 - 0xA48
   CEntityIOOutput m_OnFirstPickedUp; // 0xA48 - 0xA70
   CEntityIOOutput m_OnDroppedNotRescued; // 0xA70 - 0xA98
   CEntityIOOutput m_OnRescued; // 0xA98 - 0xAC0
   EntitySpottedState_t m_entitySpottedState; // 0xAC0 - 0xAD8
   int32_t m_nSpotRules; // 0xAD8 - 0xADC
   uint32_t m_uiHostageSpawnExclusionGroupMask; // 0xADC - 0xAE0
   uint32_t m_nHostageSpawnRandomFactor; // 0xAE0 - 0xAE4
   bool m_bRemove; // 0xAE4 - 0xAE5
   unsigned char pad_AE5[0x3]; // 0xAE5 - 0xAE8
   Vector m_vel; // 0xAE8 - 0xAF4
   bool m_isRescued; // 0xAF4 - 0xAF5
   bool m_jumpedThisFrame; // 0xAF5 - 0xAF6
   unsigned char pad_AF6[0x2]; // 0xAF6 - 0xAF8
   int32_t m_nHostageState; // 0xAF8 - 0xAFC
   CHandle< CBaseEntity > m_leader; // 0xAFC - 0xB00
   CHandle< CCSPlayerPawnBase > m_lastLeader; // 0xB00 - 0xB04
   unsigned char pad_B04[0x4]; // 0xB04 - 0xB08
   CountdownTimer m_reuseTimer; // 0xB08 - 0xB20
   bool m_hasBeenUsed; // 0xB20 - 0xB21
   unsigned char pad_B21[0x3]; // 0xB21 - 0xB24
   Vector m_accel; // 0xB24 - 0xB30
   bool m_isRunning; // 0xB30 - 0xB31
   bool m_isCrouching; // 0xB31 - 0xB32
   unsigned char pad_B32[0x6]; // 0xB32 - 0xB38
   CountdownTimer m_jumpTimer; // 0xB38 - 0xB50
   bool m_isWaitingForLeader; // 0xB50 - 0xB51
   unsigned char pad_B51[0x200F]; // 0xB51 - 0x2B60
   CountdownTimer m_repathTimer; // 0x2B60 - 0x2B78
   CountdownTimer m_inhibitDoorTimer; // 0x2B78 - 0x2B90
   unsigned char pad_2B90[0x78]; // 0x2B90 - 0x2C08
   CountdownTimer m_inhibitObstacleAvoidanceTimer; // 0x2C08 - 0x2C20
   unsigned char pad_2C20[0x8]; // 0x2C20 - 0x2C28
   CountdownTimer m_wiggleTimer; // 0x2C28 - 0x2C40
   unsigned char pad_2C40[0x4]; // 0x2C40 - 0x2C44
   bool m_isAdjusted; // 0x2C44 - 0x2C45
   bool m_bHandsHaveBeenCut; // 0x2C45 - 0x2C46
   unsigned char pad_2C46[0x2]; // 0x2C46 - 0x2C48
   CHandle< CCSPlayerPawn > m_hHostageGrabber; // 0x2C48 - 0x2C4C
   GameTime_t m_fLastGrabTime; // 0x2C4C - 0x2C50
   Vector m_vecPositionWhenStartedDroppingToGround; // 0x2C50 - 0x2C5C
   Vector m_vecGrabbedPos; // 0x2C5C - 0x2C68
   GameTime_t m_flRescueStartTime; // 0x2C68 - 0x2C6C
   GameTime_t m_flGrabSuccessTime; // 0x2C6C - 0x2C70
   GameTime_t m_flDropStartTime; // 0x2C70 - 0x2C74
   int32_t m_nApproachRewardPayouts; // 0x2C74 - 0x2C78
   int32_t m_nPickupEventCount; // 0x2C78 - 0x2C7C
   Vector m_vecSpawnGroundPos; // 0x2C7C - 0x2C88
   unsigned char pad_2C88[0x14]; // 0x2C88 - 0x2C9C
   Vector m_vecHostageResetPosition; // 0x2C9C - 0x2CA8
}; // size - 0x2CA8


class CInferno /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   unsigned char pad_710[0x10]; // 0x710 - 0x720
   Vector m_firePositions[64]; // 0x720 - 0xA20
   Vector m_fireParentPositions[64]; // 0xA20 - 0xD20
   bool m_bFireIsBurning[64]; // 0xD20 - 0xD60
   Vector m_BurnNormal[64]; // 0xD60 - 0x1060
   int32_t m_fireCount; // 0x1060 - 0x1064
   int32_t m_nInfernoType; // 0x1064 - 0x1068
   int32_t m_nFireEffectTickBegin; // 0x1068 - 0x106C
   float m_nFireLifetime; // 0x106C - 0x1070
   bool m_bInPostEffectTime; // 0x1070 - 0x1071
   unsigned char pad_1071[0x3]; // 0x1071 - 0x1074
   int32_t m_nFiresExtinguishCount; // 0x1074 - 0x1078
   bool m_bWasCreatedInSmoke; // 0x1078 - 0x1079
   unsigned char pad_1079[0x207]; // 0x1079 - 0x1280
   Extent m_extent; // 0x1280 - 0x1298
   CountdownTimer m_damageTimer; // 0x1298 - 0x12B0
   CountdownTimer m_damageRampTimer; // 0x12B0 - 0x12C8
   Vector m_splashVelocity; // 0x12C8 - 0x12D4
   Vector m_InitialSplashVelocity; // 0x12D4 - 0x12E0
   Vector m_startPos; // 0x12E0 - 0x12EC
   Vector m_vecOriginalSpawnLocation; // 0x12EC - 0x12F8
   IntervalTimer m_activeTimer; // 0x12F8 - 0x1308
   int32_t m_fireSpawnOffset; // 0x1308 - 0x130C
   int32_t m_nMaxFlames; // 0x130C - 0x1310
   int32_t m_nSpreadCount; // 0x1310 - 0x1314
   unsigned char pad_1314[0x4]; // 0x1314 - 0x1318
   CountdownTimer m_BookkeepingTimer; // 0x1318 - 0x1330
   CountdownTimer m_NextSpreadTimer; // 0x1330 - 0x1348
   uint16_t m_nSourceItemDefIndex; // 0x1348 - 0x134A
   unsigned char pad_134A[0x46]; // 0x134A - 0x1390
}; // size - 0x1390


class CItemAssaultSuit /* "server" */ : public CItem /* "server" */
{
public:
   unsigned char pad_0[0x9C0]; // 0x0 - 0x9C0
}; // size - 0x9C0


class CItemDefuser /* "server" */ : public CItem /* "server" */
{
public:
   EntitySpottedState_t m_entitySpottedState; // 0x9C0 - 0x9D8
   int32_t m_nSpotRules; // 0x9D8 - 0x9DC
   unsigned char pad_9DC[0x4]; // 0x9DC - 0x9E0
}; // size - 0x9E0


class CLogicNPCCounterAABB /* "server" */ : public CLogicNPCCounter /* "server" */
{
public:
   Vector m_vDistanceOuterMins; // 0x800 - 0x80C
   Vector m_vDistanceOuterMaxs; // 0x80C - 0x818
   Vector m_vOuterMins; // 0x818 - 0x824
   Vector m_vOuterMaxs; // 0x824 - 0x830
}; // size - 0x830


class CMarkupVolumeWithRef /* "server" */ : public CMarkupVolumeTagged /* "server" */
{
public:
   bool m_bUseRef; // 0x750 - 0x751
   unsigned char pad_751[0x3]; // 0x751 - 0x754
   Vector m_vRefPos; // 0x754 - 0x760
   float m_flRefDot; // 0x760 - 0x764
   unsigned char pad_764[0x4]; // 0x764 - 0x768
}; // size - 0x768


class CMolotovGrenade /* "server" */ : public CBaseCSGrenade /* "server" */
{
public:
   unsigned char pad_0[0xED0]; // 0x0 - 0xED0
}; // size - 0xED0


class CMotionGraph /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CParamSpanUpdater m_paramSpans; // 0x10 - 0x28
   CUtlVector< TagSpan_t > m_tags; // 0x28 - 0x40
   CSmartPtr< CMotionNode > m_pRootNode; // 0x40 - 0x48
   int32_t m_nParameterCount; // 0x48 - 0x4C
   int32_t m_nConfigStartIndex; // 0x4C - 0x50
   int32_t m_nConfigCount; // 0x50 - 0x54
   bool m_bLoop; // 0x54 - 0x55
   unsigned char pad_55[0x3]; // 0x55 - 0x58
}; // size - 0x58


class CNavVolumeSphere /* "navlib" */ : public CNavVolume /* "navlib" */
{
public:
   Vector m_vCenter; // 0x70 - 0x7C
   float m_flRadius; // 0x7C - 0x80
}; // size - 0x80


class CParticleCollectionBindingInstance /* "particleslib" */ : public CBasePulseGraphInstance /* "particleslib" */
{
public:
   unsigned char pad_0[0x120]; // 0x0 - 0x120
}; // size - 0x120


class CParticleCollectionFloatInput /* "particleslib" */ : public CParticleFloatInput /* "particleslib" */
{
public:
   unsigned char pad_0[0x158]; // 0x0 - 0x158
}; // size - 0x158


class CPathKeyFrame /* "server" */ : public CLogicalEntity /* "server" */
{
public:
   Vector m_Origin; // 0x4C0 - 0x4CC
   QAngle m_Angles; // 0x4CC - 0x4D8
   unsigned char pad_4D8[0x8]; // 0x4D8 - 0x4E0
   Quaternion m_qAngle; // 0x4E0 - 0x4F0
   CUtlSymbolLarge m_iNextKey; // 0x4F0 - 0x4F8
   float m_flNextTime; // 0x4F8 - 0x4FC
   unsigned char pad_4FC[0x4]; // 0x4FC - 0x500
   CPathKeyFrame* m_pNextKey; // 0x500 - 0x508
   CPathKeyFrame* m_pPrevKey; // 0x508 - 0x510
   float m_flMoveSpeed; // 0x510 - 0x514
   unsigned char pad_514[0xC]; // 0x514 - 0x520
}; // size - 0x520


class CPhysHinge /* "server" */ : public CPhysConstraint /* "server" */
{
public:
   unsigned char pad_538[0x8]; // 0x538 - 0x540
   ConstraintSoundInfo m_soundInfo; // 0x540 - 0x5C8
   CEntityIOOutput m_NotifyMinLimitReached; // 0x5C8 - 0x5F0
   CEntityIOOutput m_NotifyMaxLimitReached; // 0x5F0 - 0x618
   bool m_bAtMinLimit; // 0x618 - 0x619
   bool m_bAtMaxLimit; // 0x619 - 0x61A
   unsigned char pad_61A[0x2]; // 0x61A - 0x61C
   constraint_hingeparams_t m_hinge; // 0x61C - 0x65C
   float m_hingeFriction; // 0x65C - 0x660
   float m_systemLoadScale; // 0x660 - 0x664
   bool m_bIsAxisLocal; // 0x664 - 0x665
   unsigned char pad_665[0x3]; // 0x665 - 0x668
   float m_flMinRotation; // 0x668 - 0x66C
   float m_flMaxRotation; // 0x66C - 0x670
   float m_flInitialRotation; // 0x670 - 0x674
   float m_flMotorFrequency; // 0x674 - 0x678
   float m_flMotorDampingRatio; // 0x678 - 0x67C
   float m_flAngleSpeed; // 0x67C - 0x680
   float m_flAngleSpeedThreshold; // 0x680 - 0x684
   unsigned char pad_684[0x4]; // 0x684 - 0x688
   CEntityIOOutput m_OnStartMoving; // 0x688 - 0x6B0
   CEntityIOOutput m_OnStopMoving; // 0x6B0 - 0x6D8
}; // size - 0x6D8


class CPlayer_ItemServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_ItemServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_MovementServices_Humanoid /* "server" */ : public CPlayer_MovementServices /* "server" */
{
public:
   float m_flStepSoundTime; // 0x1D8 - 0x1DC
   float m_flFallVelocity; // 0x1DC - 0x1E0
   bool m_bInCrouch; // 0x1E0 - 0x1E1
   unsigned char pad_1E1[0x3]; // 0x1E1 - 0x1E4
   uint32_t m_nCrouchState; // 0x1E4 - 0x1E8
   GameTime_t m_flCrouchTransitionStartTime; // 0x1E8 - 0x1EC
   bool m_bDucked; // 0x1EC - 0x1ED
   bool m_bDucking; // 0x1ED - 0x1EE
   bool m_bInDuckJump; // 0x1EE - 0x1EF
   unsigned char pad_1EF[0x1]; // 0x1EF - 0x1F0
   Vector m_groundNormal; // 0x1F0 - 0x1FC
   float m_flSurfaceFriction; // 0x1FC - 0x200
   CUtlStringToken m_surfaceProps; // 0x200 - 0x204
   unsigned char pad_204[0xC]; // 0x204 - 0x210
   int32_t m_nStepside; // 0x210 - 0x214
   int32_t m_iTargetVolume; // 0x214 - 0x218
   Vector m_vecSmoothedVelocity; // 0x218 - 0x224
   unsigned char pad_224[0x4]; // 0x224 - 0x228
}; // size - 0x228


class CPlayer_MovementServices_Humanoid /* "client" */ : public CPlayer_MovementServices /* "client" */
{
public:
   float m_flStepSoundTime; // 0x1D8 - 0x1DC
   float m_flFallVelocity; // 0x1DC - 0x1E0
   bool m_bInCrouch; // 0x1E0 - 0x1E1
   unsigned char pad_1E1[0x3]; // 0x1E1 - 0x1E4
   uint32_t m_nCrouchState; // 0x1E4 - 0x1E8
   GameTime_t m_flCrouchTransitionStartTime; // 0x1E8 - 0x1EC
   bool m_bDucked; // 0x1EC - 0x1ED
   bool m_bDucking; // 0x1ED - 0x1EE
   bool m_bInDuckJump; // 0x1EE - 0x1EF
   unsigned char pad_1EF[0x1]; // 0x1EF - 0x1F0
   Vector m_groundNormal; // 0x1F0 - 0x1FC
   float m_flSurfaceFriction; // 0x1FC - 0x200
   CUtlStringToken m_surfaceProps; // 0x200 - 0x204
   unsigned char pad_204[0xC]; // 0x204 - 0x210
   int32_t m_nStepside; // 0x210 - 0x214
   unsigned char pad_214[0x4]; // 0x214 - 0x218
}; // size - 0x218


class CPlayer_WaterServices /* "client" */ : public CPlayerPawnComponent /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPlayer_WaterServices /* "server" */ : public CPlayerPawnComponent /* "server" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class CPulseCell_BaseLerp /* "pulse_runtime_lib" */ : public CPulseCell_BaseYieldingInflow /* "pulse_runtime_lib" */
{
public:
   class CursorState_t /* "pulse_runtime_lib" */
   {
   public:
      GameTime_t m_StartTime; // 0x0 - 0x4
      GameTime_t m_EndTime; // 0x4 - 0x8
   }; // size - 0x8

   CPulse_ResumePoint m_WakeResume; // 0x48 - 0x78
}; // size - 0x78


class CPulseGraphInstance_TestDomain /* "pulse_runtime_lib" */ : public CBasePulseGraphInstance /* "pulse_runtime_lib" */
{
public:
   bool m_bIsRunningUnitTests; // 0xF8 - 0xF9
   bool m_bExplicitTimeStepping; // 0xF9 - 0xFA
   bool m_bExpectingToDestroyWithYieldedCursors; // 0xFA - 0xFB
   unsigned char pad_FB[0x1]; // 0xFB - 0xFC
   int32_t m_nNextValidateIndex; // 0xFC - 0x100
   CUtlVector< CUtlString > m_Tracepoints; // 0x100 - 0x118
   bool m_bTestYesOrNoPath; // 0x118 - 0x119
   unsigned char pad_119[0x7]; // 0x119 - 0x120
}; // size - 0x120


class CSequenceUpdateNode /* "animgraphlib" */ : public CLeafUpdateNode /* "animgraphlib" */
{
public:
   unsigned char pad_58[0x8]; // 0x58 - 0x60
   CParamSpanUpdater m_paramSpans; // 0x60 - 0x78
   CUtlVector< TagSpan_t > m_tags; // 0x78 - 0x90
   unsigned char pad_90[0x4]; // 0x90 - 0x94
   HSequence m_hSequence; // 0x94 - 0x98
   float m_playbackSpeed; // 0x98 - 0x9C
   float m_duration; // 0x9C - 0xA0
   bool m_bLoop; // 0xA0 - 0xA1
   unsigned char pad_A1[0x7]; // 0xA1 - 0xA8
}; // size - 0xA8


class CSosGroupBranchPattern /* "soundsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   bool m_bMatchEventName; // 0x8 - 0x9
   bool m_bMatchEventSubString; // 0x9 - 0xA
   bool m_bMatchEntIndex; // 0xA - 0xB
   bool m_bMatchOpvar; // 0xB - 0xC
   bool m_bMatchString; // 0xC - 0xD
   unsigned char pad_D[0x3]; // 0xD - 0x10
}; // size - 0x10


class CSoundOpvarSetAABBEntity /* "server" */ : public CSoundOpvarSetPointEntity /* "server" */
{
public:
   Vector m_vDistanceInnerMins; // 0x668 - 0x674
   Vector m_vDistanceInnerMaxs; // 0x674 - 0x680
   Vector m_vDistanceOuterMins; // 0x680 - 0x68C
   Vector m_vDistanceOuterMaxs; // 0x68C - 0x698
   int32_t m_nAABBDirection; // 0x698 - 0x69C
   Vector m_vInnerMins; // 0x69C - 0x6A8
   Vector m_vInnerMaxs; // 0x6A8 - 0x6B4
   Vector m_vOuterMins; // 0x6B4 - 0x6C0
   Vector m_vOuterMaxs; // 0x6C0 - 0x6CC
   unsigned char pad_6CC[0x4]; // 0x6CC - 0x6D0
}; // size - 0x6D0


class CTeam /* "server" */ : public CBaseEntity /* "server" */
{
public:
   CNetworkUtlVectorBase< CHandle< CBasePlayerController > > m_aPlayerControllers; // 0x4C0 - 0x4D8
   CNetworkUtlVectorBase< CHandle< CBasePlayerPawn > > m_aPlayers; // 0x4D8 - 0x4F0
   int32_t m_iScore; // 0x4F0 - 0x4F4
   char m_szTeamname[129]; // 0x4F4 - 0x575
   unsigned char pad_575[0x3]; // 0x575 - 0x578
}; // size - 0x578


class CVoiceContainerAnalysisBase /* "soundsystem_voicecontainers" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   bool m_bRegenerateCurveOnCompile; // 0x8 - 0x9
   unsigned char pad_9[0x7]; // 0x9 - 0x10
   CPiecewiseCurve m_curve; // 0x10 - 0x50
}; // size - 0x50


class CVoiceContainerDecayingSineWave /* "soundsystem_voicecontainers" */ : public CVoiceContainerBase /* "soundsystem_voicecontainers" */
{
public:
   float m_flFrequency; // 0xF0 - 0xF4
   float m_flDecayTime; // 0xF4 - 0xF8
}; // size - 0xF8


class CWeaponBaseItem /* "server" */ : public CCSWeaponBase /* "server" */
{
public:
   CountdownTimer m_SequenceCompleteTimer; // 0xE98 - 0xEB0
   bool m_bRedraw; // 0xEB0 - 0xEB1
   unsigned char pad_EB1[0x7]; // 0xEB1 - 0xEB8
}; // size - 0xEB8


class C_BasePropDoor /* "client" */ : public C_DynamicProp /* "client" */
{
public:
   unsigned char pad_1158[0x10]; // 0x1158 - 0x1168
   DoorState_t m_eDoorState; // 0x1168 - 0x116C
   bool m_modelChanged; // 0x116C - 0x116D
   bool m_bLocked; // 0x116D - 0x116E
   unsigned char pad_116E[0x2]; // 0x116E - 0x1170
   Vector m_closedPosition; // 0x1170 - 0x117C
   QAngle m_closedAngles; // 0x117C - 0x1188
   CHandle< C_BasePropDoor > m_hMaster; // 0x1188 - 0x118C
   Vector m_vWhereToSetLightingOrigin; // 0x118C - 0x1198
}; // size - 0x1198


class C_Breakable /* "client" */ : public C_BaseModelEntity /* "client" */
{
public:
   unsigned char pad_0[0xCC8]; // 0x0 - 0xCC8
}; // size - 0xCC8


class C_CSGO_PreviewModel /* "client" */ : public C_BaseFlex /* "client" */
{
public:
   CUtlString m_animgraph; // 0x1068 - 0x1070
   CGlobalSymbol m_animgraphCharacterModeString; // 0x1070 - 0x1078
   CUtlString m_defaultAnim; // 0x1078 - 0x1080
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0x1080 - 0x1084
   float m_flInitialModelScale; // 0x1084 - 0x1088
   CUtlString m_sInitialWeaponState; // 0x1088 - 0x1090
   unsigned char pad_1090[0x4F8]; // 0x1090 - 0x1588
}; // size - 0x1588


class C_PathParticleRope /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   bool m_bStartActive; // 0x548 - 0x549
   unsigned char pad_549[0x3]; // 0x549 - 0x54C
   float m_flMaxSimulationTime; // 0x54C - 0x550
   CUtlSymbolLarge m_iszEffectName; // 0x550 - 0x558
   CUtlVector< CUtlSymbolLarge > m_PathNodes_Name; // 0x558 - 0x570
   float m_flParticleSpacing; // 0x570 - 0x574
   float m_flSlack; // 0x574 - 0x578
   float m_flRadius; // 0x578 - 0x57C
   Color m_ColorTint; // 0x57C - 0x580
   int32_t m_nEffectState; // 0x580 - 0x584
   unsigned char pad_584[0x4]; // 0x584 - 0x588
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x588 - 0x590
   C_NetworkUtlVectorBase< Vector > m_PathNodes_Position; // 0x590 - 0x5A8
   C_NetworkUtlVectorBase< Vector > m_PathNodes_TangentIn; // 0x5A8 - 0x5C0
   C_NetworkUtlVectorBase< Vector > m_PathNodes_TangentOut; // 0x5C0 - 0x5D8
   C_NetworkUtlVectorBase< Vector > m_PathNodes_Color; // 0x5D8 - 0x5F0
   C_NetworkUtlVectorBase< bool > m_PathNodes_PinEnabled; // 0x5F0 - 0x608
   C_NetworkUtlVectorBase< float32 > m_PathNodes_RadiusScale; // 0x608 - 0x620
   unsigned char pad_620[0x30]; // 0x620 - 0x650
}; // size - 0x650


class C_PredictedViewModel /* "client" */ : public C_BaseViewModel /* "client" */
{
public:
   Vector m_vPredictedLagOffset; // 0xF38 - 0xF44
   QAngle m_targetSpeed; // 0xF44 - 0xF50
   QAngle m_currentSpeed; // 0xF50 - 0xF5C
   unsigned char pad_F5C[0x4]; // 0xF5C - 0xF60
}; // size - 0xF60


class C_RagdollProp /* "client" */ : public CBaseAnimGraph /* "client" */
{
public:
   unsigned char pad_ED0[0x8]; // 0xED0 - 0xED8
   C_NetworkUtlVectorBase< Vector > m_ragPos; // 0xED8 - 0xEF0
   C_NetworkUtlVectorBase< QAngle > m_ragAngles; // 0xEF0 - 0xF08
   float m_flBlendWeight; // 0xF08 - 0xF0C
   CHandle< C_BaseEntity > m_hRagdollSource; // 0xF0C - 0xF10
   AttachmentHandle_t m_iEyeAttachment; // 0xF10 - 0xF11
   unsigned char pad_F11[0x3]; // 0xF11 - 0xF14
   float m_flBlendWeightCurrent; // 0xF14 - 0xF18
   CUtlVector< int32 > m_parentPhysicsBoneIndices; // 0xF18 - 0xF30
   CUtlVector< int32 > m_worldSpaceBoneComputationOrder; // 0xF30 - 0xF48
}; // size - 0xF48


class C_Team /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   C_NetworkUtlVectorBase< CHandle< CBasePlayerController > > m_aPlayerControllers; // 0x548 - 0x560
   C_NetworkUtlVectorBase< CHandle< C_BasePlayerPawn > > m_aPlayers; // 0x560 - 0x578
   int32_t m_iScore; // 0x578 - 0x57C
   char m_szTeamname[129]; // 0x57C - 0x5FD
   unsigned char pad_5FD[0x3]; // 0x5FD - 0x600
}; // size - 0x600


class C_TeamplayRules /* "client" */ : public C_MultiplayRules /* "client" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
}; // size - 0x40


class C_TonemapController2 /* "client" */ : public C_BaseEntity /* "client" */
{
public:
   float m_flAutoExposureMin; // 0x548 - 0x54C
   float m_flAutoExposureMax; // 0x54C - 0x550
   float m_flTonemapPercentTarget; // 0x550 - 0x554
   float m_flTonemapPercentBrightPixels; // 0x554 - 0x558
   float m_flTonemapMinAvgLum; // 0x558 - 0x55C
   float m_flExposureAdaptationSpeedUp; // 0x55C - 0x560
   float m_flExposureAdaptationSpeedDown; // 0x560 - 0x564
   float m_flTonemapEVSmoothingRange; // 0x564 - 0x568
   unsigned char pad_568[0x8]; // 0x568 - 0x570
}; // size - 0x570


class FeSphereRigid_t /* "physicslib" */
{
public:
   fltx4 vSphere; // 0x0 - 0x10
   uint16_t nNode; // 0x10 - 0x12
   uint16_t nCollisionMask; // 0x12 - 0x14
   uint16_t nVertexMapIndex; // 0x14 - 0x16
   uint16_t nFlags; // 0x16 - 0x18
   unsigned char pad_18[0x8]; // 0x18 - 0x20
}; // size - 0x20


class FeTaperedCapsuleRigid_t /* "physicslib" */
{
public:
   fltx4 vSphere[2]; // 0x0 - 0x20
   uint16_t nNode; // 0x20 - 0x22
   uint16_t nCollisionMask; // 0x22 - 0x24
   uint16_t nVertexMapIndex; // 0x24 - 0x26
   uint16_t nFlags; // 0x26 - 0x28
   unsigned char pad_28[0x8]; // 0x28 - 0x30
}; // size - 0x30


class IChoreoServices /* "server" */
{
public:

   enum class ChoreoState_t : std::uint32_t
   {
      STATE_PRE_SCRIPT = 0,
      STATE_WAIT_FOR_SCRIPT = 1,
      STATE_WALK_TO_MARK = 2,
      STATE_SYNCHRONIZE_SCRIPT = 3,
      STATE_PLAY_SCRIPT = 4,
      STATE_PLAY_SCRIPT_POST_IDLE = 5,
      STATE_PLAY_SCRIPT_POST_IDLE_DONE = 6
   };

   enum class ScriptState_t : std::uint32_t
   {
      SCRIPT_PLAYING = 0,
      SCRIPT_WAIT = 1,
      SCRIPT_POST_IDLE = 2,
      SCRIPT_CLEANUP = 3,
      SCRIPT_MOVE_TO_MARK = 4
   };
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class IClientAlphaProperty /* "client" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class IParticleSystemDefinition /* "particles" */
{
public:
   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;
}; // size - 0x8


class IntervalTimer /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   GameTime_t m_timestamp; // 0x8 - 0xC
   WorldGroupId_t m_nWorldGroupId; // 0xC - 0x10
}; // size - 0x10


class IntervalTimer /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   GameTime_t m_timestamp; // 0x8 - 0xC
   WorldGroupId_t m_nWorldGroupId; // 0xC - 0x10
}; // size - 0x10


class PointDefinition_t /* "particles" */
{
public:
   int32_t m_nControlPoint; // 0x0 - 0x4
   bool m_bLocalCoords; // 0x4 - 0x5
   unsigned char pad_5[0x3]; // 0x5 - 0x8
   Vector m_vOffset; // 0x8 - 0x14
}; // size - 0x14


class Relationship_t /* "server" */
{
public:
   Disposition_t disposition; // 0x0 - 0x4
   int32_t priority; // 0x4 - 0x8
}; // size - 0x8


class dynpitchvol_base_t /* "server" */
{
public:
   int32_t preset; // 0x0 - 0x4
   int32_t pitchrun; // 0x4 - 0x8
   int32_t pitchstart; // 0x8 - 0xC
   int32_t spinup; // 0xC - 0x10
   int32_t spindown; // 0x10 - 0x14
   int32_t volrun; // 0x14 - 0x18
   int32_t volstart; // 0x18 - 0x1C
   int32_t fadein; // 0x1C - 0x20
   int32_t fadeout; // 0x20 - 0x24
   int32_t lfotype; // 0x24 - 0x28
   int32_t lforate; // 0x28 - 0x2C
   int32_t lfomodpitch; // 0x2C - 0x30
   int32_t lfomodvol; // 0x30 - 0x34
   int32_t cspinup; // 0x34 - 0x38
   int32_t cspincount; // 0x38 - 0x3C
   int32_t pitch; // 0x3C - 0x40
   int32_t spinupsav; // 0x40 - 0x44
   int32_t spindownsav; // 0x44 - 0x48
   int32_t pitchfrac; // 0x48 - 0x4C
   int32_t vol; // 0x4C - 0x50
   int32_t fadeinsav; // 0x50 - 0x54
   int32_t fadeoutsav; // 0x54 - 0x58
   int32_t volfrac; // 0x58 - 0x5C
   int32_t lfofrac; // 0x5C - 0x60
   int32_t lfomult; // 0x60 - 0x64
}; // size - 0x64


class AABB_t /* "mathlib_extended" */
{
public:
   Vector m_vMinBounds; // 0x0 - 0xC
   Vector m_vMaxBounds; // 0xC - 0x18
}; // size - 0x18


class AISound_t /* "server" */
{
public:
   uint16_t nType; // 0x0 - 0x2
   uint16_t nFlags; // 0x2 - 0x4
}; // size - 0x4


class ActiveModelConfig_t /* "server" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
   ModelConfigHandle_t m_Handle; // 0x28 - 0x2C
   unsigned char pad_2C[0x4]; // 0x2C - 0x30
   CUtlSymbolLarge m_Name; // 0x30 - 0x38
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_AssociatedEntities; // 0x38 - 0x50
   CNetworkUtlVectorBase< CUtlSymbolLarge > m_AssociatedEntityNames; // 0x50 - 0x68
}; // size - 0x68


class ActiveModelConfig_t /* "client" */
{
public:
   unsigned char pad_0[0x28]; // 0x0 - 0x28
   ModelConfigHandle_t m_Handle; // 0x28 - 0x2C
   unsigned char pad_2C[0x4]; // 0x2C - 0x30
   CUtlSymbolLarge m_Name; // 0x30 - 0x38
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_AssociatedEntities; // 0x38 - 0x50
   C_NetworkUtlVectorBase< CUtlSymbolLarge > m_AssociatedEntityNames; // 0x50 - 0x68
}; // size - 0x68


class AggregateLODSetup_t /* "worldrenderer" */
{
public:
   Vector m_vLODOrigin; // 0x0 - 0xC
   float m_fMaxObjectScale; // 0xC - 0x10
   CUtlVector< float32 > m_fSwitchDistances; // 0x10 - 0x28
}; // size - 0x28


class AggregateMeshInfo_t /* "worldrenderer" */
{
public:
   uint32_t m_nVisClusterMemberOffset; // 0x0 - 0x4
   uint8_t m_nVisClusterMemberCount; // 0x4 - 0x5
   bool m_bHasTransform; // 0x5 - 0x6
   int16_t m_nDrawCallIndex; // 0x6 - 0x8
   int16_t m_nLODSetupIndex; // 0x8 - 0xA
   uint8_t m_nLODGroupMask; // 0xA - 0xB
   Color m_vTintColor; // 0xB - 0xF
   unsigned char pad_F[0x1]; // 0xF - 0x10
   ObjectTypeFlags_t m_objectFlags; // 0x10 - 0x14
   int32_t m_nLightProbeVolumePrecomputedHandshake; // 0x14 - 0x18
}; // size - 0x18


class AggregateSceneObject_t /* "worldrenderer" */
{
public:
   ObjectTypeFlags_t m_allFlags; // 0x0 - 0x4
   ObjectTypeFlags_t m_anyFlags; // 0x4 - 0x8
   int16_t m_nLayer; // 0x8 - 0xA
   unsigned char pad_A[0x6]; // 0xA - 0x10
   CUtlVector< AggregateMeshInfo_t > m_aggregateMeshes; // 0x10 - 0x28
   CUtlVector< AggregateLODSetup_t > m_lodSetups; // 0x28 - 0x40
   CUtlVector< uint16 > m_visClusterMembership; // 0x40 - 0x58
   CUtlVector< matrix3x4_t > m_fragmentTransforms; // 0x58 - 0x70
   CStrongHandle< InfoForResourceTypeCModel > m_renderableModel; // 0x70 - 0x78
}; // size - 0x78


class AimCameraOpFixedSettings_t /* "animgraphlib" */
{
public:
   int32_t m_nChainIndex; // 0x0 - 0x4
   int32_t m_nCameraJointIndex; // 0x4 - 0x8
   int32_t m_nPelvisJointIndex; // 0x8 - 0xC
   int32_t m_nClavicleLeftJointIndex; // 0xC - 0x10
   int32_t m_nClavicleRightJointIndex; // 0x10 - 0x14
   int32_t m_nDepenetrationJointIndex; // 0x14 - 0x18
   CUtlVector< int32 > m_propJoints; // 0x18 - 0x30
}; // size - 0x30


class AimMatrixOpFixedSettings_t /* "animgraphlib" */
{
public:
   CAnimAttachment m_attachment; // 0x0 - 0x80
   CAnimInputDamping m_damping; // 0x80 - 0x90
   CPoseHandle m_poseCacheHandles[10]; // 0x90 - 0xB8
   AimMatrixBlendMode m_eBlendMode; // 0xB8 - 0xBC
   float m_flMaxYawAngle; // 0xBC - 0xC0
   float m_flMaxPitchAngle; // 0xC0 - 0xC4
   int32_t m_nSequenceMaxFrame; // 0xC4 - 0xC8
   int32_t m_nBoneMaskIndex; // 0xC8 - 0xCC
   bool m_bTargetIsPosition; // 0xCC - 0xCD
   bool m_bUseBiasAndClamp; // 0xCD - 0xCE
   unsigned char pad_CE[0x2]; // 0xCE - 0xD0
   float m_flBiasAndClampYawOffset; // 0xD0 - 0xD4
   float m_flBiasAndClampPitchOffset; // 0xD4 - 0xD8
   CBlendCurve m_biasAndClampBlendCurve; // 0xD8 - 0xE0
}; // size - 0xE0


class AmmoIndex_t /* "server" */
{
public:
   int8_t m_Value; // 0x0 - 0x1
}; // size - 0x1


class AnimComponentID /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimNodeID /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimNodeOutputID /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimParamID /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimScriptHandle /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimStateID /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimTagID /* "modellib" */
{
public:
   uint32_t m_id; // 0x0 - 0x4
}; // size - 0x4


class AnimationDecodeDebugDumpElement_t /* "animationsystem" */
{
public:
   int32_t m_nEntityIndex; // 0x0 - 0x4
   unsigned char pad_4[0x4]; // 0x4 - 0x8
   CUtlString m_modelName; // 0x8 - 0x10
   CUtlVector< CUtlString > m_poseParams; // 0x10 - 0x28
   CUtlVector< CUtlString > m_decodeOps; // 0x28 - 0x40
   CUtlVector< CUtlString > m_internalOps; // 0x40 - 0x58
   CUtlVector< CUtlString > m_decodedAnims; // 0x58 - 0x70
}; // size - 0x70


class AnimationDecodeDebugDump_t /* "animationsystem" */
{
public:
   AnimationProcessingType_t m_processingType; // 0x0 - 0x4
   unsigned char pad_4[0x4]; // 0x4 - 0x8
   CUtlVector< AnimationDecodeDebugDumpElement_t > m_elems; // 0x8 - 0x20
}; // size - 0x20


class AnimationSnapshot_t /* "animationsystem" */ : public AnimationSnapshotBase_t /* "animationsystem" */
{
public:
   int32_t m_nEntIndex; // 0x110 - 0x114
   unsigned char pad_114[0x4]; // 0x114 - 0x118
   CUtlString m_modelName; // 0x118 - 0x120
}; // size - 0x120


class AttachmentHandle_t /* "modellib" */
{
public:
   uint8_t m_Value; // 0x0 - 0x1
}; // size - 0x1


class BakedLightingInfo_t /* "worldrenderer" */
{
public:
   uint32_t m_nLightmapVersionNumber; // 0x0 - 0x4
   uint32_t m_nLightmapGameVersionNumber; // 0x4 - 0x8
   Vector2D m_vLightmapUvScale; // 0x8 - 0x10
   bool m_bHasLightmaps; // 0x10 - 0x11
   bool m_bBakedShadowsGamma20; // 0x11 - 0x12
   bool m_bCompressionEnabled; // 0x12 - 0x13
   uint8_t m_nChartPackIterations; // 0x13 - 0x14
   uint8_t m_nVradQuality; // 0x14 - 0x15
   unsigned char pad_15[0x3]; // 0x15 - 0x18
   CUtlVector< CStrongHandle< InfoForResourceTypeCTextureBase > > m_lightMaps; // 0x18 - 0x30
}; // size - 0x30


class BlendItem_t /* "animgraphlib" */
{
public:
   CUtlVector< TagSpan_t > m_tags; // 0x0 - 0x18
   CAnimUpdateNodeRef m_pChild; // 0x18 - 0x28
   HSequence m_hSequence; // 0x28 - 0x2C
   Vector2D m_vPos; // 0x2C - 0x34
   float m_flDuration; // 0x34 - 0x38
   bool m_bUseCustomDuration; // 0x38 - 0x39
   unsigned char pad_39[0x7]; // 0x39 - 0x40
}; // size - 0x40


class BoneDemoCaptureSettings_t /* "animgraphlib" */
{
public:
   CUtlString m_boneName; // 0x0 - 0x8
   float m_flErrorSplineRotationMax; // 0x8 - 0xC
   float m_flErrorSplineTranslationMax; // 0xC - 0x10
   float m_flErrorSplineScaleMax; // 0x10 - 0x14
   float m_flErrorQuantizationRotationMax; // 0x14 - 0x18
   float m_flErrorQuantizationTranslationMax; // 0x18 - 0x1C
   float m_flErrorQuantizationScaleMax; // 0x1C - 0x20
}; // size - 0x20


class CAISound /* "server" */ : public CPointEntity /* "server" */
{
public:
   SoundTypes_t m_iSoundType; // 0x4C0 - 0x4C2
   SoundFlags_t m_iSoundFlags; // 0x4C2 - 0x4C4
   int32_t m_iVolume; // 0x4C4 - 0x4C8
   int32_t m_iSoundIndex; // 0x4C8 - 0x4CC
   float m_flDuration; // 0x4CC - 0x4D0
   CUtlSymbolLarge m_iszProxyEntityName; // 0x4D0 - 0x4D8
}; // size - 0x4D8


class CAI_ChangeHintGroup /* "server" */ : public CBaseEntity /* "server" */
{
public:
   int32_t m_iSearchType; // 0x4C0 - 0x4C4
   unsigned char pad_4C4[0x4]; // 0x4C4 - 0x4C8
   CUtlSymbolLarge m_strSearchName; // 0x4C8 - 0x4D0
   CUtlSymbolLarge m_strNewHintGroup; // 0x4D0 - 0x4D8
   float m_flRadius; // 0x4D8 - 0x4DC
   unsigned char pad_4DC[0x4]; // 0x4DC - 0x4E0
}; // size - 0x4E0


class CAK47 /* "server" */ : public CCSWeaponBaseGun /* "server" */
{
public:
   unsigned char pad_0[0xEB8]; // 0x0 - 0xEB8
}; // size - 0xEB8


class CActionComponentUpdater /* "animgraphlib" */ : public CAnimComponentUpdater /* "animgraphlib" */
{
public:
   CUtlVector< CSmartPtr< CAnimActionUpdater > > m_actions; // 0x30 - 0x48
}; // size - 0x48


class CAddUpdateNode /* "animgraphlib" */ : public CBinaryUpdateNode /* "animgraphlib" */
{
public:
   unsigned char pad_88[0x4]; // 0x88 - 0x8C
   BinaryNodeChildOption m_footMotionTiming; // 0x8C - 0x90
   bool m_bApplyToFootMotion; // 0x90 - 0x91
   bool m_bApplyChannelsSeparately; // 0x91 - 0x92
   bool m_bUseModelSpace; // 0x92 - 0x93
   bool m_bApplyScale; // 0x93 - 0x94
   unsigned char pad_94[0x4]; // 0x94 - 0x98
}; // size - 0x98


class CAimCameraUpdateNode /* "animgraphlib" */ : public CUnaryUpdateNode /* "animgraphlib" */
{
public:
   CAnimParamHandle m_hParameterPosition; // 0x68 - 0x6A
   CAnimParamHandle m_hParameterOrientation; // 0x6A - 0x6C
   CAnimParamHandle m_hParameterSpineRotationWeight; // 0x6C - 0x6E
   CAnimParamHandle m_hParameterPelvisOffset; // 0x6E - 0x70
   CAnimParamHandle m_hParameterUseIK; // 0x70 - 0x72
   CAnimParamHandle m_hParameterWeaponDepenetrationDistance; // 0x72 - 0x74
   CAnimParamHandle m_hParameterCameraClearanceDistance; // 0x74 - 0x76
   unsigned char pad_76[0x2]; // 0x76 - 0x78
   AimCameraOpFixedSettings_t m_opFixedSettings; // 0x78 - 0xA8
   unsigned char pad_A8[0x8]; // 0xA8 - 0xB0
}; // size - 0xB0


class CAimConstraint /* "modellib" */ : public CBaseConstraint /* "modellib" */
{
public:
   Quaternion m_qAimOffset; // 0x70 - 0x80
   uint32_t m_nUpType; // 0x80 - 0x84
   unsigned char pad_84[0xC]; // 0x84 - 0x90
}; // size - 0x90


class CAimMatrixUpdateNode /* "animgraphlib" */ : public CUnaryUpdateNode /* "animgraphlib" */
{
public:
   unsigned char pad_68[0x8]; // 0x68 - 0x70
   AimMatrixOpFixedSettings_t m_opFixedSettings; // 0x70 - 0x150
   unsigned char pad_150[0x8]; // 0x150 - 0x158
   AnimVectorSource m_target; // 0x158 - 0x15C
   CAnimParamHandle m_paramIndex; // 0x15C - 0x15E
   unsigned char pad_15E[0x2]; // 0x15E - 0x160
   HSequence m_hSequence; // 0x160 - 0x164
   bool m_bResetChild; // 0x164 - 0x165
   bool m_bLockWhenWaning; // 0x165 - 0x166
   unsigned char pad_166[0xA]; // 0x166 - 0x170
}; // size - 0x170


class CAmbientGeneric /* "server" */ : public CPointEntity /* "server" */
{
public:
   float m_radius; // 0x4C0 - 0x4C4
   float m_flMaxRadius; // 0x4C4 - 0x4C8
   soundlevel_t m_iSoundLevel; // 0x4C8 - 0x4CC
   dynpitchvol_t m_dpv; // 0x4CC - 0x530
   bool m_fActive; // 0x530 - 0x531
   bool m_fLooping; // 0x531 - 0x532
   unsigned char pad_532[0x6]; // 0x532 - 0x538
   CUtlSymbolLarge m_iszSound; // 0x538 - 0x540
   CUtlSymbolLarge m_sSourceEntName; // 0x540 - 0x548
   CHandle< CBaseEntity > m_hSoundSource; // 0x548 - 0x54C
   CEntityIndex m_nSoundSourceEntIndex; // 0x54C - 0x550
   unsigned char pad_550[0x8]; // 0x550 - 0x558
}; // size - 0x558


class CAnimActivity /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   int32_t m_nActivity; // 0x10 - 0x14
   int32_t m_nFlags; // 0x14 - 0x18
   int32_t m_nWeight; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
}; // size - 0x20


class CAnimAttachment /* "modellib" */
{
public:
   Quaternion m_influenceRotations[3]; // 0x0 - 0x30
   VectorAligned m_influenceOffsets[3]; // 0x30 - 0x60
   int32 m_influenceIndices[3]; // 0x60 - 0x6C
   float32 m_influenceWeights[3]; // 0x6C - 0x78
   uint8_t m_numInfluences; // 0x78 - 0x79
   unsigned char pad_79[0x7]; // 0x79 - 0x80
}; // size - 0x80


class CAnimBone /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   int32_t m_parent; // 0x10 - 0x14
   Vector m_pos; // 0x14 - 0x20
   QuaternionStorage m_quat; // 0x20 - 0x30
   float m_scale; // 0x30 - 0x34
   QuaternionStorage m_qAlignment; // 0x34 - 0x44
   int32_t m_flags; // 0x44 - 0x48
}; // size - 0x48


class CAnimBoneDifference /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   CBufferString m_parent; // 0x10 - 0x20
   Vector m_posError; // 0x20 - 0x2C
   bool m_bHasRotation; // 0x2C - 0x2D
   bool m_bHasMovement; // 0x2D - 0x2E
   unsigned char pad_2E[0x2]; // 0x2E - 0x30
}; // size - 0x30


class CAnimCycle /* "modellib" */ : public CCycleBase /* "modellib" */
{
public:
   unsigned char pad_0[0x4]; // 0x0 - 0x4
}; // size - 0x4


class CAnimData /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CBufferString m_name; // 0x10 - 0x20
   CUtlVector< CAnimDesc > m_animArray; // 0x20 - 0x38
   CUtlVector< CAnimDecoder > m_decoderArray; // 0x38 - 0x50
   int32_t m_nMaxUniqueFrameIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
   CUtlVector< CAnimFrameSegment > m_segmentArray; // 0x58 - 0x70
}; // size - 0x70


class CAnimDataChannelDesc /* "animationsystem" */
{
public:
   CBufferString m_szChannelClass; // 0x0 - 0x10
   CBufferString m_szVariableName; // 0x10 - 0x20
   int32_t m_nFlags; // 0x20 - 0x24
   int32_t m_nType; // 0x24 - 0x28
   CBufferString m_szGrouping; // 0x28 - 0x38
   CBufferString m_szDescription; // 0x38 - 0x48
   CUtlVector< CBufferString > m_szElementNameArray; // 0x48 - 0x60
   CUtlVector< int32 > m_nElementIndexArray; // 0x60 - 0x78
   CUtlVector< uint32 > m_nElementMaskArray; // 0x78 - 0x90
}; // size - 0x90


class CAnimDecoder /* "animationsystem" */
{
public:
   CBufferString m_szName; // 0x0 - 0x10
   int32_t m_nVersion; // 0x10 - 0x14
   int32_t m_nType; // 0x14 - 0x18
}; // size - 0x18


class CAnimDemoCaptureSettings /* "animgraphlib" */
{
public:
   Vector2D m_vecErrorRangeSplineRotation; // 0x0 - 0x8
   Vector2D m_vecErrorRangeSplineTranslation; // 0x8 - 0x10
   Vector2D m_vecErrorRangeSplineScale; // 0x10 - 0x18
   float m_flIkRotation_MaxSplineError; // 0x18 - 0x1C
   float m_flIkTranslation_MaxSplineError; // 0x1C - 0x20
   Vector2D m_vecErrorRangeQuantizationRotation; // 0x20 - 0x28
   Vector2D m_vecErrorRangeQuantizationTranslation; // 0x28 - 0x30
   Vector2D m_vecErrorRangeQuantizationScale; // 0x30 - 0x38
   float m_flIkRotation_MaxQuantizationError; // 0x38 - 0x3C
   float m_flIkTranslation_MaxQuantizationError; // 0x3C - 0x40
   CUtlString m_baseSequence; // 0x40 - 0x48
   int32_t m_nBaseSequenceFrame; // 0x48 - 0x4C
   EDemoBoneSelectionMode m_boneSelectionMode; // 0x4C - 0x50
   CUtlVector< BoneDemoCaptureSettings_t > m_bones; // 0x50 - 0x68
   CUtlVector< IKDemoCaptureSettings_t > m_ikChains; // 0x68 - 0x80
}; // size - 0x80


class CAnimDesc /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   CAnimDesc_Flag m_flags; // 0x10 - 0x18
   float fps; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
   CAnimEncodedFrames m_Data; // 0x20 - 0xF8
   CUtlVector< CAnimMovement > m_movementArray; // 0xF8 - 0x110
   CUtlVector< CAnimEventDefinition > m_eventArray; // 0x110 - 0x128
   CUtlVector< CAnimActivity > m_activityArray; // 0x128 - 0x140
   CUtlVector< CAnimLocalHierarchy > m_hierarchyArray; // 0x140 - 0x158
   float framestalltime; // 0x158 - 0x15C
   Vector m_vecRootMin; // 0x15C - 0x168
   Vector m_vecRootMax; // 0x168 - 0x174
   unsigned char pad_174[0x4]; // 0x174 - 0x178
   CUtlVector< Vector > m_vecBoneWorldMin; // 0x178 - 0x190
   CUtlVector< Vector > m_vecBoneWorldMax; // 0x190 - 0x1A8
   CAnimSequenceParams m_sequenceParams; // 0x1A8 - 0x1B0
}; // size - 0x1B0


class CAnimDesc_Flag /* "animationsystem" */
{
public:
   bool m_bLooping; // 0x0 - 0x1
   bool m_bAllZeros; // 0x1 - 0x2
   bool m_bHidden; // 0x2 - 0x3
   bool m_bDelta; // 0x3 - 0x4
   bool m_bLegacyWorldspace; // 0x4 - 0x5
   bool m_bModelDoc; // 0x5 - 0x6
   bool m_bImplicitSeqIgnoreDelta; // 0x6 - 0x7
   bool m_bAnimGraphAdditive; // 0x7 - 0x8
}; // size - 0x8


class CAnimEncodeDifference /* "animationsystem" */
{
public:
   CUtlVector< CAnimBoneDifference > m_boneArray; // 0x0 - 0x18
   CUtlVector< CAnimMorphDifference > m_morphArray; // 0x18 - 0x30
   CUtlVector< CAnimUserDifference > m_userArray; // 0x30 - 0x48
   CUtlVector< uint8 > m_bHasRotationBitArray; // 0x48 - 0x60
   CUtlVector< uint8 > m_bHasMovementBitArray; // 0x60 - 0x78
   CUtlVector< uint8 > m_bHasMorphBitArray; // 0x78 - 0x90
   CUtlVector< uint8 > m_bHasUserBitArray; // 0x90 - 0xA8
}; // size - 0xA8


class CAnimEncodedFrames /* "animationsystem" */
{
public:
   CBufferString m_fileName; // 0x0 - 0x10
   int32_t m_nFrames; // 0x10 - 0x14
   int32_t m_nFramesPerBlock; // 0x14 - 0x18
   CUtlVector< CAnimFrameBlockAnim > m_frameblockArray; // 0x18 - 0x30
   CAnimEncodeDifference m_usageDifferences; // 0x30 - 0xD8
}; // size - 0xD8


class CAnimEnum /* "animationsystem" */
{
public:
   uint8_t m_value; // 0x0 - 0x1
}; // size - 0x1


class CAnimEventDefinition /* "animationsystem" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   int32_t m_nFrame; // 0x8 - 0xC
   int32_t m_nEndFrame; // 0xC - 0x10
   float m_flCycle; // 0x10 - 0x14
   float m_flDuration; // 0x14 - 0x18
   KeyValues3 m_EventData; // 0x18 - 0x28
   CBufferString m_sLegacyOptions; // 0x28 - 0x38
   CGlobalSymbol m_sEventName; // 0x38 - 0x40
}; // size - 0x40


class CAnimEventListener /* "server" */ : public CAnimEventListenerBase /* "server" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
}; // size - 0x20


class CAnimEventQueueListener /* "server" */ : public CAnimEventListenerBase /* "server" */
{
public:
   unsigned char pad_0[0x50]; // 0x0 - 0x50
}; // size - 0x50


class CAnimFoot /* "modellib" */
{
public:
   CUtlString m_name; // 0x0 - 0x8
   Vector m_vBallOffset; // 0x8 - 0x14
   Vector m_vHeelOffset; // 0x14 - 0x20
   int32_t m_ankleBoneIndex; // 0x20 - 0x24
   int32_t m_toeBoneIndex; // 0x24 - 0x28
}; // size - 0x28


class CAnimFrameBlockAnim /* "animationsystem" */
{
public:
   int32_t m_nStartFrame; // 0x0 - 0x4
   int32_t m_nEndFrame; // 0x4 - 0x8
   CUtlVector< int32 > m_segmentIndexArray; // 0x8 - 0x20
}; // size - 0x20


class CAnimFrameSegment /* "animationsystem" */
{
public:
   int32_t m_nUniqueFrameIndex; // 0x0 - 0x4
   uint32_t m_nLocalElementMasks; // 0x4 - 0x8
   int32_t m_nLocalChannel; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
   CUtlBinaryBlock m_container; // 0x10 - 0x28
}; // size - 0x28


class CAnimGraphDebugReplay /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x40]; // 0x0 - 0x40
   CUtlString m_animGraphFileName; // 0x40 - 0x48
   CUtlVector< CSmartPtr< CAnimReplayFrame > > m_frameList; // 0x48 - 0x60
   int32_t m_startIndex; // 0x60 - 0x64
   int32_t m_writeIndex; // 0x64 - 0x68
   int32_t m_frameCount; // 0x68 - 0x6C
   unsigned char pad_6C[0x4]; // 0x6C - 0x70
}; // size - 0x70


class CAnimGraphModelBinding /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlString m_modelName; // 0x8 - 0x10
   CSmartPtr< CAnimUpdateSharedData > m_pSharedData; // 0x10 - 0x18
   unsigned char pad_18[0x10]; // 0x18 - 0x28
}; // size - 0x28


class CAnimGraphNetworkSettings /* "animgraphlib" */ : public CAnimGraphSettingsGroup /* "animgraphlib" */
{
public:
   bool m_bNetworkingEnabled; // 0x20 - 0x21
   unsigned char pad_21[0x7]; // 0x21 - 0x28
}; // size - 0x28


class CAnimGraphNetworkedVariables /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   C_NetworkUtlVectorBase< uint32 > m_PredNetBoolVariables; // 0x8 - 0x20
   C_NetworkUtlVectorBase< uint8 > m_PredNetByteVariables; // 0x20 - 0x38
   C_NetworkUtlVectorBase< uint16 > m_PredNetUInt16Variables; // 0x38 - 0x50
   C_NetworkUtlVectorBase< int32 > m_PredNetIntVariables; // 0x50 - 0x68
   C_NetworkUtlVectorBase< uint32 > m_PredNetUInt32Variables; // 0x68 - 0x80
   C_NetworkUtlVectorBase< uint64 > m_PredNetUInt64Variables; // 0x80 - 0x98
   C_NetworkUtlVectorBase< float32 > m_PredNetFloatVariables; // 0x98 - 0xB0
   C_NetworkUtlVectorBase< Vector > m_PredNetVectorVariables; // 0xB0 - 0xC8
   C_NetworkUtlVectorBase< Quaternion > m_PredNetQuaternionVariables; // 0xC8 - 0xE0
   C_NetworkUtlVectorBase< CGlobalSymbol > m_PredNetGlobalSymbolVariables; // 0xE0 - 0xF8
   C_NetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetBoolVariables; // 0xF8 - 0x110
   C_NetworkUtlVectorBase< uint8 > m_OwnerOnlyPredNetByteVariables; // 0x110 - 0x128
   C_NetworkUtlVectorBase< uint16 > m_OwnerOnlyPredNetUInt16Variables; // 0x128 - 0x140
   C_NetworkUtlVectorBase< int32 > m_OwnerOnlyPredNetIntVariables; // 0x140 - 0x158
   C_NetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetUInt32Variables; // 0x158 - 0x170
   C_NetworkUtlVectorBase< uint64 > m_OwnerOnlyPredNetUInt64Variables; // 0x170 - 0x188
   C_NetworkUtlVectorBase< float32 > m_OwnerOnlyPredNetFloatVariables; // 0x188 - 0x1A0
   C_NetworkUtlVectorBase< Vector > m_OwnerOnlyPredNetVectorVariables; // 0x1A0 - 0x1B8
   C_NetworkUtlVectorBase< Quaternion > m_OwnerOnlyPredNetQuaternionVariables; // 0x1B8 - 0x1D0
   C_NetworkUtlVectorBase< CGlobalSymbol > m_OwnerOnlyPredNetGlobalSymbolVariables; // 0x1D0 - 0x1E8
   int32_t m_nBoolVariablesCount; // 0x1E8 - 0x1EC
   int32_t m_nOwnerOnlyBoolVariablesCount; // 0x1EC - 0x1F0
   int32_t m_nRandomSeedOffset; // 0x1F0 - 0x1F4
   float m_flLastTeleportTime; // 0x1F4 - 0x1F8
   unsigned char pad_1F8[0x1298]; // 0x1F8 - 0x1490
}; // size - 0x1490


class CAnimGraphNetworkedVariables /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CNetworkUtlVectorBase< uint32 > m_PredNetBoolVariables; // 0x8 - 0x20
   CNetworkUtlVectorBase< uint8 > m_PredNetByteVariables; // 0x20 - 0x38
   CNetworkUtlVectorBase< uint16 > m_PredNetUInt16Variables; // 0x38 - 0x50
   CNetworkUtlVectorBase< int32 > m_PredNetIntVariables; // 0x50 - 0x68
   CNetworkUtlVectorBase< uint32 > m_PredNetUInt32Variables; // 0x68 - 0x80
   CNetworkUtlVectorBase< uint64 > m_PredNetUInt64Variables; // 0x80 - 0x98
   CNetworkUtlVectorBase< float32 > m_PredNetFloatVariables; // 0x98 - 0xB0
   CNetworkUtlVectorBase< Vector > m_PredNetVectorVariables; // 0xB0 - 0xC8
   CNetworkUtlVectorBase< Quaternion > m_PredNetQuaternionVariables; // 0xC8 - 0xE0
   CNetworkUtlVectorBase< CGlobalSymbol > m_PredNetGlobalSymbolVariables; // 0xE0 - 0xF8
   CNetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetBoolVariables; // 0xF8 - 0x110
   CNetworkUtlVectorBase< uint8 > m_OwnerOnlyPredNetByteVariables; // 0x110 - 0x128
   CNetworkUtlVectorBase< uint16 > m_OwnerOnlyPredNetUInt16Variables; // 0x128 - 0x140
   CNetworkUtlVectorBase< int32 > m_OwnerOnlyPredNetIntVariables; // 0x140 - 0x158
   CNetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetUInt32Variables; // 0x158 - 0x170
   CNetworkUtlVectorBase< uint64 > m_OwnerOnlyPredNetUInt64Variables; // 0x170 - 0x188
   CNetworkUtlVectorBase< float32 > m_OwnerOnlyPredNetFloatVariables; // 0x188 - 0x1A0
   CNetworkUtlVectorBase< Vector > m_OwnerOnlyPredNetVectorVariables; // 0x1A0 - 0x1B8
   CNetworkUtlVectorBase< Quaternion > m_OwnerOnlyPredNetQuaternionVariables; // 0x1B8 - 0x1D0
   CNetworkUtlVectorBase< CGlobalSymbol > m_OwnerOnlyPredNetGlobalSymbolVariables; // 0x1D0 - 0x1E8
   int32_t m_nBoolVariablesCount; // 0x1E8 - 0x1EC
   int32_t m_nOwnerOnlyBoolVariablesCount; // 0x1EC - 0x1F0
   int32_t m_nRandomSeedOffset; // 0x1F0 - 0x1F4
   float m_flLastTeleportTime; // 0x1F4 - 0x1F8
   unsigned char pad_1F8[0x10]; // 0x1F8 - 0x208
}; // size - 0x208


class CAnimGraphSettingsManager /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< CSmartPtr< CAnimGraphSettingsGroup > > m_settingsGroups; // 0x18 - 0x30
}; // size - 0x30


class CAnimInputDamping /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   DampingSpeedFunction m_speedFunction; // 0x8 - 0xC
   float m_fSpeedScale; // 0xC - 0x10
}; // size - 0x10


class CAnimKeyData /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   CUtlVector< CAnimBone > m_boneArray; // 0x10 - 0x28
   CUtlVector< CAnimUser > m_userArray; // 0x28 - 0x40
   CUtlVector< CBufferString > m_morphArray; // 0x40 - 0x58
   int32_t m_nChannelElements; // 0x58 - 0x5C
   unsigned char pad_5C[0x4]; // 0x5C - 0x60
   CUtlVector< CAnimDataChannelDesc > m_dataChannelArray; // 0x60 - 0x78
}; // size - 0x78


class CAnimLocalHierarchy /* "animationsystem" */
{
public:
   CBufferString m_sBone; // 0x0 - 0x10
   CBufferString m_sNewParent; // 0x10 - 0x20
   int32_t m_nStartFrame; // 0x20 - 0x24
   int32_t m_nPeakFrame; // 0x24 - 0x28
   int32_t m_nTailFrame; // 0x28 - 0x2C
   int32_t m_nEndFrame; // 0x2C - 0x30
}; // size - 0x30


class CAnimMorphDifference /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
}; // size - 0x10


class CAnimMovement /* "animationsystem" */
{
public:
   int32_t endframe; // 0x0 - 0x4
   int32_t motionflags; // 0x4 - 0x8
   float v0; // 0x8 - 0xC
   float v1; // 0xC - 0x10
   float angle; // 0x10 - 0x14
   Vector vector; // 0x14 - 0x20
   Vector position; // 0x20 - 0x2C
}; // size - 0x2C


class CAnimNodePath /* "animgraphlib" */
{
public:
   AnimNodeID m_path[11]; // 0x0 - 0x2C
   int32_t m_nCount; // 0x2C - 0x30
}; // size - 0x30


class CAnimParamHandle /* "animgraphlib" */
{
public:
   AnimParamType_t m_type; // 0x0 - 0x1
   uint8_t m_index; // 0x1 - 0x2
}; // size - 0x2


class CAnimParamHandleMap /* "animgraphlib" */
{
public:
   CUtlHashtable< uint16, int16 > m_list; // 0x0 - 0x20
}; // size - 0x20


class CAnimParameterManagerUpdater /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< CSmartPtr< CAnimParameterBase > > m_parameters; // 0x18 - 0x30
   CUtlHashtable< AnimParamID, int32 > m_idToIndexMap; // 0x30 - 0x50
   CUtlHashtable< CUtlString, int32 > m_nameToIndexMap; // 0x50 - 0x70
   CUtlVector< CAnimParamHandle > m_indexToHandle; // 0x70 - 0x88
   CUtlVector< CUtlPair< CAnimParamHandle, CAnimVariant > > m_autoResetParams; // 0x88 - 0xA0
   CUtlHashtable< CAnimParamHandle, int16 > m_autoResetMap; // 0xA0 - 0xC0
   unsigned char pad_C0[0x40]; // 0xC0 - 0x100
}; // size - 0x100


class CAnimReplayFrame /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CUtlBinaryBlock > m_inputDataBlocks; // 0x10 - 0x28
   CUtlBinaryBlock m_instanceData; // 0x28 - 0x40
   CTransform m_startingLocalToWorldTransform; // 0x40 - 0x60
   CTransform m_localToWorldTransform; // 0x60 - 0x80
   float m_timeStamp; // 0x80 - 0x84
   unsigned char pad_84[0xC]; // 0x84 - 0x90
}; // size - 0x90


class CAnimScriptComponentUpdater /* "animgraphlib" */ : public CAnimComponentUpdater /* "animgraphlib" */
{
public:
   AnimScriptHandle m_hScript; // 0x30 - 0x34
   unsigned char pad_34[0x4]; // 0x34 - 0x38
}; // size - 0x38


class CAnimScriptManager /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< ScriptInfo_t > m_scriptInfo; // 0x10 - 0x28
   unsigned char pad_28[0x178]; // 0x28 - 0x1A0
}; // size - 0x1A0


class CAnimSequenceParams /* "animationsystem" */
{
public:
   float m_flFadeInTime; // 0x0 - 0x4
   float m_flFadeOutTime; // 0x4 - 0x8
}; // size - 0x8


class CAnimSkeleton /* "modellib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CTransform > m_localSpaceTransforms; // 0x10 - 0x28
   CUtlVector< CTransform > m_modelSpaceTransforms; // 0x28 - 0x40
   CUtlVector< CUtlString > m_boneNames; // 0x40 - 0x58
   CUtlVector< CUtlVector< int32 > > m_children; // 0x58 - 0x70
   CUtlVector< int32 > m_parents; // 0x70 - 0x88
   CUtlVector< CAnimFoot > m_feet; // 0x88 - 0xA0
   CUtlVector< CUtlString > m_morphNames; // 0xA0 - 0xB8
   CUtlVector< int32 > m_lodBoneCounts; // 0xB8 - 0xD0
}; // size - 0xD0


class CAnimStateMachineUpdater /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVector< CStateUpdateData > m_states; // 0x8 - 0x20
   CUtlVector< CTransitionUpdateData > m_transitions; // 0x20 - 0x38
   unsigned char pad_38[0x18]; // 0x38 - 0x50
   int32_t m_startStateIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
}; // size - 0x58


class CAnimTagManagerUpdater /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   CUtlVector< CSmartPtr< CAnimTagBase > > m_tags; // 0x18 - 0x30
   unsigned char pad_30[0x8]; // 0x30 - 0x38
}; // size - 0x38


class CAnimUpdateNodeRef /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   int32_t m_nodeIndex; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
}; // size - 0x10


class CAnimUpdateSharedData /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   CUtlVector< CSmartPtr< CAnimUpdateNodeBase > > m_nodes; // 0x10 - 0x28
   CUtlHashtable< CAnimNodePath, int32 > m_nodeIndexMap; // 0x28 - 0x48
   CUtlVector< CSmartPtr< CAnimComponentUpdater > > m_components; // 0x48 - 0x60
   CSmartPtr< CAnimParameterManagerUpdater > m_pParamListUpdater; // 0x60 - 0x68
   CSmartPtr< CAnimTagManagerUpdater > m_pTagManagerUpdater; // 0x68 - 0x70
   CSmartPtr< CAnimScriptManager > m_scriptManager; // 0x70 - 0x78
   CAnimGraphSettingsManager m_settings; // 0x78 - 0xA8
   CSmartPtr< CStaticPoseCacheBuilder > m_pStaticPoseCache; // 0xA8 - 0xB0
   CSmartPtr< CAnimSkeleton > m_pSkeleton; // 0xB0 - 0xB8
   CAnimNodePath m_rootNodePath; // 0xB8 - 0xE8
   unsigned char pad_E8[0x18]; // 0xE8 - 0x100
}; // size - 0x100


class CAnimUser /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   int32_t m_nType; // 0x10 - 0x14
   unsigned char pad_14[0x4]; // 0x14 - 0x18
}; // size - 0x18


class CAnimUserDifference /* "animationsystem" */
{
public:
   CBufferString m_name; // 0x0 - 0x10
   int32_t m_nType; // 0x10 - 0x14
   unsigned char pad_14[0x4]; // 0x14 - 0x18
}; // size - 0x18


class CAnimationGraphVisualizerAxis /* "animgraphlib" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animgraphlib" */
{
public:
   CTransform m_xWsTransform; // 0x40 - 0x60
   float m_flAxisSize; // 0x60 - 0x64
   unsigned char pad_64[0xC]; // 0x64 - 0x70
}; // size - 0x70


class CAnimationGraphVisualizerLine /* "animgraphlib" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animgraphlib" */
{
public:
   VectorAligned m_vWsPositionStart; // 0x40 - 0x50
   VectorAligned m_vWsPositionEnd; // 0x50 - 0x60
   Color m_Color; // 0x60 - 0x64
   unsigned char pad_64[0xC]; // 0x64 - 0x70
}; // size - 0x70


class CAnimationGraphVisualizerPie /* "animgraphlib" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animgraphlib" */
{
public:
   VectorAligned m_vWsCenter; // 0x40 - 0x50
   VectorAligned m_vWsStart; // 0x50 - 0x60
   VectorAligned m_vWsEnd; // 0x60 - 0x70
   Color m_Color; // 0x70 - 0x74
   unsigned char pad_74[0xC]; // 0x74 - 0x80
}; // size - 0x80


class CAnimationGraphVisualizerSphere /* "animgraphlib" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animgraphlib" */
{
public:
   VectorAligned m_vWsPosition; // 0x40 - 0x50
   float m_flRadius; // 0x50 - 0x54
   Color m_Color; // 0x54 - 0x58
   unsigned char pad_58[0x8]; // 0x58 - 0x60
}; // size - 0x60


class CAnimationGraphVisualizerText /* "animgraphlib" */ : public CAnimationGraphVisualizerPrimitiveBase /* "animgraphlib" */
{
public:
   VectorAligned m_vWsPosition; // 0x40 - 0x50
   Color m_Color; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
   CUtlString m_Text; // 0x58 - 0x60
}; // size - 0x60


class CAnimationGroup /* "animationsystem" */
{
public:
   unsigned char pad_0[0x10]; // 0x0 - 0x10
   uint32_t m_nFlags; // 0x10 - 0x14
   unsigned char pad_14[0x4]; // 0x14 - 0x18
   CBufferString m_name; // 0x18 - 0x28
   unsigned char pad_28[0x38]; // 0x28 - 0x60
   CUtlVector< CStrongHandle< InfoForResourceTypeCAnimData > > m_localHAnimArray_Handle; // 0x60 - 0x78
   CUtlVector< CStrongHandle< InfoForResourceTypeCAnimationGroup > > m_includedGroupArray_Handle; // 0x78 - 0x90
   CStrongHandle< InfoForResourceTypeCSequenceGroupData > m_directHSeqGroup_Handle; // 0x90 - 0x98
   CAnimKeyData m_decodeKey; // 0x98 - 0x110
   CUtlVector< CBufferString > m_szScripts; // 0x110 - 0x128
   unsigned char pad_128[0x8]; // 0x128 - 0x130
}; // size - 0x130


class CAttachment /* "modellib" */
{
public:
   CUtlString m_name; // 0x0 - 0x8
   CUtlString m_influenceNames[3]; // 0x8 - 0x20
   Quaternion m_vInfluenceRotations[3]; // 0x20 - 0x50
   Vector m_vInfluenceOffsets[3]; // 0x50 - 0x74
   float32 m_influenceWeights[3]; // 0x74 - 0x80
   bool m_bInfluenceRootTransform[3]; // 0x80 - 0x83
   uint8_t m_nInfluences; // 0x83 - 0x84
   bool m_bIgnoreRotation; // 0x84 - 0x85
   unsigned char pad_85[0xB]; // 0x85 - 0x90
}; // size - 0x90


class CAttributeContainer /* "server" */ : public CAttributeManager /* "server" */
{
public:
   CEconItemView m_Item; // 0x50 - 0x2C8
}; // size - 0x2C8


class CAttributeList /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   CUtlVectorEmbeddedNetworkVar< CEconItemAttribute > m_Attributes; // 0x8 - 0x58
   CAttributeManager* m_pManager; // 0x58 - 0x60
}; // size - 0x60


class CAttributeList /* "client" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   C_UtlVectorEmbeddedNetworkVar< CEconItemAttribute > m_Attributes; // 0x8 - 0x58
   CAttributeManager* m_pManager; // 0x58 - 0x60
}; // size - 0x60




class CAudioAnimTag /* "animgraphlib" */ : public CAnimTagBase /* "animgraphlib" */
{
public:
   unsigned char pad_50[0x8]; // 0x50 - 0x58
   CUtlString m_clipName; // 0x58 - 0x60
   CUtlString m_attachmentName; // 0x60 - 0x68
   float m_flVolume; // 0x68 - 0x6C
   bool m_bStopWhenTagEnds; // 0x6C - 0x6D
   bool m_bStopWhenGraphEnds; // 0x6D - 0x6E
   bool m_bPlayOnServer; // 0x6E - 0x6F
   bool m_bPlayOnClient; // 0x6F - 0x70
}; // size - 0x70


class CAudioEmphasisSample /* "soundsystem_voicecontainers" */
{
public:
   float m_flTime; // 0x0 - 0x4
   float m_flValue; // 0x4 - 0x8
}; // size - 0x8


class CAudioMorphData /* "soundsystem_voicecontainers" */
{
public:
   CUtlVector< float32 > m_times; // 0x0 - 0x18
   CUtlVector< uint32 > m_nameHashCodes; // 0x18 - 0x30
   CUtlVector< CUtlString > m_nameStrings; // 0x30 - 0x48
   CUtlVector< CUtlVector< float32 > > m_samples; // 0x48 - 0x60
   float m_flEaseIn; // 0x60 - 0x64
   float m_flEaseOut; // 0x64 - 0x68
}; // size - 0x68


class CAudioPhonemeTag /* "soundsystem_voicecontainers" */
{
public:
   float m_flStartTime; // 0x0 - 0x4
   float m_flEndTime; // 0x4 - 0x8
   int32_t m_nPhonemeCode; // 0x8 - 0xC
}; // size - 0xC


class CAudioSentence /* "soundsystem_voicecontainers" */
{
public:
   bool m_bShouldVoiceDuck; // 0x0 - 0x1
   unsigned char pad_1[0x7]; // 0x1 - 0x8
   CUtlVector< CAudioPhonemeTag > m_RunTimePhonemes; // 0x8 - 0x20
   CUtlVector< CAudioEmphasisSample > m_EmphasisSamples; // 0x20 - 0x38
   CAudioMorphData m_morphData; // 0x38 - 0xA0
}; // size - 0xA0


class CBaseAnimGraphController /* "server" */ : public CSkeletonAnimationController /* "server" */
{
public:
   unsigned char pad_10[0x8]; // 0x10 - 0x18
   CAnimGraphNetworkedVariables m_animGraphNetworkedVars; // 0x18 - 0x220
   bool m_bSequenceFinished; // 0x220 - 0x221
   unsigned char pad_221[0x3]; // 0x221 - 0x224
   float m_flSoundSyncTime; // 0x224 - 0x228
   uint32_t m_nActiveIKChainMask; // 0x228 - 0x22C
   HSequence m_hSequence; // 0x22C - 0x230
   GameTime_t m_flSeqStartTime; // 0x230 - 0x234
   float m_flSeqFixedCycle; // 0x234 - 0x238
   AnimLoopMode_t m_nAnimLoopMode; // 0x238 - 0x23C
   CNetworkedQuantizedFloat m_flPlaybackRate; // 0x23C - 0x244
   unsigned char pad_244[0x4]; // 0x244 - 0x248
   SequenceFinishNotifyState_t m_nNotifyState; // 0x248 - 0x249
   unsigned char pad_249[0x1]; // 0x249 - 0x24A
   bool m_bNetworkedAnimationInputsChanged; // 0x24A - 0x24B
   bool m_bNetworkedSequenceChanged; // 0x24B - 0x24C
   bool m_bLastUpdateSkipped; // 0x24C - 0x24D
   unsigned char pad_24D[0x3]; // 0x24D - 0x250
   GameTime_t m_flPrevAnimUpdateTime; // 0x250 - 0x254
   unsigned char pad_254[0x32C]; // 0x254 - 0x580
}; // size - 0x580


class CBaseAnimGraphController /* "client" */ : public CSkeletonAnimationController /* "client" */
{
public:
   unsigned char pad_10[0x8]; // 0x10 - 0x18
   CAnimGraphNetworkedVariables m_animGraphNetworkedVars; // 0x18 - 0x14A8
   bool m_bSequenceFinished; // 0x14A8 - 0x14A9
   unsigned char pad_14A9[0x3]; // 0x14A9 - 0x14AC
   float m_flSoundSyncTime; // 0x14AC - 0x14B0
   uint32_t m_nActiveIKChainMask; // 0x14B0 - 0x14B4
   HSequence m_hSequence; // 0x14B4 - 0x14B8
   GameTime_t m_flSeqStartTime; // 0x14B8 - 0x14BC
   float m_flSeqFixedCycle; // 0x14BC - 0x14C0
   AnimLoopMode_t m_nAnimLoopMode; // 0x14C0 - 0x14C4
   CNetworkedQuantizedFloat m_flPlaybackRate; // 0x14C4 - 0x14CC
   unsigned char pad_14CC[0x4]; // 0x14CC - 0x14D0
   SequenceFinishNotifyState_t m_nNotifyState; // 0x14D0 - 0x14D1
   unsigned char pad_14D1[0x1]; // 0x14D1 - 0x14D2
   bool m_bNetworkedAnimationInputsChanged; // 0x14D2 - 0x14D3
   bool m_bNetworkedSequenceChanged; // 0x14D3 - 0x14D4
   bool m_bLastUpdateSkipped; // 0x14D4 - 0x14D5
   unsigned char pad_14D5[0x3]; // 0x14D5 - 0x14D8
   GameTime_t m_flPrevAnimUpdateTime; // 0x14D8 - 0x14DC
   unsigned char pad_14DC[0x37C]; // 0x14DC - 0x1858
}; // size - 0x1858


class CBaseDMStart /* "server" */ : public CPointEntity /* "server" */
{
public:
   CUtlSymbolLarge m_Master; // 0x4C0 - 0x4C8
}; // size - 0x4C8


class CBaseEntityAPI /* "server" */
{
public:
   unsigned char pad_0[0x1]; // 0x0 - 0x1
}; // size - 0x1


class CBaseFlexAlias_funCBaseFlex /* "server" */ : public CBaseFlex /* "server" */
{
public:
   unsigned char pad_0[0x978]; // 0x0 - 0x978
}; // size - 0x978


class CBaseIssue /* "server" */
{
public:
   unsigned char pad_0[0x20]; // 0x0 - 0x20
   char m_szTypeString[64]; // 0x20 - 0x60
   char m_szDetailsString[260]; // 0x60 - 0x164
   int32_t m_iNumYesVotes; // 0x164 - 0x168
   int32_t m_iNumNoVotes; // 0x168 - 0x16C
   int32_t m_iNumPotentialVotes; // 0x16C - 0x170
   CVoteController* m_pVoteController; // 0x170 - 0x178
}; // size - 0x178


class CBaseMoveBehavior /* "server" */ : public CPathKeyFrame /* "server" */
{
public:
   int32_t m_iPositionInterpolator; // 0x520 - 0x524
   int32_t m_iRotationInterpolator; // 0x524 - 0x528
   float m_flAnimStartTime; // 0x528 - 0x52C
   float m_flAnimEndTime; // 0x52C - 0x530
   float m_flAverageSpeedAcrossFrame; // 0x530 - 0x534
   unsigned char pad_534[0x4]; // 0x534 - 0x538
   CPathKeyFrame* m_pCurrentKeyFrame; // 0x538 - 0x540
   CPathKeyFrame* m_pTargetKeyFrame; // 0x540 - 0x548
   CPathKeyFrame* m_pPreKeyFrame; // 0x548 - 0x550
   CPathKeyFrame* m_pPostKeyFrame; // 0x550 - 0x558
   float m_flTimeIntoFrame; // 0x558 - 0x55C
   int32_t m_iDirection; // 0x55C - 0x560
}; // size - 0x560


class CBasePlayerControllerAPI /* "client" */
{
public:
   unsigned char pad_0[0x1]; // 0x0 - 0x1
}; // size - 0x1


class CBasePlayerControllerAPI /* "server" */
{
public:
   unsigned char pad_0[0x1]; // 0x0 - 0x1
}; // size - 0x1


class CBasePlayerVData /* "server" */ : public CEntitySubclassVDataBase /* "server" */
{
public:
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_sModelName; // 0x28 - 0x108
   CSkillFloat m_flHeadDamageMultiplier; // 0x108 - 0x118
   CSkillFloat m_flChestDamageMultiplier; // 0x118 - 0x128
   CSkillFloat m_flStomachDamageMultiplier; // 0x128 - 0x138
   CSkillFloat m_flArmDamageMultiplier; // 0x138 - 0x148
   CSkillFloat m_flLegDamageMultiplier; // 0x148 - 0x158
   float m_flHoldBreathTime; // 0x158 - 0x15C
   float m_flDrowningDamageInterval; // 0x15C - 0x160
   int32_t m_nDrowningDamageInitial; // 0x160 - 0x164
   int32_t m_nDrowningDamageMax; // 0x164 - 0x168
   int32_t m_nWaterSpeed; // 0x168 - 0x16C
   float m_flUseRange; // 0x16C - 0x170
   float m_flUseAngleTolerance; // 0x170 - 0x174
   float m_flCrouchTime; // 0x174 - 0x178
}; // size - 0x178


class CBasePlayerVData /* "client" */ : public CEntitySubclassVDataBase /* "client" */
{
public:
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_sModelName; // 0x28 - 0x108
   CSkillFloat m_flHeadDamageMultiplier; // 0x108 - 0x118
   CSkillFloat m_flChestDamageMultiplier; // 0x118 - 0x128
   CSkillFloat m_flStomachDamageMultiplier; // 0x128 - 0x138
   CSkillFloat m_flArmDamageMultiplier; // 0x138 - 0x148
   CSkillFloat m_flLegDamageMultiplier; // 0x148 - 0x158
   float m_flHoldBreathTime; // 0x158 - 0x15C
   float m_flDrowningDamageInterval; // 0x15C - 0x160
   int32_t m_nDrowningDamageInitial; // 0x160 - 0x164
   int32_t m_nDrowningDamageMax; // 0x164 - 0x168
   int32_t m_nWaterSpeed; // 0x168 - 0x16C
   float m_flUseRange; // 0x16C - 0x170
   float m_flUseAngleTolerance; // 0x170 - 0x174
   float m_flCrouchTime; // 0x174 - 0x178
}; // size - 0x178


class CBindPoseUpdateNode /* "animgraphlib" */ : public CLeafUpdateNode /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x60]; // 0x0 - 0x60
}; // size - 0x60


class CBlend2DUpdateNode /* "animgraphlib" */ : public CAnimUpdateNodeBase /* "animgraphlib" */
{
public:
   unsigned char pad_58[0x8]; // 0x58 - 0x60
   CUtlVector< BlendItem_t > m_items; // 0x60 - 0x78
   CUtlVector< TagSpan_t > m_tags; // 0x78 - 0x90
   CParamSpanUpdater m_paramSpans; // 0x90 - 0xA8
   CUtlVector< int32 > m_nodeItemIndices; // 0xA8 - 0xC0
   CAnimInputDamping m_damping; // 0xC0 - 0xD0
   AnimValueSource m_blendSourceX; // 0xD0 - 0xD4
   CAnimParamHandle m_paramX; // 0xD4 - 0xD6
   unsigned char pad_D6[0x2]; // 0xD6 - 0xD8
   AnimValueSource m_blendSourceY; // 0xD8 - 0xDC
   CAnimParamHandle m_paramY; // 0xDC - 0xDE
   unsigned char pad_DE[0x2]; // 0xDE - 0xE0
   Blend2DMode m_eBlendMode; // 0xE0 - 0xE4
   float m_playbackSpeed; // 0xE4 - 0xE8
   bool m_bLoop; // 0xE8 - 0xE9
   bool m_bLockBlendOnReset; // 0xE9 - 0xEA
   bool m_bLockWhenWaning; // 0xEA - 0xEB
   bool m_bAnimEventsAndTagsOnMostWeightedOnly; // 0xEB - 0xEC
   unsigned char pad_EC[0x4]; // 0xEC - 0xF0
}; // size - 0xF0


class CBlendCurve /* "animgraphlib" */
{
public:
   float m_flControlPoint1; // 0x0 - 0x4
   float m_flControlPoint2; // 0x4 - 0x8
}; // size - 0x8


class CBlendUpdateNode /* "animgraphlib" */ : public CAnimUpdateNodeBase /* "animgraphlib" */
{
public:
   unsigned char pad_58[0x8]; // 0x58 - 0x60
   CUtlVector< CAnimUpdateNodeRef > m_children; // 0x60 - 0x78
   CUtlVector< uint8 > m_sortedOrder; // 0x78 - 0x90
   CUtlVector< float32 > m_targetValues; // 0x90 - 0xA8
   unsigned char pad_A8[0x4]; // 0xA8 - 0xAC
   AnimValueSource m_blendValueSource; // 0xAC - 0xB0
   CAnimParamHandle m_paramIndex; // 0xB0 - 0xB2
   unsigned char pad_B2[0x6]; // 0xB2 - 0xB8
   CAnimInputDamping m_damping; // 0xB8 - 0xC8
   BlendKeyType m_blendKeyType; // 0xC8 - 0xCC
   bool m_bLockBlendOnReset; // 0xCC - 0xCD
   bool m_bSyncCycles; // 0xCD - 0xCE
   bool m_bLoop; // 0xCE - 0xCF
   bool m_bLockWhenWaning; // 0xCF - 0xD0
}; // size - 0xD0


class CBlockSelectionMetricEvaluator /* "animgraphlib" */ : public CMotionMetricEvaluator /* "animgraphlib" */
{
public:
   unsigned char pad_0[0x50]; // 0x0 - 0x50
}; // size - 0x50


class CBlood /* "server" */ : public CPointEntity /* "server" */
{
public:
   QAngle m_vecSprayAngles; // 0x4C0 - 0x4CC
   Vector m_vecSprayDir; // 0x4CC - 0x4D8
   float m_flAmount; // 0x4D8 - 0x4DC
   BloodType m_Color; // 0x4DC - 0x4E0
}; // size - 0x4E0


class CBodyComponentBaseAnimGraph /* "server" */ : public CBodyComponentSkeletonInstance /* "server" */
{
public:
   CBaseAnimGraphController m_animationController; // 0x460 - 0x9E0
}; // size - 0x9E0


class CBodyComponentBaseAnimGraph /* "client" */ : public CBodyComponentSkeletonInstance /* "client" */
{
public:
   CBaseAnimGraphController m_animationController; // 0x460 - 0x1CB8
   unsigned char pad_1CB8[0x8]; // 0x1CB8 - 0x1CC0
}; // size - 0x1CC0


class CBodyComponentBaseModelEntity /* "server" */ : public CBodyComponentSkeletonInstance /* "server" */
{
public:
   unsigned char pad_0[0x460]; // 0x0 - 0x460
}; // size - 0x460


class CBodyComponentBaseModelEntity /* "client" */ : public CBodyComponentSkeletonInstance /* "client" */
{
public:
   unsigned char pad_0[0x460]; // 0x0 - 0x460
}; // size - 0x460


class CBodyComponentPoint /* "server" */ : public CBodyComponent /* "server" */
{
public:
   CGameSceneNode m_sceneNode; // 0x50 - 0x1B0
}; // size - 0x1B0


class CBodyComponentPoint /* "client" */ : public CBodyComponent /* "client" */
{
public:
   CGameSceneNode m_sceneNode; // 0x50 - 0x1B0
}; // size - 0x1B0


class CBodyGroupAnimTag /* "animgraphlib" */ : public CAnimTagBase /* "animgraphlib" */
{
public:
   unsigned char pad_50[0x8]; // 0x50 - 0x58
   int32_t m_nPriority; // 0x58 - 0x5C
   unsigned char pad_5C[0x4]; // 0x5C - 0x60
   CUtlVector< CBodyGroupSetting > m_bodyGroupSettings; // 0x60 - 0x78
}; // size - 0x78


class CBodyGroupSetting /* "animgraphlib" */
{
public:
   CUtlString m_BodyGroupName; // 0x0 - 0x8
   int32_t m_nBodyGroupOption; // 0x8 - 0xC
   unsigned char pad_C[0x4]; // 0xC - 0x10
}; // size - 0x10


class CBombTarget /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   CEntityIOOutput m_OnBombExplode; // 0x8E0 - 0x908
   CEntityIOOutput m_OnBombPlanted; // 0x908 - 0x930
   CEntityIOOutput m_OnBombDefused; // 0x930 - 0x958
   bool m_bIsBombSiteB; // 0x958 - 0x959
   bool m_bIsHeistBombTarget; // 0x959 - 0x95A
   bool m_bBombPlantedHere; // 0x95A - 0x95B
   unsigned char pad_95B[0x5]; // 0x95B - 0x960
   CUtlSymbolLarge m_szMountTarget; // 0x960 - 0x968
   CHandle< CBaseEntity > m_hInstructorHint; // 0x968 - 0x96C
   int32_t m_nBombSiteDesignation; // 0x96C - 0x970
}; // size - 0x970


class CBombTarget /* "client" */ : public C_BaseTrigger /* "client" */
{
public:
   bool m_bBombPlantedHere; // 0xCD0 - 0xCD1
   unsigned char pad_CD1[0x7]; // 0xCD1 - 0xCD8
}; // size - 0xCD8


class CBoneConstraintDotToMorph /* "modellib" */ : public CBoneConstraintBase /* "modellib" */
{
public:
   CUtlString m_sBoneName; // 0x28 - 0x30
   CUtlString m_sTargetBoneName; // 0x30 - 0x38
   CUtlString m_sMorphChannelName; // 0x38 - 0x40
   float32 m_flRemap[4]; // 0x40 - 0x50
   unsigned char pad_50[0x10]; // 0x50 - 0x60
}; // size - 0x60


class CBoneConstraintPoseSpaceBone /* "modellib" */ : public CBaseConstraint /* "modellib" */
{
public:
   class Input_t /* "modellib" */
   {
   public:
      Vector m_inputValue; // 0x0 - 0xC
      unsigned char pad_C[0x4]; // 0xC - 0x10
      CUtlVector< CTransform > m_outputTransformList; // 0x10 - 0x28
   }; // size - 0x28

   CUtlVector< CBoneConstraintPoseSpaceBone::Input_t > m_inputList; // 0x70 - 0x88
   unsigned char pad_88[0x10]; // 0x88 - 0x98
}; // size - 0x98



class CBoneConstraintPoseSpaceMorph /* "modellib" */ : public CBoneConstraintBase /* "modellib" */
{
public:
   class Input_t /* "modellib" */
   {
   public:
      Vector m_inputValue; // 0x0 - 0xC
      unsigned char pad_C[0x4]; // 0xC - 0x10
      CUtlVector< float32 > m_outputWeightList; // 0x10 - 0x28
   }; // size - 0x28

   CUtlString m_sBoneName; // 0x28 - 0x30
   CUtlString m_sAttachmentName; // 0x30 - 0x38
   CUtlVector< CUtlString > m_outputMorph; // 0x38 - 0x50
   CUtlVector< CBoneConstraintPoseSpaceMorph::Input_t > m_inputList; // 0x50 - 0x68
   bool m_bClamp; // 0x68 - 0x69
   unsigned char pad_69[0x3F]; // 0x69 - 0xA8
}; // size - 0xA8



class CBoneMaskUpdateNode /* "animgraphlib" */ : public CBinaryUpdateNode /* "animgraphlib" */
{
public:
   unsigned char pad_88[0x4]; // 0x88 - 0x8C
   int32_t m_nWeightListIndex; // 0x8C - 0x90
   float m_flRootMotionBlend; // 0x90 - 0x94
   BoneMaskBlendSpace m_blendSpace; // 0x94 - 0x98
   BinaryNodeChildOption m_footMotionTiming; // 0x98 - 0x9C
   bool m_bUseBlendScale; // 0x9C - 0x9D
   unsigned char pad_9D[0x3]; // 0x9D - 0xA0
   AnimValueSource m_blendValueSource; // 0xA0 - 0xA4
   CAnimParamHandle m_hBlendParameter; // 0xA4 - 0xA6
   unsigned char pad_A6[0x2]; // 0xA6 - 0xA8
}; // size - 0xA8


class CBonePositionMetricEvaluator /* "animgraphlib" */ : public CMotionMetricEvaluator /* "animgraphlib" */
{
public:
   int32_t m_nBoneIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
}; // size - 0x58


class CBoneVelocityMetricEvaluator /* "animgraphlib" */ : public CMotionMetricEvaluator /* "animgraphlib" */
{
public:
   int32_t m_nBoneIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4]; // 0x54 - 0x58
}; // size - 0x58


class CBoolAnimParameter /* "animgraphlib" */ : public CConcreteAnimParameter /* "animgraphlib" */
{
public:
   bool m_bDefaultValue; // 0x80 - 0x81
   unsigned char pad_81[0x7]; // 0x81 - 0x88
}; // size - 0x88


class CBreachCharge /* "server" */ : public CCSWeaponBase /* "server" */
{
public:
   unsigned char pad_0[0xE98]; // 0x0 - 0xE98
}; // size - 0xE98


class CBreachCharge /* "client" */ : public C_CSWeaponBase /* "client" */
{
public:
   unsigned char pad_0[0x1A80]; // 0x0 - 0x1A80
}; // size - 0x1A80


class CBreachChargeProjectile /* "server" */ : public CBaseGrenade /* "server" */
{
public:
   unsigned char pad_0[0xA20]; // 0x0 - 0xA20
}; // size - 0xA20


class CBreachChargeProjectile /* "client" */ : public C_BaseGrenade /* "client" */
{
public:
   unsigned char pad_0[0x10B8]; // 0x0 - 0x10B8
}; // size - 0x10B8


class CBreakableStageHelper /* "server" */
{
public:
   unsigned char pad_0[0x8]; // 0x0 - 0x8
   int32_t m_nCurrentStage; // 0x8 - 0xC
   int32_t m_nStageCount; // 0xC - 0x10
   unsigned char pad_10[0x8]; // 0x10 - 0x18
}; // size - 0x18


class CBtActionAim /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_58[0x10]; // 0x58 - 0x68
   CUtlString m_szSensorInputKey; // 0x68 - 0x70
   unsigned char pad_70[0x10]; // 0x70 - 0x80
   CUtlString m_szAimReadyKey; // 0x80 - 0x88
   float m_flZoomCooldownTimestamp; // 0x88 - 0x8C
   bool m_bDoneAiming; // 0x8C - 0x8D
   unsigned char pad_8D[0x3]; // 0x8D - 0x90
   float m_flLerpStartTime; // 0x90 - 0x94
   float m_flNextLookTargetLerpTime; // 0x94 - 0x98
   float m_flPenaltyReductionRatio; // 0x98 - 0x9C
   QAngle m_NextLookTarget; // 0x9C - 0xA8
   CountdownTimer m_AimTimer; // 0xA8 - 0xC0
   CountdownTimer m_SniperHoldTimer; // 0xC0 - 0xD8
   CountdownTimer m_FocusIntervalTimer; // 0xD8 - 0xF0
   bool m_bAcquired; // 0xF0 - 0xF1
   unsigned char pad_F1[0x7]; // 0xF1 - 0xF8
}; // size - 0xF8


class CBtActionCombatPositioning /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_58[0x10]; // 0x58 - 0x68
   CUtlString m_szSensorInputKey; // 0x68 - 0x70
   unsigned char pad_70[0x10]; // 0x70 - 0x80
   CUtlString m_szIsAttackingKey; // 0x80 - 0x88
   CountdownTimer m_ActionTimer; // 0x88 - 0xA0
   bool m_bCrouching; // 0xA0 - 0xA1
   unsigned char pad_A1[0xF]; // 0xA1 - 0xB0
}; // size - 0xB0


class CBtActionMoveTo /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_58[0x8]; // 0x58 - 0x60
   CUtlString m_szDestinationInputKey; // 0x60 - 0x68
   CUtlString m_szHidingSpotInputKey; // 0x68 - 0x70
   CUtlString m_szThreatInputKey; // 0x70 - 0x78
   Vector m_vecDestination; // 0x78 - 0x84
   bool m_bAutoLookAdjust; // 0x84 - 0x85
   bool m_bComputePath; // 0x85 - 0x86
   unsigned char pad_86[0x2]; // 0x86 - 0x88
   float m_flDamagingAreasPenaltyCost; // 0x88 - 0x8C
   unsigned char pad_8C[0x4]; // 0x8C - 0x90
   CountdownTimer m_CheckApproximateCornersTimer; // 0x90 - 0xA8
   CountdownTimer m_CheckHighPriorityItem; // 0xA8 - 0xC0
   CountdownTimer m_RepathTimer; // 0xC0 - 0xD8
   float m_flArrivalEpsilon; // 0xD8 - 0xDC
   float m_flAdditionalArrivalEpsilon2D; // 0xDC - 0xE0
   float m_flHidingSpotCheckDistanceThreshold; // 0xE0 - 0xE4
   float m_flNearestAreaDistanceThreshold; // 0xE4 - 0xE8
}; // size - 0xE8


class CBtActionParachutePositioning /* "server" */ : public CBtNode /* "server" */
{
public:
   CountdownTimer m_ActionTimer; // 0x58 - 0x70
   unsigned char pad_70[0x8]; // 0x70 - 0x78
}; // size - 0x78


class CBtNodeComposite /* "server" */ : public CBtNode /* "server" */
{
public:
   unsigned char pad_0[0x58]; // 0x0 - 0x58
}; // size - 0x58


class CBtNodeConditionInactive /* "server" */ : public CBtNodeCondition /* "server" */
{
public:
   unsigned char pad_60[0x18]; // 0x60 - 0x78
   float m_flRoundStartThresholdSeconds; // 0x78 - 0x7C
   float m_flSensorInactivityThresholdSeconds; // 0x7C - 0x80
   CountdownTimer m_SensorInactivityTimer; // 0x80 - 0x98
}; // size - 0x98


class CBubbling /* "server" */ : public CBaseModelEntity /* "server" */
{
public:
   int32_t m_density; // 0x710 - 0x714
   int32_t m_frequency; // 0x714 - 0x718
   int32_t m_state; // 0x718 - 0x71C
   unsigned char pad_71C[0x4]; // 0x71C - 0x720
}; // size - 0x720


class CBumpMine /* "client" */ : public C_CSWeaponBase /* "client" */
{
public:
   unsigned char pad_0[0x1A80]; // 0x0 - 0x1A80
}; // size - 0x1A80


class CBumpMine /* "server" */ : public CCSWeaponBase /* "server" */
{
public:
   unsigned char pad_0[0xE98]; // 0x0 - 0xE98
}; // size - 0xE98


class CBumpMineProjectile /* "server" */ : public CBaseGrenade /* "server" */
{
public:
   unsigned char pad_0[0xA20]; // 0x0 - 0xA20
}; // size - 0xA20


class CBumpMineProjectile /* "client" */ : public C_BaseGrenade /* "client" */
{
public:
   unsigned char pad_0[0x10B8]; // 0x0 - 0x10B8
}; // size - 0x10B8


class CBuoyancyHelper /* "server" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   float m_flFluidDensity; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
}; // size - 0x20


class CBuoyancyHelper /* "client" */
{
public:
   unsigned char pad_0[0x18]; // 0x0 - 0x18
   float m_flFluidDensity; // 0x18 - 0x1C
   unsigned char pad_1C[0x4]; // 0x1C - 0x20
}; // size - 0x20


class CBuyZone /* "server" */ : public CBaseTrigger /* "server" */
{
public:
   int32_t m_LegacyTeamNum; // 0x8E0 - 0x8E4
   unsigned char pad_8E4[0x4]; // 0x8E4 - 0x8E8
}; // size - 0x8E8


class CC4 /* "server" */ : public CCSWeaponBase /* "server" */
{
public:
   Vector m_vecLastValidPlayerHeldPosition; // 0xE98 - 0xEA4
   Vector m_vecLastValidDroppedPosition; // 0xEA4 - 0xEB0
   bool m_bDoValidDroppedPositionCheck; // 0xEB0 - 0xEB1
   bool m_bStartedArming; // 0xEB1 - 0xEB2
   unsigned char pad_EB2[0x2]; // 0xEB2 - 0xEB4
   GameTime_t m_fArmedTime; // 0xEB4 - 0xEB8
   bool m_bBombPlacedAnimation; // 0xEB8 - 0xEB9
   bool m_bIsPlantingViaUse; // 0xEB9 - 0xEBA
   unsigned char pad_EBA[0x6]; // 0xEBA - 0xEC0
   EntitySpottedState_t m_entitySpottedState; // 0xEC0 - 0xED8
   int32_t m_nSpotRules; // 0xED8 - 0xEDC
   bool m_bPlayedArmingBeeps[7]; // 0xEDC - 0xEE3
   bool m_bBombPlanted; // 0xEE3 - 0xEE4
   unsigned char pad_EE4[0x4]; // 0xEE4 - 0xEE8
}; // size - 0xEE8


class CCPPScriptComponentUpdater /* "animgraphlib" */ : public CAnimComponentUpdater /* "animgraphlib" */
{
public:
   CUtlVector< CGlobalSymbol > m_scriptsToRun; // 0x30 - 0x48
   unsigned char pad_48[0x18]; // 0x48 - 0x60
}; // size - 0x60


class CCSArmsRaceScript /* "server" */ : public CCSGameModeScript /* "server" */
{
public:
   CCSGameModeRules_ArmsRace* m_pOuter; // 0xF8 - 0x100
}; // size - 0x100


class CCSArmsRaceScript /* "client" */ : public CCSGameModeScript /* "client" */
{
public:
   CCSGameModeRules_ArmsRace* m_pOuter; // 0xF8 - 0x100
}; // size - 0x100


class CCSBot /* "server" */ : public CBot /* "server" */
{
public:
   unsigned char pad_F0[0x8]; // 0xF0 - 0xF8
   Vector m_eyePosition; // 0xF8 - 0x104
   char m_name[64]; // 0x104 - 0x144
   float m_combatRange; // 0x144 - 0x148
   bool m_isRogue; // 0x148 - 0x149
   unsigned char pad_149[0x7]; // 0x149 - 0x150
   CountdownTimer m_rogueTimer; // 0x150 - 0x168
   unsigned char pad_168[0x4]; // 0x168 - 0x16C
   bool m_diedLastRound; // 0x16C - 0x16D
   unsigned char pad_16D[0x3]; // 0x16D - 0x170
   float m_safeTime; // 0x170 - 0x174
   bool m_wasSafe; // 0x174 - 0x175
   unsigned char pad_175[0x7]; // 0x175 - 0x17C
   bool m_blindFire; // 0x17C - 0x17D
   unsigned char pad_17D[0x3]; // 0x17D - 0x180
   CountdownTimer m_surpriseTimer; // 0x180 - 0x198
   bool m_bAllowActive; // 0x198 - 0x199
   bool m_isFollowing; // 0x199 - 0x19A
   unsigned char pad_19A[0x2]; // 0x19A - 0x19C
   CHandle< CCSPlayerPawn > m_leader; // 0x19C - 0x1A0
   float m_followTimestamp; // 0x1A0 - 0x1A4
   float m_allowAutoFollowTime; // 0x1A4 - 0x1A8
   CountdownTimer m_hurryTimer; // 0x1A8 - 0x1C0
   CountdownTimer m_alertTimer; // 0x1C0 - 0x1D8
   CountdownTimer m_sneakTimer; // 0x1D8 - 0x1F0
   CountdownTimer m_panicTimer; // 0x1F0 - 0x208
   unsigned char pad_208[0x2B8]; // 0x208 - 0x4C0
   float m_stateTimestamp; // 0x4C0 - 0x4C4
   bool m_isAttacking; // 0x4C4 - 0x4C5
   bool m_isOpeningDoor; // 0x4C5 - 0x4C6
   unsigned char pad_4C6[0x6]; // 0x4C6 - 0x4CC
   CHandle< CBaseEntity > m_taskEntity; // 0x4CC - 0x4D0
   unsigned char pad_4D0[0xC]; // 0x4D0 - 0x4DC
   Vector m_goalPosition; // 0x4DC - 0x4E8
   CHandle< CBaseEntity > m_goalEntity; // 0x4E8 - 0x4EC
   CHandle< CBaseEntity > m_avoid; // 0x4EC - 0x4F0
   float m_avoidTimestamp; // 0x4F0 - 0x4F4
   bool m_isStopping; // 0x4F4 - 0x4F5
   bool m_hasVisitedEnemySpawn; // 0x4F5 - 0x4F6
   unsigned char pad_4F6[0x2]; // 0x4F6 - 0x4F8
   IntervalTimer m_stillTimer; // 0x4F8 - 0x508
   bool m_bEyeAnglesUnderPathFinderControl; // 0x508 - 0x509
   unsigned char pad_509[0x50F7]; // 0x509 - 0x5600
   int32_t m_pathIndex; // 0x5600 - 0x5604
   GameTime_t m_areaEnteredTimestamp; // 0x5604 - 0x5608
   CountdownTimer m_repathTimer; // 0x5608 - 0x5620
   CountdownTimer m_avoidFriendTimer; // 0x5620 - 0x5638
   bool m_isFriendInTheWay; // 0x5638 - 0x5639
   unsigned char pad_5639[0x7]; // 0x5639 - 0x5640
   CountdownTimer m_politeTimer; // 0x5640 - 0x5658
   bool m_isWaitingBehindFriend; // 0x5658 - 0x5659
   unsigned char pad_5659[0x2B]; // 0x5659 - 0x5684
   float m_pathLadderEnd; // 0x5684 - 0x5688
   unsigned char pad_5688[0x48]; // 0x5688 - 0x56D0
   CountdownTimer m_mustRunTimer; // 0x56D0 - 0x56E8
   CountdownTimer m_waitTimer; // 0x56E8 - 0x5700
   CountdownTimer m_updateTravelDistanceTimer; // 0x5700 - 0x5718
   float32 m_playerTravelDistance[64]; // 0x5718 - 0x5818
   uint8_t m_travelDistancePhase; // 0x5818 - 0x5819
   unsigned char pad_5819[0x197]; // 0x5819 - 0x59B0
   uint8_t m_hostageEscortCount; // 0x59B0 - 0x59B1
   unsigned char pad_59B1[0x3]; // 0x59B1 - 0x59B4
   float m_hostageEscortCountTimestamp; // 0x59B4 - 0x59B8
   int32_t m_desiredTeam; // 0x59B8 - 0x59BC
   bool m_hasJoined; // 0x59BC - 0x59BD
   bool m_isWaitingForHostage; // 0x59BD - 0x59BE
   unsigned char pad_59BE[0x2]; // 0x59BE - 0x59C0
   CountdownTimer m_inhibitWaitingForHostageTimer; // 0x59C0 - 0x59D8
   CountdownTimer m_waitForHostageTimer; // 0x59D8 - 0x59F0
   Vector m_noisePosition; // 0x59F0 - 0x59FC
   float m_noiseTravelDistance; // 0x59FC - 0x5A00
   float m_noiseTimestamp; // 0x5A00 - 0x5A04
   unsigned char pad_5A04[0x4]; // 0x5A04 - 0x5A08
   CCSPlayerPawn* m_noiseSource; // 0x5A08 - 0x5A10
   unsigned char pad_5A10[0x10]; // 0x5A10 - 0x5A20
   CountdownTimer m_noiseBendTimer; // 0x5A20 - 0x5A38
   Vector m_bentNoisePosition; // 0x5A38 - 0x5A44
   bool m_bendNoisePositionValid; // 0x5A44 - 0x5A45
   unsigned char pad_5A45[0x3]; // 0x5A45 - 0x5A48
   float m_lookAroundStateTimestamp; // 0x5A48 - 0x5A4C
   float m_lookAheadAngle; // 0x5A4C - 0x5A50
   float m_forwardAngle; // 0x5A50 - 0x5A54
   float m_inhibitLookAroundTimestamp; // 0x5A54 - 0x5A58
   unsigned char pad_5A58[0x4]; // 0x5A58 - 0x5A5C
   Vector m_lookAtSpot; // 0x5A5C - 0x5A68
   unsigned char pad_5A68[0x4]; // 0x5A68 - 0x5A6C
   float m_lookAtSpotDuration; // 0x5A6C - 0x5A70
   float m_lookAtSpotTimestamp; // 0x5A70 - 0x5A74
   float m_lookAtSpotAngleTolerance; // 0x5A74 - 0x5A78
   bool m_lookAtSpotClearIfClose; // 0x5A78 - 0x5A79
   bool m_lookAtSpotAttack; // 0x5A79 - 0x5A7A
   unsigned char pad_5A7A[0x6]; // 0x5A7A - 0x5A80
   char* m_lookAtDesc; // 0x5A80 - 0x5A88
   float m_peripheralTimestamp; // 0x5A88 - 0x5A8C
   unsigned char pad_5A8C[0x184]; // 0x5A8C - 0x5C10
   uint8_t m_approachPointCount; // 0x5C10 - 0x5C11
   unsigned char pad_5C11[0x3]; // 0x5C11 - 0x5C14
   Vector m_approachPointViewPosition; // 0x5C14 - 0x5C20
   IntervalTimer m_viewSteadyTimer; // 0x5C20 - 0x5C30
   unsigned char pad_5C30[0x8]; // 0x5C30 - 0x5C38
   CountdownTimer m_tossGrenadeTimer; // 0x5C38 - 0x5C50
   unsigned char pad_5C50[0x8]; // 0x5C50 - 0x5C58
   CountdownTimer m_isAvoidingGrenade; // 0x5C58 - 0x5C70
   unsigned char pad_5C70[0x8]; // 0x5C70 - 0x5C78
   float m_spotCheckTimestamp; // 0x5C78 - 0x5C7C
   unsigned char pad_5C7C[0x404]; // 0x5C7C - 0x6080
   int32_t m_checkedHidingSpotCount; // 0x6080 - 0x6084
   float m_lookPitch; // 0x6084 - 0x6088
   float m_lookPitchVel; // 0x6088 - 0x608C
   float m_lookYaw; // 0x608C - 0x6090
   float m_lookYawVel; // 0x6090 - 0x6094
   Vector m_targetSpot; // 0x6094 - 0x60A0
   Vector m_targetSpotVelocity; // 0x60A0 - 0x60AC
   Vector m_targetSpotPredicted; // 0x60AC - 0x60B8
   QAngle m_aimError; // 0x60B8 - 0x60C4
   QAngle m_aimGoal; // 0x60C4 - 0x60D0
   GameTime_t m_targetSpotTime; // 0x60D0 - 0x60D4
   float m_aimFocus; // 0x60D4 - 0x60D8
   float m_aimFocusInterval; // 0x60D8 - 0x60DC
   GameTime_t m_aimFocusNextUpdate; // 0x60DC - 0x60E0
   unsigned char pad_60E0[0x8]; // 0x60E0 - 0x60E8
   CountdownTimer m_ignoreEnemiesTimer; // 0x60E8 - 0x6100
   CHandle< CCSPlayerPawn > m_enemy; // 0x6100 - 0x6104
   bool m_isEnemyVisible; // 0x6104 - 0x6105
   uint8_t m_visibleEnemyParts; // 0x6105 - 0x6106
   unsigned char pad_6106[0x2]; // 0x6106 - 0x6108
   Vector m_lastEnemyPosition; // 0x6108 - 0x6114
   float m_lastSawEnemyTimestamp; // 0x6114 - 0x6118
   float m_firstSawEnemyTimestamp; // 0x6118 - 0x611C
   float m_currentEnemyAcquireTimestamp; // 0x611C - 0x6120
   float m_enemyDeathTimestamp; // 0x6120 - 0x6124
   float m_friendDeathTimestamp; // 0x6124 - 0x6128
   bool m_isLastEnemyDead; // 0x6128 - 0x6129
   unsigned char pad_6129[0x3]; // 0x6129 - 0x612C
   int32_t m_nearbyEnemyCount; // 0x612C - 0x6130
   unsigned char pad_6130[0x208]; // 0x6130 - 0x6338
   CHandle< CCSPlayerPawn > m_bomber; // 0x6338 - 0x633C
   int32_t m_nearbyFriendCount; // 0x633C - 0x6340
   CHandle< CCSPlayerPawn > m_closestVisibleFriend; // 0x6340 - 0x6344
   CHandle< CCSPlayerPawn > m_closestVisibleHumanFriend; // 0x6344 - 0x6348
   IntervalTimer m_attentionInterval; // 0x6348 - 0x6358
   CHandle< CCSPlayerPawn > m_attacker; // 0x6358 - 0x635C
   float m_attackedTimestamp; // 0x635C - 0x6360
   IntervalTimer m_burnedByFlamesTimer; // 0x6360 - 0x6370
   int32_t m_lastVictimID; // 0x6370 - 0x6374
   bool m_isAimingAtEnemy; // 0x6374 - 0x6375
   bool m_isRapidFiring; // 0x6375 - 0x6376
   unsigned char pad_6376[0x2]; // 0x6376 - 0x6378
   IntervalTimer m_equipTimer; // 0x6378 - 0x6388
   CountdownTimer m_zoomTimer; // 0x6388 - 0x63A0
   GameTime_t m_fireWeaponTimestamp; // 0x63A0 - 0x63A4
   unsigned char pad_63A4[0x4]; // 0x63A4 - 0x63A8
   CountdownTimer m_lookForWeaponsOnGroundTimer; // 0x63A8 - 0x63C0
   bool m_bIsSleeping; // 0x63C0 - 0x63C1
   bool m_isEnemySniperVisible; // 0x63C1 - 0x63C2
   unsigned char pad_63C2[0x6]; // 0x63C2 - 0x63C8
   CountdownTimer m_sawEnemySniperTimer; // 0x63C8 - 0x63E0
   unsigned char pad_63E0[0xA0]; // 0x63E0 - 0x6480
   uint8_t m_enemyQueueIndex; // 0x6480 - 0x6481
   uint8_t m_enemyQueueCount; // 0x6481 - 0x6482
   uint8_t m_enemyQueueAttendIndex; // 0x6482 - 0x6483
   bool m_isStuck; // 0x6483 - 0x6484
   GameTime_t m_stuckTimestamp; // 0x6484 - 0x6488
   Vector m_stuckSpot; // 0x6488 - 0x6494
   unsigned char pad_6494[0x4]; // 0x6494 - 0x6498
   CountdownTimer m_wiggleTimer; // 0x6498 - 0x64B0
   CountdownTimer m_stuckJumpTimer; // 0x64B0 - 0x64C8
   GameTime_t m_nextCleanupCheckTimestamp; // 0x64C8 - 0x64CC
   float32 m_avgVel[10]; // 0x64CC - 0x64F4
   int32_t m_avgVelIndex; // 0x64F4 - 0x64F8
   int32_t m_avgVelCount; // 0x64F8 - 0x64FC
   Vector m_lastOrigin; // 0x64FC - 0x6508
   unsigned char pad_6508[0x4]; // 0x6508 - 0x650C
   float m_lastRadioRecievedTimestamp; // 0x650C - 0x6510
   float m_lastRadioSentTimestamp; // 0x6510 - 0x6514
   CHandle< CCSPlayerPawn > m_radioSubject; // 0x6514 - 0x6518
   Vector m_radioPosition; // 0x6518 - 0x6524
   float m_voiceEndTimestamp; // 0x6524 - 0x6528
   unsigned char pad_6528[0x8]; // 0x6528 - 0x6530
   int32_t m_lastValidReactionQueueFrame; // 0x6530 - 0x6534
   unsigned char pad_6534[0x4]; // 0x6534 - 0x6538
}; // size - 0x6538


class CCSClientPointScriptEntity /* "client" */ : public CCSPointScriptEntity /* "client" */
{
public:
   unsigned char pad_0[0x550]; // 0x0 - 0x550
}; // size - 0x550


class CCSDeathmatchScript /* "server" */ : public CCSGameModeScript /* "server" */
{
public:
   CCSGameModeRules_Deathmatch* m_pOuter; // 0xF8 - 0x100
}; // size - 0x100


class CCSDeathmatchScript /* "client" */ : public CCSGameModeScript /* "client" */
{
public:
   CCSGameModeRules_Deathmatch* m_pOuter; // 0xF8 - 0x100
}; // size - 0x100


class CCSDeathmatchScript_ConVars /* "server" */
{
public:
   unsigned char pad_0[0x1]; // 0x0 - 0x1
}; // size - 0x1


class CCSGOPlayerAnimGraphState /* "server" */
{
public:
   unsigned char pad_0[0x608]; // 0x0 - 0x608
}; // size - 0x608


class CCSGOViewModel /* "server" */ : public CPredictedViewModel /* "server" */
{
public:
   bool m_bShouldIgnoreOffsetAndAccuracy; // 0x930 - 0x931
   unsigned char pad_931[0x3]; // 0x931 - 0x934
   uint32_t m_nWeaponParity; // 0x934 - 0x938
   uint32_t m_nOldWeaponParity; // 0x938 - 0x93C
   unsigned char pad_93C[0x2C]; // 0x93C - 0x968
}; // size - 0x968


class CCSGO_TeamIntroCounterTerroristPosition /* "server" */ : public CCSGO_TeamIntroCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC48]; // 0x0 - 0xC48
}; // size - 0xC48


class CCSGO_TeamIntroTerroristPosition /* "server" */ : public CCSGO_TeamIntroCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC48]; // 0x0 - 0xC48
}; // size - 0xC48


class CCSGO_TeamSelectCounterTerroristPosition /* "server" */ : public CCSGO_TeamSelectCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC48]; // 0x0 - 0xC48
}; // size - 0xC48


class CCSGO_TeamSelectTerroristPosition /* "server" */ : public CCSGO_TeamSelectCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC48]; // 0x0 - 0xC48
}; // size - 0xC48


class CCSGO_WingmanIntroCounterTerroristPosition /* "client" */ : public CCSGO_WingmanIntroCharacterPosition /* "client" */
{
public:
   unsigned char pad_0[0x1278]; // 0x0 - 0x1278
}; // size - 0x1278


class CCSGO_WingmanIntroCounterTerroristPosition /* "server" */ : public CCSGO_WingmanIntroCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC48]; // 0x0 - 0xC48
}; // size - 0xC48


class CCSGO_WingmanIntroTerroristPosition /* "server" */ : public CCSGO_WingmanIntroCharacterPosition /* "server" */
{
public:
   unsigned char pad_0[0xC48]; // 0x0 - 0xC48
}; // size - 0xC48


class CCSGO_WingmanIntroTerroristPosition /* "client" */ : public CCSGO_WingmanIntroCharacterPosition /* "client" */
{
public:
   unsigned char pad_0[0x1278]; // 0x0 - 0x1278
}; // size - 0x1278


class CCSGameModeRules_ArmsRace /* "server" */ : public CCSGameModeRules /* "server" */
{
public:
   CNetworkUtlVectorBase< CUtlString > m_WeaponSequence; // 0x38 - 0x50
}; // size - 0x50


class CCSGameModeRules_ArmsRace /* "client" */ : public CCSGameModeRules /* "client" */
{
public:
   C_NetworkUtlVectorBase< CUtlString > m_WeaponSequence; // 0x38 - 0x50
}; // size - 0x50


class CCSGameModeRules_Deathmatch /* "client" */ : public CCSGameModeRules /* "client" */
{
public:
   GameTime_t m_flDMBonusStartTime; // 0x38 - 0x3C
   float m_flDMBonusTimeLength; // 0x3C - 0x40
   CUtlString m_sDMBonusWeapon; // 0x40 - 0x48
}; // size - 0x48


class CCSGameModeRules_Deathmatch /* "server" */ : public CCSGameModeRules /* "server" */
{
public:
   GameTime_t m_flDMBonusStartTime; // 0x38 - 0x3C
   float m_flDMBonusTimeLength; // 0x3C - 0x40
   CUtlString m_sDMBonusWeapon; // 0x40 - 0x48
}; // size - 0x48


class CCSGameModeRules_Noop /* "client" */ : public CCSGameModeRules /* "client" */
{
public:
   unsigned char pad_0[0x38]; // 0x0 - 0x38
}; // size - 0x38


class CCSGameModeRules_Noop /* "server" */ : public CCSGameModeRules /* "server" */
{
public:
   unsigned char pad_0[0x38]; // 0x0 - 0x38
}; // size - 0x38


class CCSGameModeScript_ConVars /* "server" */
{
public:
   unsigned char pad_0[0x1]; // 0x0 - 0x1
}; // size - 0x1


class CCSGameRules /* "server" */ : public CTeamplayRules /* "server" */
{
public:
   unsigned char pad_C0[0x8]; // 0xC0 - 0xC8
   bool m_bFreezePeriod; // 0xC8 - 0xC9
   bool m_bWarmupPeriod; // 0xC9 - 0xCA
   unsigned char pad_CA[0x2]; // 0xCA - 0xCC
   GameTime_t m_fWarmupPeriodEnd; // 0xCC - 0xD0
   GameTime_t m_fWarmupPeriodStart; // 0xD0 - 0xD4
   bool m_bServerPaused; // 0xD4 - 0xD5
   bool m_bTerroristTimeOutActive; // 0xD5 - 0xD6
   bool m_bCTTimeOutActive; // 0xD6 - 0xD7
   unsigned char pad_D7[0x1]; // 0xD7 - 0xD8
   float m_flTerroristTimeOutRemaining; // 0xD8 - 0xDC
   float m_flCTTimeOutRemaining; // 0xDC - 0xE0
   int32_t m_nTerroristTimeOuts; // 0xE0 - 0xE4
   int32_t m_nCTTimeOuts; // 0xE4 - 0xE8
   bool m_bTechnicalTimeOut; // 0xE8 - 0xE9
   bool m_bMatchWaitingForResume; // 0xE9 - 0xEA
   unsigned char pad_EA[0x2]; // 0xEA - 0xEC
   int32_t m_iRoundTime; // 0xEC - 0xF0
   float m_fMatchStartTime; // 0xF0 - 0xF4
   GameTime_t m_fRoundStartTime; // 0xF4 - 0xF8
   GameTime_t m_flRestartRoundTime; // 0xF8 - 0xFC
   bool m_bGameRestart; // 0xFC - 0xFD
   unsigned char pad_FD[0x3]; // 0xFD - 0x100
   float m_flGameStartTime; // 0x100 - 0x104
   float m_timeUntilNextPhaseStarts; // 0x104 - 0x108
   int32_t m_gamePhase; // 0x108 - 0x10C
   int32_t m_totalRoundsPlayed; // 0x10C - 0x110
   int32_t m_nRoundsPlayedThisPhase; // 0x110 - 0x114
   int32_t m_nOvertimePlaying; // 0x114 - 0x118
   int32_t m_iHostagesRemaining; // 0x118 - 0x11C
   bool m_bAnyHostageReached; // 0x11C - 0x11D
   bool m_bMapHasBombTarget; // 0x11D - 0x11E
   bool m_bMapHasRescueZone; // 0x11E - 0x11F
   bool m_bMapHasBuyZone; // 0x11F - 0x120
   bool m_bIsQueuedMatchmaking; // 0x120 - 0x121
   unsigned char pad_121[0x3]; // 0x121 - 0x124
   int32_t m_nQueuedMatchmakingMode; // 0x124 - 0x128
   bool m_bIsValveDS; // 0x128 - 0x129
   bool m_bLogoMap; // 0x129 - 0x12A
   bool m_bPlayAllStepSoundsOnServer; // 0x12A - 0x12B
   unsigned char pad_12B[0x1]; // 0x12B - 0x12C
   int32_t m_iSpectatorSlotCount; // 0x12C - 0x130
   int32_t m_MatchDevice; // 0x130 - 0x134
   bool m_bHasMatchStarted; // 0x134 - 0x135
   unsigned char pad_135[0x3]; // 0x135 - 0x138
   int32_t m_nNextMapInMapgroup; // 0x138 - 0x13C
   char m_szTournamentEventName[512]; // 0x13C - 0x33C
   char m_szTournamentEventStage[512]; // 0x33C - 0x53C
   char m_szMatchStatTxt[512]; // 0x53C - 0x73C
   char m_szTournamentPredictionsTxt[512]; // 0x73C - 0x93C
   int32_t m_nTournamentPredictionsPct; // 0x93C - 0x940
   GameTime_t m_flCMMItemDropRevealStartTime; // 0x940 - 0x944
   GameTime_t m_flCMMItemDropRevealEndTime; // 0x944 - 0x948
   bool m_bIsDroppingItems; // 0x948 - 0x949
   bool m_bIsQuestEligible; // 0x949 - 0x94A
   bool m_bIsHltvActive; // 0x94A - 0x94B
   unsigned char pad_94B[0x1]; // 0x94B - 0x94C
   uint16 m_arrProhibitedItemIndices[100]; // 0x94C - 0xA14
   uint32 m_arrTournamentActiveCasterAccounts[4]; // 0xA14 - 0xA24
   int32_t m_numBestOfMaps; // 0xA24 - 0xA28
   int32_t m_nHalloweenMaskListSeed; // 0xA28 - 0xA2C
   bool m_bBombDropped; // 0xA2C - 0xA2D
   bool m_bBombPlanted; // 0xA2D - 0xA2E
   unsigned char pad_A2E[0x2]; // 0xA2E - 0xA30
   int32_t m_iRoundWinStatus; // 0xA30 - 0xA34
   int32_t m_eRoundWinReason; // 0xA34 - 0xA38
   bool m_bTCantBuy; // 0xA38 - 0xA39
   bool m_bCTCantBuy; // 0xA39 - 0xA3A
   unsigned char pad_A3A[0x2]; // 0xA3A - 0xA3C
   int32 m_iMatchStats_RoundResults[30]; // 0xA3C - 0xAB4
   int32 m_iMatchStats_PlayersAlive_CT[30]; // 0xAB4 - 0xB2C
   int32 m_iMatchStats_PlayersAlive_T[30]; // 0xB2C - 0xBA4
   float32 m_TeamRespawnWaveTimes[32]; // 0xBA4 - 0xC24
   GameTime_t m_flNextRespawnWave[32]; // 0xC24 - 0xCA4
   int32_t m_nServerQuestID; // 0xCA4 - 0xCA8
   Vector m_vMinimapMins; // 0xCA8 - 0xCB4
   Vector m_vMinimapMaxs; // 0xCB4 - 0xCC0
   float32 m_MinimapVerticalSectionHeights[8]; // 0xCC0 - 0xCE0
   bool m_bSpawnedTerrorHuntHeavy; // 0xCE0 - 0xCE1
   unsigned char pad_CE1[0x3]; // 0xCE1 - 0xCE4
   int32 m_nEndMatchMapGroupVoteTypes[10]; // 0xCE4 - 0xD0C
   int32 m_nEndMatchMapGroupVoteOptions[10]; // 0xD0C - 0xD34
   int32_t m_nEndMatchMapVoteWinner; // 0xD34 - 0xD38
