#pragma once

#include "SDK.hpp"

class IHandleEntity
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class CEntityInstance : public IHandleEntity
{
public:

   CUtlSymbolLarge m_iszPrivateVScripts; // 0x8 - 0x10
   CEntityIdentity* m_pEntity; // 0x10 - 0x18
   unsigned char pad_18[0x10] // 0x18 - 0x28
   CScriptComponent* m_CScriptComponent; // 0x28 - 0x30

}; // size - 0x30


class CBaseEntity : public CEntityInstance
{
public:

   CBodyComponent* m_CBodyComponent; // 0x30 - 0x38
   CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x38 - 0x1D8
   unsigned char pad_1D8[0x40] // 0x1D8 - 0x218
   CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x218 - 0x230
   int32_t m_iCurrentThinkContext; // 0x230 - 0x234
   GameTick_t m_nLastThinkTick; // 0x234 - 0x238
   unsigned char pad_238[0x8] // 0x238 - 0x240
   CBitVec< 64 > m_isSteadyState; // 0x240 - 0x248
   float m_lastNetworkChange; // 0x248 - 0x24C
   unsigned char pad_24C[0xC] // 0x24C - 0x258
   CUtlVector< ResponseContext_t > m_ResponseContexts; // 0x258 - 0x270
   CUtlSymbolLarge m_iszResponseContext; // 0x270 - 0x278
   unsigned char pad_278[0x20] // 0x278 - 0x298
   int32_t m_iHealth; // 0x298 - 0x29C
   int32_t m_iMaxHealth; // 0x29C - 0x2A0
   uint8_t m_lifeState; // 0x2A0 - 0x2A1
   unsigned char pad_2A1[0x3] // 0x2A1 - 0x2A4
   float m_flDamageAccumulator; // 0x2A4 - 0x2A8
   bool m_bTakesDamage; // 0x2A8 - 0x2A9
   unsigned char pad_2A9[0x3] // 0x2A9 - 0x2AC
   TakeDamageFlags_t m_nTakeDamageFlags; // 0x2AC - 0x2B0
   unsigned char pad_2B0[0x1] // 0x2B0 - 0x2B1
   MoveCollide_t m_MoveCollide; // 0x2B1 - 0x2B2
   MoveType_t m_MoveType; // 0x2B2 - 0x2B3
   uint8_t m_nWaterTouch; // 0x2B3 - 0x2B4
   uint8_t m_nSlimeTouch; // 0x2B4 - 0x2B5
   bool m_bRestoreInHierarchy; // 0x2B5 - 0x2B6
   unsigned char pad_2B6[0x2] // 0x2B6 - 0x2B8
   CUtlSymbolLarge m_target; // 0x2B8 - 0x2C0
   float m_flMoveDoneTime; // 0x2C0 - 0x2C4
   CHandle< CBaseFilter > m_hDamageFilter; // 0x2C4 - 0x2C8
   CUtlSymbolLarge m_iszDamageFilterName; // 0x2C8 - 0x2D0
   CUtlStringToken m_nSubclassID; // 0x2D0 - 0x2D4
   unsigned char pad_2D4[0xC] // 0x2D4 - 0x2E0
   float m_flAnimTime; // 0x2E0 - 0x2E4
   float m_flSimulationTime; // 0x2E4 - 0x2E8
   GameTime_t m_flCreateTime; // 0x2E8 - 0x2EC
   bool m_bClientSideRagdoll; // 0x2EC - 0x2ED
   uint8_t m_ubInterpolationFrame; // 0x2ED - 0x2EE
   unsigned char pad_2EE[0x2] // 0x2EE - 0x2F0
   Vector m_vPrevVPhysicsUpdatePos; // 0x2F0 - 0x2FC
   uint8_t m_iTeamNum; // 0x2FC - 0x2FD
   unsigned char pad_2FD[0x3] // 0x2FD - 0x300
   CUtlSymbolLarge m_iGlobalname; // 0x300 - 0x308
   int32_t m_iSentToClients; // 0x308 - 0x30C
   float m_flSpeed; // 0x30C - 0x310
   CUtlString m_sUniqueHammerID; // 0x310 - 0x318
   uint32_t m_spawnflags; // 0x318 - 0x31C
   GameTick_t m_nNextThinkTick; // 0x31C - 0x320
   int32_t m_nSimulationTick; // 0x320 - 0x324
   unsigned char pad_324[0x4] // 0x324 - 0x328
   CEntityIOOutput m_OnKilled; // 0x328 - 0x350
   uint32_t m_fFlags; // 0x350 - 0x354
   Vector m_vecAbsVelocity; // 0x354 - 0x360
   CNetworkVelocityVector m_vecVelocity; // 0x360 - 0x388
   unsigned char pad_388[0x8] // 0x388 - 0x390
   Vector m_vecBaseVelocity; // 0x390 - 0x39C
   int32_t m_nPushEnumCount; // 0x39C - 0x3A0
   CCollisionProperty* m_pCollision; // 0x3A0 - 0x3A8
   CHandle< CBaseEntity > m_hEffectEntity; // 0x3A8 - 0x3AC
   CHandle< CBaseEntity > m_hOwnerEntity; // 0x3AC - 0x3B0
   uint32_t m_fEffects; // 0x3B0 - 0x3B4
   CHandle< CBaseEntity > m_hGroundEntity; // 0x3B4 - 0x3B8
   float m_flFriction; // 0x3B8 - 0x3BC
   float m_flElasticity; // 0x3BC - 0x3C0
   float m_flGravityScale; // 0x3C0 - 0x3C4
   float m_flTimeScale; // 0x3C4 - 0x3C8
   float m_flWaterLevel; // 0x3C8 - 0x3CC
   bool m_bSimulatedEveryTick; // 0x3CC - 0x3CD
   bool m_bAnimatedEveryTick; // 0x3CD - 0x3CE
   uint8_t m_nMinCPULevel; // 0x3CE - 0x3CF
   uint8_t m_nMaxCPULevel; // 0x3CF - 0x3D0
   uint8_t m_nMinGPULevel; // 0x3D0 - 0x3D1
   uint8_t m_nMaxGPULevel; // 0x3D1 - 0x3D2
   bool m_bDisableLowViolence; // 0x3D2 - 0x3D3
   uint8_t m_nWaterType; // 0x3D3 - 0x3D4
   int32_t m_iEFlags; // 0x3D4 - 0x3D8
   CEntityIOOutput m_OnUser1; // 0x3D8 - 0x400
   CEntityIOOutput m_OnUser2; // 0x400 - 0x428
   CEntityIOOutput m_OnUser3; // 0x428 - 0x450
   CEntityIOOutput m_OnUser4; // 0x450 - 0x478
   int32_t m_iInitialTeamNum; // 0x478 - 0x47C
   GameTime_t m_flNavIgnoreUntilTime; // 0x47C - 0x480
   QAngle m_vecAngVelocity; // 0x480 - 0x48C
   bool m_bNetworkQuantizeOriginAndAngles; // 0x48C - 0x48D
   bool m_bLagCompensate; // 0x48D - 0x48E
   unsigned char pad_48E[0x2] // 0x48E - 0x490
   float m_flOverriddenFriction; // 0x490 - 0x494
   CHandle< CBaseEntity > m_pBlocker; // 0x494 - 0x498
   float m_flLocalTime; // 0x498 - 0x49C
   float m_flVPhysicsUpdateLocalTime; // 0x49C - 0x4A0

}; // size - 0x4A0


class CEntityInstance : public IHandleEntity
{
public:

   CUtlSymbolLarge m_iszPrivateVScripts; // 0x8 - 0x10
   CEntityIdentity* m_pEntity; // 0x10 - 0x18
   unsigned char pad_18[0x10] // 0x18 - 0x28
   CScriptComponent* m_CScriptComponent; // 0x28 - 0x30

}; // size - 0x30


class CBaseModelEntity : public CBaseEntity
{
public:

   CRenderComponent* m_CRenderComponent; // 0x4A0 - 0x4A8
   CHitboxComponent m_CHitboxComponent; // 0x4A8 - 0x4D0
   GameTime_t m_flDissolveStartTime; // 0x4D0 - 0x4D4
   unsigned char pad_4D4[0x4] // 0x4D4 - 0x4D8
   CEntityIOOutput m_OnIgnite; // 0x4D8 - 0x500
   RenderMode_t m_nRenderMode; // 0x500 - 0x501
   RenderFx_t m_nRenderFX; // 0x501 - 0x502
   bool m_bAllowFadeInView; // 0x502 - 0x503
   Color m_clrRender; // 0x503 - 0x507
   unsigned char pad_507[0x1] // 0x507 - 0x508
   CUtlVectorEmbeddedNetworkVar< EntityRenderAttribute_t > m_vecRenderAttributes; // 0x508 - 0x558
   CUtlStringToken m_LightGroup; // 0x558 - 0x55C
   bool m_bRenderToCubemaps; // 0x55C - 0x55D
   unsigned char pad_55D[0x3] // 0x55D - 0x560
   CCollisionProperty m_Collision; // 0x560 - 0x610
   CGlowProperty m_Glow; // 0x610 - 0x668
   float m_flGlowBackfaceMult; // 0x668 - 0x66C
   float m_fadeMinDist; // 0x66C - 0x670
   float m_fadeMaxDist; // 0x670 - 0x674
   float m_flFadeScale; // 0x674 - 0x678
   float m_flShadowStrength; // 0x678 - 0x67C
   uint8_t m_nObjectCulling; // 0x67C - 0x67D
   unsigned char pad_67D[0x3] // 0x67D - 0x680
   int32_t m_nAddDecal; // 0x680 - 0x684
   Vector m_vDecalPosition; // 0x684 - 0x690
   Vector m_vDecalForwardAxis; // 0x690 - 0x69C
   float m_flDecalHealBloodRate; // 0x69C - 0x6A0
   float m_flDecalHealHeightRate; // 0x6A0 - 0x6A4
   unsigned char pad_6A4[0x4] // 0x6A4 - 0x6A8
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_ConfigEntitiesToPropagateMaterialDecalsTo; // 0x6A8 - 0x6C0
   CNetworkViewOffsetVector m_vecViewOffset; // 0x6C0 - 0x6E8

}; // size - 0x6F0


class C_BaseEntity : public CEntityInstance
{
public:

   CBodyComponent* m_CBodyComponent; // 0x30 - 0x38
   CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x38 - 0x1D8
   unsigned char pad_1D8[0x120] // 0x1D8 - 0x2F8
   GameTick_t m_nLastThinkTick; // 0x2F8 - 0x2FC
   unsigned char pad_2FC[0x4] // 0x2FC - 0x300
   CGameSceneNode* m_pGameSceneNode; // 0x300 - 0x308
   CRenderComponent* m_pRenderComponent; // 0x308 - 0x310
   CCollisionProperty* m_pCollision; // 0x310 - 0x318
   int32_t m_iMaxHealth; // 0x318 - 0x31C
   int32_t m_iHealth; // 0x31C - 0x320
   uint8_t m_lifeState; // 0x320 - 0x321
   bool m_bTakesDamage; // 0x321 - 0x322
   unsigned char pad_322[0x2] // 0x322 - 0x324
   TakeDamageFlags_t m_nTakeDamageFlags; // 0x324 - 0x328
   uint8_t m_ubInterpolationFrame; // 0x328 - 0x329
   unsigned char pad_329[0x3] // 0x329 - 0x32C
   CHandle< C_BaseEntity > m_hSceneObjectController; // 0x32C - 0x330
   int32_t m_nNoInterpolationTick; // 0x330 - 0x334
   int32_t m_nVisibilityNoInterpolationTick; // 0x334 - 0x338
   float m_flProxyRandomValue; // 0x338 - 0x33C
   int32_t m_iEFlags; // 0x33C - 0x340
   uint8_t m_nWaterType; // 0x340 - 0x341
   bool m_bInterpolateEvenWithNoModel; // 0x341 - 0x342
   bool m_bPredictionEligible; // 0x342 - 0x343
   bool m_bApplyLayerMatchIDToModel; // 0x343 - 0x344
   CUtlStringToken m_tokLayerMatchID; // 0x344 - 0x348
   CUtlStringToken m_nSubclassID; // 0x348 - 0x34C
   unsigned char pad_34C[0xC] // 0x34C - 0x358
   int32_t m_nSimulationTick; // 0x358 - 0x35C
   int32_t m_iCurrentThinkContext; // 0x35C - 0x360
   CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x360 - 0x378
   float m_flAnimTime; // 0x378 - 0x37C
   float m_flSimulationTime; // 0x37C - 0x380
   uint8_t m_nSceneObjectOverrideFlags; // 0x380 - 0x381
   bool m_bHasSuccessfullyInterpolated; // 0x381 - 0x382
   bool m_bHasAddedVarsToInterpolation; // 0x382 - 0x383
   bool m_bRenderEvenWhenNotSuccessfullyInterpolated; // 0x383 - 0x384
   int32 m_nInterpolationLatchDirtyFlags[2]; // 0x384 - 0x38C
   uint16 m_ListEntry[11]; // 0x38C - 0x3A2
   unsigned char pad_3A2[0x2] // 0x3A2 - 0x3A4
   GameTime_t m_flCreateTime; // 0x3A4 - 0x3A8
   float m_flSpeed; // 0x3A8 - 0x3AC
   uint16_t m_EntClientFlags; // 0x3AC - 0x3AE
   bool m_bClientSideRagdoll; // 0x3AE - 0x3AF
   uint8_t m_iTeamNum; // 0x3AF - 0x3B0
   uint32_t m_spawnflags; // 0x3B0 - 0x3B4
   GameTick_t m_nNextThinkTick; // 0x3B4 - 0x3B8
   uint32_t m_fFlags; // 0x3B8 - 0x3BC
   Vector m_vecAbsVelocity; // 0x3BC - 0x3C8
   CNetworkVelocityVector m_vecVelocity; // 0x3C8 - 0x3F0
   unsigned char pad_3F0[0x8] // 0x3F0 - 0x3F8
   Vector m_vecBaseVelocity; // 0x3F8 - 0x404
   CHandle< C_BaseEntity > m_hEffectEntity; // 0x404 - 0x408
   CHandle< C_BaseEntity > m_hOwnerEntity; // 0x408 - 0x40C
   MoveCollide_t m_MoveCollide; // 0x40C - 0x40D
   MoveType_t m_MoveType; // 0x40D - 0x40E
   unsigned char pad_40E[0x2] // 0x40E - 0x410
   float m_flWaterLevel; // 0x410 - 0x414
   uint32_t m_fEffects; // 0x414 - 0x418
   CHandle< C_BaseEntity > m_hGroundEntity; // 0x418 - 0x41C
   float m_flFriction; // 0x41C - 0x420
   float m_flElasticity; // 0x420 - 0x424
   float m_flGravityScale; // 0x424 - 0x428
   float m_flTimeScale; // 0x428 - 0x42C
   bool m_bSimulatedEveryTick; // 0x42C - 0x42D
   bool m_bAnimatedEveryTick; // 0x42D - 0x42E
   uint8_t m_nMinCPULevel; // 0x42E - 0x42F
   uint8_t m_nMaxCPULevel; // 0x42F - 0x430
   uint8_t m_nMinGPULevel; // 0x430 - 0x431
   uint8_t m_nMaxGPULevel; // 0x431 - 0x432
   unsigned char pad_432[0x2] // 0x432 - 0x434
   GameTime_t m_flNavIgnoreUntilTime; // 0x434 - 0x438
   uint16_t m_hThink; // 0x438 - 0x43A
   unsigned char pad_43A[0xE] // 0x43A - 0x448
   uint8_t m_fBBoxVisFlags; // 0x448 - 0x449
   bool m_bPredictable; // 0x449 - 0x44A
   bool m_bRenderWithViewModels; // 0x44A - 0x44B
   unsigned char pad_44B[0x1] // 0x44B - 0x44C
   CSplitScreenSlot m_nSplitUserPlayerPredictionSlot; // 0x44C - 0x450
   int32_t m_nFirstPredictableCommand; // 0x450 - 0x454
   int32_t m_nLastPredictableCommand; // 0x454 - 0x458
   CHandle< C_BaseEntity > m_hOldMoveParent; // 0x458 - 0x45C
   unsigned char pad_45C[0x4] // 0x45C - 0x460
   CParticleProperty m_Particles; // 0x460 - 0x488
   CUtlVector< float32 > m_vecPredictedScriptFloats; // 0x488 - 0x4A0
   CUtlVector< int32 > m_vecPredictedScriptFloatIDs; // 0x4A0 - 0x4B8
   unsigned char pad_4B8[0x18] // 0x4B8 - 0x4D0
   int32_t m_nNextScriptVarRecordID; // 0x4D0 - 0x4D4
   unsigned char pad_4D4[0xC] // 0x4D4 - 0x4E0
   QAngle m_vecAngVelocity; // 0x4E0 - 0x4EC
   int32_t m_DataChangeEventRef; // 0x4EC - 0x4F0
   CUtlVector< CEntityHandle > m_dependencies; // 0x4F0 - 0x508
   int32_t m_nCreationTick; // 0x508 - 0x50C
   unsigned char pad_50C[0x15] // 0x50C - 0x521
   bool m_bAnimTimeChanged; // 0x521 - 0x522
   bool m_bSimulationTimeChanged; // 0x522 - 0x523
   unsigned char pad_523[0xD] // 0x523 - 0x530
   CUtlString m_sUniqueHammerID; // 0x530 - 0x538

}; // size - 0x538


class CParticleFunction
{
public:

   CParticleCollectionFloatInput m_flOpStrength; // 0x8 - 0x140
   ParticleEndcapMode_t m_nOpEndCapState; // 0x140 - 0x144
   float m_flOpStartFadeInTime; // 0x144 - 0x148
   float m_flOpEndFadeInTime; // 0x148 - 0x14C
   float m_flOpStartFadeOutTime; // 0x14C - 0x150
   float m_flOpEndFadeOutTime; // 0x150 - 0x154
   float m_flOpFadeOscillatePeriod; // 0x154 - 0x158
   bool m_bNormalizeToStopTime; // 0x158 - 0x159
   unsigned char pad_159[0x3] // 0x159 - 0x15C
   float m_flOpTimeOffsetMin; // 0x15C - 0x160
   float m_flOpTimeOffsetMax; // 0x160 - 0x164
   int32_t m_nOpTimeOffsetSeed; // 0x164 - 0x168
   int32_t m_nOpTimeScaleSeed; // 0x168 - 0x16C
   float m_flOpTimeScaleMin; // 0x16C - 0x170
   float m_flOpTimeScaleMax; // 0x170 - 0x174
   unsigned char pad_174[0x1] // 0x174 - 0x175
   bool m_bDisableOperator; // 0x175 - 0x176
   unsigned char pad_176[0x2] // 0x176 - 0x178
   CUtlString m_Notes; // 0x178 - 0x180

}; // size - 0x1F0


class C_BaseModelEntity : public C_BaseEntity
{
public:

   CRenderComponent* m_CRenderComponent; // 0x588 - 0x590
   CHitboxComponent m_CHitboxComponent; // 0x590 - 0x5B8
   unsigned char pad_5B8[0x20] // 0x5B8 - 0x5D8
   bool m_bInitModelEffects; // 0x5D8 - 0x5D9
   bool m_bIsStaticProp; // 0x5D9 - 0x5DA
   unsigned char pad_5DA[0x2] // 0x5DA - 0x5DC
   int32_t m_nLastAddDecal; // 0x5DC - 0x5E0
   int32_t m_nDecalsAdded; // 0x5E0 - 0x5E4
   int32_t m_iOldHealth; // 0x5E4 - 0x5E8
   RenderMode_t m_nRenderMode; // 0x5E8 - 0x5E9
   RenderFx_t m_nRenderFX; // 0x5E9 - 0x5EA
   bool m_bAllowFadeInView; // 0x5EA - 0x5EB
   Color m_clrRender; // 0x5EB - 0x5EF
   unsigned char pad_5EF[0x1] // 0x5EF - 0x5F0
   C_UtlVectorEmbeddedNetworkVar< EntityRenderAttribute_t > m_vecRenderAttributes; // 0x5F0 - 0x640
   unsigned char pad_640[0x18] // 0x640 - 0x658
   CUtlStringToken m_LightGroup; // 0x658 - 0x65C
   bool m_bRenderToCubemaps; // 0x65C - 0x65D
   unsigned char pad_65D[0x3] // 0x65D - 0x660
   CCollisionProperty m_Collision; // 0x660 - 0x710
   CGlowProperty m_Glow; // 0x710 - 0x768
   float m_flGlowBackfaceMult; // 0x768 - 0x76C
   float m_fadeMinDist; // 0x76C - 0x770
   float m_fadeMaxDist; // 0x770 - 0x774
   float m_flFadeScale; // 0x774 - 0x778
   float m_flShadowStrength; // 0x778 - 0x77C
   uint8_t m_nObjectCulling; // 0x77C - 0x77D
   unsigned char pad_77D[0x3] // 0x77D - 0x780
   int32_t m_nAddDecal; // 0x780 - 0x784
   Vector m_vDecalPosition; // 0x784 - 0x790
   Vector m_vDecalForwardAxis; // 0x790 - 0x79C
   float m_flDecalHealBloodRate; // 0x79C - 0x7A0
   float m_flDecalHealHeightRate; // 0x7A0 - 0x7A4
   unsigned char pad_7A4[0x4] // 0x7A4 - 0x7A8
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_ConfigEntitiesToPropagateMaterialDecalsTo; // 0x7A8 - 0x7C0
   CNetworkViewOffsetVector m_vecViewOffset; // 0x7C0 - 0x7E8
   unsigned char pad_7E8[0x8] // 0x7E8 - 0x7F0
   CClientAlphaProperty* m_pClientAlphaProperty; // 0x7F0 - 0x7F8
   Color m_ClientOverrideTint; // 0x7F8 - 0x7FC
   bool m_bUseClientOverrideTint; // 0x7FC - 0x7FD

}; // size - 0x838


class CBaseAnimGraph : public CBaseModelEntity
{
public:

   PhysicsRagdollPose_t* m_pRagdollPose; // 0x700 - 0x708
   bool m_bClientRagdoll; // 0x708 - 0x709
   unsigned char pad_709[0x3] // 0x709 - 0x70C
   Vector m_vecForce; // 0x70C - 0x718
   int32_t m_nForceBone; // 0x718 - 0x71C
   bool m_bShouldAnimateDuringGameplayPause; // 0x71C - 0x71D
   bool m_bAnimGraphUpdateEnabled; // 0x71D - 0x71E
   bool m_bInitiallyPopulateInterpHistory; // 0x71E - 0x71F
   unsigned char pad_71F[0x1] // 0x71F - 0x720
   float m_flMaxSlopeDistance; // 0x720 - 0x724
   Vector m_vLastSlopeCheckPos; // 0x724 - 0x730
   IChoreoServices* m_pChoreoServices; // 0x730 - 0x738
   bool m_bAnimGraphDirty; // 0x738 - 0x739

}; // size - 0x820


class CBaseAnimGraph : public C_BaseModelEntity
{
public:

   PhysicsRagdollPose_t* m_pRagdollPose; // 0x848 - 0x850
   bool m_bClientRagdoll; // 0x850 - 0x851
   unsigned char pad_851[0x3] // 0x851 - 0x854
   Vector m_vecForce; // 0x854 - 0x860
   int32_t m_nForceBone; // 0x860 - 0x864
   bool m_bShouldAnimateDuringGameplayPause; // 0x864 - 0x865
   bool m_bAnimGraphUpdateEnabled; // 0x865 - 0x866
   bool m_bInitiallyPopulateInterpHistory; // 0x866 - 0x867
   unsigned char pad_867[0x1] // 0x867 - 0x868
   float m_flMaxSlopeDistance; // 0x868 - 0x86C
   Vector m_vLastSlopeCheckPos; // 0x86C - 0x878
   bool m_bHasAnimatedMaterialAttributes; // 0x878 - 0x879
   unsigned char pad_879[0x7] // 0x879 - 0x880
   CBaseAnimGraph* m_pClientsideRagdoll; // 0x880 - 0x888
   bool m_builtRagdoll; // 0x888 - 0x889
   unsigned char pad_889[0xF] // 0x889 - 0x898
   bool m_bSuppressAnimEventSounds; // 0x898 - 0x899

}; // size - 0x998


class CParticleFunctionOperator : public CParticleFunction
{
public:


}; // size - 0x1F0


class C_BaseFlex : public CBaseAnimGraph
{
public:

   class Emphasized_Phoneme
   {
   public:

      CUtlString m_sClassName; // 0x0 - 0x8
      unsigned char pad_8[0x10] // 0x8 - 0x18
      float m_flAmount; // 0x18 - 0x1C
      bool m_bRequired; // 0x1C - 0x1D
      bool m_bBasechecked; // 0x1D - 0x1E
      bool m_bValid; // 0x1E - 0x1F

   }; // size - 0x20

   C_NetworkUtlVectorBase< float32 > m_flexWeight; // 0x9A0 - 0x9B8
   bool m_blinktoggle; // 0x9B8 - 0x9B9
   unsigned char pad_9B9[0x7] // 0x9B9 - 0x9C0
   Vector m_vLookTargetPosition; // 0x9C0 - 0x9CC
   unsigned char pad_9CC[0x64] // 0x9CC - 0xA30
   int32_t m_nLastFlexUpdateFrameCount; // 0xA30 - 0xA34
   Vector m_CachedViewTarget; // 0xA34 - 0xA40
   uint32_t m_nNextSceneEventId; // 0xA40 - 0xA44
   int32_t m_iBlink; // 0xA44 - 0xA48
   float m_blinktime; // 0xA48 - 0xA4C
   bool m_prevblinktoggle; // 0xA4C - 0xA4D
   unsigned char pad_A4D[0x3] // 0xA4D - 0xA50
   int32_t m_iJawOpen; // 0xA50 - 0xA54
   float m_flJawOpenAmount; // 0xA54 - 0xA58
   float m_flBlinkAmount; // 0xA58 - 0xA5C
   AttachmentHandle_t m_iMouthAttachment; // 0xA5C - 0xA5D
   AttachmentHandle_t m_iEyeAttachment; // 0xA5D - 0xA5E
   bool m_bResetFlexWeightsOnModelChange; // 0xA5E - 0xA5F
   unsigned char pad_A5F[0x19] // 0xA5F - 0xA78
   int32_t m_nEyeOcclusionRendererBone; // 0xA78 - 0xA7C
   matrix3x4_t m_mEyeOcclusionRendererCameraToBoneTransform; // 0xA7C - 0xAAC
   Vector m_vEyeOcclusionRendererHalfExtent; // 0xAAC - 0xAB8
   unsigned char pad_AB8[0x10] // 0xAB8 - 0xAC8
   C_BaseFlex::Emphasized_Phoneme m_PhonemeClasses[3]; // 0xAC8 - 0xB28

}; // size - 0xB28


class CBaseFlex : public CBaseAnimGraph
{
public:

   CNetworkUtlVectorBase< float32 > m_flexWeight; // 0x820 - 0x838
   Vector m_vLookTargetPosition; // 0x838 - 0x844
   bool m_blinktoggle; // 0x844 - 0x845
   unsigned char pad_845[0x53] // 0x845 - 0x898
   GameTime_t m_flAllowResponsesEndTime; // 0x898 - 0x89C
   GameTime_t m_flLastFlexAnimationTime; // 0x89C - 0x8A0
   uint32_t m_nNextSceneEventId; // 0x8A0 - 0x8A4
   bool m_bUpdateLayerPriorities; // 0x8A4 - 0x8A5

}; // size - 0x8B0


class CServerOnlyEntity : public CBaseEntity
{
public:


}; // size - 0x4A0


class C_EconEntity : public C_BaseFlex
{
public:

   class AttachedModelData_t
   {
   public:

      int32_t m_iModelDisplayFlags; // 0x0 - 0x4

   }; // size - 0x4

   float m_flFlexDelayTime; // 0xB38 - 0xB3C
   unsigned char pad_B3C[0x4] // 0xB3C - 0xB40
   float32* m_flFlexDelayedWeight; // 0xB40 - 0xB48
   bool m_bAttributesInitialized; // 0xB48 - 0xB49
   unsigned char pad_B49[0x7] // 0xB49 - 0xB50
   C_AttributeContainer m_AttributeManager; // 0xB50 - 0xFF8
   uint32_t m_OriginalOwnerXuidLow; // 0xFF8 - 0xFFC
   uint32_t m_OriginalOwnerXuidHigh; // 0xFFC - 0x1000
   int32_t m_nFallbackPaintKit; // 0x1000 - 0x1004
   int32_t m_nFallbackSeed; // 0x1004 - 0x1008
   float m_flFallbackWear; // 0x1008 - 0x100C
   int32_t m_nFallbackStatTrak; // 0x100C - 0x1010
   bool m_bClientside; // 0x1010 - 0x1011
   bool m_bParticleSystemsCreated; // 0x1011 - 0x1012
   unsigned char pad_1012[0x6] // 0x1012 - 0x1018
   CUtlVector< int32 > m_vecAttachedParticles; // 0x1018 - 0x1030
   CHandle< CBaseAnimGraph > m_hViewmodelAttachment; // 0x1030 - 0x1034
   int32_t m_iOldTeam; // 0x1034 - 0x1038
   bool m_bAttachmentDirty; // 0x1038 - 0x1039
   unsigned char pad_1039[0x3] // 0x1039 - 0x103C
   int32_t m_nUnloadedModelIndex; // 0x103C - 0x1040
   int32_t m_iNumOwnerValidationRetries; // 0x1040 - 0x1044
   unsigned char pad_1044[0xC] // 0x1044 - 0x1050
   CHandle< C_BaseEntity > m_hOldProvidee; // 0x1050 - 0x1054
   unsigned char pad_1054[0x4] // 0x1054 - 0x1058
   CUtlVector< C_EconEntity::AttachedModelData_t > m_vecAttachedModels; // 0x1058 - 0x1070

}; // size - 0x1070


class CEconEntity : public CBaseFlex
{
public:

   CAttributeContainer m_AttributeManager; // 0x8C0 - 0xB88
   uint32_t m_OriginalOwnerXuidLow; // 0xB88 - 0xB8C
   uint32_t m_OriginalOwnerXuidHigh; // 0xB8C - 0xB90
   int32_t m_nFallbackPaintKit; // 0xB90 - 0xB94
   int32_t m_nFallbackSeed; // 0xB94 - 0xB98
   float m_flFallbackWear; // 0xB98 - 0xB9C
   int32_t m_nFallbackStatTrak; // 0xB9C - 0xBA0
   CHandle< CBaseEntity > m_hOldProvidee; // 0xBA0 - 0xBA4
   int32_t m_iOldOwnerClass; // 0xBA4 - 0xBA8

}; // size - 0xBA8


class CParticleFunctionInitializer : public CParticleFunction
{
public:

   int32_t m_nAssociatedEmitterIndex; // 0x1E8 - 0x1EC

}; // size - 0x1F0


class CBaseProp : public CBaseAnimGraph
{
public:

   bool m_bModelOverrodeBlockLOS; // 0x820 - 0x821
   unsigned char pad_821[0x3] // 0x821 - 0x824
   int32_t m_iShapeType; // 0x824 - 0x828
   bool m_bConformToCollisionBounds; // 0x828 - 0x829
   unsigned char pad_829[0x3] // 0x829 - 0x82C
   matrix3x4_t m_mPreferredCatchTransform; // 0x82C - 0x85C

}; // size - 0x860


class CBaseToggle : public CBaseModelEntity
{
public:

   TOGGLE_STATE m_toggle_state; // 0x6F0 - 0x6F4
   float m_flMoveDistance; // 0x6F4 - 0x6F8
   float m_flWait; // 0x6F8 - 0x6FC
   float m_flLip; // 0x6FC - 0x700
   bool m_bAlwaysFireBlockedOutputs; // 0x700 - 0x701
   unsigned char pad_701[0x3] // 0x701 - 0x704
   Vector m_vecPosition1; // 0x704 - 0x710
   Vector m_vecPosition2; // 0x710 - 0x71C
   QAngle m_vecMoveAng; // 0x71C - 0x728
   QAngle m_vecAngle1; // 0x728 - 0x734
   QAngle m_vecAngle2; // 0x734 - 0x740
   float m_flHeight; // 0x740 - 0x744
   CHandle< CBaseEntity > m_hActivator; // 0x744 - 0x748
   Vector m_vecFinalDest; // 0x748 - 0x754
   QAngle m_vecFinalAngle; // 0x754 - 0x760
   int32_t m_movementType; // 0x760 - 0x764
   unsigned char pad_764[0x4] // 0x764 - 0x768
   CUtlSymbolLarge m_sMaster; // 0x768 - 0x770

}; // size - 0x770


class CBasePlayerWeapon : public CEconEntity
{
public:

   WeaponState_t m_iState; // 0xBA8 - 0xBAC
   bool m_bRemoveable; // 0xBAC - 0xBAD
   unsigned char pad_BAD[0x3] // 0xBAD - 0xBB0
   GameTick_t m_nNextPrimaryAttackTick; // 0xBB0 - 0xBB4
   float m_flNextPrimaryAttackTickRatio; // 0xBB4 - 0xBB8
   GameTick_t m_nNextSecondaryAttackTick; // 0xBB8 - 0xBBC
   float m_flNextSecondaryAttackTickRatio; // 0xBBC - 0xBC0
   int32_t m_iClip1; // 0xBC0 - 0xBC4
   int32_t m_iClip2; // 0xBC4 - 0xBC8
   int32 m_pReserveAmmo[2]; // 0xBC8 - 0xBD0
   CEntityIOOutput m_OnPlayerUse; // 0xBD0 - 0xBF8

}; // size - 0xBF8


class C_BasePlayerWeapon : public C_EconEntity
{
public:

   WeaponState_t m_iState; // 0x1070 - 0x1074
   WeaponState_t m_iOldState; // 0x1074 - 0x1078
   bool m_bRemoveable; // 0x1078 - 0x1079
   unsigned char pad_1079[0x3] // 0x1079 - 0x107C
   GameTick_t m_nNextPrimaryAttackTick; // 0x107C - 0x1080
   float m_flNextPrimaryAttackTickRatio; // 0x1080 - 0x1084
   GameTick_t m_nNextSecondaryAttackTick; // 0x1084 - 0x1088
   float m_flNextSecondaryAttackTickRatio; // 0x1088 - 0x108C
   int32_t m_iClip1; // 0x108C - 0x1090
   int32_t m_iClip2; // 0x1090 - 0x1094
   int32 m_pReserveAmmo[2]; // 0x1094 - 0x109C

}; // size - 0x10A0


class CBreakableProp : public CBaseProp
{
public:

   CEntityIOOutput m_OnBreak; // 0x870 - 0x898
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0x898 - 0x8C0
   CEntityIOOutput m_OnTakeDamage; // 0x8C0 - 0x8E8
   float m_impactEnergyScale; // 0x8E8 - 0x8EC
   int32_t m_iMinHealthDmg; // 0x8EC - 0x8F0
   QAngle m_preferredCarryAngles; // 0x8F0 - 0x8FC
   float m_flPressureDelay; // 0x8FC - 0x900
   CHandle< CBaseEntity > m_hBreaker; // 0x900 - 0x904
   PerformanceMode_t m_PerformanceMode; // 0x904 - 0x908
   float m_flDmgModBullet; // 0x908 - 0x90C
   float m_flDmgModClub; // 0x90C - 0x910
   float m_flDmgModExplosive; // 0x910 - 0x914
   float m_flDmgModFire; // 0x914 - 0x918
   CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0x918 - 0x920
   CUtlSymbolLarge m_iszBasePropData; // 0x920 - 0x928
   int32_t m_iInteractions; // 0x928 - 0x92C
   GameTime_t m_flPreventDamageBeforeTime; // 0x92C - 0x930
   bool m_bHasBreakPiecesOrCommands; // 0x930 - 0x931
   unsigned char pad_931[0x3] // 0x931 - 0x934
   float m_explodeDamage; // 0x934 - 0x938
   float m_explodeRadius; // 0x938 - 0x93C
   unsigned char pad_93C[0x4] // 0x93C - 0x940
   float m_explosionDelay; // 0x940 - 0x944
   unsigned char pad_944[0x4] // 0x944 - 0x948
   CUtlSymbolLarge m_explosionBuildupSound; // 0x948 - 0x950
   CUtlSymbolLarge m_explosionCustomEffect; // 0x950 - 0x958
   CUtlSymbolLarge m_explosionCustomSound; // 0x958 - 0x960
   CUtlSymbolLarge m_explosionModifier; // 0x960 - 0x968
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x968 - 0x96C
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x96C - 0x970
   bool m_bOriginalBlockLOS; // 0x970 - 0x971
   unsigned char pad_971[0x3] // 0x971 - 0x974
   float m_flDefaultFadeScale; // 0x974 - 0x978
   CHandle< CBaseEntity > m_hLastAttacker; // 0x978 - 0x97C
   CHandle< CBaseEntity > m_hFlareEnt; // 0x97C - 0x980
   bool m_bUsePuntSound; // 0x980 - 0x981
   unsigned char pad_981[0x7] // 0x981 - 0x988
   CUtlSymbolLarge m_iszPuntSound; // 0x988 - 0x990
   bool m_noGhostCollision; // 0x990 - 0x991

}; // size - 0x998


class CPointEntity : public CBaseEntity
{
public:


}; // size - 0x4A0


class CLogicalEntity : public CServerOnlyEntity
{
public:


}; // size - 0x4A0


class CWeaponCSBase : public CBasePlayerWeapon
{
public:

   float m_flFireSequenceStartTime; // 0xC20 - 0xC24
   int32_t m_nFireSequenceStartTimeChange; // 0xC24 - 0xC28
   int32_t m_nFireSequenceStartTimeAck; // 0xC28 - 0xC2C
   bool m_bPlayerFireEventIsPrimary; // 0xC2C - 0xC2D
   unsigned char pad_C2D[0x3] // 0xC2D - 0xC30
   HSequence m_seqIdle; // 0xC30 - 0xC34
   HSequence m_seqFirePrimary; // 0xC34 - 0xC38
   HSequence m_seqFireSecondary; // 0xC38 - 0xC3C
   unsigned char pad_C3C[0xC] // 0xC3C - 0xC48
   bool m_bPlayerAmmoStockOnPickup; // 0xC48 - 0xC49
   bool m_bRequireUseToTouch; // 0xC49 - 0xC4A
   unsigned char pad_C4A[0x2] // 0xC4A - 0xC4C
   GameTime_t m_flLastTimeInAir; // 0xC4C - 0xC50
   GameTime_t m_flLastDeployTime; // 0xC50 - 0xC54
   uint32_t m_nViewModelIndex; // 0xC54 - 0xC58
   bool m_bReloadsWithClips; // 0xC58 - 0xC59
   unsigned char pad_C59[0x3] // 0xC59 - 0xC5C
   GameTime_t m_flTimeWeaponIdle; // 0xC5C - 0xC60
   bool m_bFireOnEmpty; // 0xC60 - 0xC61
   unsigned char pad_C61[0x7] // 0xC61 - 0xC68
   CEntityIOOutput m_OnPlayerPickup; // 0xC68 - 0xC90
   CSWeaponMode m_weaponMode; // 0xC90 - 0xC94
   float m_flTurningInaccuracyDelta; // 0xC94 - 0xC98
   Vector m_vecTurningInaccuracyEyeDirLast; // 0xC98 - 0xCA4
   float m_flTurningInaccuracy; // 0xCA4 - 0xCA8
   float m_fAccuracyPenalty; // 0xCA8 - 0xCAC
   GameTime_t m_flLastAccuracyUpdateTime; // 0xCAC - 0xCB0
   float m_fAccuracySmoothedForZoom; // 0xCB0 - 0xCB4
   GameTime_t m_fScopeZoomEndTime; // 0xCB4 - 0xCB8
   int32_t m_iRecoilIndex; // 0xCB8 - 0xCBC
   float m_flRecoilIndex; // 0xCBC - 0xCC0
   bool m_bBurstMode; // 0xCC0 - 0xCC1
   unsigned char pad_CC1[0x3] // 0xCC1 - 0xCC4
   GameTime_t m_flPostponeFireReadyTime; // 0xCC4 - 0xCC8
   bool m_bInReload; // 0xCC8 - 0xCC9
   bool m_bReloadVisuallyComplete; // 0xCC9 - 0xCCA
   unsigned char pad_CCA[0x2] // 0xCCA - 0xCCC
   GameTime_t m_flDroppedAtTime; // 0xCCC - 0xCD0
   bool m_bIsHauledBack; // 0xCD0 - 0xCD1
   bool m_bSilencerOn; // 0xCD1 - 0xCD2
   unsigned char pad_CD2[0x2] // 0xCD2 - 0xCD4
   GameTime_t m_flTimeSilencerSwitchComplete; // 0xCD4 - 0xCD8
   int32_t m_iOriginalTeamNumber; // 0xCD8 - 0xCDC
   float m_flNextAttackRenderTimeOffset; // 0xCDC - 0xCE0
   unsigned char pad_CE0[0x8] // 0xCE0 - 0xCE8
   bool m_bCanBePickedUp; // 0xCE8 - 0xCE9
   bool m_bUseCanOverrideNextOwnerTouchTime; // 0xCE9 - 0xCEA
   unsigned char pad_CEA[0x2] // 0xCEA - 0xCEC
   GameTime_t m_nextOwnerTouchTime; // 0xCEC - 0xCF0
   GameTime_t m_nextPrevOwnerTouchTime; // 0xCF0 - 0xCF4
   CHandle< CCSPlayerPawnBase > m_hPrevOwner; // 0xCF4 - 0xCF8
   unsigned char pad_CF8[0x1C] // 0xCF8 - 0xD14
   bool m_donated; // 0xD14 - 0xD15
   unsigned char pad_D15[0x3] // 0xD15 - 0xD18
   GameTime_t m_fLastShotTime; // 0xD18 - 0xD1C
   bool m_bWasOwnedByCT; // 0xD1C - 0xD1D
   bool m_bWasOwnedByTerrorist; // 0xD1D - 0xD1E
   bool m_bFiredOutOfAmmoEvent; // 0xD1E - 0xD1F
   unsigned char pad_D1F[0x1] // 0xD1F - 0xD20
   int32_t m_numRemoveUnownedWeaponThink; // 0xD20 - 0xD24
   unsigned char pad_D24[0x4] // 0xD24 - 0xD28
   CIronSightController m_IronSightController; // 0xD28 - 0xD40
   int32_t m_iIronSightMode; // 0xD40 - 0xD44
   GameTime_t m_flLastLOSTraceFailureTime; // 0xD44 - 0xD48
   int32_t m_iNumEmptyAttacks; // 0xD48 - 0xD4C

}; // size - 0xD50


class C_WeaponCSBase : public C_BasePlayerWeapon
{
public:

   float m_flFireSequenceStartTime; // 0x10D8 - 0x10DC
   int32_t m_nFireSequenceStartTimeChange; // 0x10DC - 0x10E0
   int32_t m_nFireSequenceStartTimeAck; // 0x10E0 - 0x10E4
   bool m_bPlayerFireEventIsPrimary; // 0x10E4 - 0x10E5
   unsigned char pad_10E5[0x3] // 0x10E5 - 0x10E8
   HSequence m_seqIdle; // 0x10E8 - 0x10EC
   HSequence m_seqFirePrimary; // 0x10EC - 0x10F0
   HSequence m_seqFireSecondary; // 0x10F0 - 0x10F4
   unsigned char pad_10F4[0x14] // 0x10F4 - 0x1108
   float m_flCrosshairDistance; // 0x1108 - 0x110C
   int32_t m_iAmmoLastCheck; // 0x110C - 0x1110
   int32_t m_iAlpha; // 0x1110 - 0x1114
   int32_t m_iScopeTextureID; // 0x1114 - 0x1118
   int32_t m_iCrosshairTextureID; // 0x1118 - 0x111C
   float m_flGunAccuracyPosition; // 0x111C - 0x1120
   uint32_t m_nViewModelIndex; // 0x1120 - 0x1124
   bool m_bReloadsWithClips; // 0x1124 - 0x1125
   unsigned char pad_1125[0x3] // 0x1125 - 0x1128
   GameTime_t m_flTimeWeaponIdle; // 0x1128 - 0x112C
   bool m_bFireOnEmpty; // 0x112C - 0x112D
   unsigned char pad_112D[0x3] // 0x112D - 0x1130
   CEntityIOOutput m_OnPlayerPickup; // 0x1130 - 0x1158
   CSWeaponMode m_weaponMode; // 0x1158 - 0x115C
   float m_flTurningInaccuracyDelta; // 0x115C - 0x1160
   Vector m_vecTurningInaccuracyEyeDirLast; // 0x1160 - 0x116C
   float m_flTurningInaccuracy; // 0x116C - 0x1170
   float m_fAccuracyPenalty; // 0x1170 - 0x1174
   GameTime_t m_flLastAccuracyUpdateTime; // 0x1174 - 0x1178
   float m_fAccuracySmoothedForZoom; // 0x1178 - 0x117C
   GameTime_t m_fScopeZoomEndTime; // 0x117C - 0x1180
   int32_t m_iRecoilIndex; // 0x1180 - 0x1184
   float m_flRecoilIndex; // 0x1184 - 0x1188
   bool m_bBurstMode; // 0x1188 - 0x1189
   unsigned char pad_1189[0x3] // 0x1189 - 0x118C
   GameTime_t m_flPostponeFireReadyTime; // 0x118C - 0x1190
   bool m_bInReload; // 0x1190 - 0x1191
   bool m_bReloadVisuallyComplete; // 0x1191 - 0x1192
   unsigned char pad_1192[0x2] // 0x1192 - 0x1194
   GameTime_t m_flDroppedAtTime; // 0x1194 - 0x1198
   bool m_bIsHauledBack; // 0x1198 - 0x1199
   bool m_bSilencerOn; // 0x1199 - 0x119A
   unsigned char pad_119A[0x2] // 0x119A - 0x119C
   GameTime_t m_flTimeSilencerSwitchComplete; // 0x119C - 0x11A0
   int32_t m_iOriginalTeamNumber; // 0x11A0 - 0x11A4
   float m_flNextAttackRenderTimeOffset; // 0x11A4 - 0x11A8
   unsigned char pad_11A8[0x88] // 0x11A8 - 0x1230
   bool m_bVisualsDataSet; // 0x1230 - 0x1231
   bool m_bOldFirstPersonSpectatedState; // 0x1231 - 0x1232
   unsigned char pad_1232[0x2] // 0x1232 - 0x1234
   CHandle< C_BaseEntity > m_hOurPing; // 0x1234 - 0x1238
   CEntityIndex m_nOurPingIndex; // 0x1238 - 0x123C
   Vector m_vecOurPingPos; // 0x123C - 0x1248
   bool m_bGlowForPing; // 0x1248 - 0x1249
   bool m_bUIWeapon; // 0x1249 - 0x124A
   unsigned char pad_124A[0xE] // 0x124A - 0x1258
   CHandle< C_CSPlayerPawnBase > m_hPrevOwner; // 0x1258 - 0x125C
   unsigned char pad_125C[0x20] // 0x125C - 0x127C
   bool m_donated; // 0x127C - 0x127D
   unsigned char pad_127D[0x3] // 0x127D - 0x1280
   GameTime_t m_fLastShotTime; // 0x1280 - 0x1284
   bool m_bWasOwnedByCT; // 0x1284 - 0x1285
   bool m_bWasOwnedByTerrorist; // 0x1285 - 0x1286
   unsigned char pad_1286[0x2] // 0x1286 - 0x1288
   float m_gunHeat; // 0x1288 - 0x128C
   uint32_t m_smokeAttachments; // 0x128C - 0x1290
   GameTime_t m_lastSmokeTime; // 0x1290 - 0x1294
   float m_flLastClientFireBulletTime; // 0x1294 - 0x1298
   unsigned char pad_1298[0x58] // 0x1298 - 0x12F0
   C_IronSightController m_IronSightController; // 0x12F0 - 0x13A0
   int32_t m_iIronSightMode; // 0x13A0 - 0x13A4
   unsigned char pad_13A4[0xC] // 0x13A4 - 0x13B0
   GameTime_t m_flLastLOSTraceFailureTime; // 0x13B0 - 0x13B4
   int32_t m_iNumEmptyAttacks; // 0x13B4 - 0x13B8

}; // size - 0x13D0


class CAnimUpdateNodeBase
{
public:

   CAnimNodePath m_nodePath; // 0x18 - 0x48
   CUtlString m_name; // 0x48 - 0x50
   AnimNodeNetworkMode m_networkMode; // 0x50 - 0x54

}; // size - 0x58


class CPlayerPawnComponent
{
public:

   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30

}; // size - 0x40


class CAnimNodeBase
{
public:

   CUtlString m_sName; // 0x20 - 0x28
   Vector2D m_vecPosition; // 0x28 - 0x30
   AnimNodeID m_nNodeID; // 0x30 - 0x34
   AnimNodeNetworkMode m_networkMode; // 0x34 - 0x38

}; // size - 0x38


class CPhysicsProp : public CBreakableProp
{
public:

   CEntityIOOutput m_MotionEnabled; // 0x9A0 - 0x9C8
   CEntityIOOutput m_OnAwakened; // 0x9C8 - 0x9F0
   CEntityIOOutput m_OnAwake; // 0x9F0 - 0xA18
   CEntityIOOutput m_OnAsleep; // 0xA18 - 0xA40
   CEntityIOOutput m_OnPlayerUse; // 0xA40 - 0xA68
   CEntityIOOutput m_OnPlayerPickup; // 0xA68 - 0xA90
   CEntityIOOutput m_OnOutOfWorld; // 0xA90 - 0xAB8
   float m_massScale; // 0xAB8 - 0xABC
   float m_inertiaScale; // 0xABC - 0xAC0
   int32_t m_damageType; // 0xAC0 - 0xAC4
   int32_t m_damageToEnableMotion; // 0xAC4 - 0xAC8
   float m_flForceToEnableMotion; // 0xAC8 - 0xACC
   bool m_bThrownByPlayer; // 0xACC - 0xACD
   bool m_bDroppedByPlayer; // 0xACD - 0xACE
   bool m_bTouchedByPlayer; // 0xACE - 0xACF
   bool m_bFirstCollisionAfterLaunch; // 0xACF - 0xAD0
   int32_t m_iExploitableByPlayer; // 0xAD0 - 0xAD4
   bool m_bHasBeenAwakened; // 0xAD4 - 0xAD5
   bool m_bIsOverrideProp; // 0xAD5 - 0xAD6
   unsigned char pad_AD6[0x2] // 0xAD6 - 0xAD8
   GameTime_t m_fNextCheckDisableMotionContactsTime; // 0xAD8 - 0xADC
   int32_t m_iInitialGlowState; // 0xADC - 0xAE0
   int32_t m_nGlowRange; // 0xAE0 - 0xAE4
   int32_t m_nGlowRangeMin; // 0xAE4 - 0xAE8
   Color m_glowColor; // 0xAE8 - 0xAEC
   bool m_bForceNavIgnore; // 0xAEC - 0xAED
   bool m_bNoNavmeshBlocker; // 0xAED - 0xAEE
   bool m_bForceNpcExclude; // 0xAEE - 0xAEF
   bool m_bShouldAutoConvertBackFromDebris; // 0xAEF - 0xAF0
   bool m_bMuteImpactEffects; // 0xAF0 - 0xAF1
   unsigned char pad_AF1[0x7] // 0xAF1 - 0xAF8
   bool m_bAcceptDamageFromHeldObjects; // 0xAF8 - 0xAF9
   bool m_bEnableUseOutput; // 0xAF9 - 0xAFA
   bool m_bAwake; // 0xAFA - 0xAFB
   unsigned char pad_AFB[0x1] // 0xAFB - 0xAFC
   int32_t m_nCollisionGroupOverride; // 0xAFC - 0xB00

}; // size - 0xB00


class CBaseTrigger : public CBaseToggle
{
public:

   bool m_bDisabled; // 0x770 - 0x771
   unsigned char pad_771[0x7] // 0x771 - 0x778
   CUtlSymbolLarge m_iFilterName; // 0x778 - 0x780
   CHandle< CBaseFilter > m_hFilter; // 0x780 - 0x784
   unsigned char pad_784[0x4] // 0x784 - 0x788
   CEntityIOOutput m_OnStartTouch; // 0x788 - 0x7B0
   CEntityIOOutput m_OnStartTouchAll; // 0x7B0 - 0x7D8
   CEntityIOOutput m_OnEndTouch; // 0x7D8 - 0x800
   CEntityIOOutput m_OnEndTouchAll; // 0x800 - 0x828
   CEntityIOOutput m_OnTouching; // 0x828 - 0x850
   CEntityIOOutput m_OnNotTouching; // 0x850 - 0x878
   CUtlVector< CHandle< CBaseEntity > > m_hTouchingEntities; // 0x878 - 0x890
   bool m_bClientSidePredicted; // 0x890 - 0x891

}; // size - 0x898


class CParticleFunctionPreEmission : public CParticleFunctionOperator
{
public:

   bool m_bRunOnce; // 0x1F0 - 0x1F1

}; // size - 0x200


class CPhysicsPropMultiplayer : public CPhysicsProp
{
public:


}; // size - 0xB00


class CBaseProp : public CBaseAnimGraph
{
public:

   bool m_bModelOverrodeBlockLOS; // 0x998 - 0x999
   unsigned char pad_999[0x3] // 0x999 - 0x99C
   int32_t m_iShapeType; // 0x99C - 0x9A0
   bool m_bConformToCollisionBounds; // 0x9A0 - 0x9A1
   unsigned char pad_9A1[0x3] // 0x9A1 - 0x9A4
   matrix3x4_t m_mPreferredCatchTransform; // 0x9A4 - 0x9D4

}; // size - 0x9D8


class CParticleFunctionRenderer : public CParticleFunction
{
public:

   CParticleVisibilityInputs VisibilityInputs; // 0x1E8 - 0x22C
   bool m_bCannotBeRefracted; // 0x22C - 0x22D
   bool m_bSkipRenderingOnMobile; // 0x22D - 0x22E

}; // size - 0x230


class CWeaponCSBaseGun : public CWeaponCSBase
{
public:

   int32_t m_zoomLevel; // 0xD50 - 0xD54
   int32_t m_iBurstShotsRemaining; // 0xD54 - 0xD58
   unsigned char pad_D58[0x8] // 0xD58 - 0xD60
   int32_t m_silencedModelIndex; // 0xD60 - 0xD64
   bool m_inPrecache; // 0xD64 - 0xD65
   bool m_bNeedsBoltAction; // 0xD65 - 0xD66
   bool m_bSkillReloadAvailable; // 0xD66 - 0xD67
   bool m_bSkillReloadLiftedReloadKey; // 0xD67 - 0xD68
   bool m_bSkillBoltInterruptAvailable; // 0xD68 - 0xD69
   bool m_bSkillBoltLiftedFireKey; // 0xD69 - 0xD6A

}; // size - 0xD70


class C_WeaponCSBaseGun : public C_WeaponCSBase
{
public:

   int32_t m_zoomLevel; // 0x13D0 - 0x13D4
   int32_t m_iBurstShotsRemaining; // 0x13D4 - 0x13D8
   int32_t m_iSilencerBodygroup; // 0x13D8 - 0x13DC
   unsigned char pad_13DC[0xC] // 0x13DC - 0x13E8
   int32_t m_silencedModelIndex; // 0x13E8 - 0x13EC
   bool m_inPrecache; // 0x13EC - 0x13ED
   bool m_bNeedsBoltAction; // 0x13ED - 0x13EE

}; // size - 0x13F0


class CBrBaseItem : public CPhysicsPropMultiplayer
{
public:


}; // size - 0xB28


class CEntityComponent
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class CUnaryUpdateNode : public CAnimUpdateNodeBase
{
public:

   CAnimUpdateNodeRef m_pChildNode; // 0x58 - 0x68

}; // size - 0x68


class C_BreakableProp : public CBaseProp
{
public:

   CEntityIOOutput m_OnBreak; // 0x9E0 - 0xA08
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0xA08 - 0xA30
   CEntityIOOutput m_OnTakeDamage; // 0xA30 - 0xA58
   float m_impactEnergyScale; // 0xA58 - 0xA5C
   int32_t m_iMinHealthDmg; // 0xA5C - 0xA60
   float m_flPressureDelay; // 0xA60 - 0xA64
   CHandle< C_BaseEntity > m_hBreaker; // 0xA64 - 0xA68
   PerformanceMode_t m_PerformanceMode; // 0xA68 - 0xA6C
   float m_flDmgModBullet; // 0xA6C - 0xA70
   float m_flDmgModClub; // 0xA70 - 0xA74
   float m_flDmgModExplosive; // 0xA74 - 0xA78
   float m_flDmgModFire; // 0xA78 - 0xA7C
   unsigned char pad_A7C[0x4] // 0xA7C - 0xA80
   CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0xA80 - 0xA88
   CUtlSymbolLarge m_iszBasePropData; // 0xA88 - 0xA90
   int32_t m_iInteractions; // 0xA90 - 0xA94
   GameTime_t m_flPreventDamageBeforeTime; // 0xA94 - 0xA98
   bool m_bHasBreakPiecesOrCommands; // 0xA98 - 0xA99
   unsigned char pad_A99[0x3] // 0xA99 - 0xA9C
   float m_explodeDamage; // 0xA9C - 0xAA0
   float m_explodeRadius; // 0xAA0 - 0xAA4
   unsigned char pad_AA4[0x4] // 0xAA4 - 0xAA8
   float m_explosionDelay; // 0xAA8 - 0xAAC
   unsigned char pad_AAC[0x4] // 0xAAC - 0xAB0
   CUtlSymbolLarge m_explosionBuildupSound; // 0xAB0 - 0xAB8
   CUtlSymbolLarge m_explosionCustomEffect; // 0xAB8 - 0xAC0
   CUtlSymbolLarge m_explosionCustomSound; // 0xAC0 - 0xAC8
   CUtlSymbolLarge m_explosionModifier; // 0xAC8 - 0xAD0
   CHandle< C_BasePlayerPawn > m_hPhysicsAttacker; // 0xAD0 - 0xAD4
   GameTime_t m_flLastPhysicsInfluenceTime; // 0xAD4 - 0xAD8
   float m_flDefaultFadeScale; // 0xAD8 - 0xADC
   CHandle< C_BaseEntity > m_hLastAttacker; // 0xADC - 0xAE0
   CHandle< C_BaseEntity > m_hFlareEnt; // 0xAE0 - 0xAE4
   bool m_noGhostCollision; // 0xAE4 - 0xAE5

}; // size - 0xAE8


class CServerOnlyPointEntity : public CServerOnlyEntity
{
public:


}; // size - 0x4A0


class CParticleFunctionForce : public CParticleFunction
{
public:


}; // size - 0x1F0


class C_BaseCombatCharacter : public C_BaseFlex
{
public:

   enum class WaterWakeMode_t : std::uint32_t
   {
      WATER_WAKE_NONE = 0,
      WATER_WAKE_IDLE = 1,
      WATER_WAKE_WALKING = 2,
      WATER_WAKE_RUNNING = 3,
      WATER_WAKE_WATER_OVERHEAD = 4
   };

   C_NetworkUtlVectorBase< CHandle< C_EconWearable > > m_hMyWearables; // 0xB28 - 0xB40
   int32_t m_bloodColor; // 0xB40 - 0xB44
   AttachmentHandle_t m_leftFootAttachment; // 0xB44 - 0xB45
   AttachmentHandle_t m_rightFootAttachment; // 0xB45 - 0xB46
   unsigned char pad_B46[0x2] // 0xB46 - 0xB48
   C_BaseCombatCharacter::WaterWakeMode_t m_nWaterWakeMode; // 0xB48 - 0xB4C
   float m_flWaterWorldZ; // 0xB4C - 0xB50
   float m_flWaterNextTraceTime; // 0xB50 - 0xB54
   float m_flFieldOfView; // 0xB54 - 0xB58

}; // size - 0xBB8


class EventSimulate_t
{
public:

   EngineLoopState_t m_LoopState; // 0x0 - 0x28
   bool m_bFirstTick; // 0x28 - 0x29
   bool m_bLastTick; // 0x29 - 0x2A

}; // size - 0x30


class CBoneConstraintBase
{
public:


}; // size - 0x28


class CPhysPropWeaponUpgrade : public CBrBaseItem
{
public:

   int32_t m_nEventPriority; // 0xB28 - 0xB2C
   GameTime_t m_flTimeLastUsed; // 0xB2C - 0xB30

}; // size - 0xB30


class CBaseFilter : public CLogicalEntity
{
public:

   bool m_bNegated; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x7] // 0x4A1 - 0x4A8
   CEntityIOOutput m_OnPass; // 0x4A8 - 0x4D0
   CEntityIOOutput m_OnFail; // 0x4D0 - 0x4F8

}; // size - 0x4F8


class CBaseGrenade : public CBaseFlex
{
public:

   CEntityIOOutput m_OnPlayerPickup; // 0x8B8 - 0x8E0
   CEntityIOOutput m_OnExplode; // 0x8E0 - 0x908
   bool m_bHasWarnedAI; // 0x908 - 0x909
   bool m_bIsSmokeGrenade; // 0x909 - 0x90A
   bool m_bIsLive; // 0x90A - 0x90B
   unsigned char pad_90B[0x1] // 0x90B - 0x90C
   float m_DmgRadius; // 0x90C - 0x910
   GameTime_t m_flDetonateTime; // 0x910 - 0x914
   float m_flWarnAITime; // 0x914 - 0x918
   float m_flDamage; // 0x918 - 0x91C
   unsigned char pad_91C[0x4] // 0x91C - 0x920
   CUtlSymbolLarge m_iszBounceSound; // 0x920 - 0x928
   CUtlString m_ExplosionSound; // 0x928 - 0x930
   unsigned char pad_930[0x4] // 0x930 - 0x934
   CHandle< CBaseEntity > m_hThrower; // 0x934 - 0x938
   unsigned char pad_938[0x18] // 0x938 - 0x950
   GameTime_t m_flNextAttack; // 0x950 - 0x954
   CHandle< CBaseEntity > m_hOriginalThrower; // 0x954 - 0x958

}; // size - 0x958


class CDynamicProp : public CBreakableProp
{
public:

   bool m_bCreateNavObstacle; // 0x9A0 - 0x9A1
   bool m_bUseHitboxesForRenderBox; // 0x9A1 - 0x9A2
   bool m_bUseAnimGraph; // 0x9A2 - 0x9A3
   unsigned char pad_9A3[0x5] // 0x9A3 - 0x9A8
   CEntityIOOutput m_pOutputAnimBegun; // 0x9A8 - 0x9D0
   CEntityIOOutput m_pOutputAnimOver; // 0x9D0 - 0x9F8
   CEntityIOOutput m_pOutputAnimLoopCycleOver; // 0x9F8 - 0xA20
   CEntityIOOutput m_OnAnimReachedStart; // 0xA20 - 0xA48
   CEntityIOOutput m_OnAnimReachedEnd; // 0xA48 - 0xA70
   CUtlSymbolLarge m_iszDefaultAnim; // 0xA70 - 0xA78
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0xA78 - 0xA7C
   bool m_bAnimateOnServer; // 0xA7C - 0xA7D
   bool m_bRandomizeCycle; // 0xA7D - 0xA7E
   bool m_bStartDisabled; // 0xA7E - 0xA7F
   bool m_bScriptedMovement; // 0xA7F - 0xA80
   bool m_bFiredStartEndOutput; // 0xA80 - 0xA81
   bool m_bForceNpcExclude; // 0xA81 - 0xA82
   bool m_bCreateNonSolid; // 0xA82 - 0xA83
   bool m_bIsOverrideProp; // 0xA83 - 0xA84
   int32_t m_iInitialGlowState; // 0xA84 - 0xA88
   int32_t m_nGlowRange; // 0xA88 - 0xA8C
   int32_t m_nGlowRangeMin; // 0xA8C - 0xA90
   Color m_glowColor; // 0xA90 - 0xA94
   int32_t m_nGlowTeam; // 0xA94 - 0xA98

}; // size - 0xA98


class CMotionMetricBase
{
public:

   float m_flWeight; // 0x20 - 0x24

}; // size - 0x28


class CMotionMetricEvaluator
{
public:

   CUtlVector< float32 > m_means; // 0x18 - 0x30
   CUtlVector< float32 > m_standardDeviations; // 0x30 - 0x48
   float m_flWeight; // 0x48 - 0x4C
   int32_t m_nDimensionStartIndex; // 0x4C - 0x50

}; // size - 0x50


class C_BaseToggle : public C_BaseModelEntity
{
public:


}; // size - 0x838


class CParticleFunctionConstraint : public CParticleFunction
{
public:


}; // size - 0x1F0


class CLeafUpdateNode : public CAnimUpdateNodeBase
{
public:


}; // size - 0x58


class CPhysConstraint : public CLogicalEntity
{
public:

   CUtlSymbolLarge m_nameAttach1; // 0x4A8 - 0x4B0
   CUtlSymbolLarge m_nameAttach2; // 0x4B0 - 0x4B8
   CUtlSymbolLarge m_breakSound; // 0x4B8 - 0x4C0
   float m_forceLimit; // 0x4C0 - 0x4C4
   float m_torqueLimit; // 0x4C4 - 0x4C8
   uint32_t m_teleportTick; // 0x4C8 - 0x4CC
   float m_minTeleportDistance; // 0x4CC - 0x4D0
   CEntityIOOutput m_OnBreak; // 0x4D0 - 0x4F8

}; // size - 0x4F8


class CAnimTagBase
{
public:

   CUtlString m_name; // 0x20 - 0x28
   CUtlString m_group; // 0x28 - 0x30
   AnimTagID m_tagID; // 0x30 - 0x34
   bool m_bIsReferenced; // 0x34 - 0x35

}; // size - 0x38


class CBaseCombatCharacter : public CBaseFlex
{
public:

   bool m_bForceServerRagdoll; // 0x8B0 - 0x8B1
   unsigned char pad_8B1[0x7] // 0x8B1 - 0x8B8
   CNetworkUtlVectorBase< CHandle< CEconWearable > > m_hMyWearables; // 0x8B8 - 0x8D0
   float m_flFieldOfView; // 0x8D0 - 0x8D4
   float m_impactEnergyScale; // 0x8D4 - 0x8D8
   HitGroup_t m_LastHitGroup; // 0x8D8 - 0x8DC
   bool m_bApplyStressDamage; // 0x8DC - 0x8DD
   unsigned char pad_8DD[0x3] // 0x8DD - 0x8E0
   int32_t m_bloodColor; // 0x8E0 - 0x8E4
   unsigned char pad_8E4[0x5C] // 0x8E4 - 0x940
   int32_t m_registeredNavTeam; // 0x940 - 0x944
   int32_t m_navMeshID; // 0x944 - 0x948
   int32_t m_iDamageCount; // 0x948 - 0x94C
   unsigned char pad_94C[0x4] // 0x94C - 0x950
   CUtlVector< RelationshipOverride_t >* m_pVecRelationships; // 0x950 - 0x958
   CUtlSymbolLarge m_strRelationships; // 0x958 - 0x960
   Hull_t m_eHull; // 0x960 - 0x964
   uint32_t m_nNavHullIdx; // 0x964 - 0x968

}; // size - 0x968


class C_BasePlayerPawn : public C_BaseCombatCharacter
{
public:

   CPlayer_WeaponServices* m_pWeaponServices; // 0xBB8 - 0xBC0
   CPlayer_ItemServices* m_pItemServices; // 0xBC0 - 0xBC8
   CPlayer_AutoaimServices* m_pAutoaimServices; // 0xBC8 - 0xBD0
   CPlayer_ObserverServices* m_pObserverServices; // 0xBD0 - 0xBD8
   CPlayer_WaterServices* m_pWaterServices; // 0xBD8 - 0xBE0
   CPlayer_UseServices* m_pUseServices; // 0xBE0 - 0xBE8
   CPlayer_FlashlightServices* m_pFlashlightServices; // 0xBE8 - 0xBF0
   CPlayer_CameraServices* m_pCameraServices; // 0xBF0 - 0xBF8
   CPlayer_MovementServices* m_pMovementServices; // 0xBF8 - 0xC00
   unsigned char pad_C00[0x8] // 0xC00 - 0xC08
   QAngle v_angle; // 0xC08 - 0xC14
   uint32_t m_iHideHUD; // 0xC14 - 0xC18
   sky3dparams_t m_skybox3d; // 0xC18 - 0xCA8
   GameTime_t m_flDeathTime; // 0xCA8 - 0xCAC
   Vector m_vecPredictionError; // 0xCAC - 0xCB8
   GameTime_t m_flPredictionErrorTime; // 0xCB8 - 0xCBC
   float m_flFOVSensitivityAdjust; // 0xCBC - 0xCC0
   float m_flMouseSensitivity; // 0xCC0 - 0xCC4
   Vector m_vOldOrigin; // 0xCC4 - 0xCD0
   float m_flOldSimulationTime; // 0xCD0 - 0xCD4
   int32_t m_nLastExecutedCommandNumber; // 0xCD4 - 0xCD8
   int32_t m_nLastExecutedCommandTick; // 0xCD8 - 0xCDC
   CHandle< CBasePlayerController > m_hController; // 0xCDC - 0xCE0
   bool m_bIsSwappingToPredictableController; // 0xCE0 - 0xCE1

}; // size - 0xCE8


class C_PhysicsProp : public C_BreakableProp
{
public:

   bool m_bAwake; // 0xAE8 - 0xAE9

}; // size - 0xAF0


class CAnimComponentBase
{
public:

   CUtlString m_group; // 0x18 - 0x20
   unsigned char pad_20[0x8] // 0x20 - 0x28
   AnimComponentID m_id; // 0x28 - 0x2C
   bool m_bStartEnabled; // 0x2C - 0x2D
   unsigned char pad_2D[0x3] // 0x2D - 0x30
   int32_t m_nPriority; // 0x30 - 0x34
   AnimNodeNetworkMode m_networkMode; // 0x34 - 0x38

}; // size - 0x38


class CAnimComponentUpdater
{
public:

   CUtlString m_name; // 0x18 - 0x20
   AnimComponentID m_id; // 0x20 - 0x24
   AnimNodeNetworkMode m_networkMode; // 0x24 - 0x28
   bool m_bStartEnabled; // 0x28 - 0x29

}; // size - 0x30


class CItem : public CBaseAnimGraph
{
public:

   CEntityIOOutput m_OnPlayerTouch; // 0x828 - 0x850
   bool m_bActivateWhenAtRest; // 0x850 - 0x851
   unsigned char pad_851[0x7] // 0x851 - 0x858
   CEntityIOOutput m_OnCacheInteraction; // 0x858 - 0x880
   CEntityIOOutput m_OnPlayerPickup; // 0x880 - 0x8A8
   CEntityIOOutput m_OnGlovePulled; // 0x8A8 - 0x8D0
   Vector m_vOriginalSpawnOrigin; // 0x8D0 - 0x8DC
   QAngle m_vOriginalSpawnAngles; // 0x8DC - 0x8E8
   bool m_bPhysStartAsleep; // 0x8E8 - 0x8E9

}; // size - 0x8F8


class CModelConfigElement
{
public:

   CUtlString m_ElementName; // 0x8 - 0x10
   CUtlVector< CModelConfigElement* > m_NestedElements; // 0x10 - 0x28

}; // size - 0x48


class C_BaseGrenade : public C_BaseFlex
{
public:

   bool m_bHasWarnedAI; // 0xB28 - 0xB29
   bool m_bIsSmokeGrenade; // 0xB29 - 0xB2A
   bool m_bIsLive; // 0xB2A - 0xB2B
   unsigned char pad_B2B[0x1] // 0xB2B - 0xB2C
   float m_DmgRadius; // 0xB2C - 0xB30
   GameTime_t m_flDetonateTime; // 0xB30 - 0xB34
   float m_flWarnAITime; // 0xB34 - 0xB38
   float m_flDamage; // 0xB38 - 0xB3C
   unsigned char pad_B3C[0x4] // 0xB3C - 0xB40
   CUtlSymbolLarge m_iszBounceSound; // 0xB40 - 0xB48
   CUtlString m_ExplosionSound; // 0xB48 - 0xB50
   unsigned char pad_B50[0x4] // 0xB50 - 0xB54
   CHandle< C_BaseEntity > m_hThrower; // 0xB54 - 0xB58
   unsigned char pad_B58[0x18] // 0xB58 - 0xB70
   GameTime_t m_flNextAttack; // 0xB70 - 0xB74
   CHandle< C_BaseEntity > m_hOriginalThrower; // 0xB74 - 0xB78

}; // size - 0xB78


class CBtNode
{
public:


}; // size - 0x58


class CEntitySubclassVDataBase
{
public:


}; // size - 0x28


class C_CSGO_TeamPreviewCharacterPosition : public C_BaseEntity
{
public:

   int32_t m_nOrdinal; // 0x538 - 0x53C
   unsigned char pad_53C[0x4] // 0x53C - 0x540
   CUtlString m_sWeaponName; // 0x540 - 0x548
   uint64_t m_xuid; // 0x548 - 0x550
   C_EconItemView m_weaponItem; // 0x550 - 0x998

}; // size - 0x9D0


class CBaseCSGrenade : public CWeaponCSBase
{
public:

   bool m_bRedraw; // 0xD70 - 0xD71
   bool m_bIsHeldByPlayer; // 0xD71 - 0xD72
   bool m_bPinPulled; // 0xD72 - 0xD73
   unsigned char pad_D73[0x1] // 0xD73 - 0xD74
   EGrenadeThrowState m_eThrowStatus; // 0xD74 - 0xD78
   GameTime_t m_fThrowTime; // 0xD78 - 0xD7C
   float m_flThrowStrength; // 0xD7C - 0xD80
   float m_flThrowStrengthApproach; // 0xD80 - 0xD84
   GameTime_t m_fDropTime; // 0xD84 - 0xD88

}; // size - 0xD90


class CNavVolume
{
public:


}; // size - 0x70


class C_BaseCSGrenade : public C_WeaponCSBase
{
public:

   bool m_bRedraw; // 0x13F0 - 0x13F1
   bool m_bIsHeldByPlayer; // 0x13F1 - 0x13F2
   bool m_bPinPulled; // 0x13F2 - 0x13F3
   unsigned char pad_13F3[0x1] // 0x13F3 - 0x13F4
   EGrenadeThrowState m_eThrowStatus; // 0x13F4 - 0x13F8
   GameTime_t m_fThrowTime; // 0x13F8 - 0x13FC
   float m_flThrowStrength; // 0x13FC - 0x1400
   float m_flThrowStrengthApproach; // 0x1400 - 0x1404
   GameTime_t m_fDropTime; // 0x1404 - 0x1408

}; // size - 0x1410


class C_PointEntity : public C_BaseEntity
{
public:


}; // size - 0x538


class CBaseConstraint : public CBoneConstraintBase
{
public:

   CUtlString m_name; // 0x28 - 0x30
   Vector m_vUpVector; // 0x30 - 0x3C
   unsigned char pad_3C[0x4] // 0x3C - 0x40
   CUtlVector< CConstraintSlave > m_slaves; // 0x40 - 0x58
   CUtlVector< CConstraintTarget > m_targets; // 0x58 - 0x70

}; // size - 0x70


class CBasePlatTrain : public CBaseToggle
{
public:

   CUtlSymbolLarge m_NoiseMoving; // 0x770 - 0x778
   CUtlSymbolLarge m_NoiseArrived; // 0x778 - 0x780
   unsigned char pad_780[0x8] // 0x780 - 0x788
   float m_volume; // 0x788 - 0x78C
   float m_flTWidth; // 0x78C - 0x790
   float m_flTLength; // 0x790 - 0x794

}; // size - 0x798


class CCSGO_TeamPreviewCharacterPosition : public CBaseEntity
{
public:

   int32_t m_nOrdinal; // 0x4A0 - 0x4A4
   unsigned char pad_4A4[0x4] // 0x4A4 - 0x4A8
   CUtlString m_sWeaponName; // 0x4A8 - 0x4B0
   uint64_t m_xuid; // 0x4B0 - 0x4B8
   CEconItemView m_weaponItem; // 0x4B8 - 0x730

}; // size - 0x730


class CConditionBase
{
public:


}; // size - 0x28


class CPlayerControllerComponent
{
public:

   CNetworkVarChainer __m_pChainEntity; // 0x8 - 0x30

}; // size - 0x40


class CRuleEntity : public CBaseModelEntity
{
public:

   CUtlSymbolLarge m_iszMaster; // 0x6F0 - 0x6F8

}; // size - 0x6F8


class CMarkupVolume : public CBaseModelEntity
{
public:

   bool m_bEnabled; // 0x6F0 - 0x6F1

}; // size - 0x6F8


class CSimpleSimTimer
{
public:

   GameTime_t m_next; // 0x0 - 0x4
   WorldGroupId_t m_nWorldGroupId; // 0x4 - 0x8

}; // size - 0x8


class C_BaseClientUIEntity : public C_BaseModelEntity
{
public:

   bool m_bEnabled; // 0x840 - 0x841
   unsigned char pad_841[0x7] // 0x841 - 0x848
   CUtlSymbolLarge m_DialogXMLName; // 0x848 - 0x850
   CUtlSymbolLarge m_PanelClassName; // 0x850 - 0x858
   CUtlSymbolLarge m_PanelID; // 0x858 - 0x860

}; // size - 0x868


class C_CSPlayerPawnBase : public C_BasePlayerPawn
{
public:

   CCSPlayer_ActionTrackingServices* m_pActionTrackingServices; // 0xD00 - 0xD08
   CCSPlayer_PingServices* m_pPingServices; // 0xD08 - 0xD10
   CCSPlayer_ViewModelServices* m_pViewModelServices; // 0xD10 - 0xD18
   float32 m_fRenderingClipPlane[4]; // 0xD18 - 0xD28
   int32_t m_nLastClipPlaneSetupFrame; // 0xD28 - 0xD2C
   Vector m_vecLastClipCameraPos; // 0xD2C - 0xD38
   Vector m_vecLastClipCameraForward; // 0xD38 - 0xD44
   bool m_bClipHitStaticWorld; // 0xD44 - 0xD45
   bool m_bCachedPlaneIsValid; // 0xD45 - 0xD46
   unsigned char pad_D46[0x2] // 0xD46 - 0xD48
   C_WeaponCSBase* m_pClippingWeapon; // 0xD48 - 0xD50
   CSPlayerState m_previousPlayerState; // 0xD50 - 0xD54
   float m_flLastCollisionCeiling; // 0xD54 - 0xD58
   float m_flLastCollisionCeilingChangeTime; // 0xD58 - 0xD5C
   unsigned char pad_D5C[0x5C] // 0xD5C - 0xDB8
   bool m_bInLanding; // 0xDB8 - 0xDB9
   unsigned char pad_DB9[0x3] // 0xDB9 - 0xDBC
   float m_flLandingTime; // 0xDBC - 0xDC0
   GameTime_t m_grenadeParameterStashTime; // 0xDC0 - 0xDC4
   bool m_bGrenadeParametersStashed; // 0xDC4 - 0xDC5
   unsigned char pad_DC5[0x3] // 0xDC5 - 0xDC8
   QAngle m_angStashedShootAngles; // 0xDC8 - 0xDD4
   Vector m_vecStashedGrenadeThrowPosition; // 0xDD4 - 0xDE0
   Vector m_vecStashedVelocity; // 0xDE0 - 0xDEC
   QAngle m_angShootAngleHistory[2]; // 0xDEC - 0xE04
   Vector m_vecThrowPositionHistory[2]; // 0xE04 - 0xE1C
   Vector m_vecVelocityHistory[2]; // 0xE1C - 0xE34
   unsigned char pad_E34[0x4] // 0xE34 - 0xE38
   QAngle m_thirdPersonHeading; // 0xE38 - 0xE44
   unsigned char pad_E44[0xC] // 0xE44 - 0xE50
   float m_flSlopeDropOffset; // 0xE50 - 0xE54
   unsigned char pad_E54[0xC] // 0xE54 - 0xE60
   float m_flSlopeDropHeight; // 0xE60 - 0xE64
   unsigned char pad_E64[0xC] // 0xE64 - 0xE70
   Vector m_vHeadConstraintOffset; // 0xE70 - 0xE7C
   unsigned char pad_E7C[0xC] // 0xE7C - 0xE88
   bool m_bClientTransparentImmunityAlphaEffectEnabled; // 0xE88 - 0xE89
   bool m_bClientDeferDrawToImmunityAlphaPass; // 0xE89 - 0xE8A
   bool m_bIsScoped; // 0xE8A - 0xE8B
   bool m_bIsWalking; // 0xE8B - 0xE8C
   bool m_bResumeZoom; // 0xE8C - 0xE8D
   unsigned char pad_E8D[0x3] // 0xE8D - 0xE90
   CSPlayerState m_iPlayerState; // 0xE90 - 0xE94
   bool m_bIsDefusing; // 0xE94 - 0xE95
   bool m_bIsGrabbingHostage; // 0xE95 - 0xE96
   unsigned char pad_E96[0x2] // 0xE96 - 0xE98
   CSPlayerBlockingUseAction_t m_iBlockingUseActionInProgress; // 0xE98 - 0xE9C
   bool m_bIsRescuing; // 0xE9C - 0xE9D
   unsigned char pad_E9D[0x3] // 0xE9D - 0xEA0
   GameTime_t m_fImmuneToGunGameDamageTime; // 0xEA0 - 0xEA4
   GameTime_t m_fImmuneToGunGameDamageTimeLast; // 0xEA4 - 0xEA8
   bool m_bGunGameImmunity; // 0xEA8 - 0xEA9
   bool m_bHasMovedSinceSpawn; // 0xEA9 - 0xEAA
   bool m_bMadeFinalGunGameProgressiveKill; // 0xEAA - 0xEAB
   unsigned char pad_EAB[0x1] // 0xEAB - 0xEAC
   int32_t m_iGunGameProgressiveWeaponIndex; // 0xEAC - 0xEB0
   int32_t m_iNumGunGameTRKillPoints; // 0xEB0 - 0xEB4
   int32_t m_iNumGunGameKillsWithCurrentWeapon; // 0xEB4 - 0xEB8
   uint32_t m_unTotalRoundDamageDealt; // 0xEB8 - 0xEBC
   float m_fMolotovUseTime; // 0xEBC - 0xEC0
   float m_fMolotovDamageTime; // 0xEC0 - 0xEC4
   bool m_bInBombZone; // 0xEC4 - 0xEC5
   unsigned char pad_EC5[0x3] // 0xEC5 - 0xEC8
   int32_t m_nWhichBombZone; // 0xEC8 - 0xECC
   bool m_bInBuyZone; // 0xECC - 0xECD
   bool m_bInNoDefuseArea; // 0xECD - 0xECE
   unsigned char pad_ECE[0x2] // 0xECE - 0xED0
   int32_t m_iThrowGrenadeCounter; // 0xED0 - 0xED4
   bool m_bWaitForNoAttack; // 0xED4 - 0xED5
   bool m_bIsRespawningForDMBonus; // 0xED5 - 0xED6
   unsigned char pad_ED6[0x2] // 0xED6 - 0xED8
   float m_flGuardianTooFarDistFrac; // 0xED8 - 0xEDC
   GameTime_t m_flDetectedByEnemySensorTime; // 0xEDC - 0xEE0
   float m_flNextGuardianTooFarWarning; // 0xEE0 - 0xEE4
   bool m_bSuppressGuardianTooFarWarningAudio; // 0xEE4 - 0xEE5
   bool m_bKilledByTaser; // 0xEE5 - 0xEE6
   unsigned char pad_EE6[0x2] // 0xEE6 - 0xEE8
   int32_t m_iMoveState; // 0xEE8 - 0xEEC
   bool m_bCanMoveDuringFreezePeriod; // 0xEEC - 0xEED
   bool m_isCurrentGunGameLeader; // 0xEED - 0xEEE
   bool m_isCurrentGunGameTeamLeader; // 0xEEE - 0xEEF
   unsigned char pad_EEF[0x1] // 0xEEF - 0xEF0
   float m_flLowerBodyYawTarget; // 0xEF0 - 0xEF4
   bool m_bStrafing; // 0xEF4 - 0xEF5
   char m_szLastPlaceName[18]; // 0xEF5 - 0xF07
   unsigned char pad_F07[0x1] // 0xF07 - 0xF08
   float m_flLastExoJumpTime; // 0xF08 - 0xF0C
   unsigned char pad_F0C[0xC] // 0xF0C - 0xF18
   GameTime_t m_flLastSpawnTimeIndex; // 0xF18 - 0xF1C
   int32_t m_iAddonBits; // 0xF1C - 0xF20
   int32_t m_iPrimaryAddon; // 0xF20 - 0xF24
   int32_t m_iSecondaryAddon; // 0xF24 - 0xF28
   int32_t m_iProgressBarDuration; // 0xF28 - 0xF2C
   float m_flProgressBarStartTime; // 0xF2C - 0xF30
   float m_flStamina; // 0xF30 - 0xF34
   int32_t m_iDirection; // 0xF34 - 0xF38
   int32_t m_iShotsFired; // 0xF38 - 0xF3C
   bool m_bNightVisionOn; // 0xF3C - 0xF3D
   bool m_bHasNightVision; // 0xF3D - 0xF3E
   unsigned char pad_F3E[0x2] // 0xF3E - 0xF40
   float m_flVelocityModifier; // 0xF40 - 0xF44
   float m_flGroundAccelLinearFracLastTime; // 0xF44 - 0xF48
   int32_t m_iStartAccount; // 0xF48 - 0xF4C
   bool m_bIsSpawnRappelling; // 0xF4C - 0xF4D
   unsigned char pad_F4D[0x3] // 0xF4D - 0xF50
   Vector m_vecSpawnRappellingRopeOrigin; // 0xF50 - 0xF5C
   float m_flSpawnRappellingFadeOutForClientViewOffset; // 0xF5C - 0xF60
   int32_t m_nSurvivalTeam; // 0xF60 - 0xF64
   CHandle< C_CSPlayerPawnBase > m_hSurvivalAssassinationTarget; // 0xF64 - 0xF68
   float m_flHealthShotBoostExpirationTime; // 0xF68 - 0xF6C
   float m_flLastKnownParachuteScreenEffectAmount; // 0xF6C - 0xF70
   Vector m_vecIntroStartEyePosition; // 0xF70 - 0xF7C
   Vector m_vecIntroStartPlayerForward; // 0xF7C - 0xF88
   float m_flClientDeathTime; // 0xF88 - 0xF8C
   unsigned char pad_F8C[0x8] // 0xF8C - 0xF94
   float m_flNightVisionAlpha; // 0xF94 - 0xF98
   bool m_bScreenTearFrameCaptured; // 0xF98 - 0xF99
   unsigned char pad_F99[0x3] // 0xF99 - 0xF9C
   float m_flFlashBangTime; // 0xF9C - 0xFA0
   float m_flFlashScreenshotAlpha; // 0xFA0 - 0xFA4
   float m_flFlashOverlayAlpha; // 0xFA4 - 0xFA8
   bool m_bFlashBuildUp; // 0xFA8 - 0xFA9
   bool m_bFlashDspHasBeenCleared; // 0xFA9 - 0xFAA
   bool m_bFlashScreenshotHasBeenGrabbed; // 0xFAA - 0xFAB
   unsigned char pad_FAB[0x1] // 0xFAB - 0xFAC
   float m_flFlashMaxAlpha; // 0xFAC - 0xFB0
   float m_flFlashDuration; // 0xFB0 - 0xFB4
   float m_flLastFiredWeaponTime; // 0xFB4 - 0xFB8
   Vector m_lastStandingPos; // 0xFB8 - 0xFC4
   Vector m_vecLastMuzzleFlashPos; // 0xFC4 - 0xFD0
   QAngle m_angLastMuzzleFlashAngle; // 0xFD0 - 0xFDC
   CHandle< C_BaseEntity > m_hMuzzleFlashShape; // 0xFDC - 0xFE0
   int32_t m_iHealthBarRenderMaskIndex; // 0xFE0 - 0xFE4
   float m_flHealthFadeValue; // 0xFE4 - 0xFE8
   float m_flHealthFadeAlpha; // 0xFE8 - 0xFEC
   int32_t m_nMyCollisionGroup; // 0xFEC - 0xFF0
   float m_ignoreLadderJumpTime; // 0xFF0 - 0xFF4
   unsigned char pad_FF4[0x4] // 0xFF4 - 0xFF8
   CountdownTimer m_ladderSurpressionTimer; // 0xFF8 - 0x1010
   Vector m_lastLadderNormal; // 0x1010 - 0x101C
   Vector m_lastLadderPos; // 0x101C - 0x1028
   unsigned char pad_1028[0x8] // 0x1028 - 0x1030
   float m_flDeathCCWeight; // 0x1030 - 0x1034
   bool m_bOldIsScoped; // 0x1034 - 0x1035
   unsigned char pad_1035[0x3] // 0x1035 - 0x1038
   float m_flPrevRoundEndTime; // 0x1038 - 0x103C
   float m_flPrevMatchEndTime; // 0x103C - 0x1040
   uint16_t m_unCurrentEquipmentValue; // 0x1040 - 0x1042
   uint16_t m_unRoundStartEquipmentValue; // 0x1042 - 0x1044
   uint16_t m_unFreezetimeEndEquipmentValue; // 0x1044 - 0x1046
   bool m_passiveItems[4]; // 0x1046 - 0x104A
   unsigned char pad_104A[0x2] // 0x104A - 0x104C
   Vector m_vecThirdPersonViewPositionOverride; // 0x104C - 0x1058
   int32_t m_nHeavyAssaultSuitCooldownRemaining; // 0x1058 - 0x105C
   int32_t m_ArmorValue; // 0x105C - 0x1060
   QAngle m_angEyeAngles; // 0x1060 - 0x106C
   unsigned char pad_106C[0xC] // 0x106C - 0x1078
   bool m_bInHostageRescueZone; // 0x1078 - 0x1079
   unsigned char pad_1079[0x3] // 0x1079 - 0x107C
   float m_fNextThinkPushAway; // 0x107C - 0x1080
   bool m_bShouldAutobuyDMWeapons; // 0x1080 - 0x1081
   bool m_bShouldAutobuyNow; // 0x1081 - 0x1082
   bool m_bHud_MiniScoreHidden; // 0x1082 - 0x1083
   bool m_bHud_RadarHidden; // 0x1083 - 0x1084
   CEntityIndex m_nLastKillerIndex; // 0x1084 - 0x1088
   int32_t m_nLastConcurrentKilled; // 0x1088 - 0x108C
   int32_t m_nDeathCamMusic; // 0x108C - 0x1090
   CEntityIndex m_iIDEntIndex; // 0x1090 - 0x1094
   unsigned char pad_1094[0x4] // 0x1094 - 0x1098
   CountdownTimer m_delayTargetIDTimer; // 0x1098 - 0x10B0
   CEntityIndex m_iTargetedWeaponEntIndex; // 0x10B0 - 0x10B4
   CEntityIndex m_iOldIDEntIndex; // 0x10B4 - 0x10B8
   CountdownTimer m_holdTargetIDTimer; // 0x10B8 - 0x10D0
   unsigned char pad_10D0[0x4C] // 0x10D0 - 0x111C
   float m_flCurrentMusicStartTime; // 0x111C - 0x1120
   float m_flMusicRoundStartTime; // 0x1120 - 0x1124
   int32_t m_cycleLatch; // 0x1124 - 0x1128
   float m_serverIntendedCycle; // 0x1128 - 0x112C
   uint32 m_vecPlayerPatchEconIndices[5]; // 0x112C - 0x1140
   bool m_bClientEconPatchesNeedUpdate; // 0x1140 - 0x1141
   bool m_bHideTargetID; // 0x1141 - 0x1142
   unsigned char pad_1142[0x2] // 0x1142 - 0x1144
   float m_nextTaserShakeTime; // 0x1144 - 0x1148
   float m_firstTaserShakeTime; // 0x1148 - 0x114C
   float m_flLastSmokeOverlayAlpha; // 0x114C - 0x1150
   Vector m_vLastSmokeOverlayColor; // 0x1150 - 0x115C
   ParticleIndex_t m_nPlayerSmokedFx; // 0x115C - 0x1160
   float m_flLastKnownAccumulatedWeaponEncumbrance; // 0x1160 - 0x1164
   float m_flLastTimeComputedAccumulatedWeaponEncumbrance; // 0x1164 - 0x1168
   float m_flNextMagDropTime; // 0x1168 - 0x116C
   int32_t m_nLastMagDropAttachmentIndex; // 0x116C - 0x1170
   CUtlVector< C_BulletHitModel* > m_vecBulletHitModels; // 0x1170 - 0x1188
   CUtlVector< C_PickUpModelSlerper* > m_vecPickupModelSlerpers; // 0x1188 - 0x11A0
   Vector m_vecLastAliveLocalVelocity; // 0x11A0 - 0x11AC
   float m_flLastNearbyItemHighlightCheck; // 0x11AC - 0x11B0
   bool m_bInSurvivalDangerZone; // 0x11B0 - 0x11B1
   bool m_bNearDangerZone; // 0x11B1 - 0x11B2
   unsigned char pad_11B2[0x36] // 0x11B2 - 0x11E8
   EntitySpottedState_t m_entitySpottedState; // 0x11E8 - 0x1200
   float m_flTimeOfLastInjury; // 0x1200 - 0x1204
   RelativeDamagedDirection_t m_nRelativeDirectionOfLastInjury; // 0x1204 - 0x1208
   int32_t m_nSurvivalTeamNumber; // 0x1208 - 0x120C
   float m_flNextSprayDecalTime; // 0x120C - 0x1210
   bool m_bPreviouslyInBuyZone; // 0x1210 - 0x1211
   unsigned char pad_1211[0x3] // 0x1211 - 0x1214
   uint32_t m_unPreviousWeaponHash; // 0x1214 - 0x1218
   uint32_t m_unWeaponHash; // 0x1218 - 0x121C
   bool m_bPrevDefuser; // 0x121C - 0x121D
   bool m_bPrevHelmet; // 0x121D - 0x121E
   unsigned char pad_121E[0x2] // 0x121E - 0x1220
   int32_t m_nPrevArmorVal; // 0x1220 - 0x1224
   bool m_bGuardianShouldSprayCustomXMark; // 0x1224 - 0x1225
   unsigned char pad_1225[0x3] // 0x1225 - 0x1228
   QAngle m_aimPunchAngle; // 0x1228 - 0x1234
   QAngle m_aimPunchAngleVel; // 0x1234 - 0x1240
   int32_t m_aimPunchTickBase; // 0x1240 - 0x1244
   float m_aimPunchTickFraction; // 0x1244 - 0x1248
   CUtlVector< QAngle > m_aimPunchCache; // 0x1248 - 0x1260
   unsigned char pad_1260[0x8] // 0x1260 - 0x1268
   float m_flOldFallVelocity; // 0x1268 - 0x126C
   bool m_bHasDeathInfo; // 0x126C - 0x126D
   unsigned char pad_126D[0x3] // 0x126D - 0x1270
   float m_flDeathInfoTime; // 0x1270 - 0x1274
   Vector m_vecDeathInfoOrigin; // 0x1274 - 0x1280
   bool m_bKilledByHeadshot; // 0x1280 - 0x1281
   unsigned char pad_1281[0x3] // 0x1281 - 0x1284
   CHandle< CCSPlayerController > m_hOriginalController; // 0x1284 - 0x1288
   unsigned char pad_1288[0x10] // 0x1288 - 0x1298
   float m_flLandseconds; // 0x1298 - 0x129C

}; // size - 0x12A0


class SpawnPoint : public CServerOnlyPointEntity
{
public:

   int32_t m_iPriority; // 0x4A0 - 0x4A4
   bool m_bEnabled; // 0x4A4 - 0x4A5
   unsigned char pad_4A5[0x3] // 0x4A5 - 0x4A8
   int32_t m_nType; // 0x4A8 - 0x4AC

}; // size - 0x4B0


class CSoundOpvarSetPointBase : public CBaseEntity
{
public:

   bool m_bDisabled; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x3] // 0x4A1 - 0x4A4
   CEntityHandle m_hSource; // 0x4A4 - 0x4A8
   unsigned char pad_4A8[0x8] // 0x4A8 - 0x4B0
   CUtlSymbolLarge m_iszSourceEntityName; // 0x4B0 - 0x4B8
   unsigned char pad_4B8[0x50] // 0x4B8 - 0x508
   Vector m_vLastPosition; // 0x508 - 0x514
   unsigned char pad_514[0x4] // 0x514 - 0x518
   CUtlSymbolLarge m_iszStackName; // 0x518 - 0x520
   CUtlSymbolLarge m_iszOperatorName; // 0x520 - 0x528
   CUtlSymbolLarge m_iszOpvarName; // 0x528 - 0x530
   int32_t m_iOpvarIndex; // 0x530 - 0x534
   bool m_bUseAutoCompare; // 0x534 - 0x535

}; // size - 0x538


class C_CSGO_MapPreviewCameraPath : public C_BaseEntity
{
public:

   float m_flZFar; // 0x538 - 0x53C
   float m_flZNear; // 0x53C - 0x540
   bool m_bLoop; // 0x540 - 0x541
   bool m_bVerticalFOV; // 0x541 - 0x542
   bool m_bConstantSpeed; // 0x542 - 0x543
   unsigned char pad_543[0x1] // 0x543 - 0x544
   float m_flDuration; // 0x544 - 0x548
   unsigned char pad_548[0x40] // 0x548 - 0x588
   float m_flPathLength; // 0x588 - 0x58C
   float m_flPathDuration; // 0x58C - 0x590

}; // size - 0x598


class C_SoundOpvarSetPointBase : public C_BaseEntity
{
public:

   CUtlSymbolLarge m_iszStackName; // 0x538 - 0x540
   CUtlSymbolLarge m_iszOperatorName; // 0x540 - 0x548
   CUtlSymbolLarge m_iszOpvarName; // 0x548 - 0x550
   int32_t m_iOpvarIndex; // 0x550 - 0x554
   bool m_bUseAutoCompare; // 0x554 - 0x555

}; // size - 0x558


class CAnimParameterBase
{
public:

   CAnimGraphSymbolWithStorage m_name; // 0x18 - 0x38
   CUtlString m_group; // 0x38 - 0x40
   AnimParamID m_id; // 0x40 - 0x44
   unsigned char pad_44[0x14] // 0x44 - 0x58
   CUtlString m_componentName; // 0x58 - 0x60
   unsigned char pad_60[0x4] // 0x60 - 0x64
   AnimParamButton_t m_previewButton; // 0x64 - 0x68
   bool m_bUseMostRecentValue; // 0x68 - 0x69
   bool m_bAutoReset; // 0x69 - 0x6A
   unsigned char pad_6A[0x2] // 0x6A - 0x6C
   AnimParamNetworkSetting m_eNetworkSetting; // 0x6C - 0x70
   bool m_bGameWritable; // 0x70 - 0x71
   bool m_bGraphWritable; // 0x71 - 0x72
   bool m_bIsReferenced; // 0x72 - 0x73
   bool m_bNetworkingRequested; // 0x73 - 0x74

}; // size - 0x78


class CBaseCSGrenadeProjectile : public CBaseGrenade
{
public:

   Vector m_vInitialVelocity; // 0x958 - 0x964
   int32_t m_nBounces; // 0x964 - 0x968
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_nExplodeEffectIndex; // 0x968 - 0x970
   int32_t m_nExplodeEffectTickBegin; // 0x970 - 0x974
   Vector m_vecExplodeEffectOrigin; // 0x974 - 0x980
   uint8_t m_unOGSExtraFlags; // 0x980 - 0x981
   bool m_bDetonationRecorded; // 0x981 - 0x982
   unsigned char pad_982[0x2] // 0x982 - 0x984
   GameTime_t m_flDetonateTime; // 0x984 - 0x988
   uint16_t m_nItemIndex; // 0x988 - 0x98A
   unsigned char pad_98A[0x2] // 0x98A - 0x98C
   Vector m_vecOriginalSpawnLocation; // 0x98C - 0x998
   GameTime_t m_flLastBounceSoundTime; // 0x998 - 0x99C

}; // size - 0x9A0


class CEnvSoundscape : public CServerOnlyEntity
{
public:

   CEntityIOOutput m_OnPlay; // 0x4A0 - 0x4C8
   float m_flRadius; // 0x4C8 - 0x4CC
   unsigned char pad_4CC[0x4] // 0x4CC - 0x4D0
   CUtlSymbolLarge m_soundscapeName; // 0x4D0 - 0x4D8
   CUtlSymbolLarge m_soundEventName; // 0x4D8 - 0x4E0
   bool m_bOverrideWithEvent; // 0x4E0 - 0x4E1
   unsigned char pad_4E1[0x3] // 0x4E1 - 0x4E4
   int32_t m_soundscapeIndex; // 0x4E4 - 0x4E8
   int32_t m_soundscapeEntityListId; // 0x4E8 - 0x4EC
   uint32_t m_soundEventHash; // 0x4EC - 0x4F0
   CUtlSymbolLarge m_positionNames[8]; // 0x4F0 - 0x530
   CHandle< CEnvSoundscape > m_hProxySoundscape; // 0x530 - 0x534
   bool m_bDisabled; // 0x534 - 0x535

}; // size - 0x538


class CModelPointEntity : public CBaseModelEntity
{
public:


}; // size - 0x6F0


class CTriggerMultiple : public CBaseTrigger
{
public:

   CEntityIOOutput m_OnTrigger; // 0x898 - 0x8C0

}; // size - 0x8C0


class C_BaseTrigger : public C_BaseToggle
{
public:

   bool m_bDisabled; // 0x838 - 0x839
   bool m_bClientSidePredicted; // 0x839 - 0x83A

}; // size - 0x840


class MaterialParam_t
{
public:

   CUtlString m_name; // 0x0 - 0x8

}; // size - 0x8


class CGameRules
{
public:

   char m_szQuestName[128]; // 0x8 - 0x88
   int32_t m_nQuestPhase; // 0x88 - 0x8C

}; // size - 0x90


class C_GameRules
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class C_INIT_RemapParticleCountToScalar : public CParticleFunctionInitializer
{
public:

   ParticleAttributeIndex_t m_nFieldOutput; // 0x1F0 - 0x1F4
   int32_t m_nInputMin; // 0x1F4 - 0x1F8
   int32_t m_nInputMax; // 0x1F8 - 0x1FC
   int32_t m_nScaleControlPoint; // 0x1FC - 0x200
   int32_t m_nScaleControlPointField; // 0x200 - 0x204
   float m_flOutputMin; // 0x204 - 0x208
   float m_flOutputMax; // 0x208 - 0x20C
   ParticleSetMethod_t m_nSetMethod; // 0x20C - 0x210
   bool m_bActiveRange; // 0x210 - 0x211
   bool m_bInvert; // 0x211 - 0x212
   bool m_bWrap; // 0x212 - 0x213
   unsigned char pad_213[0x1] // 0x213 - 0x214
   float m_flRemapBias; // 0x214 - 0x218

}; // size - 0x220


class CAnimMotorBase
{
public:

   CUtlString m_name; // 0x18 - 0x20
   bool m_bDefault; // 0x20 - 0x21

}; // size - 0x28


class CAnimMotorUpdaterBase
{
public:

   CUtlString m_name; // 0x10 - 0x18
   bool m_bDefault; // 0x18 - 0x19

}; // size - 0x20


class CAnimationGraphVisualizerPrimitiveBase
{
public:

   CAnimationGraphVisualizerPrimitiveType m_Type; // 0x8 - 0xC

}; // size - 0x10


class CBaseClientUIEntity : public CBaseModelEntity
{
public:

   bool m_bEnabled; // 0x6F0 - 0x6F1
   unsigned char pad_6F1[0x7] // 0x6F1 - 0x6F8
   CUtlSymbolLarge m_DialogXMLName; // 0x6F8 - 0x700
   CUtlSymbolLarge m_PanelClassName; // 0x700 - 0x708
   CUtlSymbolLarge m_PanelID; // 0x708 - 0x710
   CEntityIOOutput m_CustomOutput0; // 0x710 - 0x738
   CEntityIOOutput m_CustomOutput1; // 0x738 - 0x760
   CEntityIOOutput m_CustomOutput2; // 0x760 - 0x788
   CEntityIOOutput m_CustomOutput3; // 0x788 - 0x7B0
   CEntityIOOutput m_CustomOutput4; // 0x7B0 - 0x7D8
   CEntityIOOutput m_CustomOutput5; // 0x7D8 - 0x800
   CEntityIOOutput m_CustomOutput6; // 0x800 - 0x828
   CEntityIOOutput m_CustomOutput7; // 0x828 - 0x850
   CEntityIOOutput m_CustomOutput8; // 0x850 - 0x878
   CEntityIOOutput m_CustomOutput9; // 0x878 - 0x8A0

}; // size - 0x8A0


class CBodyComponent : public CEntityComponent
{
public:

   CGameSceneNode* m_pSceneNode; // 0x8 - 0x10
   unsigned char pad_10[0x10] // 0x10 - 0x20
   CNetworkVarChainer __m_pChainEntity; // 0x20 - 0x48

}; // size - 0x50


class CBodyComponent : public CEntityComponent
{
public:

   CGameSceneNode* m_pSceneNode; // 0x8 - 0x10
   unsigned char pad_10[0x10] // 0x10 - 0x20
   CNetworkVarChainer __m_pChainEntity; // 0x20 - 0x48

}; // size - 0x50


class C_DynamicProp : public C_BreakableProp
{
public:

   bool m_bUseHitboxesForRenderBox; // 0xAE8 - 0xAE9
   bool m_bUseAnimGraph; // 0xAE9 - 0xAEA
   unsigned char pad_AEA[0x6] // 0xAEA - 0xAF0
   CEntityIOOutput m_pOutputAnimBegun; // 0xAF0 - 0xB18
   CEntityIOOutput m_pOutputAnimOver; // 0xB18 - 0xB40
   CEntityIOOutput m_pOutputAnimLoopCycleOver; // 0xB40 - 0xB68
   CEntityIOOutput m_OnAnimReachedStart; // 0xB68 - 0xB90
   CEntityIOOutput m_OnAnimReachedEnd; // 0xB90 - 0xBB8
   CUtlSymbolLarge m_iszDefaultAnim; // 0xBB8 - 0xBC0
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0xBC0 - 0xBC4
   bool m_bAnimateOnServer; // 0xBC4 - 0xBC5
   bool m_bRandomizeCycle; // 0xBC5 - 0xBC6
   bool m_bStartDisabled; // 0xBC6 - 0xBC7
   bool m_bScriptedMovement; // 0xBC7 - 0xBC8
   bool m_bFiredStartEndOutput; // 0xBC8 - 0xBC9
   bool m_bForceNpcExclude; // 0xBC9 - 0xBCA
   bool m_bCreateNonSolid; // 0xBCA - 0xBCB
   bool m_bIsOverrideProp; // 0xBCB - 0xBCC
   int32_t m_iInitialGlowState; // 0xBCC - 0xBD0
   int32_t m_nGlowRange; // 0xBD0 - 0xBD4
   int32_t m_nGlowRangeMin; // 0xBD4 - 0xBD8
   Color m_glowColor; // 0xBD8 - 0xBDC
   int32_t m_nGlowTeam; // 0xBDC - 0xBE0
   int32_t m_iCachedFrameCount; // 0xBE0 - 0xBE4
   Vector m_vecCachedRenderMins; // 0xBE4 - 0xBF0
   Vector m_vecCachedRenderMaxs; // 0xBF0 - 0xBFC

}; // size - 0xC00


class CBasePropDoor : public CDynamicProp
{
public:

   float m_flAutoReturnDelay; // 0xAA8 - 0xAAC
   unsigned char pad_AAC[0x4] // 0xAAC - 0xAB0
   CUtlVector< CHandle< CBasePropDoor > > m_hDoorList; // 0xAB0 - 0xAC8
   int32_t m_nHardwareType; // 0xAC8 - 0xACC
   bool m_bNeedsHardware; // 0xACC - 0xACD
   unsigned char pad_ACD[0x3] // 0xACD - 0xAD0
   DoorState_t m_eDoorState; // 0xAD0 - 0xAD4
   bool m_bLocked; // 0xAD4 - 0xAD5
   unsigned char pad_AD5[0x3] // 0xAD5 - 0xAD8
   Vector m_closedPosition; // 0xAD8 - 0xAE4
   QAngle m_closedAngles; // 0xAE4 - 0xAF0
   CHandle< CBaseEntity > m_hBlocker; // 0xAF0 - 0xAF4
   bool m_bFirstBlocked; // 0xAF4 - 0xAF5
   unsigned char pad_AF5[0x3] // 0xAF5 - 0xAF8
   locksound_t m_ls; // 0xAF8 - 0xB18
   bool m_bForceClosed; // 0xB18 - 0xB19
   unsigned char pad_B19[0x3] // 0xB19 - 0xB1C
   Vector m_vecLatchWorldPosition; // 0xB1C - 0xB28
   CHandle< CBaseEntity > m_hActivator; // 0xB28 - 0xB2C
   unsigned char pad_B2C[0x8] // 0xB2C - 0xB34
   uint32_t m_sndParamAngularSpeed; // 0xB34 - 0xB38
   CUtlSymbolLarge m_SoundMoving; // 0xB38 - 0xB40
   CUtlSymbolLarge m_SoundOpen; // 0xB40 - 0xB48
   CUtlSymbolLarge m_SoundClose; // 0xB48 - 0xB50
   CUtlSymbolLarge m_SoundLock; // 0xB50 - 0xB58
   CUtlSymbolLarge m_SoundUnlock; // 0xB58 - 0xB60
   CUtlSymbolLarge m_SoundLatch; // 0xB60 - 0xB68
   CUtlSymbolLarge m_SoundPound; // 0xB68 - 0xB70
   CUtlSymbolLarge m_SoundJiggle; // 0xB70 - 0xB78
   CUtlSymbolLarge m_SoundLockedAnim; // 0xB78 - 0xB80
   int32_t m_numCloseAttempts; // 0xB80 - 0xB84
   CUtlStringToken m_nPhysicsMaterial; // 0xB84 - 0xB88
   CUtlSymbolLarge m_SlaveName; // 0xB88 - 0xB90
   CHandle< CBasePropDoor > m_hMaster; // 0xB90 - 0xB94
   unsigned char pad_B94[0x4] // 0xB94 - 0xB98
   CEntityIOOutput m_OnBlockedClosing; // 0xB98 - 0xBC0
   CEntityIOOutput m_OnBlockedOpening; // 0xBC0 - 0xBE8
   CEntityIOOutput m_OnUnblockedClosing; // 0xBE8 - 0xC10
   CEntityIOOutput m_OnUnblockedOpening; // 0xC10 - 0xC38
   CEntityIOOutput m_OnFullyClosed; // 0xC38 - 0xC60
   CEntityIOOutput m_OnFullyOpen; // 0xC60 - 0xC88
   CEntityIOOutput m_OnClose; // 0xC88 - 0xCB0
   CEntityIOOutput m_OnOpen; // 0xCB0 - 0xCD8
   CEntityIOOutput m_OnLockedUse; // 0xCD8 - 0xD00
   CEntityIOOutput m_OnAjarOpen; // 0xD00 - 0xD28

}; // size - 0xD28


class CBaseRendererSource2 : public CParticleFunctionRenderer
{
public:

   CParticleCollectionFloatInput m_flRadiusScale; // 0x230 - 0x368
   CParticleCollectionFloatInput m_flAlphaScale; // 0x368 - 0x4A0
   CParticleCollectionFloatInput m_flRollScale; // 0x4A0 - 0x5D8
   ParticleAttributeIndex_t m_nAlpha2Field; // 0x5D8 - 0x5DC
   unsigned char pad_5DC[0x4] // 0x5DC - 0x5E0
   CParticleCollectionVecInput m_vecColorScale; // 0x5E0 - 0xBA8
   ParticleColorBlendType_t m_nColorBlendType; // 0xBA8 - 0xBAC
   SpriteCardShaderType_t m_nShaderType; // 0xBAC - 0xBB0
   CUtlString m_strShaderOverride; // 0xBB0 - 0xBB8
   CParticleCollectionFloatInput m_flCenterXOffset; // 0xBB8 - 0xCF0
   CParticleCollectionFloatInput m_flCenterYOffset; // 0xCF0 - 0xE28
   float m_flBumpStrength; // 0xE28 - 0xE2C
   ParticleSequenceCropOverride_t m_nCropTextureOverride; // 0xE2C - 0xE30
   CUtlVector< TextureGroup_t > m_vecTexturesInput; // 0xE30 - 0xE48
   float m_flAnimationRate; // 0xE48 - 0xE4C
   AnimationType_t m_nAnimationType; // 0xE4C - 0xE50
   bool m_bAnimateInFPS; // 0xE50 - 0xE51
   unsigned char pad_E51[0x7] // 0xE51 - 0xE58
   CParticleCollectionFloatInput m_flSelfIllumAmount; // 0xE58 - 0xF90
   CParticleCollectionFloatInput m_flDiffuseAmount; // 0xF90 - 0x10C8
   int32_t m_nLightingControlPoint; // 0x10C8 - 0x10CC
   ParticleAttributeIndex_t m_nSelfIllumPerParticle; // 0x10CC - 0x10D0
   ParticleOutputBlendMode_t m_nOutputBlendMode; // 0x10D0 - 0x10D4
   bool m_bGammaCorrectVertexColors; // 0x10D4 - 0x10D5
   bool m_bSaturateColorPreAlphaBlend; // 0x10D5 - 0x10D6
   unsigned char pad_10D6[0x2] // 0x10D6 - 0x10D8
   CParticleCollectionFloatInput m_flAddSelfAmount; // 0x10D8 - 0x1210
   CParticleCollectionFloatInput m_flDesaturation; // 0x1210 - 0x1348
   CParticleCollectionFloatInput m_flOverbrightFactor; // 0x1348 - 0x1480
   int32_t m_nHSVShiftControlPoint; // 0x1480 - 0x1484
   ParticleFogType_t m_nFogType; // 0x1484 - 0x1488
   bool m_bTintByFOW; // 0x1488 - 0x1489
   bool m_bTintByGlobalLight; // 0x1489 - 0x148A
   unsigned char pad_148A[0x2] // 0x148A - 0x148C
   SpriteCardPerParticleScale_t m_nPerParticleAlphaReference; // 0x148C - 0x1490
   SpriteCardPerParticleScale_t m_nPerParticleAlphaRefWindow; // 0x1490 - 0x1494
   ParticleAlphaReferenceType_t m_nAlphaReferenceType; // 0x1494 - 0x1498
   CParticleCollectionFloatInput m_flAlphaReferenceSoftness; // 0x1498 - 0x15D0
   CParticleCollectionFloatInput m_flSourceAlphaValueToMapToZero; // 0x15D0 - 0x1708
   CParticleCollectionFloatInput m_flSourceAlphaValueToMapToOne; // 0x1708 - 0x1840
   bool m_bRefract; // 0x1840 - 0x1841
   bool m_bRefractSolid; // 0x1841 - 0x1842
   unsigned char pad_1842[0x6] // 0x1842 - 0x1848
   CParticleCollectionFloatInput m_flRefractAmount; // 0x1848 - 0x1980
   int32_t m_nRefractBlurRadius; // 0x1980 - 0x1984
   BlurFilterType_t m_nRefractBlurType; // 0x1984 - 0x1988
   bool m_bOnlyRenderInEffectsBloomPass; // 0x1988 - 0x1989
   bool m_bOnlyRenderInEffectsWaterPass; // 0x1989 - 0x198A
   bool m_bUseMixedResolutionRendering; // 0x198A - 0x198B
   bool m_bOnlyRenderInEffecsGameOverlay; // 0x198B - 0x198C
   char m_stencilTestID[128]; // 0x198C - 0x1A0C
   bool m_bStencilTestExclude; // 0x1A0C - 0x1A0D
   char m_stencilWriteID[128]; // 0x1A0D - 0x1A8D
   bool m_bWriteStencilOnDepthPass; // 0x1A8D - 0x1A8E
   bool m_bWriteStencilOnDepthFail; // 0x1A8E - 0x1A8F
   bool m_bReverseZBuffering; // 0x1A8F - 0x1A90
   bool m_bDisableZBuffering; // 0x1A90 - 0x1A91
   unsigned char pad_1A91[0x3] // 0x1A91 - 0x1A94
   ParticleDepthFeatheringMode_t m_nFeatheringMode; // 0x1A94 - 0x1A98
   CParticleCollectionFloatInput m_flFeatheringMinDist; // 0x1A98 - 0x1BD0
   CParticleCollectionFloatInput m_flFeatheringMaxDist; // 0x1BD0 - 0x1D08
   CParticleCollectionFloatInput m_flFeatheringFilter; // 0x1D08 - 0x1E40
   float m_flDepthBias; // 0x1E40 - 0x1E44
   ParticleSortingChoiceList_t m_nSortMethod; // 0x1E44 - 0x1E48
   bool m_bBlendFramesSeq0; // 0x1E48 - 0x1E49
   bool m_bMaxLuminanceBlendingSequence0; // 0x1E49 - 0x1E4A

}; // size - 0x2050


class CFuncPlat : public CBasePlatTrain
{
public:

   CUtlSymbolLarge m_sNoise; // 0x798 - 0x7A0

}; // size - 0x7A0


class CLightEntity : public CBaseModelEntity
{
public:

   CLightComponent* m_CLightComponent; // 0x6F0 - 0x6F8

}; // size - 0x6F8


class CMarkupVolumeTagged : public CMarkupVolume
{
public:

   bool m_bIsGroup; // 0x728 - 0x729
   bool m_bGroupByPrefab; // 0x729 - 0x72A
   bool m_bGroupByVolume; // 0x72A - 0x72B
   bool m_bGroupOtherGroups; // 0x72B - 0x72C
   bool m_bIsInGroup; // 0x72C - 0x72D

}; // size - 0x730


class C_LightEntity : public C_BaseModelEntity
{
public:

   CLightComponent* m_CLightComponent; // 0x838 - 0x840

}; // size - 0x840


class CAnimActionBase
{
public:


}; // size - 0x28


class CAnimActionUpdater
{
public:


}; // size - 0x18


class CBasePlayerPawn : public CBaseCombatCharacter
{
public:

   CPlayer_WeaponServices* m_pWeaponServices; // 0x968 - 0x970
   CPlayer_ItemServices* m_pItemServices; // 0x970 - 0x978
   CPlayer_AutoaimServices* m_pAutoaimServices; // 0x978 - 0x980
   CPlayer_ObserverServices* m_pObserverServices; // 0x980 - 0x988
   CPlayer_WaterServices* m_pWaterServices; // 0x988 - 0x990
   CPlayer_UseServices* m_pUseServices; // 0x990 - 0x998
   CPlayer_FlashlightServices* m_pFlashlightServices; // 0x998 - 0x9A0
   CPlayer_CameraServices* m_pCameraServices; // 0x9A0 - 0x9A8
   CPlayer_MovementServices* m_pMovementServices; // 0x9A8 - 0x9B0
   unsigned char pad_9B0[0x8] // 0x9B0 - 0x9B8
   QAngle v_angle; // 0x9B8 - 0x9C4
   unsigned char pad_9C4[0x10] // 0x9C4 - 0x9D4
   uint32_t m_iHideHUD; // 0x9D4 - 0x9D8
   sky3dparams_t m_skybox3d; // 0x9D8 - 0xA68
   GameTime_t m_fTimeLastHurt; // 0xA68 - 0xA6C
   GameTime_t m_flDeathTime; // 0xA6C - 0xA70
   GameTime_t m_fNextSuicideTime; // 0xA70 - 0xA74
   bool m_fInitHUD; // 0xA74 - 0xA75
   unsigned char pad_A75[0x3] // 0xA75 - 0xA78
   GameTime_t m_flNextDecalTime; // 0xA78 - 0xA7C
   unsigned char pad_A7C[0x4] // 0xA7C - 0xA80
   CAI_Expresser* m_pExpresser; // 0xA80 - 0xA88
   CHandle< CBasePlayerController > m_hController; // 0xA88 - 0xA8C
   unsigned char pad_A8C[0x4] // 0xA8C - 0xA90
   float m_fHltvReplayDelay; // 0xA90 - 0xA94
   float m_fHltvReplayEnd; // 0xA94 - 0xA98
   CEntityIndex m_iHltvReplayEntity; // 0xA98 - 0xA9C

}; // size - 0xAA0


class CParticleFunctionEmitter : public CParticleFunction
{
public:

   int32_t m_nEmitterIndex; // 0x1E8 - 0x1EC

}; // size - 0x1F0


class CSprite : public CBaseModelEntity
{
public:

   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hSpriteMaterial; // 0x6F0 - 0x6F8
   CHandle< CBaseEntity > m_hAttachedToEntity; // 0x6F8 - 0x6FC
   AttachmentHandle_t m_nAttachment; // 0x6FC - 0x6FD
   unsigned char pad_6FD[0x3] // 0x6FD - 0x700
   float m_flSpriteFramerate; // 0x700 - 0x704
   float m_flFrame; // 0x704 - 0x708
   GameTime_t m_flDieTime; // 0x708 - 0x70C
   unsigned char pad_70C[0xC] // 0x70C - 0x718
   uint32_t m_nBrightness; // 0x718 - 0x71C
   float m_flBrightnessDuration; // 0x71C - 0x720
   float m_flSpriteScale; // 0x720 - 0x724
   float m_flScaleDuration; // 0x724 - 0x728
   bool m_bWorldSpaceScale; // 0x728 - 0x729
   unsigned char pad_729[0x3] // 0x729 - 0x72C
   float m_flGlowProxySize; // 0x72C - 0x730
   float m_flHDRColorScale; // 0x730 - 0x734
   GameTime_t m_flLastTime; // 0x734 - 0x738
   float m_flMaxFrame; // 0x738 - 0x73C
   float m_flStartScale; // 0x73C - 0x740
   float m_flDestScale; // 0x740 - 0x744
   GameTime_t m_flScaleTimeStart; // 0x744 - 0x748
   int32_t m_nStartBrightness; // 0x748 - 0x74C
   int32_t m_nDestBrightness; // 0x74C - 0x750
   GameTime_t m_flBrightnessTimeStart; // 0x750 - 0x754
   int32_t m_nSpriteWidth; // 0x754 - 0x758
   int32_t m_nSpriteHeight; // 0x758 - 0x75C

}; // size - 0x760


class C_BaseCSGrenadeProjectile : public C_BaseGrenade
{
public:

   Vector m_vInitialVelocity; // 0xB78 - 0xB84
   int32_t m_nBounces; // 0xB84 - 0xB88
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_nExplodeEffectIndex; // 0xB88 - 0xB90
   int32_t m_nExplodeEffectTickBegin; // 0xB90 - 0xB94
   Vector m_vecExplodeEffectOrigin; // 0xB94 - 0xBA0
   GameTime_t m_flSpawnTime; // 0xBA0 - 0xBA4
   Vector vecLastTrailLinePos; // 0xBA4 - 0xBB0
   GameTime_t flNextTrailLineTime; // 0xBB0 - 0xBB4
   bool m_bExplodeEffectBegan; // 0xBB4 - 0xBB5
   bool m_bCanCreateGrenadeTrail; // 0xBB5 - 0xBB6
   unsigned char pad_BB6[0x2] // 0xBB6 - 0xBB8
   ParticleIndex_t m_nSnapshotTrajectoryEffectIndex; // 0xBB8 - 0xBBC
   unsigned char pad_BBC[0x4] // 0xBBC - 0xBC0
   CStrongHandle< InfoForResourceTypeIParticleSnapshot > m_hSnapshotTrajectoryParticleSnapshot; // 0xBC0 - 0xBC8
   CUtlVector< Vector > m_arrTrajectoryTrailPoints; // 0xBC8 - 0xBE0
   CUtlVector< float32 > m_arrTrajectoryTrailPointCreationTimes; // 0xBE0 - 0xBF8
   float m_flTrajectoryTrailEffectCreationTime; // 0xBF8 - 0xBFC

}; // size - 0xC00


class C_CSGO_TeamPreviewCamera : public C_CSGO_MapPreviewCameraPath
{
public:

   bool m_bDofEnabled; // 0x598 - 0x599
   unsigned char pad_599[0x3] // 0x599 - 0x59C
   float m_flDofNearBlurry; // 0x59C - 0x5A0
   float m_flDofNearCrisp; // 0x5A0 - 0x5A4
   float m_flDofFarCrisp; // 0x5A4 - 0x5A8
   float m_flDofFarBlurry; // 0x5A8 - 0x5AC
   float m_flDofTiltToGround; // 0x5AC - 0x5B0

}; // size - 0x5B0


class C_CSPlayerPawn : public C_CSPlayerPawnBase
{
public:

   CCSPlayer_BulletServices* m_pBulletServices; // 0x12A0 - 0x12A8
   CCSPlayer_HostageServices* m_pHostageServices; // 0x12A8 - 0x12B0
   CCSPlayer_GlowServices* m_pGlowServices; // 0x12B0 - 0x12B8
   bool m_bIsBuyMenuOpen; // 0x12B8 - 0x12B9
   unsigned char pad_12B9[0xCF] // 0x12B9 - 0x1388
   int32_t m_iRetakesOffering; // 0x1388 - 0x138C
   int32_t m_iRetakesOfferingCard; // 0x138C - 0x1390
   bool m_bRetakesHasDefuseKit; // 0x1390 - 0x1391
   bool m_bRetakesMVPLastRound; // 0x1391 - 0x1392
   unsigned char pad_1392[0x2] // 0x1392 - 0x1394
   int32_t m_iRetakesMVPBoostItem; // 0x1394 - 0x1398
   loadout_positions_t m_RetakesMVPBoostExtraUtility; // 0x1398 - 0x139C
   unsigned char pad_139C[0x10] // 0x139C - 0x13AC
   bool m_bNeedToReApplyGloves; // 0x13AC - 0x13AD
   unsigned char pad_13AD[0x3] // 0x13AD - 0x13B0
   C_EconItemView m_EconGloves; // 0x13B0 - 0x17F8
   bool m_bMustSyncRagdollState; // 0x17F8 - 0x17F9
   unsigned char pad_17F9[0x3] // 0x17F9 - 0x17FC
   int32_t m_nRagdollDamageBone; // 0x17FC - 0x1800
   Vector m_vRagdollDamageForce; // 0x1800 - 0x180C
   Vector m_vRagdollDamagePosition; // 0x180C - 0x1818
   char m_szRagdollDamageWeaponName[64]; // 0x1818 - 0x1858
   bool m_bRagdollDamageHeadshot; // 0x1858 - 0x1859
   unsigned char pad_1859[0x127] // 0x1859 - 0x1980
   bool m_bLastHeadBoneTransformIsValid; // 0x1980 - 0x1981
   unsigned char pad_1981[0x1B] // 0x1981 - 0x199C
   QAngle m_qDeathEyeAngles; // 0x199C - 0x19A8

}; // size - 0x19A8


class C_PhysicsPropMultiplayer : public C_PhysicsProp
{
public:


}; // size - 0xAF0


class RnShapeDesc_t
{
public:

   uint32_t m_nCollisionAttributeIndex; // 0x0 - 0x4
   uint32_t m_nSurfacePropertyIndex; // 0x4 - 0x8
   CUtlString m_UserFriendlyName; // 0x8 - 0x10

}; // size - 0x10


class CBaseButton : public CBaseToggle
{
public:

   QAngle m_angMoveEntitySpace; // 0x770 - 0x77C
   bool m_fStayPushed; // 0x77C - 0x77D
   bool m_fRotating; // 0x77D - 0x77E
   unsigned char pad_77E[0x2] // 0x77E - 0x780
   locksound_t m_ls; // 0x780 - 0x7A0
   CUtlSymbolLarge m_sUseSound; // 0x7A0 - 0x7A8
   CUtlSymbolLarge m_sLockedSound; // 0x7A8 - 0x7B0
   CUtlSymbolLarge m_sUnlockedSound; // 0x7B0 - 0x7B8
   bool m_bLocked; // 0x7B8 - 0x7B9
   bool m_bDisabled; // 0x7B9 - 0x7BA
   unsigned char pad_7BA[0x2] // 0x7BA - 0x7BC
   GameTime_t m_flUseLockedTime; // 0x7BC - 0x7C0
   bool m_bSolidBsp; // 0x7C0 - 0x7C1
   unsigned char pad_7C1[0x7] // 0x7C1 - 0x7C8
   CEntityIOOutput m_OnDamaged; // 0x7C8 - 0x7F0
   CEntityIOOutput m_OnPressed; // 0x7F0 - 0x818
   CEntityIOOutput m_OnUseLocked; // 0x818 - 0x840
   CEntityIOOutput m_OnIn; // 0x840 - 0x868
   CEntityIOOutput m_OnOut; // 0x868 - 0x890
   int32_t m_nState; // 0x890 - 0x894
   CEntityHandle m_hConstraint; // 0x894 - 0x898
   CEntityHandle m_hConstraintParent; // 0x898 - 0x89C
   bool m_bForceNpcExclude; // 0x89C - 0x89D
   unsigned char pad_89D[0x3] // 0x89D - 0x8A0
   CUtlSymbolLarge m_sGlowEntity; // 0x8A0 - 0x8A8
   CHandle< CBaseModelEntity > m_glowEntity; // 0x8A8 - 0x8AC
   bool m_usable; // 0x8AC - 0x8AD
   unsigned char pad_8AD[0x3] // 0x8AD - 0x8B0
   CUtlSymbolLarge m_szDisplayText; // 0x8B0 - 0x8B8

}; // size - 0x8B8


class CSoundOpvarSetPointEntity : public CSoundOpvarSetPointBase
{
public:

   CEntityIOOutput m_OnEnter; // 0x538 - 0x560
   CEntityIOOutput m_OnExit; // 0x560 - 0x588
   bool m_bAutoDisable; // 0x588 - 0x589
   unsigned char pad_589[0x43] // 0x589 - 0x5CC
   float m_flDistanceMin; // 0x5CC - 0x5D0
   float m_flDistanceMax; // 0x5D0 - 0x5D4
   float m_flDistanceMapMin; // 0x5D4 - 0x5D8
   float m_flDistanceMapMax; // 0x5D8 - 0x5DC
   float m_flOcclusionRadius; // 0x5DC - 0x5E0
   float m_flOcclusionMin; // 0x5E0 - 0x5E4
   float m_flOcclusionMax; // 0x5E4 - 0x5E8
   float m_flValSetOnDisable; // 0x5E8 - 0x5EC
   bool m_bSetValueOnDisable; // 0x5EC - 0x5ED
   unsigned char pad_5ED[0x3] // 0x5ED - 0x5F0
   int32_t m_nSimulationMode; // 0x5F0 - 0x5F4
   int32_t m_nVisibilitySamples; // 0x5F4 - 0x5F8
   Vector m_vDynamicProxyPoint; // 0x5F8 - 0x604
   float m_flDynamicMaximumOcclusion; // 0x604 - 0x608
   CEntityHandle m_hDynamicEntity; // 0x608 - 0x60C
   unsigned char pad_60C[0x4] // 0x60C - 0x610
   CUtlSymbolLarge m_iszDynamicEntityName; // 0x610 - 0x618
   float m_flPathingDistanceNormFactor; // 0x618 - 0x61C
   Vector m_vPathingSourcePos; // 0x61C - 0x628
   Vector m_vPathingListenerPos; // 0x628 - 0x634

}; // size - 0x638


class C_SoundOpvarSetPointEntity : public C_SoundOpvarSetPointBase
{
public:


}; // size - 0x558


class CBinaryUpdateNode : public CAnimUpdateNodeBase
{
public:

   CAnimUpdateNodeRef m_pChild1; // 0x58 - 0x68
   CAnimUpdateNodeRef m_pChild2; // 0x68 - 0x78
   BinaryNodeTiming m_timingBehavior; // 0x78 - 0x7C
   float m_flTimingBlend; // 0x7C - 0x80
   bool m_bResetChild1; // 0x80 - 0x81
   bool m_bResetChild2; // 0x81 - 0x82

}; // size - 0x88


class CGeneralRandomRotation : public CParticleFunctionInitializer
{
public:

   ParticleAttributeIndex_t m_nFieldOutput; // 0x1F0 - 0x1F4
   float m_flDegrees; // 0x1F4 - 0x1F8
   float m_flDegreesMin; // 0x1F8 - 0x1FC
   float m_flDegreesMax; // 0x1FC - 0x200
   float m_flRotationRandExponent; // 0x200 - 0x204
   bool m_bRandomlyFlipDirection; // 0x204 - 0x205

}; // size - 0x210


class CGlowOverlay
{
public:

   Vector m_vPos; // 0x8 - 0x14
   bool m_bDirectional; // 0x14 - 0x15
   unsigned char pad_15[0x3] // 0x15 - 0x18
   Vector m_vDirection; // 0x18 - 0x24
   bool m_bInSky; // 0x24 - 0x25
   unsigned char pad_25[0x3] // 0x25 - 0x28
   float m_skyObstructionScale; // 0x28 - 0x2C
   unsigned char pad_2C[0x4] // 0x2C - 0x30
   CGlowSprite m_Sprites[4]; // 0x30 - 0xB0
   int32_t m_nSprites; // 0xB0 - 0xB4
   float m_flProxyRadius; // 0xB4 - 0xB8
   float m_flHDRColorScale; // 0xB8 - 0xBC
   float m_flGlowObstructionScale; // 0xBC - 0xC0
   bool m_bCacheGlowObstruction; // 0xC0 - 0xC1
   bool m_bCacheSkyObstruction; // 0xC1 - 0xC2
   int16_t m_bActivated; // 0xC2 - 0xC4
   uint16_t m_ListIndex; // 0xC4 - 0xC6
   unsigned char pad_C6[0x2] // 0xC6 - 0xC8
   int32_t m_queryHandle; // 0xC8 - 0xCC

}; // size - 0xD0


class CParticleFloatInput
{
public:

   ParticleFloatType_t m_nType; // 0x0 - 0x4
   ParticleFloatMapType_t m_nMapType; // 0x4 - 0x8
   float m_flLiteralValue; // 0x8 - 0xC
   unsigned char pad_C[0x4] // 0xC - 0x10
   CKV3MemberNameWithStorage m_NamedValue; // 0x10 - 0x48
   int32_t m_nControlPoint; // 0x48 - 0x4C
   ParticleAttributeIndex_t m_nScalarAttribute; // 0x4C - 0x50
   ParticleAttributeIndex_t m_nVectorAttribute; // 0x50 - 0x54
   int32_t m_nVectorComponent; // 0x54 - 0x58
   float m_flRandomMin; // 0x58 - 0x5C
   float m_flRandomMax; // 0x5C - 0x60
   bool m_bHasRandomSignFlip; // 0x60 - 0x61
   unsigned char pad_61[0x3] // 0x61 - 0x64
   ParticleFloatRandomMode_t m_nRandomMode; // 0x64 - 0x68
   unsigned char pad_68[0x4] // 0x68 - 0x6C
   float m_flLOD0; // 0x6C - 0x70
   float m_flLOD1; // 0x70 - 0x74
   float m_flLOD2; // 0x74 - 0x78
   float m_flLOD3; // 0x78 - 0x7C
   ParticleAttributeIndex_t m_nNoiseInputVectorAttribute; // 0x7C - 0x80
   float m_flNoiseOutputMin; // 0x80 - 0x84
   float m_flNoiseOutputMax; // 0x84 - 0x88
   float m_flNoiseScale; // 0x88 - 0x8C
   Vector m_vecNoiseOffsetRate; // 0x8C - 0x98
   float m_flNoiseOffset; // 0x98 - 0x9C
   int32_t m_nNoiseOctaves; // 0x9C - 0xA0
   PFNoiseTurbulence_t m_nNoiseTurbulence; // 0xA0 - 0xA4
   PFNoiseType_t m_nNoiseType; // 0xA4 - 0xA8
   PFNoiseModifier_t m_nNoiseModifier; // 0xA8 - 0xAC
   float m_flNoiseTurbulenceScale; // 0xAC - 0xB0
   float m_flNoiseTurbulenceMix; // 0xB0 - 0xB4
   float m_flNoiseImgPreviewScale; // 0xB4 - 0xB8
   bool m_bNoiseImgPreviewLive; // 0xB8 - 0xB9
   unsigned char pad_B9[0x7] // 0xB9 - 0xC0
   ParticleFloatInputMode_t m_nInputMode; // 0xC0 - 0xC4
   float m_flMultFactor; // 0xC4 - 0xC8
   float m_flInput0; // 0xC8 - 0xCC
   float m_flInput1; // 0xCC - 0xD0
   float m_flOutput0; // 0xD0 - 0xD4
   float m_flOutput1; // 0xD4 - 0xD8
   float m_flNotchedRangeMin; // 0xD8 - 0xDC
   float m_flNotchedRangeMax; // 0xDC - 0xE0
   float m_flNotchedOutputOutside; // 0xE0 - 0xE4
   float m_flNotchedOutputInside; // 0xE4 - 0xE8
   ParticleFloatBiasType_t m_nBiasType; // 0xE8 - 0xEC
   float m_flBiasParameter; // 0xEC - 0xF0
   CPiecewiseCurve m_Curve; // 0xF0 - 0x130

}; // size - 0x138


class CPhysPropLootCrate : public CBrBaseItem
{
public:

   bool m_bRenderInPSPM; // 0xB28 - 0xB29
   bool m_bRenderInTablet; // 0xB29 - 0xB2A
   unsigned char pad_B2A[0x2] // 0xB2A - 0xB2C
   GameTime_t m_flSpawnTime; // 0xB2C - 0xB30
   bool m_bTakeDamageFromDangerZone; // 0xB30 - 0xB31
   unsigned char pad_B31[0x7] // 0xB31 - 0xB38
   char* m_pszCrateName; // 0xB38 - 0xB40
   CHandle< CBasePlayerPawn > m_hCrateOwner; // 0xB40 - 0xB44
   bool m_bOwnedByPlayer; // 0xB44 - 0xB45
   unsigned char pad_B45[0x3] // 0xB45 - 0xB48
   float m_flDampingOriginalSpeed; // 0xB48 - 0xB4C
   float m_flDampingOriginalRot; // 0xB4C - 0xB50

}; // size - 0xB50


class CPhysPropWeaponUpgradeTablet : public CPhysPropWeaponUpgrade
{
public:


}; // size - 0xB30


class CRulePointEntity : public CRuleEntity
{
public:

   int32_t m_Score; // 0x6F8 - 0x6FC

}; // size - 0x700


class CSoundEventEntity : public CBaseEntity
{
public:

   bool m_bStartOnSpawn; // 0x4A0 - 0x4A1
   bool m_bToLocalPlayer; // 0x4A1 - 0x4A2
   bool m_bStopOnNew; // 0x4A2 - 0x4A3
   bool m_bSaveRestore; // 0x4A3 - 0x4A4
   bool m_bSavedIsPlaying; // 0x4A4 - 0x4A5
   unsigned char pad_4A5[0x3] // 0x4A5 - 0x4A8
   float m_flSavedElapsedTime; // 0x4A8 - 0x4AC
   unsigned char pad_4AC[0x4] // 0x4AC - 0x4B0
   CUtlSymbolLarge m_iszSourceEntityName; // 0x4B0 - 0x4B8
   CUtlSymbolLarge m_iszAttachmentName; // 0x4B8 - 0x4C0
   CEntityOutputTemplate< uint64 > m_onGUIDChanged; // 0x4C0 - 0x4E8
   CEntityIOOutput m_onSoundFinished; // 0x4E8 - 0x510
   unsigned char pad_510[0x20] // 0x510 - 0x530
   CUtlSymbolLarge m_iszSoundName; // 0x530 - 0x538
   unsigned char pad_538[0x8] // 0x538 - 0x540
   CEntityHandle m_hSource; // 0x540 - 0x544

}; // size - 0x548


class CStopwatchBase : public CSimpleSimTimer
{
public:

   bool m_fIsRunning; // 0x8 - 0x9

}; // size - 0xC


class C_INIT_RandomNamedModelElement : public CParticleFunctionInitializer
{
public:

   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1F0 - 0x1F8
   CUtlVector< CUtlString > m_names; // 0x1F8 - 0x210
   bool m_bShuffle; // 0x210 - 0x211
   bool m_bLinear; // 0x211 - 0x212
   bool m_bModelFromRenderer; // 0x212 - 0x213
   unsigned char pad_213[0x1] // 0x213 - 0x214
   ParticleAttributeIndex_t m_nFieldOutput; // 0x214 - 0x218

}; // size - 0x220


class C_INIT_RemapNamedModelElementToScalar : public CParticleFunctionInitializer
{
public:

   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1F0 - 0x1F8
   CUtlVector< CUtlString > m_names; // 0x1F8 - 0x210
   CUtlVector< float32 > m_values; // 0x210 - 0x228
   ParticleAttributeIndex_t m_nFieldInput; // 0x228 - 0x22C
   ParticleAttributeIndex_t m_nFieldOutput; // 0x22C - 0x230
   ParticleSetMethod_t m_nSetMethod; // 0x230 - 0x234
   bool m_bModelFromRenderer; // 0x234 - 0x235

}; // size - 0x240


class C_INIT_RemapParticleCountToNamedModelElementScalar : public C_INIT_RemapParticleCountToScalar
{
public:

   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x220 - 0x228
   CUtlString m_outputMinName; // 0x228 - 0x230
   CUtlString m_outputMaxName; // 0x230 - 0x238
   bool m_bModelFromRenderer; // 0x238 - 0x239

}; // size - 0x240


class C_ModelPointEntity : public C_BaseModelEntity
{
public:


}; // size - 0x838


class C_OP_RemapNamedModelElementEndCap : public CParticleFunctionOperator
{
public:

   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1F0 - 0x1F8
   CUtlVector< CUtlString > m_inNames; // 0x1F8 - 0x210
   CUtlVector< CUtlString > m_outNames; // 0x210 - 0x228
   CUtlVector< CUtlString > m_fallbackNames; // 0x228 - 0x240
   bool m_bModelFromRenderer; // 0x240 - 0x241
   unsigned char pad_241[0x3] // 0x241 - 0x244
   ParticleAttributeIndex_t m_nFieldInput; // 0x244 - 0x248
   ParticleAttributeIndex_t m_nFieldOutput; // 0x248 - 0x24C

}; // size - 0x250


class C_OP_RemapNamedModelElementOnceTimed : public CParticleFunctionOperator
{
public:

   CStrongHandle< InfoForResourceTypeCModel > m_hModel; // 0x1F0 - 0x1F8
   CUtlVector< CUtlString > m_inNames; // 0x1F8 - 0x210
   CUtlVector< CUtlString > m_outNames; // 0x210 - 0x228
   CUtlVector< CUtlString > m_fallbackNames; // 0x228 - 0x240
   bool m_bModelFromRenderer; // 0x240 - 0x241
   bool m_bProportional; // 0x241 - 0x242
   unsigned char pad_242[0x2] // 0x242 - 0x244
   ParticleAttributeIndex_t m_nFieldInput; // 0x244 - 0x248
   ParticleAttributeIndex_t m_nFieldOutput; // 0x248 - 0x24C
   float m_flRemapTime; // 0x24C - 0x250

}; // size - 0x250


class C_PointClientUIWorldPanel : public C_BaseClientUIEntity
{
public:

   bool m_bForceRecreateNextUpdate; // 0x870 - 0x871
   bool m_bMoveViewToPlayerNextThink; // 0x871 - 0x872
   bool m_bCheckCSSClasses; // 0x872 - 0x873
   unsigned char pad_873[0xD] // 0x873 - 0x880
   CTransform m_anchorDeltaTransform; // 0x880 - 0x8A0
   unsigned char pad_8A0[0x180] // 0x8A0 - 0xA20
   CPointOffScreenIndicatorUi* m_pOffScreenIndicator; // 0xA20 - 0xA28
   unsigned char pad_A28[0x20] // 0xA28 - 0xA48
   bool m_bIgnoreInput; // 0xA48 - 0xA49
   bool m_bLit; // 0xA49 - 0xA4A
   bool m_bFollowPlayerAcrossTeleport; // 0xA4A - 0xA4B
   unsigned char pad_A4B[0x1] // 0xA4B - 0xA4C
   float m_flWidth; // 0xA4C - 0xA50
   float m_flHeight; // 0xA50 - 0xA54
   float m_flDPI; // 0xA54 - 0xA58
   float m_flInteractDistance; // 0xA58 - 0xA5C
   float m_flDepthOffset; // 0xA5C - 0xA60
   uint32_t m_unOwnerContext; // 0xA60 - 0xA64
   uint32_t m_unHorizontalAlign; // 0xA64 - 0xA68
   uint32_t m_unVerticalAlign; // 0xA68 - 0xA6C
   uint32_t m_unOrientation; // 0xA6C - 0xA70
   bool m_bAllowInteractionFromAllSceneWorlds; // 0xA70 - 0xA71
   unsigned char pad_A71[0x7] // 0xA71 - 0xA78
   C_NetworkUtlVectorBase< CUtlSymbolLarge > m_vecCSSClasses; // 0xA78 - 0xA90
   bool m_bOpaque; // 0xA90 - 0xA91
   bool m_bNoDepth; // 0xA91 - 0xA92
   bool m_bRenderBackface; // 0xA92 - 0xA93
   bool m_bUseOffScreenIndicator; // 0xA93 - 0xA94
   bool m_bExcludeFromSaveGames; // 0xA94 - 0xA95
   bool m_bGrabbable; // 0xA95 - 0xA96
   bool m_bOnlyRenderToTexture; // 0xA96 - 0xA97
   bool m_bDisableMipGen; // 0xA97 - 0xA98
   int32_t m_nExplicitImageLayout; // 0xA98 - 0xA9C

}; // size - 0xAA0


class C_Sprite : public C_BaseModelEntity
{
public:

   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hSpriteMaterial; // 0x850 - 0x858
   CHandle< C_BaseEntity > m_hAttachedToEntity; // 0x858 - 0x85C
   AttachmentHandle_t m_nAttachment; // 0x85C - 0x85D
   unsigned char pad_85D[0x3] // 0x85D - 0x860
   float m_flSpriteFramerate; // 0x860 - 0x864
   float m_flFrame; // 0x864 - 0x868
   GameTime_t m_flDieTime; // 0x868 - 0x86C
   unsigned char pad_86C[0xC] // 0x86C - 0x878
   uint32_t m_nBrightness; // 0x878 - 0x87C
   float m_flBrightnessDuration; // 0x87C - 0x880
   float m_flSpriteScale; // 0x880 - 0x884
   float m_flScaleDuration; // 0x884 - 0x888
   bool m_bWorldSpaceScale; // 0x888 - 0x889
   unsigned char pad_889[0x3] // 0x889 - 0x88C
   float m_flGlowProxySize; // 0x88C - 0x890
   float m_flHDRColorScale; // 0x890 - 0x894
   GameTime_t m_flLastTime; // 0x894 - 0x898
   float m_flMaxFrame; // 0x898 - 0x89C
   float m_flStartScale; // 0x89C - 0x8A0
   float m_flDestScale; // 0x8A0 - 0x8A4
   GameTime_t m_flScaleTimeStart; // 0x8A4 - 0x8A8
   int32_t m_nStartBrightness; // 0x8A8 - 0x8AC
   int32_t m_nDestBrightness; // 0x8AC - 0x8B0
   GameTime_t m_flBrightnessTimeStart; // 0x8B0 - 0x8B4
   unsigned char pad_8B4[0x4] // 0x8B4 - 0x8B8
   CWeakHandle< InfoForResourceTypeIMaterial2 > m_hOldSpriteMaterial; // 0x8B8 - 0x8C0
   unsigned char pad_8C0[0xA0] // 0x8C0 - 0x960
   int32_t m_nSpriteWidth; // 0x960 - 0x964
   int32_t m_nSpriteHeight; // 0x964 - 0x968

}; // size - 0x968


class CAI_Expresser
{
public:

   GameTime_t m_flStopTalkTime; // 0x38 - 0x3C
   GameTime_t m_flStopTalkTimeWithoutDelay; // 0x3C - 0x40
   GameTime_t m_flBlockedTalkTime; // 0x40 - 0x44
   int32_t m_voicePitch; // 0x44 - 0x48
   GameTime_t m_flLastTimeAcceptedSpeak; // 0x48 - 0x4C
   bool m_bAllowSpeakingInterrupts; // 0x4C - 0x4D
   bool m_bConsiderSceneInvolvementAsSpeech; // 0x4D - 0x4E
   unsigned char pad_4E[0x2] // 0x4E - 0x50
   int32_t m_nLastSpokenPriority; // 0x50 - 0x54
   unsigned char pad_54[0x4] // 0x54 - 0x58
   CBaseFlex* m_pOuter; // 0x58 - 0x60

}; // size - 0x60


class CBaseViewModel : public CBaseAnimGraph
{
public:

   Vector m_vecLastFacing; // 0x828 - 0x834
   uint32_t m_nViewModelIndex; // 0x834 - 0x838
   uint32_t m_nAnimationParity; // 0x838 - 0x83C
   float m_flAnimationStartTime; // 0x83C - 0x840
   CHandle< CBasePlayerWeapon > m_hWeapon; // 0x840 - 0x844
   unsigned char pad_844[0x4] // 0x844 - 0x848
   CUtlSymbolLarge m_sVMName; // 0x848 - 0x850
   CUtlSymbolLarge m_sAnimationPrefix; // 0x850 - 0x858
   HSequence m_hOldLayerSequence; // 0x858 - 0x85C
   int32_t m_oldLayer; // 0x85C - 0x860
   float m_oldLayerStartTime; // 0x860 - 0x864
   CEntityHandle m_hControlPanel; // 0x864 - 0x868

}; // size - 0x868


class CBtNodeDecorator : public CBtNode
{
public:


}; // size - 0x58


class CFuncPlatRot : public CFuncPlat
{
public:

   QAngle m_end; // 0x7A0 - 0x7AC
   QAngle m_start; // 0x7AC - 0x7B8

}; // size - 0x7B8


class CHostageExpresserShim : public CBaseCombatCharacter
{
public:

   CAI_Expresser* m_pExpresser; // 0x968 - 0x970

}; // size - 0x970


class CLogicNPCCounter : public CBaseEntity
{
public:

   CEntityIOOutput m_OnMinCountAll; // 0x4A0 - 0x4C8
   CEntityIOOutput m_OnMaxCountAll; // 0x4C8 - 0x4F0
   CEntityOutputTemplate< float32 > m_OnFactorAll; // 0x4F0 - 0x518
   CEntityOutputTemplate< float32 > m_OnMinPlayerDistAll; // 0x518 - 0x540
   CEntityIOOutput m_OnMinCount_1; // 0x540 - 0x568
   CEntityIOOutput m_OnMaxCount_1; // 0x568 - 0x590
   CEntityOutputTemplate< float32 > m_OnFactor_1; // 0x590 - 0x5B8
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_1; // 0x5B8 - 0x5E0
   CEntityIOOutput m_OnMinCount_2; // 0x5E0 - 0x608
   CEntityIOOutput m_OnMaxCount_2; // 0x608 - 0x630
   CEntityOutputTemplate< float32 > m_OnFactor_2; // 0x630 - 0x658
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_2; // 0x658 - 0x680
   CEntityIOOutput m_OnMinCount_3; // 0x680 - 0x6A8
   CEntityIOOutput m_OnMaxCount_3; // 0x6A8 - 0x6D0
   CEntityOutputTemplate< float32 > m_OnFactor_3; // 0x6D0 - 0x6F8
   CEntityOutputTemplate< float32 > m_OnMinPlayerDist_3; // 0x6F8 - 0x720
   CEntityHandle m_hSource; // 0x720 - 0x724
   unsigned char pad_724[0x4] // 0x724 - 0x728
   CUtlSymbolLarge m_iszSourceEntityName; // 0x728 - 0x730
   float m_flDistanceMax; // 0x730 - 0x734
   bool m_bDisabled; // 0x734 - 0x735
   unsigned char pad_735[0x3] // 0x735 - 0x738
   int32_t m_nMinCountAll; // 0x738 - 0x73C
   int32_t m_nMaxCountAll; // 0x73C - 0x740
   int32_t m_nMinFactorAll; // 0x740 - 0x744
   int32_t m_nMaxFactorAll; // 0x744 - 0x748
   unsigned char pad_748[0x8] // 0x748 - 0x750
   CUtlSymbolLarge m_iszNPCClassname_1; // 0x750 - 0x758
   int32_t m_nNPCState_1; // 0x758 - 0x75C
   bool m_bInvertState_1; // 0x75C - 0x75D
   unsigned char pad_75D[0x3] // 0x75D - 0x760
   int32_t m_nMinCount_1; // 0x760 - 0x764
   int32_t m_nMaxCount_1; // 0x764 - 0x768
   int32_t m_nMinFactor_1; // 0x768 - 0x76C
   int32_t m_nMaxFactor_1; // 0x76C - 0x770
   unsigned char pad_770[0x4] // 0x770 - 0x774
   float m_flDefaultDist_1; // 0x774 - 0x778
   CUtlSymbolLarge m_iszNPCClassname_2; // 0x778 - 0x780
   int32_t m_nNPCState_2; // 0x780 - 0x784
   bool m_bInvertState_2; // 0x784 - 0x785
   unsigned char pad_785[0x3] // 0x785 - 0x788
   int32_t m_nMinCount_2; // 0x788 - 0x78C
   int32_t m_nMaxCount_2; // 0x78C - 0x790
   int32_t m_nMinFactor_2; // 0x790 - 0x794
   int32_t m_nMaxFactor_2; // 0x794 - 0x798
   unsigned char pad_798[0x4] // 0x798 - 0x79C
   float m_flDefaultDist_2; // 0x79C - 0x7A0
   CUtlSymbolLarge m_iszNPCClassname_3; // 0x7A0 - 0x7A8
   int32_t m_nNPCState_3; // 0x7A8 - 0x7AC
   bool m_bInvertState_3; // 0x7AC - 0x7AD
   unsigned char pad_7AD[0x3] // 0x7AD - 0x7B0
   int32_t m_nMinCount_3; // 0x7B0 - 0x7B4
   int32_t m_nMaxCount_3; // 0x7B4 - 0x7B8
   int32_t m_nMinFactor_3; // 0x7B8 - 0x7BC
   int32_t m_nMaxFactor_3; // 0x7BC - 0x7C0
   unsigned char pad_7C0[0x4] // 0x7C0 - 0x7C4
   float m_flDefaultDist_3; // 0x7C4 - 0x7C8

}; // size - 0x7E0


class CMultiplayRules : public CGameRules
{
public:


}; // size - 0x90


class CPlayer_MovementServices : public CPlayerPawnComponent
{
public:

   int32_t m_nImpulse; // 0x40 - 0x44
   unsigned char pad_44[0x4] // 0x44 - 0x48
   CInButtonState m_nButtons; // 0x48 - 0x68
   uint64_t m_nQueuedButtonDownMask; // 0x68 - 0x70
   uint64_t m_nQueuedButtonChangeMask; // 0x70 - 0x78
   uint64_t m_nButtonDoublePressed; // 0x78 - 0x80
   uint32 m_pButtonPressedCmdNumber[64]; // 0x80 - 0x180
   uint32_t m_nLastCommandNumberProcessed; // 0x180 - 0x184
   unsigned char pad_184[0x4] // 0x184 - 0x188
   uint64_t m_nToggleButtonDownMask; // 0x188 - 0x190
   float m_flMaxspeed; // 0x190 - 0x194
   float m_flForceSubtickMoveWhen; // 0x194 - 0x198
   float m_flForwardMove; // 0x198 - 0x19C
   float m_flLeftMove; // 0x19C - 0x1A0
   float m_flUpMove; // 0x1A0 - 0x1A4
   QAngle m_vecOldViewAngles; // 0x1A4 - 0x1B0

}; // size - 0x1B8


class CPlayer_MovementServices : public CPlayerPawnComponent
{
public:

   int32_t m_nImpulse; // 0x40 - 0x44
   unsigned char pad_44[0x4] // 0x44 - 0x48
   CInButtonState m_nButtons; // 0x48 - 0x68
   uint64_t m_nQueuedButtonDownMask; // 0x68 - 0x70
   uint64_t m_nQueuedButtonChangeMask; // 0x70 - 0x78
   uint64_t m_nButtonDoublePressed; // 0x78 - 0x80
   uint32 m_pButtonPressedCmdNumber[64]; // 0x80 - 0x180
   uint32_t m_nLastCommandNumberProcessed; // 0x180 - 0x184
   unsigned char pad_184[0x4] // 0x184 - 0x188
   uint64_t m_nToggleButtonDownMask; // 0x188 - 0x190
   float m_flMaxspeed; // 0x190 - 0x194
   float m_flForceSubtickMoveWhen; // 0x194 - 0x198
   float m_flForwardMove; // 0x198 - 0x19C
   float m_flLeftMove; // 0x19C - 0x1A0
   float m_flUpMove; // 0x1A0 - 0x1A4
   QAngle m_vecOldViewAngles; // 0x1A4 - 0x1B0

}; // size - 0x1B8


class CPropDoorRotating : public CBasePropDoor
{
public:

   Vector m_vecAxis; // 0xD28 - 0xD34
   float m_flDistance; // 0xD34 - 0xD38
   PropDoorRotatingSpawnPos_t m_eSpawnPosition; // 0xD38 - 0xD3C
   PropDoorRotatingOpenDirection_e m_eOpenDirection; // 0xD3C - 0xD40
   PropDoorRotatingOpenDirection_e m_eCurrentOpenDirection; // 0xD40 - 0xD44
   float m_flAjarAngle; // 0xD44 - 0xD48
   QAngle m_angRotationAjarDeprecated; // 0xD48 - 0xD54
   QAngle m_angRotationClosed; // 0xD54 - 0xD60
   QAngle m_angRotationOpenForward; // 0xD60 - 0xD6C
   QAngle m_angRotationOpenBack; // 0xD6C - 0xD78
   QAngle m_angGoal; // 0xD78 - 0xD84
   Vector m_vecForwardBoundsMin; // 0xD84 - 0xD90
   Vector m_vecForwardBoundsMax; // 0xD90 - 0xD9C
   Vector m_vecBackBoundsMin; // 0xD9C - 0xDA8
   Vector m_vecBackBoundsMax; // 0xDA8 - 0xDB4
   CHandle< CEntityBlocker > m_hEntityBlocker; // 0xDB4 - 0xDB8

}; // size - 0xDB8


class C_BaseViewModel : public CBaseAnimGraph
{
public:

   Vector m_vecLastFacing; // 0x9A0 - 0x9AC
   uint32_t m_nViewModelIndex; // 0x9AC - 0x9B0
   uint32_t m_nAnimationParity; // 0x9B0 - 0x9B4
   float m_flAnimationStartTime; // 0x9B4 - 0x9B8
   CHandle< C_BasePlayerWeapon > m_hWeapon; // 0x9B8 - 0x9BC
   unsigned char pad_9BC[0x4] // 0x9BC - 0x9C0
   CUtlSymbolLarge m_sVMName; // 0x9C0 - 0x9C8
   CUtlSymbolLarge m_sAnimationPrefix; // 0x9C8 - 0x9D0
   CHandle< C_ViewmodelWeapon > m_hWeaponModel; // 0x9D0 - 0x9D4
   AttachmentHandle_t m_iCameraAttachment; // 0x9D4 - 0x9D5
   unsigned char pad_9D5[0x3] // 0x9D5 - 0x9D8
   QAngle m_vecLastCameraAngles; // 0x9D8 - 0x9E4
   float m_previousElapsedDuration; // 0x9E4 - 0x9E8
   float m_previousCycle; // 0x9E8 - 0x9EC
   int32_t m_nOldAnimationParity; // 0x9EC - 0x9F0
   HSequence m_hOldLayerSequence; // 0x9F0 - 0x9F4
   int32_t m_oldLayer; // 0x9F4 - 0x9F8
   float m_oldLayerStartTime; // 0x9F8 - 0x9FC
   CEntityHandle m_hControlPanel; // 0x9FC - 0xA00

}; // size - 0xA00


class C_MultiplayRules : public C_GameRules
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class BaseSceneObjectOverride_t
{
public:

   uint32_t m_nSceneObjectIndex; // 0x0 - 0x4

}; // size - 0x4


class CAnimState
{
public:

   CUtlVector< CSmartPtr< CAnimStateTransition > > m_transitions; // 0x28 - 0x40
   CUtlVector< CStateAction > m_actions; // 0x40 - 0x58
   CUtlString m_name; // 0x58 - 0x60
   AnimStateID m_stateID; // 0x60 - 0x64
   Vector2D m_position; // 0x64 - 0x6C
   bool m_bIsStartState; // 0x6C - 0x6D
   bool m_bIsEndtState; // 0x6D - 0x6E
   bool m_bIsPassthrough; // 0x6E - 0x6F

}; // size - 0x70


class CAnimStateTransition
{
public:

   CConditionContainer m_conditionList; // 0x28 - 0x60
   AnimStateID m_srcState; // 0x60 - 0x64
   AnimStateID m_destState; // 0x64 - 0x68
   bool m_bDisabled; // 0x68 - 0x69

}; // size - 0x70


class CBarnLight : public CBaseModelEntity
{
public:

   bool m_bEnabled; // 0x6F0 - 0x6F1
   unsigned char pad_6F1[0x3] // 0x6F1 - 0x6F4
   int32_t m_nColorMode; // 0x6F4 - 0x6F8
   Color m_Color; // 0x6F8 - 0x6FC
   float m_flColorTemperature; // 0x6FC - 0x700
   float m_flBrightness; // 0x700 - 0x704
   float m_flBrightnessScale; // 0x704 - 0x708
   int32_t m_nDirectLight; // 0x708 - 0x70C
   int32_t m_nBakedShadowIndex; // 0x70C - 0x710
   int32_t m_nLuminaireShape; // 0x710 - 0x714
   float m_flLuminaireSize; // 0x714 - 0x718
   float m_flLuminaireAnisotropy; // 0x718 - 0x71C
   unsigned char pad_71C[0x4] // 0x71C - 0x720
   CUtlString m_LightStyleString; // 0x720 - 0x728
   GameTime_t m_flLightStyleStartTime; // 0x728 - 0x72C
   unsigned char pad_72C[0x4] // 0x72C - 0x730
   CNetworkUtlVectorBase< CUtlString > m_QueuedLightStyleStrings; // 0x730 - 0x748
   CNetworkUtlVectorBase< CUtlString > m_LightStyleEvents; // 0x748 - 0x760
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_LightStyleTargets; // 0x760 - 0x778
   CEntityIOOutput m_StyleEvent[4]; // 0x778 - 0x818
   CUtlString m_StyleRadianceVar; // 0x818 - 0x820
   CUtlString m_StyleVar; // 0x820 - 0x828
   unsigned char pad_828[0x20] // 0x828 - 0x848
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; // 0x848 - 0x850
   float m_flShape; // 0x850 - 0x854
   float m_flSoftX; // 0x854 - 0x858
   float m_flSoftY; // 0x858 - 0x85C
   float m_flSkirt; // 0x85C - 0x860
   float m_flSkirtNear; // 0x860 - 0x864
   Vector m_vSizeParams; // 0x864 - 0x870
   float m_flRange; // 0x870 - 0x874
   Vector m_vShear; // 0x874 - 0x880
   int32_t m_nBakeSpecularToCubemaps; // 0x880 - 0x884
   Vector m_vBakeSpecularToCubemapsSize; // 0x884 - 0x890
   int32_t m_nCastShadows; // 0x890 - 0x894
   int32_t m_nShadowMapSize; // 0x894 - 0x898
   int32_t m_nShadowPriority; // 0x898 - 0x89C
   bool m_bContactShadow; // 0x89C - 0x89D
   unsigned char pad_89D[0x3] // 0x89D - 0x8A0
   int32_t m_nBounceLight; // 0x8A0 - 0x8A4
   float m_flBounceScale; // 0x8A4 - 0x8A8
   float m_flMinRoughness; // 0x8A8 - 0x8AC
   int32_t m_nFog; // 0x8AC - 0x8B0
   float m_flFogStrength; // 0x8B0 - 0x8B4
   int32_t m_nFogShadows; // 0x8B4 - 0x8B8
   float m_flFogScale; // 0x8B8 - 0x8BC
   float m_flFadeSizeStart; // 0x8BC - 0x8C0
   float m_flFadeSizeEnd; // 0x8C0 - 0x8C4
   float m_flShadowFadeSizeStart; // 0x8C4 - 0x8C8
   float m_flShadowFadeSizeEnd; // 0x8C8 - 0x8CC
   bool m_bPrecomputedFieldsValid; // 0x8CC - 0x8CD
   unsigned char pad_8CD[0x3] // 0x8CD - 0x8D0
   Vector m_vPrecomputedBoundsMins; // 0x8D0 - 0x8DC
   Vector m_vPrecomputedBoundsMaxs; // 0x8DC - 0x8E8
   Vector m_vPrecomputedOBBOrigin; // 0x8E8 - 0x8F4
   QAngle m_vPrecomputedOBBAngles; // 0x8F4 - 0x900
   Vector m_vPrecomputedOBBExtent; // 0x900 - 0x90C
   bool m_bPvsModifyEntity; // 0x90C - 0x90D

}; // size - 0x918


class CBaseDoor : public CBaseToggle
{
public:

   QAngle m_angMoveEntitySpace; // 0x780 - 0x78C
   Vector m_vecMoveDirParentSpace; // 0x78C - 0x798
   locksound_t m_ls; // 0x798 - 0x7B8
   bool m_bForceClosed; // 0x7B8 - 0x7B9
   bool m_bDoorGroup; // 0x7B9 - 0x7BA
   bool m_bLocked; // 0x7BA - 0x7BB
   bool m_bIgnoreDebris; // 0x7BB - 0x7BC
   FuncDoorSpawnPos_t m_eSpawnPosition; // 0x7BC - 0x7C0
   float m_flBlockDamage; // 0x7C0 - 0x7C4
   unsigned char pad_7C4[0x4] // 0x7C4 - 0x7C8
   CUtlSymbolLarge m_NoiseMoving; // 0x7C8 - 0x7D0
   CUtlSymbolLarge m_NoiseArrived; // 0x7D0 - 0x7D8
   CUtlSymbolLarge m_NoiseMovingClosed; // 0x7D8 - 0x7E0
   CUtlSymbolLarge m_NoiseArrivedClosed; // 0x7E0 - 0x7E8
   CUtlSymbolLarge m_ChainTarget; // 0x7E8 - 0x7F0
   CEntityIOOutput m_OnBlockedClosing; // 0x7F0 - 0x818
   CEntityIOOutput m_OnBlockedOpening; // 0x818 - 0x840
   CEntityIOOutput m_OnUnblockedClosing; // 0x840 - 0x868
   CEntityIOOutput m_OnUnblockedOpening; // 0x868 - 0x890
   CEntityIOOutput m_OnFullyClosed; // 0x890 - 0x8B8
   CEntityIOOutput m_OnFullyOpen; // 0x8B8 - 0x8E0
   CEntityIOOutput m_OnClose; // 0x8E0 - 0x908
   CEntityIOOutput m_OnOpen; // 0x908 - 0x930
   CEntityIOOutput m_OnLockedUse; // 0x930 - 0x958
   bool m_bLoopMoveSound; // 0x958 - 0x959
   unsigned char pad_959[0x17] // 0x959 - 0x970
   bool m_bCreateNavObstacle; // 0x970 - 0x971
   bool m_isChaining; // 0x971 - 0x972
   bool m_bIsUsable; // 0x972 - 0x973

}; // size - 0x978


class CBeam : public CBaseModelEntity
{
public:

   float m_flFrameRate; // 0x6F0 - 0x6F4
   float m_flHDRColorScale; // 0x6F4 - 0x6F8
   GameTime_t m_flFireTime; // 0x6F8 - 0x6FC
   float m_flDamage; // 0x6FC - 0x700
   uint8_t m_nNumBeamEnts; // 0x700 - 0x701
   unsigned char pad_701[0x7] // 0x701 - 0x708
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hBaseMaterial; // 0x708 - 0x710
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_nHaloIndex; // 0x710 - 0x718
   BeamType_t m_nBeamType; // 0x718 - 0x71C
   uint32_t m_nBeamFlags; // 0x71C - 0x720
   CHandle< CBaseEntity > m_hAttachEntity[10]; // 0x720 - 0x748
   AttachmentHandle_t m_nAttachIndex[10]; // 0x748 - 0x752
   unsigned char pad_752[0x2] // 0x752 - 0x754
   float m_fWidth; // 0x754 - 0x758
   float m_fEndWidth; // 0x758 - 0x75C
   float m_fFadeLength; // 0x75C - 0x760
   float m_fHaloScale; // 0x760 - 0x764
   float m_fAmplitude; // 0x764 - 0x768
   float m_fStartFrame; // 0x768 - 0x76C
   float m_fSpeed; // 0x76C - 0x770
   float m_flFrame; // 0x770 - 0x774
   BeamClipStyle_t m_nClipStyle; // 0x774 - 0x778
   bool m_bTurnedOff; // 0x778 - 0x779
   unsigned char pad_779[0x3] // 0x779 - 0x77C
   Vector m_vecEndPos; // 0x77C - 0x788
   CHandle< CBaseEntity > m_hEndEntity; // 0x788 - 0x78C
   int32_t m_nDissolveType; // 0x78C - 0x790

}; // size - 0x790


class CBlend2DItemBase
{
public:

   Vector2D m_blendValue; // 0x18 - 0x20
   unsigned char pad_20[0x8] // 0x20 - 0x28
   bool m_bUseCustomDuration; // 0x28 - 0x29
   unsigned char pad_29[0x3] // 0x29 - 0x2C
   float m_flCustomDuration; // 0x2C - 0x30

}; // size - 0x30


class CBodyComponentSkeletonInstance : public CBodyComponent
{
public:

   CSkeletonInstance m_skeletonInstance; // 0x50 - 0x440
   CNetworkVarChainer __m_pChainEntity; // 0x440 - 0x468

}; // size - 0x470


class CBodyComponentSkeletonInstance : public CBodyComponent
{
public:

   CSkeletonInstance m_skeletonInstance; // 0x50 - 0x440
   CNetworkVarChainer __m_pChainEntity; // 0x440 - 0x468

}; // size - 0x470


class CBreakable : public CBaseModelEntity
{
public:

   Materials m_Material; // 0x700 - 0x704
   CHandle< CBaseEntity > m_hBreaker; // 0x704 - 0x708
   Explosions m_Explosion; // 0x708 - 0x70C
   unsigned char pad_70C[0x4] // 0x70C - 0x710
   CUtlSymbolLarge m_iszSpawnObject; // 0x710 - 0x718
   float m_flPressureDelay; // 0x718 - 0x71C
   int32_t m_iMinHealthDmg; // 0x71C - 0x720
   CUtlSymbolLarge m_iszPropData; // 0x720 - 0x728
   float m_impactEnergyScale; // 0x728 - 0x72C
   EOverrideBlockLOS_t m_nOverrideBlockLOS; // 0x72C - 0x730
   CEntityIOOutput m_OnBreak; // 0x730 - 0x758
   CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0x758 - 0x780
   float m_flDmgModBullet; // 0x780 - 0x784
   float m_flDmgModClub; // 0x784 - 0x788
   float m_flDmgModExplosive; // 0x788 - 0x78C
   float m_flDmgModFire; // 0x78C - 0x790
   CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0x790 - 0x798
   CUtlSymbolLarge m_iszBasePropData; // 0x798 - 0x7A0
   int32_t m_iInteractions; // 0x7A0 - 0x7A4
   PerformanceMode_t m_PerformanceMode; // 0x7A4 - 0x7A8
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x7A8 - 0x7AC
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x7AC - 0x7B0

}; // size - 0x7B0


class CCSGO_TeamIntroCharacterPosition : public CCSGO_TeamPreviewCharacterPosition
{
public:


}; // size - 0x730


class CCSGO_TeamSelectCharacterPosition : public CCSGO_TeamPreviewCharacterPosition
{
public:


}; // size - 0x730


class CCSPlayerPawnBase : public CBasePlayerPawn
{
public:

   CTouchExpansionComponent m_CTouchExpansionComponent; // 0xAB0 - 0xAD0
   CCSPlayer_ActionTrackingServices* m_pActionTrackingServices; // 0xAD0 - 0xAD8
   CCSPlayer_ViewModelServices* m_pViewModelServices; // 0xAD8 - 0xAE0
   uint32_t m_iDisplayHistoryBits; // 0xAE0 - 0xAE4
   float m_flLastAttackedTeammate; // 0xAE4 - 0xAE8
   CHandle< CCSPlayerController > m_hOriginalController; // 0xAE8 - 0xAEC
   GameTime_t m_blindUntilTime; // 0xAEC - 0xAF0
   GameTime_t m_blindStartTime; // 0xAF0 - 0xAF4
   GameTime_t m_allowAutoFollowTime; // 0xAF4 - 0xAF8
   EntitySpottedState_t m_entitySpottedState; // 0xAF8 - 0xB10
   int32_t m_nSpotRules; // 0xB10 - 0xB14
   float m_flTimeOfLastInjury; // 0xB14 - 0xB18
   RelativeDamagedDirection_t m_nRelativeDirectionOfLastInjury; // 0xB18 - 0xB1C
   CSPlayerState m_iPlayerState; // 0xB1C - 0xB20
   unsigned char pad_B20[0x8] // 0xB20 - 0xB28
   CountdownTimer m_chickenIdleSoundTimer; // 0xB28 - 0xB40
   CountdownTimer m_chickenJumpSoundTimer; // 0xB40 - 0xB58
   unsigned char pad_B58[0xA0] // 0xB58 - 0xBF8
   Vector m_vecLastBookmarkedPosition; // 0xBF8 - 0xC04
   float m_flLastDistanceTraveledNotice; // 0xC04 - 0xC08
   float m_flAccumulatedDistanceTraveled; // 0xC08 - 0xC0C
   float m_flLastFriendlyFireDamageReductionRatio; // 0xC0C - 0xC10
   bool m_bRespawning; // 0xC10 - 0xC11
   unsigned char pad_C11[0x3] // 0xC11 - 0xC14
   int32_t m_iNumGunGameTRBombTotalPoints; // 0xC14 - 0xC18
   bool m_bShouldProgressGunGameTRBombModeWeapon; // 0xC18 - 0xC19
   unsigned char pad_C19[0x3] // 0xC19 - 0xC1C
   int32_t m_nLastPickupPriority; // 0xC1C - 0xC20
   float m_flLastPickupPriorityTime; // 0xC20 - 0xC24
   bool m_passiveItems[4]; // 0xC24 - 0xC28
   bool m_bIsScoped; // 0xC28 - 0xC29
   bool m_bIsWalking; // 0xC29 - 0xC2A
   bool m_bResumeZoom; // 0xC2A - 0xC2B
   bool m_bIsDefusing; // 0xC2B - 0xC2C
   bool m_bIsGrabbingHostage; // 0xC2C - 0xC2D
   unsigned char pad_C2D[0x3] // 0xC2D - 0xC30
   CSPlayerBlockingUseAction_t m_iBlockingUseActionInProgress; // 0xC30 - 0xC34
   GameTime_t m_fImmuneToGunGameDamageTime; // 0xC34 - 0xC38
   bool m_bGunGameImmunity; // 0xC38 - 0xC39
   bool m_bMadeFinalGunGameProgressiveKill; // 0xC39 - 0xC3A
   unsigned char pad_C3A[0x2] // 0xC3A - 0xC3C
   int32_t m_iGunGameProgressiveWeaponIndex; // 0xC3C - 0xC40
   int32_t m_iNumGunGameTRKillPoints; // 0xC40 - 0xC44
   int32_t m_iNumGunGameKillsWithCurrentWeapon; // 0xC44 - 0xC48
   uint32_t m_unTotalRoundDamageDealt; // 0xC48 - 0xC4C
   float m_fMolotovDamageTime; // 0xC4C - 0xC50
   bool m_bHasMovedSinceSpawn; // 0xC50 - 0xC51
   bool m_bCanMoveDuringFreezePeriod; // 0xC51 - 0xC52
   bool m_isCurrentGunGameLeader; // 0xC52 - 0xC53
   bool m_isCurrentGunGameTeamLeader; // 0xC53 - 0xC54
   float m_flGuardianTooFarDistFrac; // 0xC54 - 0xC58
   float m_flNextGuardianTooFarHurtTime; // 0xC58 - 0xC5C
   GameTime_t m_flDetectedByEnemySensorTime; // 0xC5C - 0xC60
   bool m_bIsSpawnRappelling; // 0xC60 - 0xC61
   unsigned char pad_C61[0x3] // 0xC61 - 0xC64
   Vector m_vecSpawnRappellingRopeOrigin; // 0xC64 - 0xC70
   int32_t m_nSurvivalTeam; // 0xC70 - 0xC74
   CHandle< CCSPlayerPawnBase > m_hSurvivalAssassinationTarget; // 0xC74 - 0xC78
   int32_t m_nCompletedSurvivalAssassinations; // 0xC78 - 0xC7C
   float m_flDealtDamageToEnemyMostRecentTimestamp; // 0xC7C - 0xC80
   float m_flHealthShotBoostExpirationTime; // 0xC80 - 0xC84
   GameTime_t m_flLastEquippedHelmetTime; // 0xC84 - 0xC88
   GameTime_t m_flLastEquippedArmorTime; // 0xC88 - 0xC8C
   int32_t m_nHeavyAssaultSuitCooldownRemaining; // 0xC8C - 0xC90
   bool m_bResetArmorNextSpawn; // 0xC90 - 0xC91
   unsigned char pad_C91[0x3] // 0xC91 - 0xC94
   float m_flLastExoJumpTime; // 0xC94 - 0xC98
   GameTime_t m_flLastBumpMineBumpTime; // 0xC98 - 0xC9C
   unsigned char pad_C9C[0xC] // 0xC9C - 0xCA8
   bool m_bEscaped; // 0xCA8 - 0xCA9
   bool m_bIsVIP; // 0xCA9 - 0xCAA
   unsigned char pad_CAA[0x2] // 0xCAA - 0xCAC
   int32_t m_iNumSpawns; // 0xCAC - 0xCB0
   int32_t m_iShouldHaveCash; // 0xCB0 - 0xCB4
   bool m_bJustKilledTeammate; // 0xCB4 - 0xCB5
   bool m_bPunishedForTK; // 0xCB5 - 0xCB6
   bool m_bInvalidSteamLogonDelayed; // 0xCB6 - 0xCB7
   unsigned char pad_CB7[0x1] // 0xCB7 - 0xCB8
   int32_t m_iTeamKills; // 0xCB8 - 0xCBC
   GameTime_t m_flLastAction; // 0xCBC - 0xCC0
   float32 m_flNameChangeHistory[5]; // 0xCC0 - 0xCD4
   float m_fLastGivenDefuserTime; // 0xCD4 - 0xCD8
   float m_fLastGivenBombTime; // 0xCD8 - 0xCDC
   bool m_bHasNightVision; // 0xCDC - 0xCDD
   bool m_bNightVisionOn; // 0xCDD - 0xCDE
   unsigned char pad_CDE[0x2] // 0xCDE - 0xCE0
   float m_fNextRadarUpdateTime; // 0xCE0 - 0xCE4
   float m_flLastMoneyUpdateTime; // 0xCE4 - 0xCE8
   char m_MenuStringBuffer[1024]; // 0xCE8 - 0x10E8
   CHandle< CBaseEntity > m_pIntroCamera; // 0x10E8 - 0x10EC
   float m_fIntroCamTime; // 0x10EC - 0x10F0
   int32_t m_nMyCollisionGroup; // 0x10F0 - 0x10F4
   bool m_bInBombZone; // 0x10F4 - 0x10F5
   bool m_bInBuyZone; // 0x10F5 - 0x10F6
   bool m_bInNoDefuseArea; // 0x10F6 - 0x10F7
   bool m_bKilledByTaser; // 0x10F7 - 0x10F8
   int32_t m_iMoveState; // 0x10F8 - 0x10FC
   unsigned char pad_10FC[0x4] // 0x10FC - 0x1100
   CStrongHandle< InfoForResourceTypeCModel > m_nPreviousModelIndex; // 0x1100 - 0x1108
   GameTime_t m_grenadeParameterStashTime; // 0x1108 - 0x110C
   bool m_bGrenadeParametersStashed; // 0x110C - 0x110D
   unsigned char pad_110D[0x3] // 0x110D - 0x1110
   QAngle m_angStashedShootAngles; // 0x1110 - 0x111C
   Vector m_vecStashedGrenadeThrowPosition; // 0x111C - 0x1128
   Vector m_vecStashedVelocity; // 0x1128 - 0x1134
   QAngle m_angShootAngleHistory[2]; // 0x1134 - 0x114C
   Vector m_vecThrowPositionHistory[2]; // 0x114C - 0x1164
   Vector m_vecVelocityHistory[2]; // 0x1164 - 0x117C
   uint16_t m_nCharacterDefIndex; // 0x117C - 0x117E
   bool m_bDiedAirborne; // 0x117E - 0x117F
   unsigned char pad_117F[0x1] // 0x117F - 0x1180
   CEntityIndex m_iBombSiteIndex; // 0x1180 - 0x1184
   int32_t m_nWhichBombZone; // 0x1184 - 0x1188
   bool m_bInBombZoneTrigger; // 0x1188 - 0x1189
   bool m_bWasInBombZoneTrigger; // 0x1189 - 0x118A
   bool m_bWasInHostageRescueZone; // 0x118A - 0x118B
   bool m_bWasInBuyZone; // 0x118B - 0x118C
   bool m_bInHostageRescueZone; // 0x118C - 0x118D
   unsigned char pad_118D[0x3] // 0x118D - 0x1190
   float m_flStamina; // 0x1190 - 0x1194
   int32_t m_iDirection; // 0x1194 - 0x1198
   int32_t m_iShotsFired; // 0x1198 - 0x119C
   int32_t m_ArmorValue; // 0x119C - 0x11A0
   float m_flFlinchStack; // 0x11A0 - 0x11A4
   float m_flVelocityModifier; // 0x11A4 - 0x11A8
   float m_flGroundAccelLinearFracLastTime; // 0x11A8 - 0x11AC
   int32_t m_iHostagesKilled; // 0x11AC - 0x11B0
   Vector m_vecTotalBulletForce; // 0x11B0 - 0x11BC
   float m_flFlashDuration; // 0x11BC - 0x11C0
   float m_flFlashMaxAlpha; // 0x11C0 - 0x11C4
   float m_flProgressBarStartTime; // 0x11C4 - 0x11C8
   int32_t m_iProgressBarDuration; // 0x11C8 - 0x11CC
   bool m_bWaitForNoAttack; // 0x11CC - 0x11CD
   bool m_bIsRespawningForDMBonus; // 0x11CD - 0x11CE
   unsigned char pad_11CE[0x2] // 0x11CE - 0x11D0
   float m_flLowerBodyYawTarget; // 0x11D0 - 0x11D4
   bool m_bStrafing; // 0x11D4 - 0x11D5
   unsigned char pad_11D5[0x3] // 0x11D5 - 0x11D8
   Vector m_lastStandingPos; // 0x11D8 - 0x11E4
   float m_ignoreLadderJumpTime; // 0x11E4 - 0x11E8
   CountdownTimer m_ladderSurpressionTimer; // 0x11E8 - 0x1200
   Vector m_lastLadderNormal; // 0x1200 - 0x120C
   Vector m_lastLadderPos; // 0x120C - 0x1218
   QAngle m_thirdPersonHeading; // 0x1218 - 0x1224
   float m_flSlopeDropOffset; // 0x1224 - 0x1228
   float m_flSlopeDropHeight; // 0x1228 - 0x122C
   Vector m_vHeadConstraintOffset; // 0x122C - 0x1238
   unsigned char pad_1238[0x8] // 0x1238 - 0x1240
   int32_t m_iLastWeaponFireUsercmd; // 0x1240 - 0x1244
   QAngle m_angEyeAngles; // 0x1244 - 0x1250
   bool m_bVCollisionInitted; // 0x1250 - 0x1251
   unsigned char pad_1251[0x3] // 0x1251 - 0x1254
   Vector m_storedSpawnPosition; // 0x1254 - 0x1260
   QAngle m_storedSpawnAngle; // 0x1260 - 0x126C
   bool m_bIsSpawning; // 0x126C - 0x126D
   bool m_bHideTargetID; // 0x126D - 0x126E
   unsigned char pad_126E[0x2] // 0x126E - 0x1270
   int32_t m_nNumDangerZoneDamageHits; // 0x1270 - 0x1274
   bool m_bHud_MiniScoreHidden; // 0x1274 - 0x1275
   bool m_bHud_RadarHidden; // 0x1275 - 0x1276
   unsigned char pad_1276[0x2] // 0x1276 - 0x1278
   CEntityIndex m_nLastKillerIndex; // 0x1278 - 0x127C
   int32_t m_nLastConcurrentKilled; // 0x127C - 0x1280
   int32_t m_nDeathCamMusic; // 0x1280 - 0x1284
   int32_t m_iAddonBits; // 0x1284 - 0x1288
   int32_t m_iPrimaryAddon; // 0x1288 - 0x128C
   int32_t m_iSecondaryAddon; // 0x128C - 0x1290
   int32_t m_nTeamDamageGivenForMatch; // 0x1290 - 0x1294
   bool m_bTDGaveProtectionWarning; // 0x1294 - 0x1295
   bool m_bTDGaveProtectionWarningThisRound; // 0x1295 - 0x1296
   unsigned char pad_1296[0x2] // 0x1296 - 0x1298
   float m_applyDeafnessTime; // 0x1298 - 0x129C
   float m_flLastTHWarningTime; // 0x129C - 0x12A0
   CUtlStringToken m_currentDeafnessFilter; // 0x12A0 - 0x12A4
   unsigned char pad_12A4[0x4] // 0x12A4 - 0x12A8
   CUtlVector< CHandle< CCSPlayerPawnBase > > m_enemyPlayersKilledThisRound; // 0x12A8 - 0x12C0
   int32_t m_NumEnemiesKilledThisSpawn; // 0x12C0 - 0x12C4
   int32_t m_maxNumEnemiesKillStreak; // 0x12C4 - 0x12C8
   int32_t m_NumEnemiesKilledThisRound; // 0x12C8 - 0x12CC
   int32_t m_NumEnemiesAtRoundStart; // 0x12CC - 0x12D0
   int32_t m_iRoundsWon; // 0x12D0 - 0x12D4
   bool m_bHasUsedDMBonusRespawn; // 0x12D4 - 0x12D5
   unsigned char pad_12D5[0x3] // 0x12D5 - 0x12D8
   int32_t m_lastRoundResult; // 0x12D8 - 0x12DC
   bool m_wasNotKilledNaturally; // 0x12DC - 0x12DD
   unsigned char pad_12DD[0x3] // 0x12DD - 0x12E0
   uint32 m_vecPlayerPatchEconIndices[5]; // 0x12E0 - 0x12F4
   int32_t m_iDeathFlags; // 0x12F4 - 0x12F8
   CHandle< CChicken > m_hPet; // 0x12F8 - 0x12FC
   float m_flLastKnownAccumulatedWeaponEncumbrance; // 0x12FC - 0x1300
   float m_flLastTimeComputedAccumulatedWeaponEncumbrance; // 0x1300 - 0x1304
   unsigned char pad_1304[0x1CC] // 0x1304 - 0x14D0
   uint16_t m_unCurrentEquipmentValue; // 0x14D0 - 0x14D2
   uint16_t m_unRoundStartEquipmentValue; // 0x14D2 - 0x14D4
   uint16_t m_unFreezetimeEndEquipmentValue; // 0x14D4 - 0x14D6
   char m_szLastPlaceName[18]; // 0x14D6 - 0x14E8
   int32_t m_nSuicides; // 0x14E8 - 0x14EC
   int32_t m_nSurvivalTeamNumber; // 0x14EC - 0x14F0
   QAngle m_aimPunchAngle; // 0x14F0 - 0x14FC
   QAngle m_aimPunchAngleVel; // 0x14FC - 0x1508
   int32_t m_aimPunchTickBase; // 0x1508 - 0x150C
   float m_aimPunchTickFraction; // 0x150C - 0x1510
   CUtlVector< QAngle > m_aimPunchCache; // 0x1510 - 0x1528
   bool m_bHasDeathInfo; // 0x1528 - 0x1529
   unsigned char pad_1529[0x3] // 0x1529 - 0x152C
   float m_flDeathInfoTime; // 0x152C - 0x1530
   Vector m_vecDeathInfoOrigin; // 0x1530 - 0x153C
   bool m_bKilledByHeadshot; // 0x153C - 0x153D
   unsigned char pad_153D[0x3] // 0x153D - 0x1540
   int32_t m_LastHitBox; // 0x1540 - 0x1544
   int32_t m_LastHealth; // 0x1544 - 0x1548
   float m_flLastCollisionCeiling; // 0x1548 - 0x154C
   float m_flLastCollisionCeilingChangeTime; // 0x154C - 0x1550
   CUtlString m_strVOPrefix; // 0x1550 - 0x1558
   float m_flLandseconds; // 0x1558 - 0x155C
   unsigned char pad_155C[0x4] // 0x155C - 0x1560
   CCSBot* m_pBot; // 0x1560 - 0x1568
   bool m_bBotAllowActive; // 0x1568 - 0x1569
   bool m_bCommittingSuicideOnTeamChange; // 0x1569 - 0x156A

}; // size - 0x1570


class CContainerAnimNodeBase : public CAnimNodeBase
{
public:

   AnimNodeID m_inputNodeID; // 0x48 - 0x4C
   AnimNodeID m_outputNodeID; // 0x4C - 0x50
   CUtlHashtable< AnimNodeOutputID, CAnimNodeConnection > m_inputConnectionMap; // 0x50 - 0x70

}; // size - 0x70


class CCycleBase
{
public:

   float m_flCycle; // 0x0 - 0x4

}; // size - 0x4


class CExampleSchemaVData_PolymorphicBase
{
public:

   int32_t m_nBase; // 0x8 - 0xC

}; // size - 0x10


class CFuncBrush : public CBaseModelEntity
{
public:

   BrushSolidities_e m_iSolidity; // 0x6F0 - 0x6F4
   int32_t m_iDisabled; // 0x6F4 - 0x6F8
   bool m_bSolidBsp; // 0x6F8 - 0x6F9
   unsigned char pad_6F9[0x7] // 0x6F9 - 0x700
   CUtlSymbolLarge m_iszExcludedClass; // 0x700 - 0x708
   bool m_bInvertExclusion; // 0x708 - 0x709
   bool m_bScriptedMovement; // 0x709 - 0x70A

}; // size - 0x710


class CFuncMoveLinear : public CBaseToggle
{
public:

   MoveLinearAuthoredPos_t m_authoredPosition; // 0x770 - 0x774
   QAngle m_angMoveEntitySpace; // 0x774 - 0x780
   Vector m_vecMoveDirParentSpace; // 0x780 - 0x78C
   unsigned char pad_78C[0x4] // 0x78C - 0x790
   CUtlSymbolLarge m_soundStart; // 0x790 - 0x798
   CUtlSymbolLarge m_soundStop; // 0x798 - 0x7A0
   CUtlSymbolLarge m_currentSound; // 0x7A0 - 0x7A8
   float m_flBlockDamage; // 0x7A8 - 0x7AC
   float m_flStartPosition; // 0x7AC - 0x7B0
   float m_flMoveDistance; // 0x7B0 - 0x7B4
   unsigned char pad_7B4[0xC] // 0x7B4 - 0x7C0
   CEntityIOOutput m_OnFullyOpen; // 0x7C0 - 0x7E8
   CEntityIOOutput m_OnFullyClosed; // 0x7E8 - 0x810
   bool m_bCreateNavObstacle; // 0x810 - 0x811

}; // size - 0x820


class CGeneralSpin : public CParticleFunctionOperator
{
public:

   int32_t m_nSpinRateDegrees; // 0x1F0 - 0x1F4
   int32_t m_nSpinRateMinDegrees; // 0x1F4 - 0x1F8
   unsigned char pad_1F8[0x4] // 0x1F8 - 0x1FC
   float m_fSpinRateStopTime; // 0x1FC - 0x200

}; // size - 0x210


class CLogicalEntity : public C_BaseEntity
{
public:


}; // size - 0x538


class CMotionItem
{
public:

   CMotionParameterManager m_paramManager; // 0x28 - 0x50
   CUtlVector< CSmartPtr< CAnimTagSpan > > m_blockSpans; // 0x50 - 0x68
   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x68 - 0x80
   CUtlVector< CSmartPtr< CAnimParamSpan > > m_paramSpans; // 0x80 - 0x98
   unsigned char pad_98[0x8] // 0x98 - 0xA0
   bool m_bLoop; // 0xA0 - 0xA1

}; // size - 0xA8


class CMotionNode
{
public:

   CUtlString m_name; // 0x18 - 0x20
   AnimNodeID m_id; // 0x20 - 0x24

}; // size - 0x28


class CParticleVecInput
{
public:

   ParticleVecType_t m_nType; // 0x0 - 0x4
   Vector m_vLiteralValue; // 0x4 - 0x10
   Color m_LiteralColor; // 0x10 - 0x14
   unsigned char pad_14[0x4] // 0x14 - 0x18
   CKV3MemberNameWithStorage m_NamedValue; // 0x18 - 0x50
   bool m_bFollowNamedValue; // 0x50 - 0x51
   unsigned char pad_51[0x3] // 0x51 - 0x54
   ParticleAttributeIndex_t m_nVectorAttribute; // 0x54 - 0x58
   Vector m_vVectorAttributeScale; // 0x58 - 0x64
   int32_t m_nControlPoint; // 0x64 - 0x68
   Vector m_vCPValueScale; // 0x68 - 0x74
   Vector m_vCPRelativePosition; // 0x74 - 0x80
   Vector m_vCPRelativeDir; // 0x80 - 0x8C
   unsigned char pad_8C[0x4] // 0x8C - 0x90
   CParticleFloatInput m_FloatComponentX; // 0x90 - 0x1C8
   CParticleFloatInput m_FloatComponentY; // 0x1C8 - 0x300
   CParticleFloatInput m_FloatComponentZ; // 0x300 - 0x438
   CParticleFloatInput m_FloatInterp; // 0x438 - 0x570
   float m_flInterpInput0; // 0x570 - 0x574
   float m_flInterpInput1; // 0x574 - 0x578
   Vector m_vInterpOutput0; // 0x578 - 0x584
   Vector m_vInterpOutput1; // 0x584 - 0x590
   CColorGradient m_Gradient; // 0x590 - 0x5A8
   Vector m_vRandomMin; // 0x5A8 - 0x5B4
   Vector m_vRandomMax; // 0x5B4 - 0x5C0

}; // size - 0x5C8


class CPathAnimMotorBase : public CAnimMotorBase
{
public:

   bool m_bLockToPath; // 0x28 - 0x29

}; // size - 0x30


class CPathAnimMotorUpdaterBase : public CAnimMotorUpdaterBase
{
public:

   bool m_bLockToPath; // 0x20 - 0x21

}; // size - 0x28


class CPhysForce : public CPointEntity
{
public:

   CUtlSymbolLarge m_nameAttach; // 0x4A8 - 0x4B0
   float m_force; // 0x4B0 - 0x4B4
   float m_forceTime; // 0x4B4 - 0x4B8
   CHandle< CBaseEntity > m_attachedObject; // 0x4B8 - 0x4BC
   bool m_wasRestored; // 0x4BC - 0x4BD
   unsigned char pad_4BD[0x3] // 0x4BD - 0x4C0
   CConstantForceController m_integrator; // 0x4C0 - 0x500

}; // size - 0x500


class CPointClientUIWorldPanel : public CBaseClientUIEntity
{
public:

   bool m_bIgnoreInput; // 0x8A0 - 0x8A1
   bool m_bLit; // 0x8A1 - 0x8A2
   bool m_bFollowPlayerAcrossTeleport; // 0x8A2 - 0x8A3
   unsigned char pad_8A3[0x1] // 0x8A3 - 0x8A4
   float m_flWidth; // 0x8A4 - 0x8A8
   float m_flHeight; // 0x8A8 - 0x8AC
   float m_flDPI; // 0x8AC - 0x8B0
   float m_flInteractDistance; // 0x8B0 - 0x8B4
   float m_flDepthOffset; // 0x8B4 - 0x8B8
   uint32_t m_unOwnerContext; // 0x8B8 - 0x8BC
   uint32_t m_unHorizontalAlign; // 0x8BC - 0x8C0
   uint32_t m_unVerticalAlign; // 0x8C0 - 0x8C4
   uint32_t m_unOrientation; // 0x8C4 - 0x8C8
   bool m_bAllowInteractionFromAllSceneWorlds; // 0x8C8 - 0x8C9
   unsigned char pad_8C9[0x7] // 0x8C9 - 0x8D0
   CNetworkUtlVectorBase< CUtlSymbolLarge > m_vecCSSClasses; // 0x8D0 - 0x8E8
   bool m_bOpaque; // 0x8E8 - 0x8E9
   bool m_bNoDepth; // 0x8E9 - 0x8EA
   bool m_bRenderBackface; // 0x8EA - 0x8EB
   bool m_bUseOffScreenIndicator; // 0x8EB - 0x8EC
   bool m_bExcludeFromSaveGames; // 0x8EC - 0x8ED
   bool m_bGrabbable; // 0x8ED - 0x8EE
   bool m_bOnlyRenderToTexture; // 0x8EE - 0x8EF
   bool m_bDisableMipGen; // 0x8EF - 0x8F0
   int32_t m_nExplicitImageLayout; // 0x8F0 - 0x8F4

}; // size - 0x8F8


class CProxyAnimNodeBase : public CAnimNodeBase
{
public:

   CUtlVector< CConnectionProxyItem > m_proxyItems; // 0x40 - 0x58

}; // size - 0x58


class CRagdollProp : public CBaseAnimGraph
{
public:

   ragdoll_t m_ragdoll; // 0x828 - 0x860
   bool m_bStartDisabled; // 0x860 - 0x861
   unsigned char pad_861[0x7] // 0x861 - 0x868
   CNetworkUtlVectorBase< Vector > m_ragPos; // 0x868 - 0x880
   CNetworkUtlVectorBase< QAngle > m_ragAngles; // 0x880 - 0x898
   CHandle< CBaseEntity > m_hRagdollSource; // 0x898 - 0x89C
   uint32_t m_lastUpdateTickCount; // 0x89C - 0x8A0
   bool m_allAsleep; // 0x8A0 - 0x8A1
   bool m_bFirstCollisionAfterLaunch; // 0x8A1 - 0x8A2
   unsigned char pad_8A2[0x2] // 0x8A2 - 0x8A4
   CHandle< CBaseEntity > m_hDamageEntity; // 0x8A4 - 0x8A8
   CHandle< CBaseEntity > m_hKiller; // 0x8A8 - 0x8AC
   CHandle< CBasePlayerPawn > m_hPhysicsAttacker; // 0x8AC - 0x8B0
   GameTime_t m_flLastPhysicsInfluenceTime; // 0x8B0 - 0x8B4
   GameTime_t m_flFadeOutStartTime; // 0x8B4 - 0x8B8
   float m_flFadeTime; // 0x8B8 - 0x8BC
   Vector m_vecLastOrigin; // 0x8BC - 0x8C8
   GameTime_t m_flAwakeTime; // 0x8C8 - 0x8CC
   GameTime_t m_flLastOriginChangeTime; // 0x8CC - 0x8D0
   int32_t m_nBloodColor; // 0x8D0 - 0x8D4
   unsigned char pad_8D4[0x4] // 0x8D4 - 0x8D8
   CUtlSymbolLarge m_strOriginClassName; // 0x8D8 - 0x8E0
   CUtlSymbolLarge m_strSourceClassName; // 0x8E0 - 0x8E8
   bool m_bHasBeenPhysgunned; // 0x8E8 - 0x8E9
   bool m_bShouldTeleportPhysics; // 0x8E9 - 0x8EA
   unsigned char pad_8EA[0x2] // 0x8EA - 0x8EC
   float m_flBlendWeight; // 0x8EC - 0x8F0
   float m_flDefaultFadeScale; // 0x8F0 - 0x8F4
   unsigned char pad_8F4[0x4] // 0x8F4 - 0x8F8
   CUtlVector< Vector > m_ragdollMins; // 0x8F8 - 0x910
   CUtlVector< Vector > m_ragdollMaxs; // 0x910 - 0x928
   bool m_bShouldDeleteActivationRecord; // 0x928 - 0x929
   unsigned char pad_929[0x5F] // 0x929 - 0x988
   bool m_bValidatePoweredRagdollPose; // 0x988 - 0x989

}; // size - 0x9C8


class CSSDSMsg_LayerBase
{
public:

   SceneViewId_t m_viewId; // 0x0 - 0x10
   CUtlString m_ViewName; // 0x10 - 0x18
   int32_t m_nLayerIndex; // 0x18 - 0x1C
   unsigned char pad_1C[0x4] // 0x1C - 0x20
   uint64_t m_nLayerId; // 0x20 - 0x28
   CUtlString m_LayerName; // 0x28 - 0x30
   CUtlString m_displayText; // 0x30 - 0x38

}; // size - 0x38


class CSceneEntity : public CPointEntity
{
public:

   CUtlSymbolLarge m_iszSceneFile; // 0x4A8 - 0x4B0
   CUtlSymbolLarge m_iszResumeSceneFile; // 0x4B0 - 0x4B8
   CUtlSymbolLarge m_iszTarget1; // 0x4B8 - 0x4C0
   CUtlSymbolLarge m_iszTarget2; // 0x4C0 - 0x4C8
   CUtlSymbolLarge m_iszTarget3; // 0x4C8 - 0x4D0
   CUtlSymbolLarge m_iszTarget4; // 0x4D0 - 0x4D8
   CUtlSymbolLarge m_iszTarget5; // 0x4D8 - 0x4E0
   CUtlSymbolLarge m_iszTarget6; // 0x4E0 - 0x4E8
   CUtlSymbolLarge m_iszTarget7; // 0x4E8 - 0x4F0
   CUtlSymbolLarge m_iszTarget8; // 0x4F0 - 0x4F8
   CHandle< CBaseEntity > m_hTarget1; // 0x4F8 - 0x4FC
   CHandle< CBaseEntity > m_hTarget2; // 0x4FC - 0x500
   CHandle< CBaseEntity > m_hTarget3; // 0x500 - 0x504
   CHandle< CBaseEntity > m_hTarget4; // 0x504 - 0x508
   CHandle< CBaseEntity > m_hTarget5; // 0x508 - 0x50C
   CHandle< CBaseEntity > m_hTarget6; // 0x50C - 0x510
   CHandle< CBaseEntity > m_hTarget7; // 0x510 - 0x514
   CHandle< CBaseEntity > m_hTarget8; // 0x514 - 0x518
   bool m_bIsPlayingBack; // 0x518 - 0x519
   bool m_bPaused; // 0x519 - 0x51A
   bool m_bMultiplayer; // 0x51A - 0x51B
   bool m_bAutogenerated; // 0x51B - 0x51C
   float m_flForceClientTime; // 0x51C - 0x520
   float m_flCurrentTime; // 0x520 - 0x524
   float m_flFrameTime; // 0x524 - 0x528
   bool m_bCancelAtNextInterrupt; // 0x528 - 0x529
   unsigned char pad_529[0x3] // 0x529 - 0x52C
   float m_fPitch; // 0x52C - 0x530
   bool m_bAutomated; // 0x530 - 0x531
   unsigned char pad_531[0x3] // 0x531 - 0x534
   int32_t m_nAutomatedAction; // 0x534 - 0x538
   float m_flAutomationDelay; // 0x538 - 0x53C
   float m_flAutomationTime; // 0x53C - 0x540
   CHandle< CBaseEntity > m_hWaitingForThisResumeScene; // 0x540 - 0x544
   bool m_bWaitingForResumeScene; // 0x544 - 0x545
   bool m_bPausedViaInput; // 0x545 - 0x546
   bool m_bPauseAtNextInterrupt; // 0x546 - 0x547
   bool m_bWaitingForActor; // 0x547 - 0x548
   bool m_bWaitingForInterrupt; // 0x548 - 0x549
   bool m_bInterruptedActorsScenes; // 0x549 - 0x54A
   bool m_bBreakOnNonIdle; // 0x54A - 0x54B
   unsigned char pad_54B[0x5] // 0x54B - 0x550
   CNetworkUtlVectorBase< CHandle< CBaseFlex > > m_hActorList; // 0x550 - 0x568
   CUtlVector< CHandle< CBaseEntity > > m_hRemoveActorList; // 0x568 - 0x580
   unsigned char pad_580[0x10] // 0x580 - 0x590
   int32_t m_nSceneFlushCounter; // 0x590 - 0x594
   uint16_t m_nSceneStringIndex; // 0x594 - 0x596
   unsigned char pad_596[0x2] // 0x596 - 0x598
   CEntityIOOutput m_OnStart; // 0x598 - 0x5C0
   CEntityIOOutput m_OnCompletion; // 0x5C0 - 0x5E8
   CEntityIOOutput m_OnCanceled; // 0x5E8 - 0x610
   CEntityIOOutput m_OnPaused; // 0x610 - 0x638
   CEntityIOOutput m_OnResumed; // 0x638 - 0x660
   CEntityIOOutput m_OnTrigger[16]; // 0x660 - 0x8E0
   unsigned char pad_8E0[0x90] // 0x8E0 - 0x970
   CHandle< CSceneEntity > m_hInterruptScene; // 0x970 - 0x974
   int32_t m_nInterruptCount; // 0x974 - 0x978
   bool m_bSceneMissing; // 0x978 - 0x979
   bool m_bInterrupted; // 0x979 - 0x97A
   bool m_bCompletedEarly; // 0x97A - 0x97B
   bool m_bInterruptSceneFinished; // 0x97B - 0x97C
   bool m_bRestoring; // 0x97C - 0x97D
   unsigned char pad_97D[0x3] // 0x97D - 0x980
   CUtlVector< CHandle< CSceneEntity > > m_hNotifySceneCompletion; // 0x980 - 0x998
   CUtlVector< CHandle< CSceneListManager > > m_hListManagers; // 0x998 - 0x9B0
   unsigned char pad_9B0[0x28] // 0x9B0 - 0x9D8
   CUtlSymbolLarge m_iszSoundName; // 0x9D8 - 0x9E0
   CHandle< CBaseFlex > m_hActor; // 0x9E0 - 0x9E4
   CHandle< CBaseEntity > m_hActivator; // 0x9E4 - 0x9E8
   CHandle< CBaseEntity > m_hCamera; // 0x9E8 - 0x9EC
   int32_t m_BusyActor; // 0x9EC - 0x9F0
   SceneOnPlayerDeath_t m_iPlayerDeathBehavior; // 0x9F0 - 0x9F4

}; // size - 0xA00


class CServerOnlyModelEntity : public CBaseModelEntity
{
public:


}; // size - 0x6F0


class CSkeletonAnimationController
{
public:

   CSkeletonInstance* m_pSkeletonInstance; // 0x8 - 0x10

}; // size - 0x10


class CSosGroupActionSchema
{
public:

   CUtlString m_name; // 0x8 - 0x10
   ActionType_t m_actionType; // 0x10 - 0x14
   ActionType_t m_actionInstanceType; // 0x14 - 0x18

}; // size - 0x18


class CSoundAreaEntityBase : public CBaseEntity
{
public:

   bool m_bDisabled; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x7] // 0x4A1 - 0x4A8
   CUtlSymbolLarge m_iszSoundAreaType; // 0x4A8 - 0x4B0
   Vector m_vPos; // 0x4B0 - 0x4BC

}; // size - 0x4C0


class CTriggerHurt : public CBaseTrigger
{
public:

   float m_flOriginalDamage; // 0x898 - 0x89C
   float m_flDamage; // 0x89C - 0x8A0
   float m_flDamageCap; // 0x8A0 - 0x8A4
   GameTime_t m_flLastDmgTime; // 0x8A4 - 0x8A8
   float m_flForgivenessDelay; // 0x8A8 - 0x8AC
   int32_t m_bitsDamageInflict; // 0x8AC - 0x8B0
   int32_t m_damageModel; // 0x8B0 - 0x8B4
   bool m_bNoDmgForce; // 0x8B4 - 0x8B5
   unsigned char pad_8B5[0x3] // 0x8B5 - 0x8B8
   Vector m_vDamageForce; // 0x8B8 - 0x8C4
   bool m_thinkAlways; // 0x8C4 - 0x8C5
   unsigned char pad_8C5[0x3] // 0x8C5 - 0x8C8
   float m_hurtThinkPeriod; // 0x8C8 - 0x8CC
   unsigned char pad_8CC[0x4] // 0x8CC - 0x8D0
   CEntityIOOutput m_OnHurt; // 0x8D0 - 0x8F8
   CEntityIOOutput m_OnHurtPlayer; // 0x8F8 - 0x920
   CUtlVector< CHandle< CBaseEntity > > m_hurtEntities; // 0x920 - 0x938

}; // size - 0x938


class CTriggerOnce : public CTriggerMultiple
{
public:


}; // size - 0x8C0


class C_BarnLight : public C_BaseModelEntity
{
public:

   bool m_bEnabled; // 0x838 - 0x839
   unsigned char pad_839[0x3] // 0x839 - 0x83C
   int32_t m_nColorMode; // 0x83C - 0x840
   Color m_Color; // 0x840 - 0x844
   float m_flColorTemperature; // 0x844 - 0x848
   float m_flBrightness; // 0x848 - 0x84C
   float m_flBrightnessScale; // 0x84C - 0x850
   int32_t m_nDirectLight; // 0x850 - 0x854
   int32_t m_nBakedShadowIndex; // 0x854 - 0x858
   int32_t m_nLuminaireShape; // 0x858 - 0x85C
   float m_flLuminaireSize; // 0x85C - 0x860
   float m_flLuminaireAnisotropy; // 0x860 - 0x864
   unsigned char pad_864[0x4] // 0x864 - 0x868
   CUtlString m_LightStyleString; // 0x868 - 0x870
   GameTime_t m_flLightStyleStartTime; // 0x870 - 0x874
   unsigned char pad_874[0x4] // 0x874 - 0x878
   C_NetworkUtlVectorBase< CUtlString > m_QueuedLightStyleStrings; // 0x878 - 0x890
   C_NetworkUtlVectorBase< CUtlString > m_LightStyleEvents; // 0x890 - 0x8A8
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_LightStyleTargets; // 0x8A8 - 0x8C0
   CEntityIOOutput m_StyleEvent[4]; // 0x8C0 - 0x960
   CStrongHandle< InfoForResourceTypeCTextureBase > m_hLightCookie; // 0x960 - 0x968
   float m_flShape; // 0x968 - 0x96C
   float m_flSoftX; // 0x96C - 0x970
   float m_flSoftY; // 0x970 - 0x974
   float m_flSkirt; // 0x974 - 0x978
   float m_flSkirtNear; // 0x978 - 0x97C
   Vector m_vSizeParams; // 0x97C - 0x988
   float m_flRange; // 0x988 - 0x98C
   Vector m_vShear; // 0x98C - 0x998
   int32_t m_nBakeSpecularToCubemaps; // 0x998 - 0x99C
   Vector m_vBakeSpecularToCubemapsSize; // 0x99C - 0x9A8
   int32_t m_nCastShadows; // 0x9A8 - 0x9AC
   int32_t m_nShadowMapSize; // 0x9AC - 0x9B0
   int32_t m_nShadowPriority; // 0x9B0 - 0x9B4
   bool m_bContactShadow; // 0x9B4 - 0x9B5
   unsigned char pad_9B5[0x3] // 0x9B5 - 0x9B8
   int32_t m_nBounceLight; // 0x9B8 - 0x9BC
   float m_flBounceScale; // 0x9BC - 0x9C0
   float m_flMinRoughness; // 0x9C0 - 0x9C4
   int32_t m_nFog; // 0x9C4 - 0x9C8
   float m_flFogStrength; // 0x9C8 - 0x9CC
   int32_t m_nFogShadows; // 0x9CC - 0x9D0
   float m_flFogScale; // 0x9D0 - 0x9D4
   float m_flFadeSizeStart; // 0x9D4 - 0x9D8
   float m_flFadeSizeEnd; // 0x9D8 - 0x9DC
   float m_flShadowFadeSizeStart; // 0x9DC - 0x9E0
   float m_flShadowFadeSizeEnd; // 0x9E0 - 0x9E4
   bool m_bPrecomputedFieldsValid; // 0x9E4 - 0x9E5
   unsigned char pad_9E5[0x3] // 0x9E5 - 0x9E8
   Vector m_vPrecomputedBoundsMins; // 0x9E8 - 0x9F4
   Vector m_vPrecomputedBoundsMaxs; // 0x9F4 - 0xA00
   Vector m_vPrecomputedOBBOrigin; // 0xA00 - 0xA0C
   QAngle m_vPrecomputedOBBAngles; // 0xA0C - 0xA18
   Vector m_vPrecomputedOBBExtent; // 0xA18 - 0xA24

}; // size - 0xA70


class C_CSGO_EndOfMatchLineupEndpoint : public C_BaseEntity
{
public:


}; // size - 0x538


class C_CSGO_PreviewPlayer : public C_CSPlayerPawn
{
public:

   CUtlString m_animgraph; // 0x19A8 - 0x19B0
   CUtlString m_animgraphCharacterModeString; // 0x19B0 - 0x19B8
   float m_flInitialModelScale; // 0x19B8 - 0x19BC

}; // size - 0x1A30


class C_CSGO_TeamIntroCharacterPosition : public C_CSGO_TeamPreviewCharacterPosition
{
public:


}; // size - 0x9D0


class C_CSGO_TeamSelectCharacterPosition : public C_CSGO_TeamPreviewCharacterPosition
{
public:


}; // size - 0x9D0


class C_FuncBrush : public C_BaseModelEntity
{
public:


}; // size - 0x838


class C_Item : public C_EconEntity
{
public:

   bool m_bShouldGlow; // 0x1070 - 0x1071
   char m_pReticleHintTextName[256]; // 0x1071 - 0x1171

}; // size - 0x1178


class C_OP_RemapDistanceToLineSegmentBase : public CParticleFunctionOperator
{
public:

   int32_t m_nCP0; // 0x1F0 - 0x1F4
   int32_t m_nCP1; // 0x1F4 - 0x1F8
   float m_flMinInputValue; // 0x1F8 - 0x1FC
   float m_flMaxInputValue; // 0x1FC - 0x200
   bool m_bInfiniteLine; // 0x200 - 0x201

}; // size - 0x210


class C_ParticleSystem : public C_BaseModelEntity
{
public:

   char m_szSnapshotFileName[512]; // 0x838 - 0xA38
   bool m_bActive; // 0xA38 - 0xA39
   bool m_bFrozen; // 0xA39 - 0xA3A
   unsigned char pad_A3A[0x2] // 0xA3A - 0xA3C
   float m_flFreezeTransitionDuration; // 0xA3C - 0xA40
   int32_t m_nStopType; // 0xA40 - 0xA44
   bool m_bAnimateDuringGameplayPause; // 0xA44 - 0xA45
   unsigned char pad_A45[0x3] // 0xA45 - 0xA48
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0xA48 - 0xA50
   GameTime_t m_flStartTime; // 0xA50 - 0xA54
   float m_flPreSimTime; // 0xA54 - 0xA58
   Vector m_vServerControlPoints[4]; // 0xA58 - 0xA88
   uint8 m_iServerControlPointAssignments[4]; // 0xA88 - 0xA8C
   CHandle< C_BaseEntity > m_hControlPointEnts[64]; // 0xA8C - 0xB8C
   bool m_bNoSave; // 0xB8C - 0xB8D
   bool m_bNoFreeze; // 0xB8D - 0xB8E
   bool m_bStartActive; // 0xB8E - 0xB8F
   unsigned char pad_B8F[0x1] // 0xB8F - 0xB90
   CUtlSymbolLarge m_iszEffectName; // 0xB90 - 0xB98
   CUtlSymbolLarge m_iszControlPointNames[64]; // 0xB98 - 0xD98
   int32_t m_nDataCP; // 0xD98 - 0xD9C
   Vector m_vecDataCPValue; // 0xD9C - 0xDA8
   int32_t m_nTintCP; // 0xDA8 - 0xDAC
   Color m_clrTint; // 0xDAC - 0xDB0
   unsigned char pad_DB0[0x20] // 0xDB0 - 0xDD0
   bool m_bOldActive; // 0xDD0 - 0xDD1
   bool m_bOldFrozen; // 0xDD1 - 0xDD2

}; // size - 0xDE8


class C_SoundAreaEntityBase : public C_BaseEntity
{
public:

   bool m_bDisabled; // 0x538 - 0x539
   unsigned char pad_539[0x7] // 0x539 - 0x540
   bool m_bWasEnabled; // 0x540 - 0x541
   unsigned char pad_541[0x7] // 0x541 - 0x548
   CUtlSymbolLarge m_iszSoundAreaType; // 0x548 - 0x550
   Vector m_vPos; // 0x550 - 0x55C

}; // size - 0x560


class EventAdvanceTick_t : public EventSimulate_t
{
public:

   int32_t m_nCurrentTick; // 0x30 - 0x34
   int32_t m_nCurrentTickThisFrame; // 0x34 - 0x38
   int32_t m_nTotalTicksThisFrame; // 0x38 - 0x3C
   int32_t m_nTotalTicks; // 0x3C - 0x40

}; // size - 0x40


class EventPostAdvanceTick_t : public EventSimulate_t
{
public:

   int32_t m_nCurrentTick; // 0x30 - 0x34
   int32_t m_nCurrentTickThisFrame; // 0x34 - 0x38
   int32_t m_nTotalTicksThisFrame; // 0x38 - 0x3C
   int32_t m_nTotalTicks; // 0x3C - 0x40

}; // size - 0x40


class IEconItemInterface
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class AmmoTypeInfo_t
{
public:

   int32_t m_nMaxCarry; // 0x10 - 0x14
   unsigned char pad_14[0x8] // 0x14 - 0x1C
   CRangeInt m_nSplashSize; // 0x1C - 0x24
   AmmoFlags_t m_nFlags; // 0x24 - 0x28
   float m_flMass; // 0x28 - 0x2C
   CRangeFloat m_flSpeed; // 0x2C - 0x34

}; // size - 0x38


class AnimationSnapshotBase_t
{
public:

   float m_flRealTime; // 0x0 - 0x4
   unsigned char pad_4[0xC] // 0x4 - 0x10
   matrix3x4a_t m_rootToWorld; // 0x10 - 0x40
   bool m_bBonesInWorldSpace; // 0x40 - 0x41
   unsigned char pad_41[0x7] // 0x41 - 0x48
   CUtlVector< uint32 > m_boneSetupMask; // 0x48 - 0x60
   CUtlVector< matrix3x4a_t > m_boneTransforms; // 0x60 - 0x78
   CUtlVector< float32 > m_flexControllers; // 0x78 - 0x90
   AnimationSnapshotType_t m_SnapshotType; // 0x90 - 0x94
   bool m_bHasDecodeDump; // 0x94 - 0x95
   unsigned char pad_95[0x3] // 0x95 - 0x98
   AnimationDecodeDebugDumpElement_t m_DecodeDump; // 0x98 - 0x108

}; // size - 0x110


class CAI_ExpresserWithFollowup : public CAI_Expresser
{
public:

   ResponseFollowup* m_pPostponedFollowup; // 0x60 - 0x68

}; // size - 0x70


class CAnimGraphSettingsGroup
{
public:


}; // size - 0x20


class CAnimNodeManager
{
public:

   CUtlHashtable< AnimNodeID, CSmartPtr< CAnimNodeBase > > m_nodes; // 0x8 - 0x28

}; // size - 0x48


class CAnimationSubGraph
{
public:

   CAnimNodeManager m_nodeManager; // 0x8 - 0x50
   CAnimComponentManager m_componentManager; // 0x50 - 0x78
   CUtlVector< CSmartPtr< CAnimParameterBase > > m_localParameters; // 0x78 - 0x90
   CUtlVector< CSmartPtr< CAnimTagBase > > m_localTags; // 0x90 - 0xA8
   CUtlVector< CUtlString > m_referencedParamGroups; // 0xA8 - 0xC0
   CUtlVector< CUtlString > m_referencedTagGroups; // 0xC0 - 0xD8

}; // size - 0xE0


class CAttributeManager
{
public:

   class cached_attribute_float_t
   {
   public:

      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4] // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14

   }; // size - 0x18

   class cached_attribute_float_t
   {
   public:

      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4] // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14

   }; // size - 0x18

   CUtlVector< CHandle< CBaseEntity > > m_Providers; // 0x8 - 0x20
   int32_t m_iReapplyProvisionParity; // 0x20 - 0x24
   CHandle< CBaseEntity > m_hOuter; // 0x24 - 0x28
   bool m_bPreventLoopback; // 0x28 - 0x29
   unsigned char pad_29[0x3] // 0x29 - 0x2C
   attributeprovidertypes_t m_ProviderType; // 0x2C - 0x30
   CUtlVector< CAttributeManager::cached_attribute_float_t > m_CachedResults; // 0x30 - 0x48

}; // size - 0x50


class CAttributeManager
{
public:

   class cached_attribute_float_t
   {
   public:

      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4] // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14

   }; // size - 0x18

   class cached_attribute_float_t
   {
   public:

      float flIn; // 0x0 - 0x4
      unsigned char pad_4[0x4] // 0x4 - 0x8
      CUtlSymbolLarge iAttribHook; // 0x8 - 0x10
      float flOut; // 0x10 - 0x14

   }; // size - 0x18

   CUtlVector< CHandle< C_BaseEntity > > m_Providers; // 0x8 - 0x20
   int32_t m_iReapplyProvisionParity; // 0x20 - 0x24
   CHandle< C_BaseEntity > m_hOuter; // 0x24 - 0x28
   bool m_bPreventLoopback; // 0x28 - 0x29
   unsigned char pad_29[0x3] // 0x29 - 0x2C
   attributeprovidertypes_t m_ProviderType; // 0x2C - 0x30
   CUtlVector< CAttributeManager::cached_attribute_float_t > m_CachedResults; // 0x30 - 0x48

}; // size - 0x50


class CBaseFire : public CBaseEntity
{
public:

   float m_flScale; // 0x4A0 - 0x4A4
   float m_flStartScale; // 0x4A4 - 0x4A8
   float m_flScaleTime; // 0x4A8 - 0x4AC
   uint32_t m_nFlags; // 0x4AC - 0x4B0

}; // size - 0x4B0


class CBasePlayerController : public C_BaseEntity
{
public:

   int32_t m_nFinalPredictedTick; // 0x540 - 0x544
   unsigned char pad_544[0x4] // 0x544 - 0x548
   C_CommandContext m_CommandContext; // 0x548 - 0x5C8
   uint64_t m_nInButtonsWhichAreToggles; // 0x5C8 - 0x5D0
   uint32_t m_nTickBase; // 0x5D0 - 0x5D4
   CHandle< C_BasePlayerPawn > m_hPawn; // 0x5D4 - 0x5D8
   CHandle< C_BasePlayerPawn > m_hPredictedPawn; // 0x5D8 - 0x5DC
   CSplitScreenSlot m_nSplitScreenSlot; // 0x5DC - 0x5E0
   CHandle< CBasePlayerController > m_hSplitOwner; // 0x5E0 - 0x5E4
   unsigned char pad_5E4[0x4] // 0x5E4 - 0x5E8
   CUtlVector< CHandle< CBasePlayerController > > m_hSplitScreenPlayers; // 0x5E8 - 0x600
   bool m_bIsHLTV; // 0x600 - 0x601
   unsigned char pad_601[0x3] // 0x601 - 0x604
   PlayerConnectedState m_iConnected; // 0x604 - 0x608
   char m_iszPlayerName[128]; // 0x608 - 0x688
   unsigned char pad_688[0x8] // 0x688 - 0x690
   uint64_t m_steamID; // 0x690 - 0x698
   bool m_bIsLocalPlayerController; // 0x698 - 0x699
   unsigned char pad_699[0x3] // 0x699 - 0x69C
   uint32_t m_iDesiredFOV; // 0x69C - 0x6A0

}; // size - 0x6A0


class CBasePlayerController : public CBaseEntity
{
public:

   uint64_t m_nInButtonsWhichAreToggles; // 0x4A8 - 0x4B0
   uint32_t m_nTickBase; // 0x4B0 - 0x4B4
   unsigned char pad_4B4[0x2C] // 0x4B4 - 0x4E0
   CHandle< CBasePlayerPawn > m_hPawn; // 0x4E0 - 0x4E4
   CSplitScreenSlot m_nSplitScreenSlot; // 0x4E4 - 0x4E8
   CHandle< CBasePlayerController > m_hSplitOwner; // 0x4E8 - 0x4EC
   unsigned char pad_4EC[0x4] // 0x4EC - 0x4F0
   CUtlVector< CHandle< CBasePlayerController > > m_hSplitScreenPlayers; // 0x4F0 - 0x508
   bool m_bIsHLTV; // 0x508 - 0x509
   unsigned char pad_509[0x3] // 0x509 - 0x50C
   PlayerConnectedState m_iConnected; // 0x50C - 0x510
   char m_iszPlayerName[128]; // 0x510 - 0x590
   CUtlString m_szNetworkIDString; // 0x590 - 0x598
   float m_fLerpTime; // 0x598 - 0x59C
   bool m_bLagCompensation; // 0x59C - 0x59D
   bool m_bPredict; // 0x59D - 0x59E
   bool m_bAutoKickDisabled; // 0x59E - 0x59F
   bool m_bIsLowViolence; // 0x59F - 0x5A0
   bool m_bGamePaused; // 0x5A0 - 0x5A1
   unsigned char pad_5A1[0x77] // 0x5A1 - 0x618
   int32_t m_nHighestCommandNumberReceived; // 0x618 - 0x61C
   unsigned char pad_61C[0x4] // 0x61C - 0x620
   int64_t m_nUsecTimestampLastUserCmdReceived; // 0x620 - 0x628
   unsigned char pad_628[0x10] // 0x628 - 0x638
   ChatIgnoreType_t m_iIgnoreGlobalChat; // 0x638 - 0x63C
   float m_flLastPlayerTalkTime; // 0x63C - 0x640
   float m_flLastEntitySteadyState; // 0x640 - 0x644
   int32_t m_nAvailableEntitySteadyState; // 0x644 - 0x648
   bool m_bHasAnySteadyStateEnts; // 0x648 - 0x649
   unsigned char pad_649[0xF] // 0x649 - 0x658
   uint64_t m_steamID; // 0x658 - 0x660
   uint32_t m_iDesiredFOV; // 0x660 - 0x664

}; // size - 0x668


class CBasePlayerWeaponVData : public CEntitySubclassVDataBase
{
public:

   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_szWorldModel; // 0x28 - 0x108
   bool m_bBuiltRightHanded; // 0x108 - 0x109
   bool m_bAllowFlipping; // 0x109 - 0x10A
   bool m_bIsFullAuto; // 0x10A - 0x10B
   unsigned char pad_10B[0x1] // 0x10B - 0x10C
   int32_t m_nNumBullets; // 0x10C - 0x110
   CUtlString m_sMuzzleAttachment; // 0x110 - 0x118
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szMuzzleFlashParticle; // 0x118 - 0x1F8
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szTracerParticle; // 0x1F8 - 0x2D8
   ItemFlagTypes_t m_iFlags; // 0x2D8 - 0x2D9
   AmmoIndex_t m_nPrimaryAmmoType; // 0x2D9 - 0x2DA
   AmmoIndex_t m_nSecondaryAmmoType; // 0x2DA - 0x2DB
   unsigned char pad_2DB[0x1] // 0x2DB - 0x2DC
   int32_t m_iMaxClip1; // 0x2DC - 0x2E0
   int32_t m_iMaxClip2; // 0x2E0 - 0x2E4
   int32_t m_iDefaultClip1; // 0x2E4 - 0x2E8
   int32_t m_iDefaultClip2; // 0x2E8 - 0x2EC
   int32_t m_iWeight; // 0x2EC - 0x2F0
   bool m_bAutoSwitchTo; // 0x2F0 - 0x2F1
   bool m_bAutoSwitchFrom; // 0x2F1 - 0x2F2
   unsigned char pad_2F2[0x2] // 0x2F2 - 0x2F4
   RumbleEffect_t m_iRumbleEffect; // 0x2F4 - 0x2F8
   CUtlMap< WeaponSound_t, CSoundEventName > m_aShootSounds; // 0x2F8 - 0x318
   int32_t m_iSlot; // 0x318 - 0x31C
   int32_t m_iPosition; // 0x31C - 0x320

}; // size - 0x320


class CBasePlayerWeaponVData : public CEntitySubclassVDataBase
{
public:

   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_szWorldModel; // 0x28 - 0x108
   bool m_bBuiltRightHanded; // 0x108 - 0x109
   bool m_bAllowFlipping; // 0x109 - 0x10A
   bool m_bIsFullAuto; // 0x10A - 0x10B
   unsigned char pad_10B[0x1] // 0x10B - 0x10C
   int32_t m_nNumBullets; // 0x10C - 0x110
   CUtlString m_sMuzzleAttachment; // 0x110 - 0x118
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szMuzzleFlashParticle; // 0x118 - 0x1F8
   CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szTracerParticle; // 0x1F8 - 0x2D8
   ItemFlagTypes_t m_iFlags; // 0x2D8 - 0x2D9
   AmmoIndex_t m_nPrimaryAmmoType; // 0x2D9 - 0x2DA
   AmmoIndex_t m_nSecondaryAmmoType; // 0x2DA - 0x2DB
   unsigned char pad_2DB[0x1] // 0x2DB - 0x2DC
   int32_t m_iMaxClip1; // 0x2DC - 0x2E0
   int32_t m_iMaxClip2; // 0x2E0 - 0x2E4
   int32_t m_iDefaultClip1; // 0x2E4 - 0x2E8
   int32_t m_iDefaultClip2; // 0x2E8 - 0x2EC
   int32_t m_iWeight; // 0x2EC - 0x2F0
   bool m_bAutoSwitchTo; // 0x2F0 - 0x2F1
   bool m_bAutoSwitchFrom; // 0x2F1 - 0x2F2
   unsigned char pad_2F2[0x2] // 0x2F2 - 0x2F4
   RumbleEffect_t m_iRumbleEffect; // 0x2F4 - 0x2F8
   CUtlMap< WeaponSound_t, CSoundEventName > m_aShootSounds; // 0x2F8 - 0x318
   int32_t m_iSlot; // 0x318 - 0x31C
   int32_t m_iPosition; // 0x31C - 0x320

}; // size - 0x320


class CBaseTrailRenderer : public CBaseRendererSource2
{
public:

   ParticleOrientationChoiceList_t m_nOrientationType; // 0x2050 - 0x2054
   int32_t m_nOrientationControlPoint; // 0x2054 - 0x2058
   float m_flMinSize; // 0x2058 - 0x205C
   float m_flMaxSize; // 0x205C - 0x2060
   CParticleCollectionFloatInput m_flStartFadeSize; // 0x2060 - 0x2198
   CParticleCollectionFloatInput m_flEndFadeSize; // 0x2198 - 0x22D0
   bool m_bClampV; // 0x22D0 - 0x22D1

}; // size - 0x22E0


class CBot
{
public:

   CCSPlayerPawnBase* m_pPlayer; // 0x10 - 0x18
   bool m_bHasSpawned; // 0x18 - 0x19
   unsigned char pad_19[0x3] // 0x19 - 0x1C
   uint32_t m_id; // 0x1C - 0x20
   unsigned char pad_20[0x70] // 0x20 - 0x90
   bool m_isRunning; // 0x90 - 0x91
   bool m_isCrouching; // 0x91 - 0x92
   unsigned char pad_92[0x2] // 0x92 - 0x94
   float m_forwardSpeed; // 0x94 - 0x98
   float m_leftSpeed; // 0x98 - 0x9C
   float m_verticalSpeed; // 0x9C - 0xA0
   uint64_t m_buttonFlags; // 0xA0 - 0xA8
   float m_jumpTimestamp; // 0xA8 - 0xAC
   Vector m_viewForward; // 0xAC - 0xB8
   unsigned char pad_B8[0x10] // 0xB8 - 0xC8
   int32_t m_postureStackIndex; // 0xC8 - 0xCC

}; // size - 0xD0


class CBtNodeCondition : public CBtNodeDecorator
{
public:

   bool m_bNegated; // 0x58 - 0x59

}; // size - 0x60


class CEnvCubemap : public CBaseEntity
{
public:

   CStrongHandle< InfoForResourceTypeCTextureBase > m_hCubemapTexture; // 0x590 - 0x598
   bool m_bCustomCubemapTexture; // 0x598 - 0x599
   unsigned char pad_599[0x3] // 0x599 - 0x59C
   float m_flInfluenceRadius; // 0x59C - 0x5A0
   Vector m_vBoxProjectMins; // 0x5A0 - 0x5AC
   Vector m_vBoxProjectMaxs; // 0x5AC - 0x5B8
   CUtlSymbolLarge m_LightGroups; // 0x5B8 - 0x5C0
   bool m_bMoveable; // 0x5C0 - 0x5C1
   unsigned char pad_5C1[0x3] // 0x5C1 - 0x5C4
   int32_t m_nHandshake; // 0x5C4 - 0x5C8
   int32_t m_nEnvCubeMapArrayIndex; // 0x5C8 - 0x5CC
   int32_t m_nPriority; // 0x5CC - 0x5D0
   float m_flEdgeFadeDist; // 0x5D0 - 0x5D4
   Vector m_vEdgeFadeDists; // 0x5D4 - 0x5E0
   float m_flDiffuseScale; // 0x5E0 - 0x5E4
   bool m_bStartDisabled; // 0x5E4 - 0x5E5
   bool m_bDefaultEnvMap; // 0x5E5 - 0x5E6
   bool m_bDefaultSpecEnvMap; // 0x5E6 - 0x5E7
   bool m_bIndoorCubeMap; // 0x5E7 - 0x5E8
   bool m_bCopyDiffuseFromDefaultCubemap; // 0x5E8 - 0x5E9
   unsigned char pad_5E9[0xF] // 0x5E9 - 0x5F8
   bool m_bEnabled; // 0x5F8 - 0x5F9

}; // size - 0x600


class CEnvSoundscapeProxy : public CEnvSoundscape
{
public:

   CUtlSymbolLarge m_MainSoundscapeName; // 0x538 - 0x540

}; // size - 0x540


class CEnvSoundscapeTriggerable : public CEnvSoundscape
{
public:


}; // size - 0x538


class CFuncLadder : public CBaseModelEntity
{
public:

   Vector m_vecLadderDir; // 0x6F0 - 0x6FC
   unsigned char pad_6FC[0x4] // 0x6FC - 0x700
   CUtlVector< CHandle< CInfoLadderDismount > > m_Dismounts; // 0x700 - 0x718
   Vector m_vecLocalTop; // 0x718 - 0x724
   Vector m_vecPlayerMountPositionTop; // 0x724 - 0x730
   Vector m_vecPlayerMountPositionBottom; // 0x730 - 0x73C
   float m_flAutoRideSpeed; // 0x73C - 0x740
   bool m_bDisabled; // 0x740 - 0x741
   bool m_bFakeLadder; // 0x741 - 0x742
   bool m_bHasSlack; // 0x742 - 0x743
   unsigned char pad_743[0x5] // 0x743 - 0x748
   CUtlSymbolLarge m_surfacePropName; // 0x748 - 0x750
   CEntityIOOutput m_OnPlayerGotOnLadder; // 0x750 - 0x778
   CEntityIOOutput m_OnPlayerGotOffLadder; // 0x778 - 0x7A0

}; // size - 0x7A0


class CFuncNavBlocker : public CBaseModelEntity
{
public:

   bool m_bDisabled; // 0x6F0 - 0x6F1
   unsigned char pad_6F1[0x3] // 0x6F1 - 0x6F4
   int32_t m_nBlockedTeamNumber; // 0x6F4 - 0x6F8

}; // size - 0x700


class CFuncTrackChange : public CFuncPlatRot
{
public:

   CPathTrack* m_trackTop; // 0x7B8 - 0x7C0
   CPathTrack* m_trackBottom; // 0x7C0 - 0x7C8
   CFuncTrackTrain* m_train; // 0x7C8 - 0x7D0
   CUtlSymbolLarge m_trackTopName; // 0x7D0 - 0x7D8
   CUtlSymbolLarge m_trackBottomName; // 0x7D8 - 0x7E0
   CUtlSymbolLarge m_trainName; // 0x7E0 - 0x7E8
   TRAIN_CODE m_code; // 0x7E8 - 0x7EC
   int32_t m_targetState; // 0x7EC - 0x7F0
   int32_t m_use; // 0x7F0 - 0x7F4

}; // size - 0x7F8


class CFuncTrackTrain : public CBaseModelEntity
{
public:

   CHandle< CPathTrack > m_ppath; // 0x6F0 - 0x6F4
   float m_length; // 0x6F4 - 0x6F8
   Vector m_controlMins; // 0x6F8 - 0x704
   Vector m_controlMaxs; // 0x704 - 0x710
   Vector m_lastBlockPos; // 0x710 - 0x71C
   int32_t m_lastBlockTick; // 0x71C - 0x720
   float m_flVolume; // 0x720 - 0x724
   float m_flBank; // 0x724 - 0x728
   float m_oldSpeed; // 0x728 - 0x72C
   float m_flBlockDamage; // 0x72C - 0x730
   float m_height; // 0x730 - 0x734
   float m_maxSpeed; // 0x734 - 0x738
   float m_dir; // 0x738 - 0x73C
   unsigned char pad_73C[0x4] // 0x73C - 0x740
   CUtlSymbolLarge m_iszSoundMove; // 0x740 - 0x748
   CUtlSymbolLarge m_iszSoundMovePing; // 0x748 - 0x750
   CUtlSymbolLarge m_iszSoundStart; // 0x750 - 0x758
   CUtlSymbolLarge m_iszSoundStop; // 0x758 - 0x760
   CUtlSymbolLarge m_strPathTarget; // 0x760 - 0x768
   float m_flMoveSoundMinDuration; // 0x768 - 0x76C
   float m_flMoveSoundMaxDuration; // 0x76C - 0x770
   GameTime_t m_flNextMoveSoundTime; // 0x770 - 0x774
   float m_flMoveSoundMinPitch; // 0x774 - 0x778
   float m_flMoveSoundMaxPitch; // 0x778 - 0x77C
   TrainOrientationType_t m_eOrientationType; // 0x77C - 0x780
   TrainVelocityType_t m_eVelocityType; // 0x780 - 0x784
   unsigned char pad_784[0xC] // 0x784 - 0x790
   CEntityIOOutput m_OnStart; // 0x790 - 0x7B8
   CEntityIOOutput m_OnNext; // 0x7B8 - 0x7E0
   CEntityIOOutput m_OnArrivedAtDestinationNode; // 0x7E0 - 0x808
   bool m_bManualSpeedChanges; // 0x808 - 0x809
   unsigned char pad_809[0x3] // 0x809 - 0x80C
   float m_flDesiredSpeed; // 0x80C - 0x810
   GameTime_t m_flSpeedChangeTime; // 0x810 - 0x814
   float m_flAccelSpeed; // 0x814 - 0x818
   float m_flDecelSpeed; // 0x818 - 0x81C
   bool m_bAccelToSpeed; // 0x81C - 0x81D
   unsigned char pad_81D[0x3] // 0x81D - 0x820
   float m_flTimeScale; // 0x820 - 0x824
   GameTime_t m_flNextMPSoundTime; // 0x824 - 0x828

}; // size - 0x828


class CFuncWall : public CBaseModelEntity
{
public:

   int32_t m_nState; // 0x6F0 - 0x6F4

}; // size - 0x6F8


class CGameRulesProxy : public CBaseEntity
{
public:


}; // size - 0x4A0


class CGameSceneNode
{
public:

   CTransform m_nodeToWorld; // 0x10 - 0x30
   CEntityInstance* m_pOwner; // 0x30 - 0x38
   CGameSceneNode* m_pParent; // 0x38 - 0x40
   CGameSceneNode* m_pChild; // 0x40 - 0x48
   CGameSceneNode* m_pNextSibling; // 0x48 - 0x50
   unsigned char pad_50[0x20] // 0x50 - 0x70
   CGameSceneNodeHandle m_hParent; // 0x70 - 0x80
   CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x80 - 0xB0
   unsigned char pad_B0[0x8] // 0xB0 - 0xB8
   QAngle m_angRotation; // 0xB8 - 0xC4
   float m_flScale; // 0xC4 - 0xC8
   Vector m_vecAbsOrigin; // 0xC8 - 0xD4
   QAngle m_angAbsRotation; // 0xD4 - 0xE0
   float m_flAbsScale; // 0xE0 - 0xE4
   int16_t m_nParentAttachmentOrBone; // 0xE4 - 0xE6
   bool m_bDebugAbsOriginChanges; // 0xE6 - 0xE7
   bool m_bDormant; // 0xE7 - 0xE8
   bool m_bForceParentToBeNetworked; // 0xE8 - 0xE9
   bitfield:1 m_bDirtyHierarchy; // 0x0 - 0x0
   bitfield:1 m_bDirtyBoneMergeInfo; // 0x0 - 0x0
   bitfield:1 m_bNetworkedPositionChanged; // 0x0 - 0x0
   bitfield:1 m_bNetworkedAnglesChanged; // 0x0 - 0x0
   bitfield:1 m_bNetworkedScaleChanged; // 0x0 - 0x0
   bitfield:1 m_bWillBeCallingPostDataUpdate; // 0x0 - 0x0
   bitfield:1 m_bNotifyBoneTransformsChanged; // 0x0 - 0x0
   bitfield:1 m_bBoneMergeFlex; // 0x0 - 0x0
   bitfield:2 m_nLatchAbsOrigin; // 0x0 - 0x0
   bitfield:1 m_bDirtyBoneMergeBoneToRoot; // 0x0 - 0x0
   unsigned char pad_0[0xEB] // 0x0 - 0xEB
   uint8_t m_nHierarchicalDepth; // 0xEB - 0xEC
   uint8_t m_nHierarchyType; // 0xEC - 0xED
   uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0xED - 0xEE
   unsigned char pad_EE[0x2] // 0xEE - 0xF0
   CUtlStringToken m_name; // 0xF0 - 0xF4
   unsigned char pad_F4[0x3C] // 0xF4 - 0x130
   CUtlStringToken m_hierarchyAttachName; // 0x130 - 0x134
   float m_flZOffset; // 0x134 - 0x138
   Vector m_vRenderOrigin; // 0x138 - 0x144

}; // size - 0x150


class CGameSceneNode
{
public:

   CTransform m_nodeToWorld; // 0x10 - 0x30
   CEntityInstance* m_pOwner; // 0x30 - 0x38
   CGameSceneNode* m_pParent; // 0x38 - 0x40
   CGameSceneNode* m_pChild; // 0x40 - 0x48
   CGameSceneNode* m_pNextSibling; // 0x48 - 0x50
   unsigned char pad_50[0x20] // 0x50 - 0x70
   CGameSceneNodeHandle m_hParent; // 0x70 - 0x80
   CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x80 - 0xB0
   unsigned char pad_B0[0x8] // 0xB0 - 0xB8
   QAngle m_angRotation; // 0xB8 - 0xC4
   float m_flScale; // 0xC4 - 0xC8
   Vector m_vecAbsOrigin; // 0xC8 - 0xD4
   QAngle m_angAbsRotation; // 0xD4 - 0xE0
   float m_flAbsScale; // 0xE0 - 0xE4
   int16_t m_nParentAttachmentOrBone; // 0xE4 - 0xE6
   bool m_bDebugAbsOriginChanges; // 0xE6 - 0xE7
   bool m_bDormant; // 0xE7 - 0xE8
   bool m_bForceParentToBeNetworked; // 0xE8 - 0xE9
   bitfield:1 m_bDirtyHierarchy; // 0x0 - 0x0
   bitfield:1 m_bDirtyBoneMergeInfo; // 0x0 - 0x0
   bitfield:1 m_bNetworkedPositionChanged; // 0x0 - 0x0
   bitfield:1 m_bNetworkedAnglesChanged; // 0x0 - 0x0
   bitfield:1 m_bNetworkedScaleChanged; // 0x0 - 0x0
   bitfield:1 m_bWillBeCallingPostDataUpdate; // 0x0 - 0x0
   bitfield:1 m_bNotifyBoneTransformsChanged; // 0x0 - 0x0
   bitfield:1 m_bBoneMergeFlex; // 0x0 - 0x0
   bitfield:2 m_nLatchAbsOrigin; // 0x0 - 0x0
   bitfield:1 m_bDirtyBoneMergeBoneToRoot; // 0x0 - 0x0
   unsigned char pad_0[0xEB] // 0x0 - 0xEB
   uint8_t m_nHierarchicalDepth; // 0xEB - 0xEC
   uint8_t m_nHierarchyType; // 0xEC - 0xED
   uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0xED - 0xEE
   unsigned char pad_EE[0x2] // 0xEE - 0xF0
   CUtlStringToken m_name; // 0xF0 - 0xF4
   unsigned char pad_F4[0x3C] // 0xF4 - 0x130
   CUtlStringToken m_hierarchyAttachName; // 0x130 - 0x134
   float m_flZOffset; // 0x134 - 0x138
   Vector m_vRenderOrigin; // 0x138 - 0x144

}; // size - 0x150


class CHostage : public CHostageExpresserShim
{
public:

   CEntityIOOutput m_OnHostageBeginGrab; // 0x980 - 0x9A8
   CEntityIOOutput m_OnFirstPickedUp; // 0x9A8 - 0x9D0
   CEntityIOOutput m_OnDroppedNotRescued; // 0x9D0 - 0x9F8
   CEntityIOOutput m_OnRescued; // 0x9F8 - 0xA20
   EntitySpottedState_t m_entitySpottedState; // 0xA20 - 0xA38
   int32_t m_nSpotRules; // 0xA38 - 0xA3C
   uint32_t m_uiHostageSpawnExclusionGroupMask; // 0xA3C - 0xA40
   uint32_t m_nHostageSpawnRandomFactor; // 0xA40 - 0xA44
   bool m_bRemove; // 0xA44 - 0xA45
   unsigned char pad_A45[0x3] // 0xA45 - 0xA48
   Vector m_vel; // 0xA48 - 0xA54
   bool m_isRescued; // 0xA54 - 0xA55
   bool m_jumpedThisFrame; // 0xA55 - 0xA56
   unsigned char pad_A56[0x2] // 0xA56 - 0xA58
   int32_t m_nHostageState; // 0xA58 - 0xA5C
   CHandle< CBaseEntity > m_leader; // 0xA5C - 0xA60
   CHandle< CCSPlayerPawnBase > m_lastLeader; // 0xA60 - 0xA64
   unsigned char pad_A64[0x4] // 0xA64 - 0xA68
   CountdownTimer m_reuseTimer; // 0xA68 - 0xA80
   bool m_hasBeenUsed; // 0xA80 - 0xA81
   unsigned char pad_A81[0x3] // 0xA81 - 0xA84
   Vector m_accel; // 0xA84 - 0xA90
   bool m_isRunning; // 0xA90 - 0xA91
   bool m_isCrouching; // 0xA91 - 0xA92
   unsigned char pad_A92[0x6] // 0xA92 - 0xA98
   CountdownTimer m_jumpTimer; // 0xA98 - 0xAB0
   bool m_isWaitingForLeader; // 0xAB0 - 0xAB1
   unsigned char pad_AB1[0x200F] // 0xAB1 - 0x2AC0
   CountdownTimer m_repathTimer; // 0x2AC0 - 0x2AD8
   CountdownTimer m_inhibitDoorTimer; // 0x2AD8 - 0x2AF0
   unsigned char pad_2AF0[0x78] // 0x2AF0 - 0x2B68
   CountdownTimer m_inhibitObstacleAvoidanceTimer; // 0x2B68 - 0x2B80
   unsigned char pad_2B80[0x8] // 0x2B80 - 0x2B88
   CountdownTimer m_wiggleTimer; // 0x2B88 - 0x2BA0
   unsigned char pad_2BA0[0x4] // 0x2BA0 - 0x2BA4
   bool m_isAdjusted; // 0x2BA4 - 0x2BA5
   bool m_bHandsHaveBeenCut; // 0x2BA5 - 0x2BA6
   unsigned char pad_2BA6[0x2] // 0x2BA6 - 0x2BA8
   CHandle< CCSPlayerPawn > m_pHostageGrabber; // 0x2BA8 - 0x2BAC
   GameTime_t m_fLastGrabTime; // 0x2BAC - 0x2BB0
   float m_flGrabbingLength; // 0x2BB0 - 0x2BB4
   Vector m_vecPositionWhenStartedDroppingToGround; // 0x2BB4 - 0x2BC0
   Vector m_vecGrabbedPos; // 0x2BC0 - 0x2BCC
   GameTime_t m_flRescueStartTime; // 0x2BCC - 0x2BD0
   GameTime_t m_flGrabSuccessTime; // 0x2BD0 - 0x2BD4
   GameTime_t m_flDropStartTime; // 0x2BD4 - 0x2BD8
   int32_t m_nApproachRewardPayouts; // 0x2BD8 - 0x2BDC
   int32_t m_nPickupEventCount; // 0x2BDC - 0x2BE0
   Vector m_vecSpawnGroundPos; // 0x2BE0 - 0x2BEC

}; // size - 0x2C00


class CHostageRescueZoneShim : public CBaseTrigger
{
public:


}; // size - 0x898


class CInferno : public CBaseModelEntity
{
public:

   int32 m_fireXDelta[64]; // 0x700 - 0x800
   int32 m_fireYDelta[64]; // 0x800 - 0x900
   int32 m_fireZDelta[64]; // 0x900 - 0xA00
   int32 m_fireParentXDelta[64]; // 0xA00 - 0xB00
   int32 m_fireParentYDelta[64]; // 0xB00 - 0xC00
   int32 m_fireParentZDelta[64]; // 0xC00 - 0xD00
   bool m_bFireIsBurning[64]; // 0xD00 - 0xD40
   Vector m_BurnNormal[64]; // 0xD40 - 0x1040
   int32_t m_fireCount; // 0x1040 - 0x1044
   int32_t m_nInfernoType; // 0x1044 - 0x1048
   int32_t m_nFireEffectTickBegin; // 0x1048 - 0x104C
   float m_nFireLifetime; // 0x104C - 0x1050
   bool m_bInPostEffectTime; // 0x1050 - 0x1051
   unsigned char pad_1051[0x3] // 0x1051 - 0x1054
   int32_t m_nFiresExtinguishCount; // 0x1054 - 0x1058
   bool m_bWasCreatedInSmoke; // 0x1058 - 0x1059
   unsigned char pad_1059[0x207] // 0x1059 - 0x1260
   Extent m_extent; // 0x1260 - 0x1278
   CountdownTimer m_damageTimer; // 0x1278 - 0x1290
   CountdownTimer m_damageRampTimer; // 0x1290 - 0x12A8
   Vector m_splashVelocity; // 0x12A8 - 0x12B4
   Vector m_InitialSplashVelocity; // 0x12B4 - 0x12C0
   Vector m_startPos; // 0x12C0 - 0x12CC
   Vector m_vecOriginalSpawnLocation; // 0x12CC - 0x12D8
   IntervalTimer m_activeTimer; // 0x12D8 - 0x12E8
   int32_t m_fireSpawnOffset; // 0x12E8 - 0x12EC
   int32_t m_nMaxFlames; // 0x12EC - 0x12F0
   CountdownTimer m_BookkeepingTimer; // 0x12F0 - 0x1308
   CountdownTimer m_NextSpreadTimer; // 0x1308 - 0x1320
   uint16_t m_nSourceItemDefIndex; // 0x1320 - 0x1322

}; // size - 0x1378


class CInfoDynamicShadowHint : public CPointEntity
{
public:

   bool m_bDisabled; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x3] // 0x4A1 - 0x4A4
   float m_flRange; // 0x4A4 - 0x4A8
   int32_t m_nImportance; // 0x4A8 - 0x4AC
   int32_t m_nLightChoice; // 0x4AC - 0x4B0
   CHandle< CBaseEntity > m_hLight; // 0x4B0 - 0x4B4

}; // size - 0x4B8


class CInfoDynamicShadowHint : public C_PointEntity
{
public:

   bool m_bDisabled; // 0x538 - 0x539
   unsigned char pad_539[0x3] // 0x539 - 0x53C
   float m_flRange; // 0x53C - 0x540
   int32_t m_nImportance; // 0x540 - 0x544
   int32_t m_nLightChoice; // 0x544 - 0x548
   CHandle< C_BaseEntity > m_hLight; // 0x548 - 0x54C

}; // size - 0x550


class CItemAssaultSuit : public CItem
{
public:


}; // size - 0x8F8


class CItemDefuser : public CItem
{
public:

   EntitySpottedState_t m_entitySpottedState; // 0x8F8 - 0x910
   int32_t m_nSpotRules; // 0x910 - 0x914

}; // size - 0x918


class CKnife : public CWeaponCSBase
{
public:


}; // size - 0xD50


class CLightDirectionalEntity : public CLightEntity
{
public:


}; // size - 0x6F8


class CLogicAutosave : public CLogicalEntity
{
public:

   bool m_bForceNewLevelUnit; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x3] // 0x4A1 - 0x4A4
   int32_t m_minHitPoints; // 0x4A4 - 0x4A8
   int32_t m_minHitPointsToCommit; // 0x4A8 - 0x4AC

}; // size - 0x4B0


class CLogicNPCCounterAABB : public CLogicNPCCounter
{
public:

   Vector m_vDistanceOuterMins; // 0x7E0 - 0x7EC
   Vector m_vDistanceOuterMaxs; // 0x7EC - 0x7F8
   Vector m_vOuterMins; // 0x7F8 - 0x804
   Vector m_vOuterMaxs; // 0x804 - 0x810

}; // size - 0x810


class CMarkupVolumeWithRef : public CMarkupVolumeTagged
{
public:

   bool m_bUseRef; // 0x730 - 0x731
   unsigned char pad_731[0x3] // 0x731 - 0x734
   Vector m_vRefPos; // 0x734 - 0x740
   float m_flRefDot; // 0x740 - 0x744

}; // size - 0x748


class CMolotovGrenade : public CBaseCSGrenade
{
public:


}; // size - 0xD90


class CMotionGraph
{
public:

   CParamSpanUpdater m_paramSpans; // 0x10 - 0x28
   CUtlVector< TagSpan_t > m_tags; // 0x28 - 0x40
   CSmartPtr< CMotionNode > m_pRootNode; // 0x40 - 0x48
   int32_t m_nParameterCount; // 0x48 - 0x4C
   int32_t m_nConfigStartIndex; // 0x4C - 0x50
   int32_t m_nConfigCount; // 0x50 - 0x54
   bool m_bLoop; // 0x54 - 0x55

}; // size - 0x58


class CNavVolumeCalculatedVector : public CNavVolume
{
public:


}; // size - 0x98


class CNavVolumeSphere : public CNavVolume
{
public:

   Vector m_vCenter; // 0x70 - 0x7C
   float m_flRadius; // 0x7C - 0x80

}; // size - 0x80


class CNavVolumeVector : public CNavVolume
{
public:

   bool m_bHasBeenPreFiltered; // 0x78 - 0x79

}; // size - 0x98


class CParticleSystem : public CBaseModelEntity
{
public:

   char m_szSnapshotFileName[512]; // 0x6F0 - 0x8F0
   bool m_bActive; // 0x8F0 - 0x8F1
   bool m_bFrozen; // 0x8F1 - 0x8F2
   unsigned char pad_8F2[0x2] // 0x8F2 - 0x8F4
   float m_flFreezeTransitionDuration; // 0x8F4 - 0x8F8
   int32_t m_nStopType; // 0x8F8 - 0x8FC
   bool m_bAnimateDuringGameplayPause; // 0x8FC - 0x8FD
   unsigned char pad_8FD[0x3] // 0x8FD - 0x900
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x900 - 0x908
   GameTime_t m_flStartTime; // 0x908 - 0x90C
   float m_flPreSimTime; // 0x90C - 0x910
   Vector m_vServerControlPoints[4]; // 0x910 - 0x940
   uint8 m_iServerControlPointAssignments[4]; // 0x940 - 0x944
   CHandle< CBaseEntity > m_hControlPointEnts[64]; // 0x944 - 0xA44
   bool m_bNoSave; // 0xA44 - 0xA45
   bool m_bNoFreeze; // 0xA45 - 0xA46
   bool m_bStartActive; // 0xA46 - 0xA47
   unsigned char pad_A47[0x1] // 0xA47 - 0xA48
   CUtlSymbolLarge m_iszEffectName; // 0xA48 - 0xA50
   CUtlSymbolLarge m_iszControlPointNames[64]; // 0xA50 - 0xC50
   int32_t m_nDataCP; // 0xC50 - 0xC54
   Vector m_vecDataCPValue; // 0xC54 - 0xC60
   int32_t m_nTintCP; // 0xC60 - 0xC64
   Color m_clrTint; // 0xC64 - 0xC68

}; // size - 0xC68


class CPathCorner : public CPointEntity
{
public:

   float m_flWait; // 0x4A0 - 0x4A4
   float m_flRadius; // 0x4A4 - 0x4A8
   CEntityIOOutput m_OnPass; // 0x4A8 - 0x4D0

}; // size - 0x4D0


class CPathKeyFrame : public CLogicalEntity
{
public:

   Vector m_Origin; // 0x4A0 - 0x4AC
   QAngle m_Angles; // 0x4AC - 0x4B8
   unsigned char pad_4B8[0x8] // 0x4B8 - 0x4C0
   Quaternion m_qAngle; // 0x4C0 - 0x4D0
   CUtlSymbolLarge m_iNextKey; // 0x4D0 - 0x4D8
   float m_flNextTime; // 0x4D8 - 0x4DC
   unsigned char pad_4DC[0x4] // 0x4DC - 0x4E0
   CPathKeyFrame* m_pNextKey; // 0x4E0 - 0x4E8
   CPathKeyFrame* m_pPrevKey; // 0x4E8 - 0x4F0
   float m_flSpeed; // 0x4F0 - 0x4F4

}; // size - 0x500


class CPathParticleRope : public CBaseEntity
{
public:

   bool m_bStartActive; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x3] // 0x4A1 - 0x4A4
   float m_flMaxSimulationTime; // 0x4A4 - 0x4A8
   CUtlSymbolLarge m_iszEffectName; // 0x4A8 - 0x4B0
   CUtlVector< CUtlSymbolLarge > m_PathNodes_Name; // 0x4B0 - 0x4C8
   float m_flParticleSpacing; // 0x4C8 - 0x4CC
   float m_flSlack; // 0x4CC - 0x4D0
   float m_flRadius; // 0x4D0 - 0x4D4
   Color m_ColorTint; // 0x4D4 - 0x4D8
   int32_t m_nEffectState; // 0x4D8 - 0x4DC
   unsigned char pad_4DC[0x4] // 0x4DC - 0x4E0
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x4E0 - 0x4E8
   CNetworkUtlVectorBase< Vector > m_PathNodes_Position; // 0x4E8 - 0x500
   CNetworkUtlVectorBase< Vector > m_PathNodes_TangentIn; // 0x500 - 0x518
   CNetworkUtlVectorBase< Vector > m_PathNodes_TangentOut; // 0x518 - 0x530
   CNetworkUtlVectorBase< Vector > m_PathNodes_Color; // 0x530 - 0x548
   CNetworkUtlVectorBase< bool > m_PathNodes_PinEnabled; // 0x548 - 0x560
   CNetworkUtlVectorBase< float32 > m_PathNodes_RadiusScale; // 0x560 - 0x578

}; // size - 0x580


class CPhysHinge : public CPhysConstraint
{
public:

   ConstraintSoundInfo m_soundInfo; // 0x500 - 0x588
   CEntityIOOutput m_NotifyMinLimitReached; // 0x588 - 0x5B0
   CEntityIOOutput m_NotifyMaxLimitReached; // 0x5B0 - 0x5D8
   bool m_bAtMinLimit; // 0x5D8 - 0x5D9
   bool m_bAtMaxLimit; // 0x5D9 - 0x5DA
   unsigned char pad_5DA[0x2] // 0x5DA - 0x5DC
   constraint_hingeparams_t m_hinge; // 0x5DC - 0x61C
   float m_hingeFriction; // 0x61C - 0x620
   float m_systemLoadScale; // 0x620 - 0x624
   bool m_bIsAxisLocal; // 0x624 - 0x625
   unsigned char pad_625[0x3] // 0x625 - 0x628
   float m_flMinRotation; // 0x628 - 0x62C
   float m_flMaxRotation; // 0x62C - 0x630
   float m_flInitialRotation; // 0x630 - 0x634
   float m_flMotorFrequency; // 0x634 - 0x638
   float m_flMotorDampingRatio; // 0x638 - 0x63C
   float m_flAngleSpeed; // 0x63C - 0x640
   float m_flAngleSpeedThreshold; // 0x640 - 0x644
   unsigned char pad_644[0x4] // 0x644 - 0x648
   CEntityIOOutput m_OnStartMoving; // 0x648 - 0x670
   CEntityIOOutput m_OnStopMoving; // 0x670 - 0x698

}; // size - 0x698


class CPlantedC4 : public CBaseAnimGraph
{
public:

   bool m_bPlantedAtQuestTarget; // 0x820 - 0x821
   bool m_bBombTicking; // 0x821 - 0x822
   unsigned char pad_822[0x2] // 0x822 - 0x824
   GameTime_t m_flC4Blow; // 0x824 - 0x828
   int32_t m_nBombSite; // 0x828 - 0x82C
   int32_t m_nSourceSoundscapeHash; // 0x82C - 0x830
   CEntityIOOutput m_OnBombDefused; // 0x830 - 0x858
   CEntityIOOutput m_OnBombBeginDefuse; // 0x858 - 0x880
   CEntityIOOutput m_OnBombDefuseAborted; // 0x880 - 0x8A8
   bool m_bCannotBeDefused; // 0x8A8 - 0x8A9
   unsigned char pad_8A9[0x7] // 0x8A9 - 0x8B0
   EntitySpottedState_t m_entitySpottedState; // 0x8B0 - 0x8C8
   int32_t m_nSpotRules; // 0x8C8 - 0x8CC
   bool m_bTrainingPlacedByPlayer; // 0x8CC - 0x8CD
   bool m_bHasExploded; // 0x8CD - 0x8CE
   unsigned char pad_8CE[0x2] // 0x8CE - 0x8D0
   float m_flTimerLength; // 0x8D0 - 0x8D4
   bool m_bBeingDefused; // 0x8D4 - 0x8D5
   unsigned char pad_8D5[0x7] // 0x8D5 - 0x8DC
   GameTime_t m_fLastDefuseTime; // 0x8DC - 0x8E0
   unsigned char pad_8E0[0x4] // 0x8E0 - 0x8E4
   float m_flDefuseLength; // 0x8E4 - 0x8E8
   GameTime_t m_flDefuseCountDown; // 0x8E8 - 0x8EC
   bool m_bBombDefused; // 0x8EC - 0x8ED
   unsigned char pad_8ED[0x3] // 0x8ED - 0x8F0
   CHandle< CCSPlayerPawnBase > m_hBombDefuser; // 0x8F0 - 0x8F4
   CEntityHandle m_hControlPanel; // 0x8F4 - 0x8F8
   int32_t m_iProgressBarTime; // 0x8F8 - 0x8FC
   bool m_bVoiceAlertFired; // 0x8FC - 0x8FD
   bool m_bVoiceAlertPlayed[4]; // 0x8FD - 0x901
   unsigned char pad_901[0x3] // 0x901 - 0x904
   GameTime_t m_flNextBotBeepTime; // 0x904 - 0x908
   unsigned char pad_908[0x4] // 0x908 - 0x90C
   bool m_bPlantedAfterPickup; // 0x90C - 0x90D
   unsigned char pad_90D[0x3] // 0x90D - 0x910
   QAngle m_angCatchUpToPlayerEye; // 0x910 - 0x91C
   GameTime_t m_flLastSpinDetectionTime; // 0x91C - 0x920

}; // size - 0x920


class CPlayer_CameraServices : public CPlayerPawnComponent
{
public:

   uint32_t m_iFOV; // 0x40 - 0x44
   uint32_t m_iFOVStart; // 0x44 - 0x48
   GameTime_t m_flFOVTime; // 0x48 - 0x4C
   float m_flFOVRate; // 0x4C - 0x50
   QAngle m_vecPunchAngle; // 0x50 - 0x5C
   unsigned char pad_5C[0xC] // 0x5C - 0x68
   QAngle m_vecPunchAngleVel; // 0x68 - 0x74
   unsigned char pad_74[0xC] // 0x74 - 0x80
   GameTick_t m_nPunchAngleJoltTickClientSide; // 0x80 - 0x84
   GameTick_t m_nPunchAngleJoltTick; // 0x84 - 0x88
   CHandle< C_BaseEntity > m_hZoomOwner; // 0x88 - 0x8C
   unsigned char pad_8C[0x4] // 0x8C - 0x90
   C_fogplayerparams_t m_PlayerFog; // 0x90 - 0xD0
   CHandle< C_ColorCorrection > m_hColorCorrectionCtrl; // 0xD0 - 0xD4
   CHandle< C_BaseEntity > m_hViewEntity; // 0xD4 - 0xD8
   CHandle< C_TonemapController2 > m_hTonemapController; // 0xD8 - 0xDC
   unsigned char pad_DC[0x4] // 0xDC - 0xE0
   audioparams_t m_audio; // 0xE0 - 0x158
   C_NetworkUtlVectorBase< CHandle< C_PostProcessingVolume > > m_PostProcessingVolumes; // 0x158 - 0x170
   float m_flOldPlayerZ; // 0x170 - 0x174
   float m_flOldPlayerViewOffsetZ; // 0x174 - 0x178
   fogparams_t m_CurrentFog; // 0x178 - 0x1E0
   CHandle< C_FogController > m_hOldFogController; // 0x1E0 - 0x1E4
   bool m_bOverrideFogColor[5]; // 0x1E4 - 0x1E9
   Color m_OverrideFogColor[5]; // 0x1E9 - 0x1FD
   bool m_bOverrideFogStartEnd[5]; // 0x1FD - 0x202
   unsigned char pad_202[0x2] // 0x202 - 0x204
   float32 m_fOverrideFogStart[5]; // 0x204 - 0x218
   float32 m_fOverrideFogEnd[5]; // 0x218 - 0x22C
   CHandle< C_PostProcessingVolume > m_hActivePostProcessingVolume; // 0x22C - 0x230
   QAngle m_angDemoViewAngles; // 0x230 - 0x23C

}; // size - 0x248


class CPlayer_CameraServices : public CPlayerPawnComponent
{
public:

   uint32_t m_iFOV; // 0x40 - 0x44
   uint32_t m_iFOVStart; // 0x44 - 0x48
   GameTime_t m_flFOVTime; // 0x48 - 0x4C
   float m_flFOVRate; // 0x4C - 0x50
   QAngle m_vecPunchAngle; // 0x50 - 0x5C
   QAngle m_vecPunchAngleVel; // 0x5C - 0x68
   GameTick_t m_nPunchAngleJoltTick; // 0x68 - 0x6C
   CHandle< CBaseEntity > m_hZoomOwner; // 0x6C - 0x70
   fogplayerparams_t m_PlayerFog; // 0x70 - 0xB0
   CHandle< CColorCorrection > m_hColorCorrectionCtrl; // 0xB0 - 0xB4
   CHandle< CBaseEntity > m_hViewEntity; // 0xB4 - 0xB8
   CHandle< CTonemapController2 > m_hTonemapController; // 0xB8 - 0xBC
   unsigned char pad_BC[0x4] // 0xBC - 0xC0
   audioparams_t m_audio; // 0xC0 - 0x138
   CNetworkUtlVectorBase< CHandle< CPostProcessingVolume > > m_PostProcessingVolumes; // 0x138 - 0x150
   float m_flOldPlayerZ; // 0x150 - 0x154
   float m_flOldPlayerViewOffsetZ; // 0x154 - 0x158
   unsigned char pad_158[0x18] // 0x158 - 0x170
   CUtlVector< CHandle< CEnvSoundscapeTriggerable > > m_hTriggerSoundscapeList; // 0x170 - 0x188

}; // size - 0x188


class CPlayer_ItemServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CPlayer_ItemServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CPlayer_MovementServices_Humanoid : public CPlayer_MovementServices
{
public:

   float m_flStepSoundTime; // 0x1B8 - 0x1BC
   float m_flFallVelocity; // 0x1BC - 0x1C0
   bool m_bInCrouch; // 0x1C0 - 0x1C1
   unsigned char pad_1C1[0x3] // 0x1C1 - 0x1C4
   uint32_t m_nCrouchState; // 0x1C4 - 0x1C8
   GameTime_t m_flCrouchTransitionStartTime; // 0x1C8 - 0x1CC
   bool m_bDucked; // 0x1CC - 0x1CD
   bool m_bDucking; // 0x1CD - 0x1CE
   bool m_bInDuckJump; // 0x1CE - 0x1CF
   unsigned char pad_1CF[0x1] // 0x1CF - 0x1D0
   Vector m_groundNormal; // 0x1D0 - 0x1DC
   float m_flSurfaceFriction; // 0x1DC - 0x1E0
   CUtlStringToken m_surfaceProps; // 0x1E0 - 0x1E4
   unsigned char pad_1E4[0xC] // 0x1E4 - 0x1F0
   int32_t m_nStepside; // 0x1F0 - 0x1F4
   int32_t m_iTargetVolume; // 0x1F4 - 0x1F8
   Vector m_vecSmoothedVelocity; // 0x1F8 - 0x204

}; // size - 0x208


class CPlayer_MovementServices_Humanoid : public CPlayer_MovementServices
{
public:

   float m_flStepSoundTime; // 0x1B8 - 0x1BC
   float m_flFallVelocity; // 0x1BC - 0x1C0
   bool m_bInCrouch; // 0x1C0 - 0x1C1
   unsigned char pad_1C1[0x3] // 0x1C1 - 0x1C4
   uint32_t m_nCrouchState; // 0x1C4 - 0x1C8
   GameTime_t m_flCrouchTransitionStartTime; // 0x1C8 - 0x1CC
   bool m_bDucked; // 0x1CC - 0x1CD
   bool m_bDucking; // 0x1CD - 0x1CE
   bool m_bInDuckJump; // 0x1CE - 0x1CF
   unsigned char pad_1CF[0x1] // 0x1CF - 0x1D0
   Vector m_groundNormal; // 0x1D0 - 0x1DC
   float m_flSurfaceFriction; // 0x1DC - 0x1E0
   CUtlStringToken m_surfaceProps; // 0x1E0 - 0x1E4
   unsigned char pad_1E4[0xC] // 0x1E4 - 0x1F0
   int32_t m_nStepside; // 0x1F0 - 0x1F4

}; // size - 0x1F8


class CPlayer_ObserverServices : public CPlayerPawnComponent
{
public:

   uint8_t m_iObserverMode; // 0x40 - 0x41
   unsigned char pad_41[0x3] // 0x41 - 0x44
   CHandle< CBaseEntity > m_hObserverTarget; // 0x44 - 0x48
   ObserverMode_t m_iObserverLastMode; // 0x48 - 0x4C
   bool m_bForcedObserverMode; // 0x4C - 0x4D

}; // size - 0x50


class CPlayer_ObserverServices : public CPlayerPawnComponent
{
public:

   uint8_t m_iObserverMode; // 0x40 - 0x41
   unsigned char pad_41[0x3] // 0x41 - 0x44
   CHandle< C_BaseEntity > m_hObserverTarget; // 0x44 - 0x48
   ObserverMode_t m_iObserverLastMode; // 0x48 - 0x4C
   bool m_bForcedObserverMode; // 0x4C - 0x4D
   unsigned char pad_4D[0x3] // 0x4D - 0x50
   float m_flObserverChaseDistance; // 0x50 - 0x54

}; // size - 0x58


class CPlayer_UseServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CPlayer_UseServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CPlayer_WaterServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CPlayer_WaterServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CPlayer_WeaponServices : public CPlayerPawnComponent
{
public:

   bool m_bAllowSwitchToNoWeapon; // 0x40 - 0x41
   unsigned char pad_41[0x7] // 0x41 - 0x48
   CNetworkUtlVectorBase< CHandle< CBasePlayerWeapon > > m_hMyWeapons; // 0x48 - 0x60
   CHandle< CBasePlayerWeapon > m_hActiveWeapon; // 0x60 - 0x64
   CHandle< CBasePlayerWeapon > m_hLastWeapon; // 0x64 - 0x68
   uint16 m_iAmmo[32]; // 0x68 - 0xA8
   bool m_bPreventWeaponPickup; // 0xA8 - 0xA9

}; // size - 0xB0


class CPlayer_WeaponServices : public CPlayerPawnComponent
{
public:

   bool m_bAllowSwitchToNoWeapon; // 0x40 - 0x41
   unsigned char pad_41[0x7] // 0x41 - 0x48
   C_NetworkUtlVectorBase< CHandle< C_BasePlayerWeapon > > m_hMyWeapons; // 0x48 - 0x60
   CHandle< C_BasePlayerWeapon > m_hActiveWeapon; // 0x60 - 0x64
   CHandle< C_BasePlayerWeapon > m_hLastWeapon; // 0x64 - 0x68
   uint16 m_iAmmo[32]; // 0x68 - 0xA8

}; // size - 0xA8


class CPointCamera : public CBaseEntity
{
public:

   float m_FOV; // 0x4A0 - 0x4A4
   float m_Resolution; // 0x4A4 - 0x4A8
   bool m_bFogEnable; // 0x4A8 - 0x4A9
   Color m_FogColor; // 0x4A9 - 0x4AD
   unsigned char pad_4AD[0x3] // 0x4AD - 0x4B0
   float m_flFogStart; // 0x4B0 - 0x4B4
   float m_flFogEnd; // 0x4B4 - 0x4B8
   float m_flFogMaxDensity; // 0x4B8 - 0x4BC
   bool m_bActive; // 0x4BC - 0x4BD
   bool m_bUseScreenAspectRatio; // 0x4BD - 0x4BE
   unsigned char pad_4BE[0x2] // 0x4BE - 0x4C0
   float m_flAspectRatio; // 0x4C0 - 0x4C4
   bool m_bNoSky; // 0x4C4 - 0x4C5
   unsigned char pad_4C5[0x3] // 0x4C5 - 0x4C8
   float m_fBrightness; // 0x4C8 - 0x4CC
   float m_flZFar; // 0x4CC - 0x4D0
   float m_flZNear; // 0x4D0 - 0x4D4
   bool m_bDofEnabled; // 0x4D4 - 0x4D5
   unsigned char pad_4D5[0x3] // 0x4D5 - 0x4D8
   float m_flDofNearBlurry; // 0x4D8 - 0x4DC
   float m_flDofNearCrisp; // 0x4DC - 0x4E0
   float m_flDofFarCrisp; // 0x4E0 - 0x4E4
   float m_flDofFarBlurry; // 0x4E4 - 0x4E8
   float m_flDofTiltToGround; // 0x4E8 - 0x4EC
   float m_TargetFOV; // 0x4EC - 0x4F0
   float m_DegreesPerSecond; // 0x4F0 - 0x4F4
   bool m_bIsOn; // 0x4F4 - 0x4F5
   unsigned char pad_4F5[0x3] // 0x4F5 - 0x4F8
   CPointCamera* m_pNext; // 0x4F8 - 0x500

}; // size - 0x500


class CPointDZItemSpawn : public CServerOnlyPointEntity
{
public:


}; // size - 0x4A8


class CPointDZItemSpawnGroup : public CServerOnlyPointEntity
{
public:

   float m_flRadius; // 0x4A0 - 0x4A4

}; // size - 0x4C0


class CPointHMDAnchor : public CBaseEntity
{
public:

   bool m_bDisabled; // 0x4A0 - 0x4A1
   unsigned char pad_4A1[0x3] // 0x4A1 - 0x4A4
   GameTime_t m_flEnableTime; // 0x4A4 - 0x4A8
   int32_t m_nPlayerIndex; // 0x4A8 - 0x4AC

}; // size - 0x4B0


class CPredictedViewModel : public CBaseViewModel
{
public:


}; // size - 0x868


class CPropDoorRotatingBreakable : public CPropDoorRotating
{
public:

   bool m_bBreakable; // 0xDB8 - 0xDB9
   bool m_isAbleToCloseAreaPortals; // 0xDB9 - 0xDBA
   unsigned char pad_DBA[0x2] // 0xDBA - 0xDBC
   int32_t m_currentDamageState; // 0xDBC - 0xDC0
   CUtlVector< CUtlSymbolLarge > m_damageStates; // 0xDC0 - 0xDD8

}; // size - 0xDD8


class CRopeKeyframe : public CBaseModelEntity
{
public:

   uint16_t m_RopeFlags; // 0x6F8 - 0x6FA
   unsigned char pad_6FA[0x6] // 0x6FA - 0x700
   CUtlSymbolLarge m_iNextLinkName; // 0x700 - 0x708
   int16_t m_Slack; // 0x708 - 0x70A
   unsigned char pad_70A[0x2] // 0x70A - 0x70C
   float m_Width; // 0x70C - 0x710
   float m_TextureScale; // 0x710 - 0x714
   uint8_t m_nSegments; // 0x714 - 0x715
   bool m_bConstrainBetweenEndpoints; // 0x715 - 0x716
   unsigned char pad_716[0x2] // 0x716 - 0x718
   CUtlSymbolLarge m_strRopeMaterialModel; // 0x718 - 0x720
   CStrongHandle< InfoForResourceTypeIMaterial2 > m_iRopeMaterialModelIndex; // 0x720 - 0x728
   uint8_t m_Subdiv; // 0x728 - 0x729
   uint8_t m_nChangeCount; // 0x729 - 0x72A
   int16_t m_RopeLength; // 0x72A - 0x72C
   uint8_t m_fLockedPoints; // 0x72C - 0x72D
   bool m_bCreatedFromMapFile; // 0x72D - 0x72E
   unsigned char pad_72E[0x2] // 0x72E - 0x730
   float m_flScrollSpeed; // 0x730 - 0x734
   bool m_bStartPointValid; // 0x734 - 0x735
   bool m_bEndPointValid; // 0x735 - 0x736
   unsigned char pad_736[0x2] // 0x736 - 0x738
   CHandle< CBaseEntity > m_hStartPoint; // 0x738 - 0x73C
   CHandle< CBaseEntity > m_hEndPoint; // 0x73C - 0x740
   AttachmentHandle_t m_iStartAttachment; // 0x740 - 0x741
   AttachmentHandle_t m_iEndAttachment; // 0x741 - 0x742

}; // size - 0x748


class CRotButton : public CBaseButton
{
public:


}; // size - 0x8B8


class CRuleBrushEntity : public CRuleEntity
{
public:


}; // size - 0x6F8


class CSAdditionalPerRoundStats_t
{
public:

   int32_t m_numChickensKilled; // 0x0 - 0x4
   int32_t m_killsWhileBlind; // 0x4 - 0x8
   int32_t m_bombCarrierkills; // 0x8 - 0xC
   int32_t m_iBurnDamageInflicted; // 0xC - 0x10
   int32_t m_iDinks; // 0x10 - 0x14

}; // size - 0x14


class CSPerRoundStats_t
{
public:

   int32_t m_iKills; // 0x30 - 0x34
   int32_t m_iDeaths; // 0x34 - 0x38
   int32_t m_iAssists; // 0x38 - 0x3C
   int32_t m_iDamage; // 0x3C - 0x40
   int32_t m_iEquipmentValue; // 0x40 - 0x44
   int32_t m_iMoneySaved; // 0x44 - 0x48
   int32_t m_iKillReward; // 0x48 - 0x4C
   int32_t m_iLiveTime; // 0x4C - 0x50
   int32_t m_iHeadShotKills; // 0x50 - 0x54
   int32_t m_iObjective; // 0x54 - 0x58
   int32_t m_iCashEarned; // 0x58 - 0x5C
   int32_t m_iUtilityDamage; // 0x5C - 0x60
   int32_t m_iEnemiesFlashed; // 0x60 - 0x64

}; // size - 0x68


class CSPerRoundStats_t
{
public:

   int32_t m_iKills; // 0x30 - 0x34
   int32_t m_iDeaths; // 0x34 - 0x38
   int32_t m_iAssists; // 0x38 - 0x3C
   int32_t m_iDamage; // 0x3C - 0x40
   int32_t m_iEquipmentValue; // 0x40 - 0x44
   int32_t m_iMoneySaved; // 0x44 - 0x48
   int32_t m_iKillReward; // 0x48 - 0x4C
   int32_t m_iLiveTime; // 0x4C - 0x50
   int32_t m_iHeadShotKills; // 0x50 - 0x54
   int32_t m_iObjective; // 0x54 - 0x58
   int32_t m_iCashEarned; // 0x58 - 0x5C
   int32_t m_iUtilityDamage; // 0x5C - 0x60
   int32_t m_iEnemiesFlashed; // 0x60 - 0x64

}; // size - 0x68


class CSequenceAnimNode : public CAnimNodeBase
{
public:

   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x68 - 0x80
   CUtlVector< CSmartPtr< CAnimParamSpan > > m_paramSpans; // 0x80 - 0x98
   CUtlString m_sequenceName; // 0x98 - 0xA0
   float m_playbackSpeed; // 0xA0 - 0xA4
   bool m_bLoop; // 0xA4 - 0xA5

}; // size - 0xA8


class CSequenceUpdateNode : public CLeafUpdateNode
{
public:

   CParamSpanUpdater m_paramSpans; // 0x60 - 0x78
   CUtlVector< TagSpan_t > m_tags; // 0x78 - 0x90
   unsigned char pad_90[0x4] // 0x90 - 0x94
   HSequence m_hSequence; // 0x94 - 0x98
   float m_playbackSpeed; // 0x98 - 0x9C
   float m_duration; // 0x9C - 0xA0
   bool m_bLoop; // 0xA0 - 0xA1

}; // size - 0xA8


class CSosGroupBranchPattern
{
public:

   bool m_bMatchEventName; // 0x8 - 0x9
   bool m_bMatchEventSubString; // 0x9 - 0xA
   bool m_bMatchEntIndex; // 0xA - 0xB
   bool m_bMatchOpvar; // 0xB - 0xC

}; // size - 0x10


class CSoundOpvarSetAABBEntity : public CSoundOpvarSetPointEntity
{
public:

   Vector m_vDistanceInnerMins; // 0x638 - 0x644
   Vector m_vDistanceInnerMaxs; // 0x644 - 0x650
   Vector m_vDistanceOuterMins; // 0x650 - 0x65C
   Vector m_vDistanceOuterMaxs; // 0x65C - 0x668
   int32_t m_nAABBDirection; // 0x668 - 0x66C
   Vector m_vInnerMins; // 0x66C - 0x678
   Vector m_vInnerMaxs; // 0x678 - 0x684
   Vector m_vOuterMins; // 0x684 - 0x690
   Vector m_vOuterMaxs; // 0x690 - 0x69C

}; // size - 0x6A0


class CSpinUpdateBase : public CParticleFunctionOperator
{
public:


}; // size - 0x1F0


class CStaticPoseCache
{
public:

   CUtlVector< CCachedPose > m_poses; // 0x10 - 0x28
   int32_t m_nBoneCount; // 0x28 - 0x2C
   int32_t m_nMorphCount; // 0x2C - 0x30

}; // size - 0x30


class CTabletBlockerShim : public CBaseTrigger
{
public:


}; // size - 0x898


class CTeam : public CBaseEntity
{
public:

   CNetworkUtlVectorBase< CHandle< CBasePlayerController > > m_aPlayerControllers; // 0x4A0 - 0x4B8
   CNetworkUtlVectorBase< CHandle< CBasePlayerPawn > > m_aPlayers; // 0x4B8 - 0x4D0
   int32_t m_iScore; // 0x4D0 - 0x4D4
   char m_szTeamname[129]; // 0x4D4 - 0x555

}; // size - 0x558


class CTeamplayRules : public CMultiplayRules
{
public:


}; // size - 0x90


class CTonemapController2 : public CBaseEntity
{
public:

   float m_flAutoExposureMin; // 0x4A0 - 0x4A4
   float m_flAutoExposureMax; // 0x4A4 - 0x4A8
   float m_flTonemapPercentTarget; // 0x4A8 - 0x4AC
   float m_flTonemapPercentBrightPixels; // 0x4AC - 0x4B0
   float m_flTonemapMinAvgLum; // 0x4B0 - 0x4B4
   float m_flExposureAdaptationSpeedUp; // 0x4B4 - 0x4B8
   float m_flExposureAdaptationSpeedDown; // 0x4B8 - 0x4BC
   float m_flTonemapEVSmoothingRange; // 0x4BC - 0x4C0

}; // size - 0x4C8


class CTriggerCustomBounds : public CBaseTrigger
{
public:


}; // size - 0x898


class CTriggerPush : public CBaseTrigger
{
public:

   QAngle m_angPushEntitySpace; // 0x898 - 0x8A4
   Vector m_vecPushDirEntitySpace; // 0x8A4 - 0x8B0
   bool m_bTriggerOnStartTouch; // 0x8B0 - 0x8B1
   unsigned char pad_8B1[0x3] // 0x8B1 - 0x8B4
   float m_flAlternateTicksFix; // 0x8B4 - 0x8B8
   float m_flPushSpeed; // 0x8B8 - 0x8BC

}; // size - 0x8C0


class CWeaponBaseItem : public CWeaponCSBase
{
public:

   CountdownTimer m_SequenceCompleteTimer; // 0xD50 - 0xD68
   bool m_bRedraw; // 0xD68 - 0xD69

}; // size - 0xD70


class C_BaseFire : public C_BaseEntity
{
public:

   float m_flScale; // 0x538 - 0x53C
   float m_flStartScale; // 0x53C - 0x540
   float m_flScaleTime; // 0x540 - 0x544
   uint32_t m_nFlags; // 0x544 - 0x548

}; // size - 0x548


class C_Breakable : public C_BaseModelEntity
{
public:


}; // size - 0x838


class C_CSGO_PreviewModel : public C_BaseFlex
{
public:

   CUtlString m_animgraph; // 0xB28 - 0xB30
   CUtlString m_animgraphCharacterModeString; // 0xB30 - 0xB38
   CUtlString m_defaultAnim; // 0xB38 - 0xB40
   AnimLoopMode_t m_nDefaultAnimLoopMode; // 0xB40 - 0xB44
   float m_flInitialModelScale; // 0xB44 - 0xB48

}; // size - 0xBF0


class C_EnvCubemap : public C_BaseEntity
{
public:

   CStrongHandle< InfoForResourceTypeCTextureBase > m_hCubemapTexture; // 0x628 - 0x630
   bool m_bCustomCubemapTexture; // 0x630 - 0x631
   unsigned char pad_631[0x3] // 0x631 - 0x634
   float m_flInfluenceRadius; // 0x634 - 0x638
   Vector m_vBoxProjectMins; // 0x638 - 0x644
   Vector m_vBoxProjectMaxs; // 0x644 - 0x650
   CUtlSymbolLarge m_LightGroups; // 0x650 - 0x658
   bool m_bMoveable; // 0x658 - 0x659
   unsigned char pad_659[0x3] // 0x659 - 0x65C
   int32_t m_nHandshake; // 0x65C - 0x660
   int32_t m_nEnvCubeMapArrayIndex; // 0x660 - 0x664
   int32_t m_nPriority; // 0x664 - 0x668
   float m_flEdgeFadeDist; // 0x668 - 0x66C
   Vector m_vEdgeFadeDists; // 0x66C - 0x678
   float m_flDiffuseScale; // 0x678 - 0x67C
   bool m_bStartDisabled; // 0x67C - 0x67D
   bool m_bDefaultEnvMap; // 0x67D - 0x67E
   bool m_bDefaultSpecEnvMap; // 0x67E - 0x67F
   bool m_bIndoorCubeMap; // 0x67F - 0x680
   bool m_bCopyDiffuseFromDefaultCubemap; // 0x680 - 0x681
   unsigned char pad_681[0xF] // 0x681 - 0x690
   bool m_bEnabled; // 0x690 - 0x691

}; // size - 0x698


class C_GameRulesProxy : public C_BaseEntity
{
public:


}; // size - 0x538


class C_Inferno : public C_BaseModelEntity
{
public:

   ParticleIndex_t m_nfxFireDamageEffect; // 0x878 - 0x87C
   int32 m_fireXDelta[64]; // 0x87C - 0x97C
   int32 m_fireYDelta[64]; // 0x97C - 0xA7C
   int32 m_fireZDelta[64]; // 0xA7C - 0xB7C
   int32 m_fireParentXDelta[64]; // 0xB7C - 0xC7C
   int32 m_fireParentYDelta[64]; // 0xC7C - 0xD7C
   int32 m_fireParentZDelta[64]; // 0xD7C - 0xE7C
   bool m_bFireIsBurning[64]; // 0xE7C - 0xEBC
   Vector m_BurnNormal[64]; // 0xEBC - 0x11BC
   int32_t m_fireCount; // 0x11BC - 0x11C0
   int32_t m_nInfernoType; // 0x11C0 - 0x11C4
   float m_nFireLifetime; // 0x11C4 - 0x11C8
   bool m_bInPostEffectTime; // 0x11C8 - 0x11C9
   unsigned char pad_11C9[0x3] // 0x11C9 - 0x11CC
   int32_t m_lastFireCount; // 0x11CC - 0x11D0
   int32_t m_nFireEffectTickBegin; // 0x11D0 - 0x11D4
   unsigned char pad_11D4[0x6C0C] // 0x11D4 - 0x7DE0
   int32_t m_drawableCount; // 0x7DE0 - 0x7DE4
   bool m_blosCheck; // 0x7DE4 - 0x7DE5
   unsigned char pad_7DE5[0x3] // 0x7DE5 - 0x7DE8
   int32_t m_nlosperiod; // 0x7DE8 - 0x7DEC
   float m_maxFireHalfWidth; // 0x7DEC - 0x7DF0
   float m_maxFireHeight; // 0x7DF0 - 0x7DF4
   Vector m_minBounds; // 0x7DF4 - 0x7E00
   Vector m_maxBounds; // 0x7E00 - 0x7E0C
   float m_flLastGrassBurnThink; // 0x7E0C - 0x7E10

}; // size - 0x7E20


class C_Knife : public C_WeaponCSBase
{
public:


}; // size - 0x13D0


class C_LightDirectionalEntity : public C_LightEntity
{
public:


}; // size - 0x840


class C_MolotovGrenade : public C_BaseCSGrenade
{
public:


}; // size - 0x1430


class C_OP_RenderPoints : public CParticleFunctionRenderer
{
public:

   CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x230 - 0x238

}; // size - 0x240


class C_PathParticleRope : public C_BaseEntity
{
public:

   bool m_bStartActive; // 0x538 - 0x539
   unsigned char pad_539[0x3] // 0x539 - 0x53C
   float m_flMaxSimulationTime; // 0x53C - 0x540
   CUtlSymbolLarge m_iszEffectName; // 0x540 - 0x548
   CUtlVector< CUtlSymbolLarge > m_PathNodes_Name; // 0x548 - 0x560
   float m_flParticleSpacing; // 0x560 - 0x564
   float m_flSlack; // 0x564 - 0x568
   float m_flRadius; // 0x568 - 0x56C
   Color m_ColorTint; // 0x56C - 0x570
   int32_t m_nEffectState; // 0x570 - 0x574
   unsigned char pad_574[0x4] // 0x574 - 0x578
   CStrongHandle< InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x578 - 0x580
   C_NetworkUtlVectorBase< Vector > m_PathNodes_Position; // 0x580 - 0x598
   C_NetworkUtlVectorBase< Vector > m_PathNodes_TangentIn; // 0x598 - 0x5B0
   C_NetworkUtlVectorBase< Vector > m_PathNodes_TangentOut; // 0x5B0 - 0x5C8
   C_NetworkUtlVectorBase< Vector > m_PathNodes_Color; // 0x5C8 - 0x5E0
   C_NetworkUtlVectorBase< bool > m_PathNodes_PinEnabled; // 0x5E0 - 0x5F8
   C_NetworkUtlVectorBase< float32 > m_PathNodes_RadiusScale; // 0x5F8 - 0x610

}; // size - 0x640


class C_PlantedC4 : public CBaseAnimGraph
{
public:

   bool m_bBombTicking; // 0x998 - 0x999
   unsigned char pad_999[0x3] // 0x999 - 0x99C
   int32_t m_nBombSite; // 0x99C - 0x9A0
   int32_t m_nSourceSoundscapeHash; // 0x9A0 - 0x9A4
   unsigned char pad_9A4[0x4] // 0x9A4 - 0x9A8
   EntitySpottedState_t m_entitySpottedState; // 0x9A8 - 0x9C0
   GameTime_t m_flNextGlow; // 0x9C0 - 0x9C4
   GameTime_t m_flNextBeep; // 0x9C4 - 0x9C8
   GameTime_t m_flC4Blow; // 0x9C8 - 0x9CC
   float m_flTimerLength; // 0x9CC - 0x9D0
   float m_bTenSecWarning; // 0x9D0 - 0x9D4
   float m_bTriggerWarning; // 0x9D4 - 0x9D8
   float m_bExplodeWarning; // 0x9D8 - 0x9DC
   bool m_bLocalBRMusicPlayed; // 0x9DC - 0x9DD
   unsigned char pad_9DD[0x3] // 0x9DD - 0x9E0
   float m_flDefuseLength; // 0x9E0 - 0x9E4
   GameTime_t m_flDefuseCountDown; // 0x9E4 - 0x9E8
   bool m_bBombDefused; // 0x9E8 - 0x9E9
   unsigned char pad_9E9[0x3] // 0x9E9 - 0x9EC
   CHandle< C_CSPlayerPawnBase > m_hBombDefuser; // 0x9EC - 0x9F0
   CEntityHandle m_hControlPanel; // 0x9F0 - 0x9F4
   CHandle< C_Multimeter > m_hDefuserMultimeter; // 0x9F4 - 0x9F8
   GameTime_t m_flNextRadarFlashTime; // 0x9F8 - 0x9FC
   bool m_bRadarFlash; // 0x9FC - 0x9FD
   unsigned char pad_9FD[0x3] // 0x9FD - 0xA00
   CHandle< C_CSPlayerPawnBase > m_hLocalDefusingPlayerHandle; // 0xA00 - 0xA04

}; // size - 0xA08


class C_PointCamera : public C_BaseEntity
{
public:

   float m_FOV; // 0x538 - 0x53C
   float m_Resolution; // 0x53C - 0x540
   bool m_bFogEnable; // 0x540 - 0x541
   Color m_FogColor; // 0x541 - 0x545
   unsigned char pad_545[0x3] // 0x545 - 0x548
   float m_flFogStart; // 0x548 - 0x54C
   float m_flFogEnd; // 0x54C - 0x550
   float m_flFogMaxDensity; // 0x550 - 0x554
   bool m_bActive; // 0x554 - 0x555
   bool m_bUseScreenAspectRatio; // 0x555 - 0x556
   unsigned char pad_556[0x2] // 0x556 - 0x558
   float m_flAspectRatio; // 0x558 - 0x55C
   bool m_bNoSky; // 0x55C - 0x55D
   unsigned char pad_55D[0x3] // 0x55D - 0x560
   float m_fBrightness; // 0x560 - 0x564
   float m_flZFar; // 0x564 - 0x568
   float m_flZNear; // 0x568 - 0x56C
   bool m_bDofEnabled; // 0x56C - 0x56D
   unsigned char pad_56D[0x3] // 0x56D - 0x570
   float m_flDofNearBlurry; // 0x570 - 0x574
   float m_flDofNearCrisp; // 0x574 - 0x578
   float m_flDofFarCrisp; // 0x578 - 0x57C
   float m_flDofFarBlurry; // 0x57C - 0x580
   float m_flDofTiltToGround; // 0x580 - 0x584
   float m_TargetFOV; // 0x584 - 0x588
   float m_DegreesPerSecond; // 0x588 - 0x58C
   bool m_bIsOn; // 0x58C - 0x58D
   unsigned char pad_58D[0x3] // 0x58D - 0x590
   C_PointCamera* m_pNext; // 0x590 - 0x598

}; // size - 0x598


class C_PointHMDAnchor : public C_BaseEntity
{
public:

   bool m_bDisabled; // 0x538 - 0x539
   unsigned char pad_539[0x3] // 0x539 - 0x53C
   GameTime_t m_flEnableTime; // 0x53C - 0x540
   int32_t m_nPlayerIndex; // 0x540 - 0x544
   int32_t m_nLastSimulateFrame; // 0x544 - 0x548

}; // size - 0x548


class C_PredictedViewModel : public C_BaseViewModel
{
public:

   QAngle m_LagAnglesHistory; // 0xA00 - 0xA0C
   unsigned char pad_A0C[0xC] // 0xA0C - 0xA18
   Vector m_vPredictedOffset; // 0xA18 - 0xA24

}; // size - 0xA28


class C_RagdollProp : public CBaseAnimGraph
{
public:

   C_NetworkUtlVectorBase< Vector > m_ragPos; // 0x9A0 - 0x9B8
   C_NetworkUtlVectorBase< QAngle > m_ragAngles; // 0x9B8 - 0x9D0
   float m_flBlendWeight; // 0x9D0 - 0x9D4
   CHandle< C_BaseEntity > m_hRagdollSource; // 0x9D4 - 0x9D8
   AttachmentHandle_t m_iEyeAttachment; // 0x9D8 - 0x9D9
   unsigned char pad_9D9[0x3] // 0x9D9 - 0x9DC
   float m_flBlendWeightCurrent; // 0x9DC - 0x9E0
   CUtlVector< int32 > m_parentPhysicsBoneIndices; // 0x9E0 - 0x9F8
   CUtlVector< int32 > m_worldSpaceBoneComputationOrder; // 0x9F8 - 0xA10

}; // size - 0xA10


class C_SoundOpvarSetAABBEntity : public C_SoundOpvarSetPointEntity
{
public:


}; // size - 0x558


class C_Team : public C_BaseEntity
{
public:

   C_NetworkUtlVectorBase< CHandle< CBasePlayerController > > m_aPlayerControllers; // 0x538 - 0x550
   C_NetworkUtlVectorBase< CHandle< C_BasePlayerPawn > > m_aPlayers; // 0x550 - 0x568
   int32_t m_iScore; // 0x568 - 0x56C
   char m_szTeamname[129]; // 0x56C - 0x5ED

}; // size - 0x5F0


class C_TeamplayRules : public C_MultiplayRules
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class C_TonemapController2 : public C_BaseEntity
{
public:

   float m_flAutoExposureMin; // 0x538 - 0x53C
   float m_flAutoExposureMax; // 0x53C - 0x540
   float m_flTonemapPercentTarget; // 0x540 - 0x544
   float m_flTonemapPercentBrightPixels; // 0x544 - 0x548
   float m_flTonemapMinAvgLum; // 0x548 - 0x54C
   float m_flExposureAdaptationSpeedUp; // 0x54C - 0x550
   float m_flExposureAdaptationSpeedDown; // 0x550 - 0x554
   float m_flTonemapEVSmoothingRange; // 0x554 - 0x558

}; // size - 0x560


class C_WeaponBaseItem : public C_WeaponCSBase
{
public:

   CountdownTimer m_SequenceCompleteTimer; // 0x13D0 - 0x13E8
   bool m_bRedraw; // 0x13E8 - 0x13E9

}; // size - 0x13F0


class FeBoxRigid_t
{
public:

   CTransform tmFrame2; // 0x0 - 0x20
   uint16_t nNode; // 0x20 - 0x22
   uint16_t nCollisionMask; // 0x22 - 0x24
   Vector vSize; // 0x24 - 0x30
   float flStickiness; // 0x30 - 0x34
   uint16_t nVertexMapIndex; // 0x34 - 0x36
   uint16_t nFlags; // 0x36 - 0x38
   float32 flReserved[2]; // 0x38 - 0x40

}; // size - 0x40


class FeSphereRigid_t
{
public:

   fltx4 vSphere; // 0x0 - 0x10
   float flStickiness; // 0x10 - 0x14
   uint16_t nNode; // 0x14 - 0x16
   uint16_t nCollisionMask; // 0x16 - 0x18
   uint16_t nVertexMapIndex; // 0x18 - 0x1A
   uint16_t nFlags; // 0x1A - 0x1C

}; // size - 0x20


class FeTaperedCapsuleRigid_t
{
public:

   fltx4 vSphere[2]; // 0x0 - 0x20
   float flStickiness; // 0x20 - 0x24
   uint16_t nNode; // 0x24 - 0x26
   uint16_t nCollisionMask; // 0x26 - 0x28
   uint16_t nVertexMapIndex; // 0x28 - 0x2A
   uint16_t nFlags; // 0x2A - 0x2C

}; // size - 0x30


class IChoreoServices
{
public:

   enum class ScriptState_t : std::uint32_t
   {
      SCRIPT_PLAYING = 0,
      SCRIPT_WAIT = 1,
      SCRIPT_POST_IDLE = 2,
      SCRIPT_CLEANUP = 3,
      SCRIPT_WALK_TO_MARK = 4,
      SCRIPT_RUN_TO_MARK = 5,
      SCRIPT_CUSTOM_MOVE_TO_MARK = 6
   };

   enum class ChoreoState_t : std::uint32_t
   {
      STATE_PRE_SCRIPT = 0,
      STATE_WAIT_FOR_SCRIPT = 1,
      STATE_WALK_TO_MARK = 2,
      STATE_SYNCHRONIZE_SCRIPT = 3,
      STATE_PLAY_SCRIPT = 4,
      STATE_PLAY_SCRIPT_POST_IDLE = 5,
      STATE_PLAY_SCRIPT_POST_IDLE_DONE = 6
   };

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class IClientAlphaProperty
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class IParticleEffect
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class IParticleSystemDefinition
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class IRagdoll
{
public:

   virtual class CSchemaClassInfo* GetClassInformation(void) = 0;

}; // size - 0x8


class IntervalTimer
{
public:

   GameTime_t m_timestamp; // 0x8 - 0xC
   WorldGroupId_t m_nWorldGroupId; // 0xC - 0x10

}; // size - 0x10


class IntervalTimer
{
public:

   GameTime_t m_timestamp; // 0x8 - 0xC
   WorldGroupId_t m_nWorldGroupId; // 0xC - 0x10

}; // size - 0x10


class PointDefinition_t
{
public:

   int32_t m_nControlPoint; // 0x0 - 0x4
   bool m_bLocalCoords; // 0x4 - 0x5
   unsigned char pad_5[0x3] // 0x5 - 0x8
   Vector m_vOffset; // 0x8 - 0x14

}; // size - 0x14


class Relationship_t
{
public:

   Disposition_t disposition; // 0x0 - 0x4
   int32_t priority; // 0x4 - 0x8

}; // size - 0x8


class SpawnPointCoopEnemy : public SpawnPoint
{
public:

   enum class BotDefaultBehavior_t : std::uint32_t
   {
      DEFEND_AREA = 0,
      HUNT = 1,
      CHARGE_ENEMY = 2,
      DEFEND_INVESTIGATE = 3
   };

   CUtlSymbolLarge m_szWeaponsToGive; // 0x4B0 - 0x4B8
   CUtlSymbolLarge m_szPlayerModelToUse; // 0x4B8 - 0x4C0
   int32_t m_nArmorToSpawnWith; // 0x4C0 - 0x4C4
   SpawnPointCoopEnemy::BotDefaultBehavior_t m_nDefaultBehavior; // 0x4C4 - 0x4C8
   int32_t m_nBotDifficulty; // 0x4C8 - 0x4CC
   bool m_bIsAgressive; // 0x4CC - 0x4CD
   bool m_bStartAsleep; // 0x4CD - 0x4CE
   unsigned char pad_4CE[0x2] // 0x4CE - 0x4D0
   float m_flHideRadius; // 0x4D0 - 0x4D4
   unsigned char pad_4D4[0xC] // 0x4D4 - 0x4E0
   CUtlSymbolLarge m_szBehaviorTreeFile; // 0x4E0 - 0x4E8

}; // size - 0x4E8


class dynpitchvol_base_t
{
public:

   int32_t preset; // 0x0 - 0x4
   int32_t pitchrun; // 0x4 - 0x8
   int32_t pitchstart; // 0x8 - 0xC
   int32_t spinup; // 0xC - 0x10
   int32_t spindown; // 0x10 - 0x14
   int32_t volrun; // 0x14 - 0x18
   int32_t volstart; // 0x18 - 0x1C
   int32_t fadein; // 0x1C - 0x20
   int32_t fadeout; // 0x20 - 0x24
   int32_t lfotype; // 0x24 - 0x28
   int32_t lforate; // 0x28 - 0x2C
   int32_t lfomodpitch; // 0x2C - 0x30
   int32_t lfomodvol; // 0x30 - 0x34
   int32_t cspinup; // 0x34 - 0x38
   int32_t cspincount; // 0x38 - 0x3C
   int32_t pitch; // 0x3C - 0x40
   int32_t spinupsav; // 0x40 - 0x44
   int32_t spindownsav; // 0x44 - 0x48
   int32_t pitchfrac; // 0x48 - 0x4C
   int32_t vol; // 0x4C - 0x50
   int32_t fadeinsav; // 0x50 - 0x54
   int32_t fadeoutsav; // 0x54 - 0x58
   int32_t volfrac; // 0x58 - 0x5C
   int32_t lfofrac; // 0x5C - 0x60
   int32_t lfomult; // 0x60 - 0x64

}; // size - 0x64


class AABB_t
{
public:

   Vector m_vMinBounds; // 0x0 - 0xC
   Vector m_vMaxBounds; // 0xC - 0x18

}; // size - 0x18


class ActiveModelConfig_t
{
public:

   ModelConfigHandle_t m_Handle; // 0x28 - 0x2C
   unsigned char pad_2C[0x4] // 0x2C - 0x30
   CUtlSymbolLarge m_Name; // 0x30 - 0x38
   CNetworkUtlVectorBase< CHandle< CBaseModelEntity > > m_AssociatedEntities; // 0x38 - 0x50
   CNetworkUtlVectorBase< CUtlSymbolLarge > m_AssociatedEntityNames; // 0x50 - 0x68

}; // size - 0x68


class ActiveModelConfig_t
{
public:

   ModelConfigHandle_t m_Handle; // 0x28 - 0x2C
   unsigned char pad_2C[0x4] // 0x2C - 0x30
   CUtlSymbolLarge m_Name; // 0x30 - 0x38
   C_NetworkUtlVectorBase< CHandle< C_BaseModelEntity > > m_AssociatedEntities; // 0x38 - 0x50
   C_NetworkUtlVectorBase< CUtlSymbolLarge > m_AssociatedEntityNames; // 0x50 - 0x68

}; // size - 0x68


class AggregateMeshInfo_t
{
public:

   uint32_t m_nVisClusterMemberOffset; // 0x0 - 0x4
   uint8_t m_nVisClusterMemberCount; // 0x4 - 0x5
   bool m_bHasTransform; // 0x5 - 0x6
   int16_t m_nDrawCallIndex; // 0x6 - 0x8
   Color m_vTintColor; // 0x8 - 0xC
   uint8_t m_nLODGroupMask; // 0xC - 0xD
   unsigned char pad_D[0x3] // 0xD - 0x10
   ObjectTypeFlags_t m_objectFlags; // 0x10 - 0x14
   Vector m_vLODOrigin; // 0x14 - 0x20
   float m_fLODStartDrawDistance; // 0x20 - 0x24
   float m_fLODEndDrawDistance; // 0x24 - 0x28
   float m_fMaxObjectScale; // 0x28 - 0x2C
   int32_t m_nLightProbeVolumePrecomputedHandshake; // 0x2C - 0x30

}; // size - 0x30


class AggregateSceneObject_t
{
public:

   ObjectTypeFlags_t m_allFlags; // 0x0 - 0x4
   ObjectTypeFlags_t m_anyFlags; // 0x4 - 0x8
   int16_t m_nLayer; // 0x8 - 0xA
   unsigned char pad_A[0x6] // 0xA - 0x10
   CUtlVector< AggregateMeshInfo_t > m_aggregateMeshes; // 0x10 - 0x28
   CUtlVector< uint16 > m_visClusterMembership; // 0x28 - 0x40
   CUtlVector< matrix3x4_t > m_fragmentTransforms; // 0x40 - 0x58
   CStrongHandle< InfoForResourceTypeCModel > m_renderableModel; // 0x58 - 0x60

}; // size - 0x60


class AimMatrixOpFixedSettings_t
{
public:

   CAnimAttachment m_attachment; // 0x0 - 0xFFFFFFFF
   CAnimInputDamping m_damping; // 0x80 - 0x90
   CPoseHandle m_poseCacheHandles[10]; // 0x90 - 0xB8
   AimMatrixBlendMode m_eBlendMode; // 0xB8 - 0xBC
   float m_fAngleIncrement; // 0xBC - 0xC0
   int32_t m_nSequenceMaxFrame; // 0xC0 - 0xC4
   int32_t m_nBoneMaskIndex; // 0xC4 - 0xC8
   bool m_bTargetIsPosition; // 0xC8 - 0xC9

}; // size - 0xD0


class AmmoIndex_t
{
public:

   int8_t m_Value; // 0x0 - 0x1

}; // size - 0x1


class AnimComponentID
{
public:

   uint32_t m_id; // 0x0 - 0x4

}; // size - 0x4


class AnimNodeID
{
public:

   uint32_t m_id; // 0x0 - 0x4

}; // size - 0x4


class AnimNodeOutputID
{
public:

   uint32_t m_id; // 0x0 - 0x4

}; // size - 0x4


class AnimParamID
{
public:

   uint32_t m_id; // 0x0 - 0x4

}; // size - 0x4


class AnimScriptHandle
{
public:

   uint32_t m_id; // 0x0 - 0x4

}; // size - 0x4


class AnimStateID
{
public:

   uint32_t m_id; // 0x0 - 0x4

}; // size - 0x4


class AnimTagID
{
public:

   uint32_t m_id; // 0x0 - 0x4

}; // size - 0x4


class AnimationDecodeDebugDumpElement_t
{
public:

   int32_t m_nEntityIndex; // 0x0 - 0x4
   unsigned char pad_4[0x4] // 0x4 - 0x8
   CUtlString m_modelName; // 0x8 - 0x10
   CUtlVector< CUtlString > m_poseParams; // 0x10 - 0x28
   CUtlVector< CUtlString > m_decodeOps; // 0x28 - 0x40
   CUtlVector< CUtlString > m_internalOps; // 0x40 - 0x58
   CUtlVector< CUtlString > m_decodedAnims; // 0x58 - 0x70

}; // size - 0x70


class AnimationDecodeDebugDump_t
{
public:

   AnimationProcessingType_t m_processingType; // 0x0 - 0x4
   unsigned char pad_4[0x4] // 0x4 - 0x8
   CUtlVector< AnimationDecodeDebugDumpElement_t > m_elems; // 0x8 - 0x20

}; // size - 0x20


class AnimationSnapshot_t : public AnimationSnapshotBase_t
{
public:

   int32_t m_nEntIndex; // 0x110 - 0x114
   unsigned char pad_114[0x4] // 0x114 - 0x118
   CUtlString m_modelName; // 0x118 - 0x120

}; // size - 0x120


class AnimationUpdateListHandle_t
{
public:

   uint32_t m_Value; // 0x0 - 0x4

}; // size - 0x4


class AttachmentHandle_t
{
public:

   uint8_t m_Value; // 0x0 - 0x1

}; // size - 0x1


class BakedLightingInfo_t
{
public:

   uint32_t m_nLightmapVersionNumber; // 0x0 - 0x4
   uint32_t m_nLightmapGameVersionNumber; // 0x4 - 0x8
   Vector2D m_vLightmapUvScale; // 0x8 - 0x10
   bool m_bHasLightmaps; // 0x10 - 0x11
   unsigned char pad_11[0x7] // 0x11 - 0x18
   CUtlVector< CStrongHandle< InfoForResourceTypeCTextureBase > > m_lightMaps; // 0x18 - 0x30

}; // size - 0x30


class BlendItem_t
{
public:

   CUtlVector< TagSpan_t > m_tags; // 0x0 - 0x18
   CAnimUpdateNodeRef m_pChild; // 0x18 - 0x28
   HSequence m_hSequence; // 0x28 - 0x2C
   Vector2D m_vPos; // 0x2C - 0x34
   float m_flDuration; // 0x34 - 0x38
   bool m_bUseCustomDuration; // 0x38 - 0x39

}; // size - 0x40


class CAISound : public CPointEntity
{
public:

   int32_t m_iSoundType; // 0x4A0 - 0x4A4
   int32_t m_iSoundContext; // 0x4A4 - 0x4A8
   int32_t m_iVolume; // 0x4A8 - 0x4AC
   int32_t m_iSoundIndex; // 0x4AC - 0x4B0
   float m_flDuration; // 0x4B0 - 0x4B4
   unsigned char pad_4B4[0x4] // 0x4B4 - 0x4B8
   CUtlSymbolLarge m_iszProxyEntityName; // 0x4B8 - 0x4C0

}; // size - 0x4C0


class CAI_ChangeHintGroup : public CBaseEntity
{
public:

   int32_t m_iSearchType; // 0x4A0 - 0x4A4
   unsigned char pad_4A4[0x4] // 0x4A4 - 0x4A8
   CUtlSymbolLarge m_strSearchName; // 0x4A8 - 0x4B0
   CUtlSymbolLarge m_strNewHintGroup; // 0x4B0 - 0x4B8
   float m_flRadius; // 0x4B8 - 0x4BC

}; // size - 0x4C0


class CAI_ChangeTarget : public CBaseEntity
{
public:

   CUtlSymbolLarge m_iszNewTarget; // 0x4A0 - 0x4A8

}; // size - 0x4A8


class CAK47 : public CWeaponCSBaseGun
{
public:


}; // size - 0xD70


class CActionComponent : public CAnimComponentBase
{
public:

   CUtlVector< CSmartPtr< CAnimActionBase > > m_actions; // 0x38 - 0x50
   CUtlString m_sName; // 0x50 - 0x58

}; // size - 0x58


class CActionComponentUpdater : public CAnimComponentUpdater
{
public:

   CUtlVector< CSmartPtr< CAnimActionUpdater > > m_actions; // 0x30 - 0x48

}; // size - 0x48


class CAddAnimNode : public CAnimNodeBase
{
public:

   CAnimNodeConnection m_baseInput; // 0x38 - 0x40
   CAnimNodeConnection m_additiveInput; // 0x40 - 0x48
   BinaryNodeTiming m_timingBehavior; // 0x48 - 0x4C
   float m_flTimingBlend; // 0x4C - 0x50
   BinaryNodeChildOption m_footMotionTiming; // 0x50 - 0x54
   bool m_bApplyToFootMotion; // 0x54 - 0x55
   bool m_bResetBase; // 0x55 - 0x56
   bool m_bResetAdditive; // 0x56 - 0x57
   bool m_bApplyChannelsSeparately; // 0x57 - 0x58
   bool m_bUseModelSpace; // 0x58 - 0x59

}; // size - 0x60


class CAddUpdateNode : public CBinaryUpdateNode
{
public:

   BinaryNodeChildOption m_footMotionTiming; // 0x8C - 0x90
   bool m_bApplyToFootMotion; // 0x90 - 0x91
   bool m_bApplyChannelsSeparately; // 0x91 - 0x92
   bool m_bUseModelSpace; // 0x92 - 0x93

}; // size - 0x98


class CAimConstraint : public CBaseConstraint
{
public:

   Quaternion m_qAimOffset; // 0x70 - 0x80
   uint32_t m_nUpType; // 0x80 - 0x84

}; // size - 0x90


class CAimMatrixAnimNode : public CAnimNodeBase
{
public:

   CAnimNodeConnection m_inputConnection; // 0x40 - 0x48
   CUtlString m_sequenceName; // 0x48 - 0x50
   float m_fAngleIncrement; // 0x50 - 0x54
   AnimVectorSource m_target; // 0x54 - 0x58
   AnimParamID m_param; // 0x58 - 0x5C
   unsigned char pad_5C[0x4] // 0x5C - 0x60
   CUtlString m_attachmentName; // 0x60 - 0x68
   AimMatrixBlendMode m_blendMode; // 0x68 - 0x6C
   unsigned char pad_6C[0x4] // 0x6C - 0x70
   CUtlString m_boneMaskName; // 0x70 - 0x78
   bool m_bResetBase; // 0x78 - 0x79
   bool m_bLockWhenWaning; // 0x79 - 0x7A
   unsigned char pad_7A[0x6] // 0x7A - 0x80
   CAnimInputDamping m_damping; // 0x80 - 0x90

}; // size - 0x90


class CAimMatrixUpdateNode : public CUnaryUpdateNode
{
public:

   AimMatrixOpFixedSettings_t m_opFixedSettings; // 0x70 - 0x140
   unsigned char pad_140[0x8] // 0x140 - 0x148
   AnimVectorSource m_target; // 0x148 - 0x14C
   CAnimParamHandle m_paramIndex; // 0x14C - 0x14E
   unsigned char pad_14E[0x2] // 0x14E - 0x150
   HSequence m_hSequence; // 0x150 - 0x154
   bool m_bResetChild; // 0x154 - 0x155
   bool m_bLockWhenWaning; // 0x155 - 0x156

}; // size - 0x160


class CAmbientGeneric : public CPointEntity
{
public:

   float m_radius; // 0x4A0 - 0x4A4
   float m_flMaxRadius; // 0x4A4 - 0x4A8
   soundlevel_t m_iSoundLevel; // 0x4A8 - 0x4AC
   dynpitchvol_t m_dpv; // 0x4AC - 0x510
   bool m_fActive; // 0x510 - 0x511
   bool m_fLooping; // 0x511 - 0x512
   unsigned char pad_512[0x6] // 0x512 - 0x518
   CUtlSymbolLarge m_iszSound; // 0x518 - 0x520
   CUtlSymbolLarge m_sSourceEntName; // 0x520 - 0x528
   CHandle< CBaseEntity > m_hSoundSource; // 0x528 - 0x52C
   CEntityIndex m_nSoundSourceEntIndex; // 0x52C - 0x530

}; // size - 0x538


class CAndCondition : public CConditionBase
{
public:


}; // size - 0x60


class CAnimActivity
{
public:

   CBufferString m_name; // 0x0 - 0x10
   int32_t m_nActivity; // 0x10 - 0x14
   int32_t m_nFlags; // 0x14 - 0x18
   int32_t m_nWeight; // 0x18 - 0x1C

}; // size - 0x20


class CAnimAnimEvent
{
public:

   int32_t m_nFrame; // 0x0 - 0x4
   float m_flCycle; // 0x4 - 0x8
   KeyValues3 m_EventData; // 0x8 - 0x18
   CBufferString m_sLegacyOptions; // 0x18 - 0x28
   CBufferString m_sEventName; // 0x28 - 0x38

}; // size - 0x38


class CAnimBone
{
public:

   CBufferString m_name; // 0x0 - 0x10
   int32_t m_parent; // 0x10 - 0x14
   Vector m_pos; // 0x14 - 0x20
   QuaternionStorage m_quat; // 0x20 - 0x30
   float m_scale; // 0x30 - 0x34
   QuaternionStorage m_qAlignment; // 0x34 - 0x44
   int32_t m_flags; // 0x44 - 0x48

}; // size - 0x48


class CAnimBoneDifference
{
public:

   CBufferString m_name; // 0x0 - 0x10
   CBufferString m_parent; // 0x10 - 0x20
   Vector m_posError; // 0x20 - 0x2C
   bool m_bHasRotation; // 0x2C - 0x2D
   bool m_bHasMovement; // 0x2D - 0x2E

}; // size - 0x30


class CAnimClipData
{
public:

   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x20 - 0x38
   CUtlString m_clipName; // 0x38 - 0x40

}; // size - 0x48


class CAnimClipDataManager
{
public:

   CUtlHashtable< CUtlString, CSmartPtr< CAnimClipData > > m_itemTable; // 0x18 - 0x38

}; // size - 0x38


class CAnimComponentManager
{
public:

   CUtlVector< CSmartPtr< CAnimComponentBase > > m_components; // 0x8 - 0x20

}; // size - 0x28


class CAnimComponentState : public CAnimState
{
public:


}; // size - 0x70


class CAnimComponentStateTransition : public CAnimStateTransition
{
public:


}; // size - 0x70


class CAnimCycle : public CCycleBase
{
public:


}; // size - 0x4


class CAnimData
{
public:

   CBufferString m_name; // 0x10 - 0x20
   CUtlVector< CAnimDesc > m_animArray; // 0x20 - 0x38
   CUtlVector< CAnimDecoder > m_decoderArray; // 0x38 - 0x50
   int32_t m_nMaxUniqueFrameIndex; // 0x50 - 0x54
   unsigned char pad_54[0x4] // 0x54 - 0x58
   CUtlVector< CAnimFrameSegment > m_segmentArray; // 0x58 - 0x70

}; // size - 0x70


class CAnimDataChannelDesc
{
public:

   CBufferString m_szChannelClass; // 0x0 - 0x10
   CBufferString m_szVariableName; // 0x10 - 0x20
   int32_t m_nFlags; // 0x20 - 0x24
   int32_t m_nType; // 0x24 - 0x28
   CBufferString m_szGrouping; // 0x28 - 0x38
   CBufferString m_szDescription; // 0x38 - 0x48
   CUtlVector< CBufferString > m_szElementNameArray; // 0x48 - 0x60
   CUtlVector< int32 > m_nElementIndexArray; // 0x60 - 0x78
   CUtlVector< uint32 > m_nElementMaskArray; // 0x78 - 0x90

}; // size - 0x90


class CAnimDecoder
{
public:

   CBufferString m_szName; // 0x0 - 0x10
   int32_t m_nVersion; // 0x10 - 0x14
   int32_t m_nType; // 0x14 - 0x18

}; // size - 0x18


class CAnimDesc
{
public:

   CBufferString m_name; // 0x0 - 0x10
   CAnimDesc_Flag m_flags; // 0x10 - 0x18
   float fps; // 0x18 - 0x1C
   unsigned char pad_1C[0x4] // 0x1C - 0x20
   CAnimEncodedFrames m_Data; // 0x20 - 0xF8
   CUtlVector< CAnimMovement > m_movementArray; // 0xF8 - 0x110
   CUtlVector< CAnimAnimEvent > m_eventArray; // 0x110 - 0x128
   CUtlVector< CAnimActivity > m_activityArray; // 0x128 - 0x140
   CUtlVector< CAnimLocalHierarchy > m_hierarchyArray; // 0x140 - 0x158
   float framestalltime; // 0x158 - 0x15C
   Vector m_vecRootMin; // 0x15C - 0x168
   Vector m_vecRootMax; // 0x168 - 0x174
   unsigned char pad_174[0x4] // 0x174 - 0x178
   CUtlVector< Vector > m_vecBoneWorldMin; // 0x178 - 0x190
   CUtlVector< Vector > m_vecBoneWorldMax; // 0x190 - 0x1A8
   CAnimSequenceParams m_sequenceParams; // 0x1A8 - 0x1B0

}; // size - 0x1B0


class CAnimDesc_Flag
{
public:

   bool m_bLooping; // 0x0 - 0x1
   bool m_bAllZeros; // 0x1 - 0x2
   bool m_bHidden; // 0x2 - 0x3
   bool m_bDelta; // 0x3 - 0x4
   bool m_bLegacyWorldspace; // 0x4 - 0x5
   bool m_bModelDoc; // 0x5 - 0x6
   bool m_bImplicitSeqIgnoreDelta; // 0x6 - 0x7
   bool m_bAnimGraphAdditive; // 0x7 - 0x8

}; // size - 0x8


class CAnimEncodeDifference
{
public:

   CUtlVector< CAnimBoneDifference > m_boneArray; // 0x0 - 0x18
   CUtlVector< CAnimMorphDifference > m_morphArray; // 0x18 - 0x30
   CUtlVector< CAnimUserDifference > m_userArray; // 0x30 - 0x48
   CUtlVector< uint8 > m_bHasRotationBitArray; // 0x48 - 0x60
   CUtlVector< uint8 > m_bHasMovementBitArray; // 0x60 - 0x78
   CUtlVector< uint8 > m_bHasMorphBitArray; // 0x78 - 0x90
   CUtlVector< uint8 > m_bHasUserBitArray; // 0x90 - 0xA8

}; // size - 0xA8


class CAnimEncodedFrames
{
public:

   CBufferString m_fileName; // 0x0 - 0x10
   int32_t m_nFrames; // 0x10 - 0x14
   int32_t m_nFramesPerBlock; // 0x14 - 0x18
   CUtlVector< CAnimFrameBlockAnim > m_frameblockArray; // 0x18 - 0x30
   CAnimEncodeDifference m_usageDifferences; // 0x30 - 0xD8

}; // size - 0xD8


class CAnimEnum
{
public:

   uint8_t m_value; // 0x0 - 0x1

}; // size - 0x1


class CAnimFoot
{
public:

   CUtlString m_name; // 0x0 - 0x8
   Vector m_vBallOffset; // 0x8 - 0x14
   Vector m_vHeelOffset; // 0x14 - 0x20
   int32_t m_ankleBoneIndex; // 0x20 - 0x24
   int32_t m_toeBoneIndex; // 0x24 - 0x28

}; // size - 0x28


class CAnimFrameBlockAnim
{
public:

   int32_t m_nStartFrame; // 0x0 - 0x4
   int32_t m_nEndFrame; // 0x4 - 0x8
   CUtlVector< int32 > m_segmentIndexArray; // 0x8 - 0x20

}; // size - 0x20


class CAnimFrameSegment
{
public:

   int32_t m_nUniqueFrameIndex; // 0x0 - 0x4
   uint32_t m_nLocalElementMasks; // 0x4 - 0x8
   int32_t m_nLocalChannel; // 0x8 - 0xC
   unsigned char pad_C[0x4] // 0xC - 0x10
   CUtlBinaryBlock m_container; // 0x10 - 0x28

}; // size - 0x28


class CAnimGraphDebugReplay
{
public:

   CUtlString m_animGraphFileName; // 0x40 - 0x48
   CUtlVector< CSmartPtr< CAnimReplayFrame > > m_frameList; // 0x48 - 0x60
   int32_t m_startIndex; // 0x60 - 0x64
   int32_t m_writeIndex; // 0x64 - 0x68
   int32_t m_frameCount; // 0x68 - 0x6C

}; // size - 0x70


class CAnimGraphModelBinding
{
public:

   CUtlString m_modelName; // 0x8 - 0x10
   CSmartPtr< CAnimUpdateSharedData > m_pSharedData; // 0x10 - 0x18

}; // size - 0x28


class CAnimGraphNetworkSettings : public CAnimGraphSettingsGroup
{
public:

   bool m_bNetworkingEnabled; // 0x20 - 0x21

}; // size - 0x28


class CAnimGraphNetworkedVariables
{
public:

   CNetworkUtlVectorBase< uint32 > m_PredNetBoolVariables; // 0x8 - 0x20
   CNetworkUtlVectorBase< uint8 > m_PredNetByteVariables; // 0x20 - 0x38
   CNetworkUtlVectorBase< uint16 > m_PredNetUInt16Variables; // 0x38 - 0x50
   CNetworkUtlVectorBase< int32 > m_PredNetIntVariables; // 0x50 - 0x68
   CNetworkUtlVectorBase< uint32 > m_PredNetUInt32Variables; // 0x68 - 0x80
   CNetworkUtlVectorBase< float32 > m_PredNetFloatVariables; // 0x80 - 0x98
   CNetworkUtlVectorBase< Vector > m_PredNetVectorVariables; // 0x98 - 0xB0
   CNetworkUtlVectorBase< Quaternion > m_PredNetQuaternionVariables; // 0xB0 - 0xC8
   CNetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetBoolVariables; // 0xC8 - 0xE0
   CNetworkUtlVectorBase< uint8 > m_OwnerOnlyPredNetByteVariables; // 0xE0 - 0xF8
   CNetworkUtlVectorBase< uint16 > m_OwnerOnlyPredNetUInt16Variables; // 0xF8 - 0x110
   CNetworkUtlVectorBase< int32 > m_OwnerOnlyPredNetIntVariables; // 0x110 - 0x128
   CNetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetUInt32Variables; // 0x128 - 0x140
   CNetworkUtlVectorBase< float32 > m_OwnerOnlyPredNetFloatVariables; // 0x140 - 0x158
   CNetworkUtlVectorBase< Vector > m_OwnerOnlyPredNetVectorVariables; // 0x158 - 0x170
   CNetworkUtlVectorBase< Quaternion > m_OwnerOnlyPredNetQuaternionVariables; // 0x170 - 0x188
   int32_t m_nBoolVariablesCount; // 0x188 - 0x18C
   int32_t m_nOwnerOnlyBoolVariablesCount; // 0x18C - 0x190
   int32_t m_nRandomSeedOffset; // 0x190 - 0x194
   float m_flLastTeleportTime; // 0x194 - 0x198

}; // size - 0x1A8


class CAnimGraphNetworkedVariables
{
public:

   C_NetworkUtlVectorBase< uint32 > m_PredNetBoolVariables; // 0x8 - 0x20
   C_NetworkUtlVectorBase< uint8 > m_PredNetByteVariables; // 0x20 - 0x38
   C_NetworkUtlVectorBase< uint16 > m_PredNetUInt16Variables; // 0x38 - 0x50
   C_NetworkUtlVectorBase< int32 > m_PredNetIntVariables; // 0x50 - 0x68
   C_NetworkUtlVectorBase< uint32 > m_PredNetUInt32Variables; // 0x68 - 0x80
   C_NetworkUtlVectorBase< float32 > m_PredNetFloatVariables; // 0x80 - 0x98
   C_NetworkUtlVectorBase< Vector > m_PredNetVectorVariables; // 0x98 - 0xB0
   C_NetworkUtlVectorBase< Quaternion > m_PredNetQuaternionVariables; // 0xB0 - 0xC8
   C_NetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetBoolVariables; // 0xC8 - 0xE0
   C_NetworkUtlVectorBase< uint8 > m_OwnerOnlyPredNetByteVariables; // 0xE0 - 0xF8
   C_NetworkUtlVectorBase< uint16 > m_OwnerOnlyPredNetUInt16Variables; // 0xF8 - 0x110
   C_NetworkUtlVectorBase< int32 > m_OwnerOnlyPredNetIntVariables; // 0x110 - 0x128
   C_NetworkUtlVectorBase< uint32 > m_OwnerOnlyPredNetUInt32Variables; // 0x128 - 0x140
   C_NetworkUtlVectorBase< float32 > m_OwnerOnlyPredNetFloatVariables; // 0x140 - 0x158
   C_NetworkUtlVectorBase< Vector > m_OwnerOnlyPredNetVectorVariables; // 0x158 - 0x170
   C_NetworkUtlVectorBase< Quaternion > m_OwnerOnlyPredNetQuaternionVariables; // 0x170 - 0x188
   int32_t m_nBoolVariablesCount; // 0x188 - 0x18C
   int32_t m_nOwnerOnlyBoolVariablesCount; // 0x18C - 0x190
   int32_t m_nRandomSeedOffset; // 0x190 - 0x194
   unsigned char pad_194[0xF8C] // 0x194 - 0x1120
   float m_flLastTeleportTime; // 0x1120 - 0x1124

}; // size - 0x1138


class CAnimGraphSettingsManager
{
public:

   CUtlVector< CSmartPtr< CAnimGraphSettingsGroup > > m_settingsGroups; // 0x18 - 0x30

}; // size - 0x30


class CAnimInputDamping
{
public:

   DampingSpeedFunction m_speedFunction; // 0x8 - 0xC
   float m_fSpeedScale; // 0xC - 0x10

}; // size - 0x10


class CAnimKeyData
{
public:

   CBufferString m_name; // 0x0 - 0x10
   CUtlVector< CAnimBone > m_boneArray; // 0x10 - 0x28
   CUtlVector< CAnimUser > m_userArray; // 0x28 - 0x40
   CUtlVector< CBufferString > m_morphArray; // 0x40 - 0x58
   int32_t m_nChannelElements; // 0x58 - 0x5C
   unsigned char pad_5C[0x4] // 0x5C - 0x60
   CUtlVector< CAnimDataChannelDesc > m_dataChannelArray; // 0x60 - 0x78

}; // size - 0x78


class CAnimLocalHierarchy
{
public:

   CBufferString m_sBone; // 0x0 - 0x10
   CBufferString m_sNewParent; // 0x10 - 0x20
   int32_t m_nStartFrame; // 0x20 - 0x24
   int32_t m_nPeakFrame; // 0x24 - 0x28
   int32_t m_nTailFrame; // 0x28 - 0x2C
   int32_t m_nEndFrame; // 0x2C - 0x30

}; // size - 0x30


class CAnimMorphDifference
{
public:

   CBufferString m_name; // 0x0 - 0x10

}; // size - 0x10


class CAnimMovement
{
public:

   int32_t endframe; // 0x0 - 0x4
   int32_t motionflags; // 0x4 - 0x8
   float v0; // 0x8 - 0xC
   float v1; // 0xC - 0x10
   float angle; // 0x10 - 0x14
   Vector vector; // 0x14 - 0x20
   Vector position; // 0x20 - 0x2C

}; // size - 0x2C


class CAnimNodeConnection
{
public:

   AnimNodeID m_nodeID; // 0x0 - 0x4
   AnimNodeOutputID m_outputID; // 0x4 - 0x8

}; // size - 0x8


class CAnimNodeList
{
public:

   CUtlVector< CAnimNodeBase* > m_nodes; // 0x10 - 0x28

}; // size - 0x28


class CAnimNodePath
{
public:

   AnimNodeID m_path[11]; // 0x0 - 0x2C
   int32_t m_nCount; // 0x2C - 0x30

}; // size - 0x30


class CAnimNodeState : public CAnimState
{
public:

   CAnimNodeConnection m_inputConnection; // 0x70 - 0x78
   bool m_bIsRootMotionExclusive; // 0x78 - 0x79

}; // size - 0x80


class CAnimNodeStateTransition : public CAnimStateTransition
{
public:

   CFloatAnimValue m_blendDuration; // 0x78 - 0x90
   bool m_bReset; // 0x90 - 0x91
   unsigned char pad_91[0x3] // 0x91 - 0x94
   ResetCycleOption m_resetCycleOption; // 0x94 - 0x98
   CFloatAnimValue m_flFixedCycleValue; // 0x98 - 0xB0
   CBlendCurve m_blendCurve; // 0xB0 - 0xB8

}; // size - 0xB8


class CAnimParamHandle
{
public:

   AnimParamType_t m_type; // 0x0 - 0x1
   uint8_t m_index; // 0x1 - 0x2

}; // size - 0x2


class CAnimParamHandleMap
{
public:

   CUtlHashtable< uint16, int16 > m_list; // 0x0 - 0x20

}; // size - 0x20


class CAnimParamSpan
{
public:

   CUtlVector< CAnimParamSpanSample > m_samples; // 0x20 - 0x38
   AnimParamID m_id; // 0x38 - 0x3C
   float m_flStartCycle; // 0x3C - 0x40
   float m_flEndCycle; // 0x40 - 0x44

}; // size - 0x48


class CAnimParamSpanSample
{
public:

   CAnimVariant m_value; // 0x8 - 0x19
   unsigned char pad_19[0x3] // 0x19 - 0x1C
   float m_flCycle; // 0x1C - 0x20

}; // size - 0x20


class CAnimParameterList
{
public:

   CUtlVector< CSmartPtr< CAnimParameterBase > > m_Parameters; // 0x20 - 0x38

}; // size - 0x58


class CAnimParameterListUpdater
{
public:

   CUtlVector< CSmartPtr< CAnimParameterBase > > m_parameters; // 0x18 - 0x30
   CUtlHashtable< AnimParamID, int32 > m_idToIndexMap; // 0x30 - 0x50
   CUtlHashtable< CUtlString, int32 > m_nameToIndexMap; // 0x50 - 0x70
   CUtlVector< CAnimParamHandle > m_indexToHandle; // 0x70 - 0x88
   CUtlVector< CUtlPair< CAnimParamHandle, CAnimVariant > > m_autoResetParams; // 0x88 - 0xA0
   CUtlHashtable< CAnimParamHandle, int16 > m_autoResetMap; // 0xA0 - 0xC0

}; // size - 0x100


class CAnimReplayFrame
{
public:

   CUtlVector< CUtlBinaryBlock > m_inputDataBlocks; // 0x10 - 0x28
   CUtlBinaryBlock m_instanceData; // 0x28 - 0x40
   CTransform m_startingLocalToWorldTransform; // 0x40 - 0x60
   CTransform m_localToWorldTransform; // 0x60 - 0x80
   float m_timeStamp; // 0x80 - 0x84

}; // size - 0x90


class CAnimScriptComponent : public CAnimComponentBase
{
public:

   CUtlString m_sName; // 0x40 - 0x48
   CUtlString m_scriptFilename; // 0x48 - 0x50

}; // size - 0x58


class CAnimScriptComponentUpdater : public CAnimComponentUpdater
{
public:

   AnimScriptHandle m_hScript; // 0x30 - 0x34

}; // size - 0x38


class CAnimScriptManager
{
public:

   CUtlVector< ScriptInfo_t > m_scriptInfo; // 0x10 - 0x28

}; // size - 0x110


class CAnimSequenceParams
{
public:

   float m_flFadeInTime; // 0x0 - 0x4
   float m_flFadeOutTime; // 0x4 - 0x8

}; // size - 0x8


class CAnimSkeleton
{
public:

   CUtlVector< CTransform > m_localSpaceTransforms; // 0x10 - 0x28
   CUtlVector< CTransform > m_modelSpaceTransforms; // 0x28 - 0x40
   CUtlVector< CUtlString > m_boneNames; // 0x40 - 0x58
   CUtlVector< CUtlVector< int32 > > m_children; // 0x58 - 0x70
   CUtlVector< int32 > m_parents; // 0x70 - 0x88
   CUtlVector< CAnimFoot > m_feet; // 0x88 - 0xA0
   CUtlVector< CUtlString > m_morphNames; // 0xA0 - 0xB8
   CUtlVector< int32 > m_lodBoneCounts; // 0xB8 - 0xD0

}; // size - 0xD0


class CAnimStateList
{
public:

   CUtlVector< CAnimState* > m_states; // 0x10 - 0x28

}; // size - 0x28


class CAnimStateMachine
{
public:

   CUtlVector< CSmartPtr< CAnimState > > m_states; // 0x8 - 0x20

}; // size - 0x28


class CAnimStateMachineUpdater
{
public:

   CUtlVector< CStateUpdateData > m_states; // 0x8 - 0x20
   CUtlVector< CTransitionUpdateData > m_transitions; // 0x20 - 0x38
   unsigned char pad_38[0x18] // 0x38 - 0x50
   int32_t m_startStateIndex; // 0x50 - 0x54

}; // size - 0x58


class CAnimTagManager
{
public:

   CUtlVector< CSmartPtr< CAnimTagBase > > m_tags; // 0x18 - 0x30

}; // size - 0x58


class CAnimTagManagerUpdater
{
public:

   CUtlVector< CSmartPtr< CAnimTagBase > > m_tags; // 0x18 - 0x30

}; // size - 0x38


class CAnimTagSpan
{
public:

   AnimTagID m_id; // 0x20 - 0x24
   float m_fStartCycle; // 0x24 - 0x28
   float m_fDuration; // 0x28 - 0x2C

}; // size - 0x30


class CAnimUpdateNodeRef
{
public:

   int32_t m_nodeIndex; // 0x8 - 0xC

}; // size - 0x10


class CAnimUpdateSharedData
{
public:

   CUtlVector< CSmartPtr< CAnimUpdateNodeBase > > m_nodes; // 0x10 - 0x28
   CUtlHashtable< CAnimNodePath, int32 > m_nodeIndexMap; // 0x28 - 0x48
   CUtlVector< CSmartPtr< CAnimComponentUpdater > > m_components; // 0x48 - 0x60
   CSmartPtr< CAnimParameterListUpdater > m_pParamListUpdater; // 0x60 - 0x68
   CSmartPtr< CAnimTagManagerUpdater > m_pTagManagerUpdater; // 0x68 - 0x70
   CSmartPtr< CAnimScriptManager > m_scriptManager; // 0x70 - 0x78
   CAnimGraphSettingsManager m_settings; // 0x78 - 0xA8
   CSmartPtr< CStaticPoseCacheBuilder > m_pStaticPoseCache; // 0xA8 - 0xB0
   CSmartPtr< CAnimSkeleton > m_pSkeleton; // 0xB0 - 0xB8
   CAnimNodePath m_rootNodePath; // 0xB8 - 0xE8

}; // size - 0x100


class CAnimUser
{
public:

   CBufferString m_name; // 0x0 - 0x10
   int32_t m_nType; // 0x10 - 0x14

}; // size - 0x18


class CAnimUserDifference
{
public:

   CBufferString m_name; // 0x0 - 0x10
   int32_t m_nType; // 0x10 - 0x14

}; // size - 0x18


class CAnimationGraph : public CAnimationSubGraph
{
public:

   CSmartPtr< CAnimGraphSettingsManager > m_pSettingsManager; // 0xE8 - 0xF0
   unsigned char pad_F0[0x8] // 0xF0 - 0xF8
   CAnimClipDataManager m_clipDataManager; // 0xF8 - 0x130
   unsigned char pad_130[0x10] // 0x130 - 0x140
   CUtlString m_modelName; // 0x140 - 0x148
   CUtlString m_previewModelName; // 0x148 - 0x150

}; // size - 0x150


class CAnimationGraphVisualizerAxis : public CAnimationGraphVisualizerPrimitiveBase
{
public:

   CTransform m_xWsTransform; // 0x10 - 0x30
   float m_flAxisSize; // 0x30 - 0x34

}; // size - 0x40


class CAnimationGraphVisualizerLine : public CAnimationGraphVisualizerPrimitiveBase
{
public:

   VectorAligned m_vWsPositionStart; // 0x10 - 0x20
   VectorAligned m_vWsPositionEnd; // 0x20 - 0x30
   Color m_Color; // 0x30 - 0x34

}; // size - 0x40


class CAnimationGraphVisualizerPie : public CAnimationGraphVisualizerPrimitiveBase
{
public:

   VectorAligned m_vWsCenter; // 0x10 - 0x20
   VectorAligned m_vWsStart; // 0x20 - 0x30
   VectorAligned m_vWsEnd; // 0x30 - 0x40
   Color m_Color; // 0x40 - 0x44

}; // size - 0x50


class CAnimationGraphVisualizerSphere : public CAnimationGraphVisualizerPrimitiveBase
{
public:

   VectorAligned m_vWsPosition; // 0x10 - 0x20
   float m_flRadius; // 0x20 - 0x24
   Color m_Color; // 0x24 - 0x28

}; // size - 0x30


class CAnimationGraphVisualizerText : public CAnimationGraphVisualizerPrimitiveBase
{
public:

   VectorAligned m_vWsPosition; // 0x10 - 0x20
   Color m_Color; // 0x20 - 0x24
   unsigned char pad_24[0x4] // 0x24 - 0x28
   CUtlString m_Text; // 0x28 - 0x30

}; // size - 0x30


class CAnimationGroup
{
public:

   uint32_t m_nFlags; // 0x10 - 0x14
   unsigned char pad_14[0x4] // 0x14 - 0x18
   CBufferString m_name; // 0x18 - 0x28
   unsigned char pad_28[0x38] // 0x28 - 0x60
   CUtlVector< CStrongHandle< InfoForResourceTypeCAnimData > > m_localHAnimArray_Handle; // 0x60 - 0x78
   CUtlVector< CStrongHandle< InfoForResourceTypeCAnimationGroup > > m_includedGroupArray_Handle; // 0x78 - 0x90
   CStrongHandle< InfoForResourceTypeCSequenceGroupData > m_directHSeqGroup_Handle; // 0x90 - 0x98
   CAnimKeyData m_decodeKey; // 0x98 - 0x110
   CUtlVector< CBufferString > m_szScripts; // 0x110 - 0x128

}; // size - 0x130


class CAttachment
{
public:

   CUtlString m_name; // 0x0 - 0x8
   CUtlString m_influenceNames[3]; // 0x8 - 0x20
   Quaternion m_vInfluenceRotations[3]; // 0x20 - 0x50
   Vector m_vInfluenceOffsets[3]; // 0x50 - 0x74
   float32 m_influenceWeights[3]; // 0x74 - 0x80
   bool m_bInfluenceRootTransform[3]; // 0x80 - 0x83
   uint8_t m_nInfluences; // 0x83 - 0x84
   bool m_bIgnoreRotation; // 0x84 - 0x85

}; // size - 0x90


class CAttributeContainer : public CAttributeManager
{
public:

   CEconItemView m_Item; // 0x50 - 0x2C8

}; // size - 0x2C8


class CAttributeList
{
public:

   CUtlVectorEmbeddedNetworkVar< CEconItemAttribute > m_Attributes; // 0x8 - 0x58
   CAttributeManager* m_pManager; // 0x58 - 0x60

}; // size - 0x60


class CAttributeList
{
public:

   C_UtlVectorEmbeddedNetworkVar< CEconItemAttribute > m_Attributes; // 0x8 - 0x58
   CAttributeManager* m_pManager; // 0x58 - 0x60

}; // size - 0x60




class CAudioAnimTag : public CAnimTagBase
{
public:

   CUtlString m_clipName; // 0x40 - 0x48
   CUtlString m_attachmentName; // 0x48 - 0x50
   float m_flVolume; // 0x50 - 0x54
   bool m_bStopWhenTagEnds; // 0x54 - 0x55
   bool m_bStopWhenGraphEnds; // 0x55 - 0x56
   bool m_bPlayOnServer; // 0x56 - 0x57
   bool m_bPlayOnClient; // 0x57 - 0x58

}; // size - 0x58


class CBRC4Target : public CBaseAnimGraph
{
public:

   CHandle< CBaseEntity > m_hPlayerThatActivatedMe; // 0x848 - 0x84C
   bool m_bBrokenOpen; // 0x84C - 0x84D
   unsigned char pad_84D[0x3] // 0x84D - 0x850
   float m_flRadius; // 0x850 - 0x854

}; // size - 0x858


class CBaseAnimGraphController : public CSkeletonAnimationController
{
public:

   CNetworkedSequenceOperation m_baseLayer; // 0x18 - 0x40
   CAnimGraphNetworkedVariables m_animGraphNetworkedVars; // 0x40 - 0x1178
   unsigned char pad_1178[0x8] // 0x1178 - 0x1180
   bool m_bSequenceFinished; // 0x1180 - 0x1181
   unsigned char pad_1181[0x3] // 0x1181 - 0x1184
   float m_flLastEventCycle; // 0x1184 - 0x1188
   float m_flLastEventAnimTime; // 0x1188 - 0x118C
   CNetworkedQuantizedFloat m_flPlaybackRate; // 0x118C - 0x1194
   float m_flPrevAnimTime; // 0x1194 - 0x1198
   bool m_bClientSideAnimation; // 0x1198 - 0x1199
   bool m_bNetworkedAnimationInputsChanged; // 0x1199 - 0x119A
   uint8_t m_nPrevNewSequenceParity; // 0x119A - 0x119B
   uint8_t m_nPrevResetEventsParity; // 0x119B - 0x119C
   int32_t m_nNewSequenceParity; // 0x119C - 0x11A0
   int32_t m_nResetEventsParity; // 0x11A0 - 0x11A4
   AnimLoopMode_t m_nAnimLoopMode; // 0x11A4 - 0x11A8
   unsigned char pad_11A8[0x94] // 0x11A8 - 0x123C
   AnimationUpdateListHandle_t m_hAnimationUpdate; // 0x123C - 0x1240
   HSequence m_hLastAnimEventSequence; // 0x1240 - 0x1244

}; // size - 0x1298


class CBaseAnimGraphController : public CSkeletonAnimationController
{
public:

   CNetworkedSequenceOperation m_baseLayer; // 0x18 - 0x40
   CAnimGraphNetworkedVariables m_animGraphNetworkedVars; // 0x40 - 0x1E8
   unsigned char pad_1E8[0x8] // 0x1E8 - 0x1F0
   bool m_bSequenceFinished; // 0x1F0 - 0x1F1
   unsigned char pad_1F1[0x3] // 0x1F1 - 0x1F4
   float m_flLastEventCycle; // 0x1F4 - 0x1F8
   float m_flLastEventAnimTime; // 0x1F8 - 0x1FC
   CNetworkedQuantizedFloat m_flPlaybackRate; // 0x1FC - 0x204
   float m_flPrevAnimTime; // 0x204 - 0x208
   bool m_bClientSideAnimation; // 0x208 - 0x209
   bool m_bNetworkedAnimationInputsChanged; // 0x209 - 0x20A
   unsigned char pad_20A[0x2] // 0x20A - 0x20C
   int32_t m_nNewSequenceParity; // 0x20C - 0x210
   int32_t m_nResetEventsParity; // 0x210 - 0x214
   AnimLoopMode_t m_nAnimLoopMode; // 0x214 - 0x218
   unsigned char pad_218[0x94] // 0x218 - 0x2AC
   AnimationUpdateListHandle_t m_hAnimationUpdate; // 0x2AC - 0x2B0

}; // size - 0x2B0


class CBaseDMStart : public CPointEntity
{
public:

   CUtlSymbolLarge m_Master; // 0x4A0 - 0x4A8

}; // size - 0x4A8


class CBaseFlexAlias_funCBaseFlex : public CBaseFlex
{
public:


}; // size - 0x8B0


class CBaseIssue
{
public:

   char m_szTypeString[64]; // 0x20 - 0x60
   char m_szDetailsString[260]; // 0x60 - 0x164
   int32_t m_iNumYesVotes; // 0x164 - 0x168
   int32_t m_iNumNoVotes; // 0x168 - 0x16C
   int32_t m_iNumPotentialVotes; // 0x16C - 0x170
   CVoteController* m_pVoteController; // 0x170 - 0x178

}; // size - 0x178


class CBaseMoveBehavior : public CPathKeyFrame
{
public:

   int32_t m_iPositionInterpolator; // 0x500 - 0x504
   int32_t m_iRotationInterpolator; // 0x504 - 0x508
   float m_flAnimStartTime; // 0x508 - 0x50C
   float m_flAnimEndTime; // 0x50C - 0x510
   float m_flAverageSpeedAcrossFrame; // 0x510 - 0x514
   unsigned char pad_514[0x4] // 0x514 - 0x518
   CPathKeyFrame* m_pCurrentKeyFrame; // 0x518 - 0x520
   CPathKeyFrame* m_pTargetKeyFrame; // 0x520 - 0x528
   CPathKeyFrame* m_pPreKeyFrame; // 0x528 - 0x530
   CPathKeyFrame* m_pPostKeyFrame; // 0x530 - 0x538
   float m_flTimeIntoFrame; // 0x538 - 0x53C
   int32_t m_iDirection; // 0x53C - 0x540

}; // size - 0x540


class CBasePlayerVData : public CEntitySubclassVDataBase
{
public:

   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_sModelName; // 0x28 - 0x108
   CSkillFloat m_flHeadDamageMultiplier; // 0x108 - 0x118
   CSkillFloat m_flChestDamageMultiplier; // 0x118 - 0x128
   CSkillFloat m_flStomachDamageMultiplier; // 0x128 - 0x138
   CSkillFloat m_flArmDamageMultiplier; // 0x138 - 0x148
   CSkillFloat m_flLegDamageMultiplier; // 0x148 - 0x158
   float m_flHoldBreathTime; // 0x158 - 0x15C
   float m_flDrowningDamageInterval; // 0x15C - 0x160
   int32_t m_nDrowningDamageInitial; // 0x160 - 0x164
   int32_t m_nDrowningDamageMax; // 0x164 - 0x168
   int32_t m_nWaterSpeed; // 0x168 - 0x16C
   float m_flUseRange; // 0x16C - 0x170
   float m_flUseAngleTolerance; // 0x170 - 0x174
   float m_flCrouchTime; // 0x174 - 0x178

}; // size - 0x178


class CBasePlayerVData : public CEntitySubclassVDataBase
{
public:

   CResourceNameTyped< CWeakHandle< InfoForResourceTypeCModel > > m_sModelName; // 0x28 - 0x108
   CSkillFloat m_flHeadDamageMultiplier; // 0x108 - 0x118
   CSkillFloat m_flChestDamageMultiplier; // 0x118 - 0x128
   CSkillFloat m_flStomachDamageMultiplier; // 0x128 - 0x138
   CSkillFloat m_flArmDamageMultiplier; // 0x138 - 0x148
   CSkillFloat m_flLegDamageMultiplier; // 0x148 - 0x158
   float m_flHoldBreathTime; // 0x158 - 0x15C
   float m_flDrowningDamageInterval; // 0x15C - 0x160
   int32_t m_nDrowningDamageInitial; // 0x160 - 0x164
   int32_t m_nDrowningDamageMax; // 0x164 - 0x168
   int32_t m_nWaterSpeed; // 0x168 - 0x16C
   float m_flUseRange; // 0x16C - 0x170
   float m_flUseAngleTolerance; // 0x170 - 0x174
   float m_flCrouchTime; // 0x174 - 0x178

}; // size - 0x178


class CBindPoseAnimNode : public CAnimNodeBase
{
public:


}; // size - 0x38


class CBindPoseUpdateNode : public CLeafUpdateNode
{
public:


}; // size - 0x60


class CBlend2DAnimNode : public CAnimNodeBase
{
public:

   CUtlVector< CSmartPtr< CBlend2DItemBase > > m_items; // 0x50 - 0x68
   CUtlVector< CSmartPtr< CAnimTagSpan > > m_tagSpans; // 0x68 - 0x80
   CUtlVector< CSmartPtr< CAnimParamSpan > > m_paramSpans; // 0x80 - 0x98
   AnimValueSource m_blendSourceX; // 0x98 - 0x9C
   AnimParamID m_paramX; // 0x9C - 0xA0
   AnimValueSource m_blendSourceY; // 0xA0 - 0xA4
   AnimParamID m_paramY; // 0xA4 - 0xA8
   bool m_bLoop; // 0xA8 - 0xA9
   bool m_bLockBlendOnReset; // 0xA9 - 0xAA
   bool m_bLockWhenWaning; // 0xAA - 0xAB
   unsigned char pad_AB[0x1] // 0xAB - 0xAC
   float m_playbackSpeed; // 0xAC - 0xB0
   CAnimInputDamping m_damping; // 0xB0 - 0xC0
   bool m_bAnimEventsAndTagsOnMostWeightedOnly; // 0xC0 - 0xC1

}; // size - 0xC8


class CBlend2DUpdateNode : public CAnimUpdateNodeBase
{
public:

   CUtlVector< BlendItem_t > m_items; // 0x60 - 0x78
   CUtlVector< TagSpan_t > m_tags; // 0x78 - 0x90
   CParamSpanUpdater m_paramSpans; // 0x90 - 0xA8
   CUtlVector< int32 > m_nodeItemIndices; // 0xA8 - 0xC0
   CAnimInputDamping m_damping; // 0xC0 - 0xD0
   AnimValueSource m_blendSourceX; // 0xD0 - 0xD4
   CAnimParamHandle m_paramX; // 0xD4 - 0xD6
   unsigned char pad_D6[0x2] // 0xD6 - 0xD8
   AnimValueSource m_blendSourceY; // 0xD8 - 0xDC
   CAnimParamHandle m_paramY; // 0xDC - 0xDE
   unsigned char pad_DE[0x2] // 0xDE - 0xE0
   Blend2DMode m_eBlendMode; // 0xE0 - 0xE4
   float m_playbackSpeed; // 0xE4 - 0xE8
   bool m_bLoop; // 0xE8 - 0xE9
   bool m_bLockBlendOnReset; // 0xE9 - 0xEA
   bool m_bLockWhenWaning; // 0xEA - 0xEB
   bool m_bAnimEventsAndTagsOnMostWeightedOnly; // 0xEB - 0xEC

}; // size - 0xF0


class CBlendAnimNode : public CAnimNodeBase
{
public:

   CUtlVector< CBlendNodeChild > m_children; // 0x48 - 0x60
   AnimValueSource m_blendValueSource; // 0x60 - 0x64
   AnimParamID m_param; // 0x64 - 0x68
   BlendKeyType m_blendKeyType; // 0x68 - 0x6C
   bool m_bLockBlendOnReset; // 0x6C - 0x6D
   bool m_bSyncCycles; // 0x6D - 0x6E
   bool m_bLoop; // 0x6E - 0x6F
   bool m_bLockWhenWaning; // 0x6F - 0x70
   CAnimInputDamping m_damping; // 0x70 - 0x80

}; // size - 0x80


class CBlendCurve
{
public:

   float m_flControlPoint1; // 0x0 - 0x4
   float m_flControlPoint2; // 0x4 - 0x8

}; // size - 0x8


class CBlendNodeChild
{
public:

   CAnimNodeConnection m_inputConnection; // 0x8 - 0x10
   CUtlString m_name; // 0x10 - 0x18
   float m_blendValue; // 0x18 - 0x1C

}; // size - 0x20


class CBlendUpdateNode : public CAnimUpdateNodeBase
{
public:

   CUtlVector< CAnimUpdateNodeRef > m_children; // 0x60 - 0x78
   CUtlVector< uint8 > m_sortedOrder; // 0x78 - 0x90
   CUtlVector< float32 > m_targetValues; // 0x90 - 0xA8
   unsigned char pad_A8[0x4] // 0xA8 - 0xAC
   AnimValueSource m_blendValueSource; // 0xAC - 0xB0
   CAnimParamHandle m_paramIndex; // 0xB0 - 0xB2
   unsigned char pad_B2[0x6] // 0xB2 - 0xB8
   CAnimInputDamping m_damping; // 0xB8 - 0xC8
   BlendKeyType m_blendKeyType; // 0xC8 - 0xCC
   bool m_bLockBlendOnReset; // 0xCC - 0xCD
   bool m_bSyncCycles; // 0xCD - 0xCE
   bool m_bLoop; // 0xCE - 0xCF
   bool m_bLockWhenWaning; // 0xCF - 0xD0

}; // size - 0xD0


class CBlockSelectionMetric : public CMotionMetricBase
{
public:


}; // size - 0x28


class CBlockSelectionMetricEvaluator : public CMotionMetricEvaluator
{
public:


}; // size - 0x50


class CBlood : public CPointEntity
{
public:

   QAngle m_vecSprayAngles; // 0x4A0 - 0x4AC
   Vector m_vecSprayDir; // 0x4AC - 0x4B8
   float m_flAmount; // 0x4B8 - 0x4BC
   int32_t m_Color; // 0x4BC - 0x4C0

}; // size - 0x4C0


class CBodyComponentBaseAnimGraph : public CBodyComponentSkeletonInstance
{
public:

   CBaseAnimGraphController m_animationController; // 0x470 - 0x1708
   CNetworkVarChainer __m_pChainEntity; // 0x1708 - 0x1730

}; // size - 0x1730


class CBodyComponentBaseAnimGraph : public CBodyComponentSkeletonInstance
{
public:

   CBaseAnimGraphController m_animationController; // 0x470 - 0x720
   CNetworkVarChainer __m_pChainEntity; // 0x720 - 0x748

}; // size - 0x750


class CBodyComponentBaseModelEntity : public CBodyComponentSkeletonInstance
{
public:

   CNetworkVarChainer __m_pChainEntity; // 0x470 - 0x498

}; // size - 0x4A0


class CBodyComponentBaseModelEntity : public CBodyComponentSkeletonInstance
{
public:

   CNetworkVarChainer __m_pChainEntity; // 0x470 - 0x498

}; // size - 0x4A0


class CBodyComponentPoint : public CBodyComponent
{
public:

   CGameSceneNode m_sceneNode; // 0x50 - 0x1A0
   CNetworkVarChainer __m_pChainEntity; // 0x1A0 - 0x1C8

}; // size - 0x1D0


class CBodyComponentPoint : public CBodyComponent
{
public:

   CGameSceneNode m_sceneNode; // 0x50 - 0x1A0
   CNetworkVarChainer __m_pChainEntity; // 0x1A0 - 0x1C8

}; // size - 0x1D0


class CBodyGroupAnimTag : public CAnimTagBase
{
public:

   int32_t m_nPriority; // 0x40 - 0x44
   unsigned char pad_44[0x4] // 0x44 - 0x48
   CUtlVector< CBodyGroupSetting > m_bodyGroupSettings; // 0x48 - 0x60

}; // size - 0x60


class CBodyGroupSetting
{
public:

   CUtlString m_BodyGroupName; // 0x0 - 0x8
   int32_t m_nBodyGroupOption; // 0x8 - 0xC

}; // size - 0x10


class CBombTarget : public CBaseTrigger
{
public:

   CEntityIOOutput m_OnBombExplode; // 0x898 - 0x8C0
   CEntityIOOutput m_OnBombPlanted; // 0x8C0 - 0x8E8
   CEntityIOOutput m_OnBombDefused; // 0x8E8 - 0x910
   bool m_bIsBombSiteB; // 0x910 - 0x911
   bool m_bIsHeistBombTarget; // 0x911 - 0x912
   bool m_bBombPlantedHere; // 0x912 - 0x913
   unsigned char pad_913[0x5] // 0x913 - 0x918
   CUtlSymbolLarge m_szMountTarget; // 0x918 - 0x920
   CHandle< CBaseEntity > m_hInstructorHint; // 0x920 - 0x924

}; // size - 0x928


class CBoneConstraintPoseSpaceBone : public CBaseConstraint
{
public:

   class Input_t
   {
   public:

      Vector m_inputValue; // 0x0 - 0xC
      unsigned char pad_C[0x4] // 0xC - 0x10
      CUtlVector< CTransform > m_outputTransformList; // 0x10 - 0x28

   }; // size - 0x28

   CUtlVector< CBoneConstraintPoseSpaceBone::Input_t > m_inputList; // 0x70 - 0x88

}; // size - 0x98



class CBoneConstraintPoseSpaceMorph : public CBoneConstraintBase
{
public:

   class Input_t
   {
   public:

      Vector m_inputValue; // 0x0 - 0xC
      unsigned char pad_C[0x4] // 0xC - 0x10
      CUtlVector< float32 > m_outputWeightList; // 0x10 - 0x28

   }; // size - 0x28

   CUtlString m_sBoneName; // 0x28 - 0x30
   CUtlString m_sAttachmentName; // 0x30 - 0x38
   CUtlVector< CUtlString > m_outputMorph; // 0x38 - 0x50
   CUtlVector< CBoneConstraintPoseSpaceMorph::Input_t > m_inputList; // 0x50 - 0x68
   bool m_bClamp; // 0x68 - 0x69

}; // size - 0xA8



class CBoneMaskAnimNode : public CAnimNodeBase
{
public:

   CUtlString m_weightListName; // 0x38 - 0x40
   CAnimNodeConnection m_inputConnection1; // 0x40 - 0x48
   CAnimNodeConnection m_inputConnection2; // 0x48 - 0x50
   BoneMaskBlendSpace m_blendSpace; // 0x50 - 0x54
   bool m_bUseBlendScale; // 0x54 - 0x55
   unsigned char pad_55[0x3] // 0x55 - 0x58
   AnimValueSource m_blendValueSource; // 0x58 - 0x5C
   AnimParamID m_blendParameter; // 0x5C - 0x60
   BinaryNodeTiming m_timingBehavior; // 0x60 - 0x64
   float m_flTimingBlend; // 0x64 - 0x68
   float m_flRootMotionBlend; // 0x68 - 0x6C
   BinaryNodeChildOption m_footMotionTiming; // 0x6C - 0x70
   bool m_bResetChild1; // 0x70 - 0x71
   bool m_bResetChild2; // 0x71 - 0x72

}; // size - 0x78


class CBoneMaskUpdateNode : public CBinaryUpdateNode
{
public:

   int32_t m_nWeightListIndex; // 0x8C - 0x90
   float m_flRootMotionBlend; // 0x90 - 0x94
   BoneMaskBlendSpace m_blendSpace; // 0x94 - 0x98
   BinaryNodeChildOption m_footMotionTiming; // 0x98 - 0x9C
   bool m_bUseBlendScale; // 0x9C - 0x9D
   unsigned char pad_9D[0x3] // 0x9D - 0xA0
   AnimValueSource m_blendValueSource; // 0xA0 - 0xA4
   CAnimParamHandle m_hBlendParameter; // 0xA4 - 0xA6

}; // size - 0xA8


class CBonePositionMetric : public CMotionMetricBase
{
public:

   CUtlString m_boneName; // 0x28 - 0x30

}; // size - 0x30


class CBonePositionMetricEvaluator : public CMotionMetricEvaluator
{
public:

   int32_t m_nBoneIndex; // 0x50 - 0x54

}; // size - 0x58


class CBoneVelocityMetric : public CMotionMetricBase
{
public:

   CUtlString m_boneName; // 0x28 - 0x30

}; // size - 0x30


class CBoneVelocityMetricEvaluator : public CMotionMetricEvaluator
{
public:

   int32_t m_nBoneIndex; // 0x50 - 0x54

}; // size - 0x58


class CBoolAnimParameter : public CAnimParameterBase
{
public:

   bool m_bDefaultValue; // 0x78 - 0x79

}; // size - 0x80


class CBreachCharge : public CWeaponCSBase
{
public:


}; // size - 0xD50


class CBreachChargeProjectile : public CBaseGrenade
{
public:

   bool m_bShouldExplode; // 0x958 - 0x959
   unsigned char pad_959[0x3] // 0x959 - 0x95C
   CHandle< CBaseEntity > m_weaponThatThrewMe; // 0x95C - 0x960
   int32_t m_nParentBoneIndex; // 0x960 - 0x964
   Vector m_vecParentBonePos; // 0x964 - 0x970
   bool m_bDefused; // 0x970 - 0x971
   bool m_bUnstuckFromPlayer; // 0x971 - 0x972
   bool m_bResolvedParent; // 0x972 - 0x973
   unsigned char pad_973[0x1] // 0x973 - 0x974
   Vector m_vecLastKnownValidPos; // 0x974 - 0x980
   CEntityHandle m_hDesiredParent; // 0x980 - 0x984

}; // size - 0x988


class CBtActionAim : public CBtNode
{
public:

   CUtlString m_szSensorInputKey; // 0x68 - 0x70
   unsigned char pad_70[0x10] // 0x70 - 0x80
   CUtlString m_szAimReadyKey; // 0x80 - 0x88
   float m_flZoomCooldownTimestamp; // 0x88 - 0x8C
   bool m_bDoneAiming; // 0x8C - 0x8D
   unsigned char pad_8D[0x3] // 0x8D - 0x90
   float m_flLerpStartTime; // 0x90 - 0x94
   float m_flNextLookTargetLerpTime; // 0x94 - 0x98
   float m_flPenaltyReductionRatio; // 0x98 - 0x9C
   QAngle m_NextLookTarget; // 0x9C - 0xA8
   CountdownTimer m_AimTimer; // 0xA8 - 0xC0
   CountdownTimer m_SniperHoldTimer; // 0xC0 - 0xD8
   CountdownTimer m_FocusIntervalTimer; // 0xD8 - 0xF0
   bool m_bAcquired; // 0xF0 - 0xF1

}; // size - 0xF8


class CBtActionCombatPositioning : public CBtNode
{
public:

   CUtlString m_szSensorInputKey; // 0x68 - 0x70
   unsigned char pad_70[0x10] // 0x70 - 0x80
   CUtlString m_szIsAttackingKey; // 0x80 - 0x88
   CountdownTimer m_ActionTimer; // 0x88 - 0xA0
   bool m_bCrouching; // 0xA0 - 0xA1

}; // size - 0xB0


class CBtActionMoveTo : public CBtNode
{
public:

   CUtlString m_szDestinationInputKey; // 0x60 - 0x68
   CUtlString m_szHidingSpotInputKey; // 0x68 - 0x70
   CUtlString m_szThreatInputKey; // 0x70 - 0x78
   Vector m_vecDestination; // 0x78 - 0x84
   bool m_bAutoLookAdjust; // 0x84 - 0x85
   bool m_bComputePath; // 0x85 - 0x86
   unsigned char pad_86[0x2] // 0x86 - 0x88
   float m_flDamagingAreasPenaltyCost; // 0x88 - 0x8C
   unsigned char pad_8C[0x4] // 0x8C - 0x90
   CountdownTimer m_CheckApproximateCornersTimer; // 0x90 - 0xA8
   CountdownTimer m_CheckHighPriorityItem; // 0xA8 - 0xC0
   CountdownTimer m_RepathTimer; // 0xC0 - 0xD8
   float m_flArrivalEpsilon; // 0xD8 - 0xDC
   float m_flAdditionalArrivalEpsilon2D; // 0xDC - 0xE0
   float m_flHidingSpotCheckDistanceThreshold; // 0xE0 - 0xE4
   float m_flNearestAreaDistanceThreshold; // 0xE4 - 0xE8

}; // size - 0xE8


class CBtActionParachutePositioning : public CBtNode
{
public:

   CountdownTimer m_ActionTimer; // 0x58 - 0x70

}; // size - 0x78


class CBtNodeComposite : public CBtNode
{
public:


}; // size - 0x58


class CBtNodeConditionInactive : public CBtNodeCondition
{
public:

   float m_flRoundStartThresholdSeconds; // 0x78 - 0x7C
   float m_flSensorInactivityThresholdSeconds; // 0x7C - 0x80
   CountdownTimer m_SensorInactivityTimer; // 0x80 - 0x98

}; // size - 0x98


class CBubbling : public CBaseModelEntity
{
public:

   int32_t m_density; // 0x6F0 - 0x6F4
   int32_t m_frequency; // 0x6F4 - 0x6F8
   int32_t m_state; // 0x6F8 - 0x6FC

}; // size - 0x700


class CBumpMine : public CWeaponCSBase
{
public:


}; // size - 0xD50


class CBumpMineProjectile : public CBaseGrenade
{
public:

   bool m_bShouldExplode; // 0x958 - 0x959
   unsigned char pad_959[0x3] // 0x959 - 0x95C
   int32_t m_nParentBoneIndex; // 0x95C - 0x960
   Vector m_vecParentBonePos; // 0x960 - 0x96C
   bool m_bArmed; // 0x96C - 0x96D
   bool m_bDefused; // 0x96D - 0x96E
   bool m_bUnstuckFromPlayer; // 0x96E - 0x96F
   unsigned char pad_96F[0x1] // 0x96F - 0x970
   CUtlVector< CHandle< CBaseEntity > > m_vecTargetedObjects; // 0x970 - 0x988
   unsigned char pad_988[0x28] // 0x988 - 0x9B0
   bool m_bResolvedParent; // 0x9B0 - 0x9B1
   unsigned char pad_9B1[0x3] // 0x9B1 - 0x9B4
   Vector m_vecLastKnownValidPos; // 0x9B4 - 0x9C0
   CEntityHandle m_hDesiredParent; // 0x9C0 - 0x9C4
   bool m_bBeingUsed; // 0x9C4 - 0x9C5

}; // size - 0x9C8


class CBuoyancyHelper
{
public:

   float m_flFluidDensity; // 0x18 - 0x1C

}; // size - 0x20


class CBuoyancyHelper
{
public:

   float m_flFluidDensity; // 0x18 - 0x1C

}; // size - 0x20


class CBuyZone : public CBaseTrigger
{
public:

   int32_t m_LegacyTeamNum; // 0x898 - 0x89C

}; // size - 0x8A0


class CC4 : public CWeaponCSBase
{
public:

   Vector m_vecLastValidPlayerHeldPosition; // 0xD50 - 0xD5C
   Vector m_vecLastValidDroppedPosition; // 0xD5C - 0xD68
   bool m_bDoValidDroppedPositionCheck; // 0xD68 - 0xD69
   bool m_bStartedArming; // 0xD69 - 0xD6A
   unsigned char pad_D6A[0x2] // 0xD6A - 0xD6C
   GameTime_t m_fArmedTime; // 0xD6C - 0xD70
   bool m_bBombPlacedAnimation; // 0xD70 - 0xD71
   bool m_bShowC4LED; // 0xD71 - 0xD72
   bool m_bIsPlantingViaUse; // 0xD72 - 0xD73
   unsigned char pad_D73[0x5] // 0xD73 - 0xD78
   EntitySpottedState_t m_entitySpottedState; // 0xD78 - 0xD90
   int32_t m_nSpotRules; // 0xD90 - 0xD94
   bool m_bPlayedArmingBeeps[7]; // 0xD94 - 0xD9B
   bool m_bBombPlanted; // 0xD9B - 0xD9C
   bool m_bDroppedFromDeath; // 0xD9C - 0xD9D

}; // size - 0xDA0


class CCSBot : public CBot
{
public:

   CHandle< SpawnPointCoopEnemy > m_lastCoopSpawnPoint; // 0xD0 - 0xD4
   unsigned char pad_D4[0xC] // 0xD4 - 0xE0
   Vector m_eyePosition; // 0xE0 - 0xEC
   char m_name[64]; // 0xEC - 0x12C
   float m_combatRange; // 0x12C - 0x130
   bool m_isRogue; // 0x130 - 0x131
   unsigned char pad_131[0x7] // 0x131 - 0x138
   CountdownTimer m_rogueTimer; // 0x138 - 0x150
   unsigned char pad_150[0x4] // 0x150 - 0x154
   bool m_diedLastRound; // 0x154 - 0x155
   unsigned char pad_155[0x3] // 0x155 - 0x158
   float m_safeTime; // 0x158 - 0x15C
   bool m_wasSafe; // 0x15C - 0x15D
   unsigned char pad_15D[0x7] // 0x15D - 0x164
   bool m_blindFire; // 0x164 - 0x165
   unsigned char pad_165[0x3] // 0x165 - 0x168
   CountdownTimer m_surpriseTimer; // 0x168 - 0x180
   bool m_bAllowActive; // 0x180 - 0x181
   bool m_isFollowing; // 0x181 - 0x182
   unsigned char pad_182[0x2] // 0x182 - 0x184
   CHandle< CCSPlayerPawn > m_leader; // 0x184 - 0x188
   float m_followTimestamp; // 0x188 - 0x18C
   float m_allowAutoFollowTime; // 0x18C - 0x190
   CountdownTimer m_hurryTimer; // 0x190 - 0x1A8
   CountdownTimer m_alertTimer; // 0x1A8 - 0x1C0
   CountdownTimer m_sneakTimer; // 0x1C0 - 0x1D8
   CountdownTimer m_panicTimer; // 0x1D8 - 0x1F0
   unsigned char pad_1F0[0x2E8] // 0x1F0 - 0x4D8
   float m_stateTimestamp; // 0x4D8 - 0x4DC
   bool m_isAttacking; // 0x4DC - 0x4DD
   bool m_isOpeningDoor; // 0x4DD - 0x4DE
   unsigned char pad_4DE[0x6] // 0x4DE - 0x4E4
   CHandle< CBaseEntity > m_taskEntity; // 0x4E4 - 0x4E8
   unsigned char pad_4E8[0xC] // 0x4E8 - 0x4F4
   Vector m_goalPosition; // 0x4F4 - 0x500
   CHandle< CBaseEntity > m_goalEntity; // 0x500 - 0x504
   CHandle< CBaseEntity > m_avoid; // 0x504 - 0x508
   float m_avoidTimestamp; // 0x508 - 0x50C
   bool m_isStopping; // 0x50C - 0x50D
   bool m_hasVisitedEnemySpawn; // 0x50D - 0x50E
   unsigned char pad_50E[0x2] // 0x50E - 0x510
   IntervalTimer m_stillTimer; // 0x510 - 0x520
   bool m_bEyeAnglesUnderPathFinderControl; // 0x520 - 0x521
   unsigned char pad_521[0x60F7] // 0x521 - 0x6618
   int32_t m_pathIndex; // 0x6618 - 0x661C
   GameTime_t m_areaEnteredTimestamp; // 0x661C - 0x6620
   CountdownTimer m_repathTimer; // 0x6620 - 0x6638
   CountdownTimer m_avoidFriendTimer; // 0x6638 - 0x6650
   bool m_isFriendInTheWay; // 0x6650 - 0x6651
   unsigned char pad_6651[0x7] // 0x6651 - 0x6658
   CountdownTimer m_politeTimer; // 0x6658 - 0x6670
   bool m_isWaitingBehindFriend; // 0x6670 - 0x6671
   unsigned char pad_6671[0x2B] // 0x6671 - 0x669C
   float m_pathLadderEnd; // 0x669C - 0x66A0
   unsigned char pad_66A0[0x48] // 0x66A0 - 0x66E8
   CountdownTimer m_mustRunTimer; // 0x66E8 - 0x6700
   CountdownTimer m_waitTimer; // 0x6700 - 0x6718
   CountdownTimer m_updateTravelDistanceTimer; // 0x6718 - 0x6730
   float32 m_playerTravelDistance[64]; // 0x6730 - 0x6830
   uint8_t m_travelDistancePhase; // 0x6830 - 0x6831
   unsigned char pad_6831[0x197] // 0x6831 - 0x69C8
   uint8_t m_hostageEscortCount; // 0x69C8 - 0x69C9
   unsigned char pad_69C9[0x3] // 0x69C9 - 0x69CC
   float m_hostageEscortCountTimestamp; // 0x69CC - 0x69D0
   int32_t m_desiredTeam; // 0x69D0 - 0x69D4
   bool m_hasJoined; // 0x69D4 - 0x69D5
   bool m_isWaitingForHostage; // 0x69D5 - 0x69D6
   unsigned char pad_69D6[0x2] // 0x69D6 - 0x69D8
   CountdownTimer m_inhibitWaitingForHostageTimer; // 0x69D8 - 0x69F0
   CountdownTimer m_waitForHostageTimer; // 0x69F0 - 0x6A08
   Vector m_noisePosition; // 0x6A08 - 0x6A14
   float m_noiseTravelDistance; // 0x6A14 - 0x6A18
   float m_noiseTimestamp; // 0x6A18 - 0x6A1C
   unsigned char pad_6A1C[0x4] // 0x6A1C - 0x6A20
   CBasePlayerPawn* m_noiseSource; // 0x6A20 - 0x6A28
   unsigned char pad_6A28[0x10] // 0x6A28 - 0x6A38
   CountdownTimer m_noiseBendTimer; // 0x6A38 - 0x6A50
   Vector m_bentNoisePosition; // 0x6A50 - 0x6A5C
   bool m_bendNoisePositionValid; // 0x6A5C - 0x6A5D
   unsigned char pad_6A5D[0x3] // 0x6A5D - 0x6A60
   float m_lookAroundStateTimestamp; // 0x6A60 - 0x6A64
   float m_lookAheadAngle; // 0x6A64 - 0x6A68
   float m_forwardAngle; // 0x6A68 - 0x6A6C
   float m_inhibitLookAroundTimestamp; // 0x6A6C - 0x6A70
   unsigned char pad_6A70[0x4] // 0x6A70 - 0x6A74
   Vector m_lookAtSpot; // 0x6A74 - 0x6A80
   unsigned char pad_6A80[0x4] // 0x6A80 - 0x6A84
   float m_lookAtSpotDuration; // 0x6A84 - 0x6A88
   float m_lookAtSpotTimestamp; // 0x6A88 - 0x6A8C
   float m_lookAtSpotAngleTolerance; // 0x6A8C - 0x6A90
   bool m_lookAtSpotClearIfClose; // 0x6A90 - 0x6A91
   bool m_lookAtSpotAttack; // 0x6A91 - 0x6A92
   unsigned char pad_6A92[0x6] // 0x6A92 - 0x6A98
   char* m_lookAtDesc; // 0x6A98 - 0x6AA0
   float m_peripheralTimestamp; // 0x6AA0 - 0x6AA4
   unsigned char pad_6AA4[0x184] // 0x6AA4 - 0x6C28
   uint8_t m_approachPointCount; // 0x6C28 - 0x6C29
   unsigned char pad_6C29[0x3] // 0x6C29 - 0x6C2C
   Vector m_approachPointViewPosition; // 0x6C2C - 0x6C38
   IntervalTimer m_viewSteadyTimer; // 0x6C38 - 0x6C48
   unsigned char pad_6C48[0x8] // 0x6C48 - 0x6C50
   CountdownTimer m_tossGrenadeTimer; // 0x6C50 - 0x6C68
   unsigned char pad_6C68[0x8] // 0x6C68 - 0x6C70
   CountdownTimer m_isAvoidingGrenade; // 0x6C70 - 0x6C88
   unsigned char pad_6C88[0x8] // 0x6C88 - 0x6C90
   float m_spotCheckTimestamp; // 0x6C90 - 0x6C94
   unsigned char pad_6C94[0x404] // 0x6C94 - 0x7098
   int32_t m_checkedHidingSpotCount; // 0x7098 - 0x709C
   float m_lookPitch; // 0x709C - 0x70A0
   float m_lookPitchVel; // 0x70A0 - 0x70A4
   float m_lookYaw; // 0x70A4 - 0x70A8
   float m_lookYawVel; // 0x70A8 - 0x70AC
   Vector m_targetSpot; // 0x70AC - 0x70B8
   Vector m_targetSpotVelocity; // 0x70B8 - 0x70C4
   Vector m_targetSpotPredicted; // 0x70C4 - 0x70D0
   QAngle m_aimError; // 0x70D0 - 0x70DC
   QAngle m_aimGoal; // 0x70DC - 0x70E8
   GameTime_t m_targetSpotTime; // 0x70E8 - 0x70EC
   float m_aimFocus; // 0x70EC - 0x70F0
   float m_aimFocusInterval; // 0x70F0 - 0x70F4
   GameTime_t m_aimFocusNextUpdate; // 0x70F4 - 0x70F8
   unsigned char pad_70F8[0x8] // 0x70F8 - 0x7100
   CountdownTimer m_ignoreEnemiesTimer; // 0x7100 - 0x7118
   CHandle< CCSPlayerPawnBase > m_enemy; // 0x7118 - 0x711C
   bool m_isEnemyVisible; // 0x711C - 0x711D
   uint8_t m_visibleEnemyParts; // 0x711D - 0x711E
   unsigned char pad_711E[0x2] // 0x711E - 0x7120
   Vector m_lastEnemyPosition; // 0x7120 - 0x712C
   float m_lastSawEnemyTimestamp; // 0x712C - 0x7130
   float m_firstSawEnemyTimestamp; // 0x7130 - 0x7134
   float m_currentEnemyAcquireTimestamp; // 0x7134 - 0x7138
   float m_enemyDeathTimestamp; // 0x7138 - 0x713C
   float m_friendDeathTimestamp; // 0x713C - 0x7140
   bool m_isLastEnemyDead; // 0x7140 - 0x7141
   unsigned char pad_7141[0x3] // 0x7141 - 0x7144
   int32_t m_nearbyEnemyCount; // 0x7144 - 0x7148
   unsigned char pad_7148[0x208] // 0x7148 - 0x7350
   CHandle< CCSPlayerPawnBase > m_bomber; // 0x7350 - 0x7354
   int32_t m_nearbyFriendCount; // 0x7354 - 0x7358
   CHandle< CCSPlayerPawnBase > m_closestVisibleFriend; // 0x7358 - 0x735C
   CHandle< CCSPlayerPawnBase > m_closestVisibleHumanFriend; // 0x735C - 0x7360
   IntervalTimer m_attentionInterval; // 0x7360 - 0x7370
   CHandle< CCSPlayerPawnBase > m_attacker; // 0x7370 - 0x7374
   float m_attackedTimestamp; // 0x7374 - 0x7378
   IntervalTimer m_burnedByFlamesTimer; // 0x7378 - 0x7388
   int32_t m_lastVictimID; // 0x7388 - 0x738C
   bool m_isAimingAtEnemy; // 0x738C - 0x738D
   bool m_isRapidFiring; // 0x738D - 0x738E
   unsigned char pad_738E[0x2] // 0x738E - 0x7390
   IntervalTimer m_equipTimer; // 0x7390 - 0x73A0
   CountdownTimer m_zoomTimer; // 0x73A0 - 0x73B8
   GameTime_t m_fireWeaponTimestamp; // 0x73B8 - 0x73BC
   unsigned char pad_73BC[0x4] // 0x73BC - 0x73C0
   CountdownTimer m_lookForWeaponsOnGroundTimer; // 0x73C0 - 0x73D8
   bool m_bIsSleeping; // 0x73D8 - 0x73D9
   bool m_isEnemySniperVisible; // 0x73D9 - 0x73DA
   unsigned char pad_73DA[0x6] // 0x73DA - 0x73E0
   CountdownTimer m_sawEnemySniperTimer; // 0x73E0 - 0x73F8
   unsigned char pad_73F8[0xA0] // 0x73F8 - 0x7498
   uint8_t m_enemyQueueIndex; // 0x7498 - 0x7499
   uint8_t m_enemyQueueCount; // 0x7499 - 0x749A
   uint8_t m_enemyQueueAttendIndex; // 0x749A - 0x749B
   bool m_isStuck; // 0x749B - 0x749C
   GameTime_t m_stuckTimestamp; // 0x749C - 0x74A0
   Vector m_stuckSpot; // 0x74A0 - 0x74AC
   unsigned char pad_74AC[0x4] // 0x74AC - 0x74B0
   CountdownTimer m_wiggleTimer; // 0x74B0 - 0x74C8
   CountdownTimer m_stuckJumpTimer; // 0x74C8 - 0x74E0
   GameTime_t m_nextCleanupCheckTimestamp; // 0x74E0 - 0x74E4
   float32 m_avgVel[10]; // 0x74E4 - 0x750C
   int32_t m_avgVelIndex; // 0x750C - 0x7510
   int32_t m_avgVelCount; // 0x7510 - 0x7514
   Vector m_lastOrigin; // 0x7514 - 0x7520
   unsigned char pad_7520[0x4] // 0x7520 - 0x7524
   float m_lastRadioRecievedTimestamp; // 0x7524 - 0x7528
   float m_lastRadioSentTimestamp; // 0x7528 - 0x752C
   CHandle< CCSPlayerPawnBase > m_radioSubject; // 0x752C - 0x7530
   Vector m_radioPosition; // 0x7530 - 0x753C
   float m_voiceEndTimestamp; // 0x753C - 0x7540
   unsigned char pad_7540[0x8] // 0x7540 - 0x7548
   int32_t m_lastValidReactionQueueFrame; // 0x7548 - 0x754C

}; // size - 0x7550


class CCSEnvGunfire : public CPointEntity
{
public:

   int32_t m_iMinBurstSize; // 0x4A0 - 0x4A4
   int32_t m_iMaxBurstSize; // 0x4A4 - 0x4A8
   float m_flMinBurstDelay; // 0x4A8 - 0x4AC
   float m_flMaxBurstDelay; // 0x4AC - 0x4B0
   float m_flRateOfFire; // 0x4B0 - 0x4B4
   unsigned char pad_4B4[0x4] // 0x4B4 - 0x4B8
   CUtlSymbolLarge m_iszShootSound; // 0x4B8 - 0x4C0
   CUtlSymbolLarge m_iszTracerType; // 0x4C0 - 0x4C8
   CUtlSymbolLarge m_iszWeaponName; // 0x4C8 - 0x4D0
   bool m_bDisabled; // 0x4D0 - 0x4D1
   unsigned char pad_4D1[0x3] // 0x4D1 - 0x4D4
   int32_t m_iShotsRemaining; // 0x4D4 - 0x4D8
   int32_t m_iSpread; // 0x4D8 - 0x4DC
   Vector m_vecSpread; // 0x4DC - 0x4E8
   Vector m_vecTargetPosition; // 0x4E8 - 0x4F4
   float m_flTargetDist; // 0x4F4 - 0x4F8
   float m_flBias; // 0x4F8 - 0x4FC
   bool m_bCollide; // 0x4FC - 0x4FD
   unsigned char pad_4FD[0x3] // 0x4FD - 0x500
   CHandle< CBaseEntity > m_hTarget; // 0x500 - 0x504
   bool m_bAllowNullTarget; // 0x504 - 0x505
   bool m_bAlwaysWallbangTracer; // 0x505 - 0x506
   unsigned char pad_506[0x2] // 0x506 - 0x508
   float m_flDamageScaleValue; // 0x508 - 0x50C
   float m_flAdditionalSpread; // 0x50C - 0x510

}; // size - 0x510


class CCSGOPlayerAnimGraphState
{
public:


}; // size - 0x120


class CCSGOViewModel : public CPredictedViewModel
{
public:

   bool m_bShouldIgnoreOffsetAndAccuracy; // 0x868 - 0x869
   unsigned char pad_869[0x3] // 0x869 - 0x86C
   uint32_t m_nWeaponParity; // 0x86C - 0x870
   uint32_t m_nOldWeaponParity; // 0x870 - 0x874

}; // size - 0x878


class CCSGO_TeamIntroCounterTerroristPosition : public CCSGO_TeamIntroCharacterPosition
{
public:


}; // size - 0x730


class CCSGO_TeamIntroTerroristPosition : public CCSGO_TeamIntroCharacterPosition
{
public:


}; // size - 0x730


class CCSGO_TeamSelectCounterTerroristPosition : public CCSGO_TeamSelectCharacterPosition
{
public:


}; // size - 0x730


class CCSGO_TeamSelectTerroristPosition : public CCSGO_TeamSelectCharacterPosition
{
public:


}; // size - 0x730


class CCSGameRules : public CTeamplayRules
{
public:

   CNetworkVarChainer __m_pChainEntity; // 0x98 - 0xC0
   CHandle< CBaseEntity > m_coopMissionManager; // 0xC0 - 0xC4
   bool m_bFreezePeriod; // 0xC4 - 0xC5
   bool m_bWarmupPeriod; // 0xC5 - 0xC6
   unsigned char pad_C6[0x2] // 0xC6 - 0xC8
   GameTime_t m_fWarmupPeriodEnd; // 0xC8 - 0xCC
   GameTime_t m_fWarmupPeriodStart; // 0xCC - 0xD0
   bool m_bTerroristTimeOutActive; // 0xD0 - 0xD1
   bool m_bCTTimeOutActive; // 0xD1 - 0xD2
   unsigned char pad_D2[0x2] // 0xD2 - 0xD4
   float m_flTerroristTimeOutRemaining; // 0xD4 - 0xD8
   float m_flCTTimeOutRemaining; // 0xD8 - 0xDC
   int32_t m_nTerroristTimeOuts; // 0xDC - 0xE0
   int32_t m_nCTTimeOuts; // 0xE0 - 0xE4
   bool m_bTechnicalTimeOut; // 0xE4 - 0xE5
   bool m_bMatchWaitingForResume; // 0xE5 - 0xE6
   unsigned char pad_E6[0x2] // 0xE6 - 0xE8
   int32_t m_iRoundTime; // 0xE8 - 0xEC
   float m_fMatchStartTime; // 0xEC - 0xF0
   GameTime_t m_fRoundStartTime; // 0xF0 - 0xF4
   GameTime_t m_flRestartRoundTime; // 0xF4 - 0xF8
   bool m_bGameRestart; // 0xF8 - 0xF9
   unsigned char pad_F9[0x3] // 0xF9 - 0xFC
   float m_flGameStartTime; // 0xFC - 0x100
   float m_timeUntilNextPhaseStarts; // 0x100 - 0x104
   int32_t m_gamePhase; // 0x104 - 0x108
   int32_t m_totalRoundsPlayed; // 0x108 - 0x10C
   int32_t m_nRoundsPlayedThisPhase; // 0x10C - 0x110
   int32_t m_nOvertimePlaying; // 0x110 - 0x114
   int32_t m_iHostagesRemaining; // 0x114 - 0x118
   bool m_bAnyHostageReached; // 0x118 - 0x119
   bool m_bMapHasBombTarget; // 0x119 - 0x11A
   bool m_bMapHasRescueZone; // 0x11A - 0x11B
   bool m_bMapHasBuyZone; // 0x11B - 0x11C
   bool m_bIsQueuedMatchmaking; // 0x11C - 0x11D
   unsigned char pad_11D[0x3] // 0x11D - 0x120
   int32_t m_nQueuedMatchmakingMode; // 0x120 - 0x124
   bool m_bIsValveDS; // 0x124 - 0x125
   bool m_bLogoMap; // 0x125 - 0x126
   bool m_bPlayAllStepSoundsOnServer; // 0x126 - 0x127
   unsigned char pad_127[0x1] // 0x127 - 0x128
   int32_t m_iNumGunGameProgressiveWeaponsCT; // 0x128 - 0x12C
   int32_t m_iNumGunGameProgressiveWeaponsT; // 0x12C - 0x130
   int32_t m_iSpectatorSlotCount; // 0x130 - 0x134
   int32 m_GGProgressiveWeaponOrderCT[60]; // 0x134 - 0x224
   int32 m_GGProgressiveWeaponOrderT[60]; // 0x224 - 0x314
   int32 m_GGProgressiveWeaponKillUpgradeOrderCT[60]; // 0x314 - 0x404
   int32 m_GGProgressiveWeaponKillUpgradeOrderT[60]; // 0x404 - 0x4F4
   int32_t m_MatchDevice; // 0x4F4 - 0x4F8
   bool m_bHasMatchStarted; // 0x4F8 - 0x4F9
   unsigned char pad_4F9[0x3] // 0x4F9 - 0x4FC
   float m_flDMBonusStartTime; // 0x4FC - 0x500
   float m_flDMBonusTimeLength; // 0x500 - 0x504
   uint16_t m_unDMBonusWeaponLoadoutSlot; // 0x504 - 0x506
   bool m_bDMBonusActive; // 0x506 - 0x507
   unsigned char pad_507[0x1] // 0x507 - 0x508
   int32_t m_nNextMapInMapgroup; // 0x508 - 0x50C
   char m_szTournamentEventName[512]; // 0x50C - 0x70C
   char m_szTournamentEventStage[512]; // 0x70C - 0x90C
   char m_szMatchStatTxt[512]; // 0x90C - 0xB0C
   char m_szTournamentPredictionsTxt[512]; // 0xB0C - 0xD0C
   int32_t m_nTournamentPredictionsPct; // 0xD0C - 0xD10
   GameTime_t m_flCMMItemDropRevealStartTime; // 0xD10 - 0xD14
   GameTime_t m_flCMMItemDropRevealEndTime; // 0xD14 - 0xD18
   bool m_bIsDroppingItems; // 0xD18 - 0xD19
   bool m_bIsQuestEligible; // 0xD19 - 0xD1A
   unsigned char pad_D1A[0x2] // 0xD1A - 0xD1C
   int32_t m_nGuardianModeWaveNumber; // 0xD1C - 0xD20
   int32_t m_nGuardianModeSpecialKillsRemaining; // 0xD20 - 0xD24
   int32_t m_nGuardianModeSpecialWeaponNeeded; // 0xD24 - 0xD28
   int32_t m_nGuardianGrenadesToGiveBots; // 0xD28 - 0xD2C
   int32_t m_nNumHeaviesToSpawn; // 0xD2C - 0xD30
   uint32_t m_numGlobalGiftsGiven; // 0xD30 - 0xD34
   uint32_t m_numGlobalGifters; // 0xD34 - 0xD38
   uint32_t m_numGlobalGiftsPeriodSeconds; // 0xD38 - 0xD3C
   uint32 m_arrFeaturedGiftersAccounts[4]; // 0xD3C - 0xD4C
   uint32 m_arrFeaturedGiftersGifts[4]; // 0xD4C - 0xD5C
   uint16 m_arrProhibitedItemIndices[100]; // 0xD5C - 0xE24
   uint32 m_arrTournamentActiveCasterAccounts[4]; // 0xE24 - 0xE34
   int32_t m_numBestOfMaps; // 0xE34 - 0xE38
   int32_t m_nHalloweenMaskListSeed; // 0xE38 - 0xE3C
   bool m_bBombDropped; // 0xE3C - 0xE3D
   bool m_bBombPlanted; // 0xE3D - 0xE3E
   unsigned char pad_E3E[0x2] // 0xE3E - 0xE40
   int32_t m_iRoundWinStatus; // 0xE40 - 0xE44
   int32_t m_eRoundWinReason; // 0xE44 - 0xE48
   bool m_bTCantBuy; // 0xE48 - 0xE49
   bool m_bCTCantBuy; // 0xE49 - 0xE4A
   unsigned char pad_E4A[0x2] // 0xE4A - 0xE4C
   GameTime_t m_flGuardianBuyUntilTime; // 0xE4C - 0xE50
   int32 m_iMatchStats_RoundResults[30]; // 0xE50 - 0xEC8
   int32 m_iMatchStats_PlayersAlive_CT[30]; // 0xEC8 - 0xF40
   int32 m_iMatchStats_PlayersAlive_T[30]; // 0xF40 - 0xFB8
   float32 m_TeamRespawnWaveTimes[32]; // 0xFB8 - 0x1038
   GameTime_t m_flNextRespawnWave[32]; // 0x1038 - 0x10B8
   int32_t m_nServerQuestID; // 0x10B8 - 0x10BC
   bool m_bDontIncrementCoopWave; // 0x10BC - 0x10BD
   bool m_bSpawnedTerrorHuntHeavy; // 0x10BD - 0x10BE
   unsigned char pad_10BE[0x2] // 0x10BE - 0x10C0
   int32 m_nEndMatchMapGroupVoteTypes[10]; // 0x10C0 - 0x10E8
   int32 m_nEndMatchMapGroupVoteOptions[10]; // 0x10E8 - 0x1110
   int32_t m_nEndMatchMapVoteWinner; // 0x1110 - 0x1114
   int32_t m_iNumConsecutiveCTLoses; // 0x1114 - 0x1118
   int32_t m_iNumConsecutiveTerroristLoses; // 0x1118 - 0x111C
   unsigned char pad_111C[0x1C] // 0x111C - 0x1138
   bool m_bHasHostageBeenTouched; // 0x1138 - 0x1139
   unsigned char pad_1139[0x3] // 0x1139 - 0x113C
   GameTime_t m_flIntermissionStartTime; // 0x113C - 0x1140
   GameTime_t m_flIntermissionEndTime; // 0x1140 - 0x1144
   bool m_bLevelInitialized; // 0x1144 - 0x1145
   unsigned char pad_1145[0x3] // 0x1145 - 0x1148
   int32_t m_iTotalRoundsPlayed; // 0x1148 - 0x114C
   int32_t m_iUnBalancedRounds; // 0x114C - 0x1150
   bool m_endMatchOnRoundReset; // 0x1150 - 0x1151
   bool m_endMatchOnThink; // 0x1151 - 0x1152
   unsigned char pad_1152[0x2] // 0x1152 - 0x1154
   int32_t m_iFreezeTime; // 0x1154 - 0x1158
   int32_t m_iNumTerrorist; // 0x1158 - 0x115C
   int32_t m_iNumCT; // 0x115C - 0x1160
   int32_t m_iNumSpawnableTerrorist; // 0x1160 - 0x1164
   int32_t m_iNumSpawnableCT; // 0x1164 - 0x1168
   CUtlVector< int32 > m_arrSelectedHostageSpawnIndices; // 0x1168 - 0x1180
   bool m_bFirstConnected; // 0x1180 - 0x1181
   bool m_bCompleteReset; // 0x1181 - 0x1182
   bool m_bPickNewTeamsOnReset; // 0x1182 - 0x1183
   bool m_bScrambleTeamsOnRestart; // 0x1183 - 0x1184
   bool m_bSwapTeamsOnRestart; // 0x1184 - 0x1185
   unsigned char pad_1185[0xB] // 0x1185 - 0x1190
   CUtlVector< int32 > m_nEndMatchTiedVotes; // 0x1190 - 0x11A8
   unsigned char pad_11A8[0x4] // 0x11A8 - 0x11AC
   bool m_bNeedToAskPlayersForContinueVote; // 0x11AC - 0x11AD
   unsigned char pad_11AD[0x3] // 0x11AD - 0x11B0
   uint32_t m_numQueuedMatchmakingAccounts; // 0x11B0 - 0x11B4
   unsigned char pad_11B4[0x4] // 0x11B4 - 0x11B8
   char* m_pQueuedMatchmakingReservationString; // 0x11B8 - 0x11C0
   uint32_t m_numTotalTournamentDrops; // 0x11C0 - 0x11C4
   uint32_t m_numSpectatorsCountMax; // 0x11C4 - 0x11C8
   uint32_t m_numSpectatorsCountMaxTV; // 0x11C8 - 0x11CC
   uint32_t m_numSpectatorsCountMaxLnk; // 0x11CC - 0x11D0
   unsigned char pad_11D0[0x8] // 0x11D0 - 0x11D8
   bool m_bForceTeamChangeSilent; // 0x11D8 - 0x11D9
   bool m_bLoadingRoundBackupData; // 0x11D9 - 0x11DA
   unsigned char pad_11DA[0x36] // 0x11DA - 0x1210
   int32_t m_nMatchInfoShowType; // 0x1210 - 0x1214
   float m_flMatchInfoDecidedTime; // 0x1214 - 0x1218
   unsigned char pad_1218[0x18] // 0x1218 - 0x1230
   float m_flCoopRespawnAndHealTime; // 0x1230 - 0x1234
   int32_t m_coopBonusCoinsFound; // 0x1234 - 0x1238
   bool m_coopBonusPistolsOnly; // 0x1238 - 0x1239
   bool m_coopPlayersInDeploymentZone; // 0x1239 - 0x123A
   bool m_coopMissionDeadPlayerRespawnEnabled; // 0x123A - 0x123B
   unsigned char pad_123B[0x1] // 0x123B - 0x123C
   int32_t mTeamDMLastWinningTeamNumber; // 0x123C - 0x1240
   float mTeamDMLastThinkTime; // 0x1240 - 0x1244
   float m_flTeamDMLastAnnouncementTime; // 0x1244 - 0x1248
   int32_t m_iAccountTerrorist; // 0x1248 - 0x124C
   int32_t m_iAccountCT; // 0x124C - 0x1250
   int32_t m_iSpawnPointCount_Terrorist; // 0x1250 - 0x1254
   int32_t m_iSpawnPointCount_CT; // 0x1254 - 0x1258
   int32_t m_iMaxNumTerrorists; // 0x1258 - 0x125C
   int32_t m_iMaxNumCTs; // 0x125C - 0x1260
   int32_t m_iLoserBonus; // 0x1260 - 0x1264
   int32_t m_iLoserBonusMostRecentTeam; // 0x1264 - 0x1268
   float m_tmNextPeriodicThink; // 0x1268 - 0x126C
   bool m_bVoiceWonMatchBragFired; // 0x126C - 0x126D
   unsigned char pad_126D[0x3] // 0x126D - 0x1270
   float m_fWarmupNextChatNoticeTime; // 0x1270 - 0x1274
   unsigned char pad_1274[0x4] // 0x1274 - 0x1278
   int32_t m_iHostagesRescued; // 0x1278 - 0x127C
   int32_t m_iHostagesTouched; // 0x127C - 0x1280
   float m_flNextHostageAnnouncement; // 0x1280 - 0x1284
   bool m_bNoTerroristsKilled; // 0x1284 - 0x1285
   bool m_bNoCTsKilled; // 0x1285 - 0x1286
   bool m_bNoEnemiesKilled; // 0x1286 - 0x1287
   bool m_bCanDonateWeapons; // 0x1287 - 0x1288
   unsigned char pad_1288[0x4] // 0x1288 - 0x128C
   float m_firstKillTime; // 0x128C - 0x1290
   unsigned char pad_1290[0x4] // 0x1290 - 0x1294
   float m_firstBloodTime; // 0x1294 - 0x1298
   unsigned char pad_1298[0x18] // 0x1298 - 0x12B0
   bool m_hostageWasInjured; // 0x12B0 - 0x12B1
   bool m_hostageWasKilled; // 0x12B1 - 0x12B2
   unsigned char pad_12B2[0xE] // 0x12B2 - 0x12C0
   bool m_bVoteCalled; // 0x12C0 - 0x12C1
   bool m_bServerVoteOnReset; // 0x12C1 - 0x12C2
   unsigned char pad_12C2[0x2] // 0x12C2 - 0x12C4
   float m_flVoteCheckThrottle; // 0x12C4 - 0x12C8
   bool m_bBuyTimeEnded; // 0x12C8 - 0x12C9
   unsigned char pad_12C9[0x3] // 0x12C9 - 0x12CC
   int32_t m_nLastFreezeEndBeep; // 0x12CC - 0x12D0
   int32_t m_iHaveEscaped; // 0x12D0 - 0x12D4
   bool m_bMapHasEscapeZone; // 0x12D4 - 0x12D5
   unsigned char pad_12D5[0x3] // 0x12D5 - 0x12D8
   int32_t m_iNumEscapers; // 0x12D8 - 0x12DC
   int32_t m_iNumEscapeRounds; // 0x12DC - 0x12E0
   bool m_bTargetBombed; // 0x12E0 - 0x12E1
   bool m_bBombDefused; // 0x12E1 - 0x12E2
   bool m_bMapHasBombZone; // 0x12E2 - 0x12E3
   bool m_bGunGameRespawnWithBomb; // 0x12E3 - 0x12E4
   float m_fGunGameBombRespawnTimer; // 0x12E4 - 0x12E8
   unsigned char pad_12E8[0x1C] // 0x12E8 - 0x1304
   Vector m_vecMainCTSpawnPos; // 0x1304 - 0x1310
   CUtlVector< SpawnPoint* > m_CTSpawnPointsMasterList; // 0x1310 - 0x1328
   CUtlVector< SpawnPoint* > m_TerroristSpawnPointsMasterList; // 0x1328 - 0x1340
   int32_t m_iNextCTSpawnPoint; // 0x1340 - 0x1344
   int32_t m_iNextTerroristSpawnPoint; // 0x1344 - 0x1348
   CUtlVector< SpawnPoint* > m_CTSpawnPoints; // 0x1348 - 0x1360
   CUtlVector< SpawnPoint* > m_TerroristSpawnPoints; // 0x1360 - 0x1378
   bool m_bIsUnreservedGameServer; // 0x1378 - 0x1379
   unsigned char pad_1379[0x3] // 0x1379 - 0x137C
   float m_fAutobalanceDisplayTime; // 0x137C - 0x1380
   unsigned char pad_1380[0x268] // 0x1380 - 0x15E8
   bool m_bAllowWeaponSwitch; // 0x15E8 - 0x15E9
   bool m_bRoundTimeWarningTriggered; // 0x15E9 - 0x15EA
   unsigned char pad_15EA[0x2] // 0x15EA - 0x15EC
   GameTime_t m_phaseChangeAnnouncementTime; // 0x15EC - 0x15F0
   float m_fNextUpdateTeamClanNamesTime; // 0x15F0 - 0x15F4
   GameTime_t m_flLastThinkTime; // 0x15F4 - 0x15F8
   float m_fAccumulatedRoundOffDamage; // 0x15F8 - 0x15FC
   int32_t m_nShorthandedBonusLastEvalRound; // 0x15FC - 0x1600
   unsigned char pad_1600[0x260] // 0x1600 - 0x1860
   bool m_bHasTriggeredRoundStartMusic; // 0x1860 - 0x1861
   bool m_bHasTriggeredCoopSpawnReset; // 0x1861 - 0x1862
   bool m_bSwitchingTeamsAtRoundReset; // 0x1862 - 0x1863
   unsigned char pad_1863[0x1] // 0x1863 - 0x1864
   int32_t m_iMaxGunGameProgressiveWeaponIndex; // 0x1864 - 0x1868
   unsigned char pad_1868[0x18] // 0x1868 - 0x1880
   CSurvivalGameRules m_SurvivalRules; // 0x1880 - 0x3518
   KeyValues3 m_BtGlobalBlackboard; // 0x3518 - 0x3528
   unsigned char pad_3528[0x58] // 0x3528 - 0x3580
   CHandle< CBaseEntity > m_hPlayerResource; // 0x3580 - 0x3584
   unsigned char pad_3584[0x4] // 0x3584 - 0x3588
   CRetakeGameRules m_RetakeRules; // 0x3588 - 0x3720
   unsigned char pad_3720[0x4C] // 0x3720 - 0x376C
   int32_t m_GuardianBotSkillLevelMax; // 0x376C - 0x3770
   int32_t m_GuardianBotSkillLevelMin; // 0x3770 - 0x3774
   unsigned char pad_3774[0x4] // 0x3774 - 0x3778
   CUtlVector< int32 > m_arrTeamUniqueKillWeaponsMatch[4]; // 0x3778 - 0x37D8
   bool m_bTeamLastKillUsedUniqueWeaponMatch[4]; // 0x37D8 - 0x37DC
   unsigned char pad_37DC[0x24] // 0x37DC - 0x3800
   uint8_t m_nMatchEndCount; // 0x3800 - 0x3801
   bool m_bTeamIntroPeriod; // 0x3801 - 0x3802
   unsigned char pad_3802[0x2] // 0x3802 - 0x3804
   GameTime_t m_fTeamIntroPeriodEnd; // 0x3804 - 0x3808

}; // size - 0x3808


class CCSGameRulesProxy : public CGameRulesProxy
{
public:

   CCSGameRules* m_pGameRules; // 0x4A0 - 0x4A8

}; // size - 0x4A8


class CCSObserverPawn : public CCSPlayerPawnBase
{
public:


}; // size - 0x1598


class CCSPlace : public CServerOnlyModelEntity
{
public:

   CUtlSymbolLarge m_name; // 0x6F8 - 0x700

}; // size - 0x700


class CCSPlayerController : public CBasePlayerController
{
public:

   CCSPlayerController_InGameMoneyServices* m_pInGameMoneyServices; // 0x678 - 0x680
   CCSPlayerController_InventoryServices* m_pInventoryServices; // 0x680 - 0x688
   CCSPlayerController_ActionTrackingServices* m_pActionTrackingServices; // 0x688 - 0x690
   CCSPlayerController_DamageServices* m_pDamageServices; // 0x690 - 0x698
   uint32_t m_iPing; // 0x698 - 0x69C
   bool m_bHasCommunicationAbuseMute; // 0x69C - 0x69D
   unsigned char pad_69D[0x3] // 0x69D - 0x6A0
   CUtlSymbolLarge m_szCrosshairCodes; // 0x6A0 - 0x6A8
   uint8_t m_iPendingTeamNum; // 0x6A8 - 0x6A9
   unsigned char pad_6A9[0x3] // 0x6A9 - 0x6AC
   GameTime_t m_flForceTeamTime; // 0x6AC - 0x6B0
   int32_t m_iCompTeammateColor; // 0x6B0 - 0x6B4
   bool m_bEverPlayedOnTeam; // 0x6B4 - 0x6B5
   bool m_bAttemptedToGetColor; // 0x6B5 - 0x6B6
   unsigned char pad_6B6[0x2] // 0x6B6 - 0x6B8
   int32_t m_iTeammatePreferredColor; // 0x6B8 - 0x6BC
   bool m_bTeamChanged; // 0x6BC - 0x6BD
   bool m_bInSwitchTeam; // 0x6BD - 0x6BE
   bool m_bHasSeenJoinGame; // 0x6BE - 0x6BF
   bool m_bJustBecameSpectator; // 0x6BF - 0x6C0
   bool m_bSwitchTeamsOnNextRoundReset; // 0x6C0 - 0x6C1
   unsigned char pad_6C1[0x7] // 0x6C1 - 0x6C8
   CUtlSymbolLarge m_szClan; // 0x6C8 - 0x6D0
   char m_szClanName[32]; // 0x6D0 - 0x6F0
   int32_t m_iCoachingTeam; // 0x6F0 - 0x6F4
   unsigned char pad_6F4[0x4] // 0x6F4 - 0x6F8
   uint64_t m_nPlayerDominated; // 0x6F8 - 0x700
   uint64_t m_nPlayerDominatingMe; // 0x700 - 0x708
   int32_t m_iCompetitiveRanking; // 0x708 - 0x70C
   int32_t m_iCompetitiveWins; // 0x70C - 0x710
   int8_t m_iCompetitiveRankType; // 0x710 - 0x711
   unsigned char pad_711[0x3] // 0x711 - 0x714
   int32_t m_nEndMatchNextMapVote; // 0x714 - 0x718
   uint16_t m_unActiveQuestId; // 0x718 - 0x71A
   unsigned char pad_71A[0x2] // 0x71A - 0x71C
   QuestProgress::Reason m_nQuestProgressReason; // 0x71C - 0x720
   uint32_t m_unPlayerTvControlFlags; // 0x720 - 0x724
   unsigned char pad_724[0x6C] // 0x724 - 0x790
   int32_t m_iDraftIndex; // 0x790 - 0x794
   uint32_t m_msQueuedModeDisconnectionTimestamp; // 0x794 - 0x798
   uint32_t m_uiAbandonRecordedReason; // 0x798 - 0x79C
   bool m_bEverFullyConnected; // 0x79C - 0x79D
   bool m_bAbandonAllowsSurrender; // 0x79D - 0x79E
   bool m_bDisconnection1MinWarningPrinted; // 0x79E - 0x79F
   bool m_bScoreReported; // 0x79F - 0x7A0
   int32_t m_nDisconnectionTick; // 0x7A0 - 0x7A4
   unsigned char pad_7A4[0xC] // 0x7A4 - 0x7B0
   bool m_bControllingBot; // 0x7B0 - 0x7B1
   bool m_bHasControlledBotThisRound; // 0x7B1 - 0x7B2
   bool m_bHasBeenControlledByPlayerThisRound; // 0x7B2 - 0x7B3
   unsigned char pad_7B3[0x1] // 0x7B3 - 0x7B4
   int32_t m_nBotsControlledThisRound; // 0x7B4 - 0x7B8
   bool m_bCanControlObservedBot; // 0x7B8 - 0x7B9
   unsigned char pad_7B9[0x3] // 0x7B9 - 0x7BC
   CHandle< CCSPlayerPawn > m_hPlayerPawn; // 0x7BC - 0x7C0
   CHandle< CCSObserverPawn > m_hObserverPawn; // 0x7C0 - 0x7C4
   int32_t m_DesiredObserverMode; // 0x7C4 - 0x7C8
   CEntityHandle m_hDesiredObserverTarget; // 0x7C8 - 0x7CC
   bool m_bPawnIsAlive; // 0x7CC - 0x7CD
   unsigned char pad_7CD[0x3] // 0x7CD - 0x7D0
   uint32_t m_iPawnHealth; // 0x7D0 - 0x7D4
   int32_t m_iPawnArmor; // 0x7D4 - 0x7D8
   bool m_bPawnHasDefuser; // 0x7D8 - 0x7D9
   bool m_bPawnHasHelmet; // 0x7D9 - 0x7DA
   uint16_t m_nPawnCharacterDefIndex; // 0x7DA - 0x7DC
   int32_t m_iPawnLifetimeStart; // 0x7DC - 0x7E0
   int32_t m_iPawnLifetimeEnd; // 0x7E0 - 0x7E4
   int32_t m_iPawnGunGameLevel; // 0x7E4 - 0x7E8
   int32_t m_iPawnBotDifficulty; // 0x7E8 - 0x7EC
   CHandle< CCSPlayerController > m_hOriginalControllerOfCurrentPawn; // 0x7EC - 0x7F0
   int32_t m_iScore; // 0x7F0 - 0x7F4
   int32_t m_iRoundScore; // 0x7F4 - 0x7F8
   CNetworkUtlVectorBase< EKillTypes_t > m_vecKills; // 0x7F8 - 0x810
   int32_t m_iMVPs; // 0x810 - 0x814
   int32_t m_nUpdateCounter; // 0x814 - 0x818
   unsigned char pad_818[0xF0A0] // 0x818 - 0xF8B8
   IntervalTimer m_lastHeldVoteTimer; // 0xF8B8 - 0xF8C8
   unsigned char pad_F8C8[0x8] // 0xF8C8 - 0xF8D0
   bool m_bShowHints; // 0xF8D0 - 0xF8D1
   unsigned char pad_F8D1[0x3] // 0xF8D1 - 0xF8D4
   int32_t m_iNextTimeCheck; // 0xF8D4 - 0xF8D8

}; // size - 0xF8D8


class CCSPlayerController : public CBasePlayerController
{
public:

   CCSPlayerController_InGameMoneyServices* m_pInGameMoneyServices; // 0x6B0 - 0x6B8
   CCSPlayerController_InventoryServices* m_pInventoryServices; // 0x6B8 - 0x6C0
   CCSPlayerController_ActionTrackingServices* m_pActionTrackingServices; // 0x6C0 - 0x6C8
   CCSPlayerController_DamageServices* m_pDamageServices; // 0x6C8 - 0x6D0
   uint32_t m_iPing; // 0x6D0 - 0x6D4
   bool m_bHasCommunicationAbuseMute; // 0x6D4 - 0x6D5
   unsigned char pad_6D5[0x3] // 0x6D5 - 0x6D8
   CUtlSymbolLarge m_szCrosshairCodes; // 0x6D8 - 0x6E0
   uint8_t m_iPendingTeamNum; // 0x6E0 - 0x6E1
   unsigned char pad_6E1[0x3] // 0x6E1 - 0x6E4
   GameTime_t m_flForceTeamTime; // 0x6E4 - 0x6E8
   int32_t m_iCompTeammateColor; // 0x6E8 - 0x6EC
   bool m_bEverPlayedOnTeam; // 0x6EC - 0x6ED
   unsigned char pad_6ED[0x3] // 0x6ED - 0x6F0
   GameTime_t m_flPreviousForceJoinTeamTime; // 0x6F0 - 0x6F4
   unsigned char pad_6F4[0x4] // 0x6F4 - 0x6F8
   CUtlSymbolLarge m_szClan; // 0x6F8 - 0x700
   CUtlString m_sSanitizedPlayerName; // 0x700 - 0x708
   int32_t m_iCoachingTeam; // 0x708 - 0x70C
   unsigned char pad_70C[0x4] // 0x70C - 0x710
   uint64_t m_nPlayerDominated; // 0x710 - 0x718
   uint64_t m_nPlayerDominatingMe; // 0x718 - 0x720
   int32_t m_iCompetitiveRanking; // 0x720 - 0x724
   int32_t m_iCompetitiveWins; // 0x724 - 0x728
   int8_t m_iCompetitiveRankType; // 0x728 - 0x729
   unsigned char pad_729[0x3] // 0x729 - 0x72C
   int32_t m_nEndMatchNextMapVote; // 0x72C - 0x730
   uint16_t m_unActiveQuestId; // 0x730 - 0x732
   unsigned char pad_732[0x2] // 0x732 - 0x734
   QuestProgress::Reason m_nQuestProgressReason; // 0x734 - 0x738
   uint32_t m_unPlayerTvControlFlags; // 0x738 - 0x73C
   unsigned char pad_73C[0x6C] // 0x73C - 0x7A8
   int32_t m_iDraftIndex; // 0x7A8 - 0x7AC
   uint32_t m_msQueuedModeDisconnectionTimestamp; // 0x7AC - 0x7B0
   uint32_t m_uiAbandonRecordedReason; // 0x7B0 - 0x7B4
   bool m_bEverFullyConnected; // 0x7B4 - 0x7B5
   bool m_bAbandonAllowsSurrender; // 0x7B5 - 0x7B6
   bool m_bDisconnection1MinWarningPrinted; // 0x7B6 - 0x7B7
   bool m_bScoreReported; // 0x7B7 - 0x7B8
   int32_t m_nDisconnectionTick; // 0x7B8 - 0x7BC
   unsigned char pad_7BC[0xC] // 0x7BC - 0x7C8
   bool m_bControllingBot; // 0x7C8 - 0x7C9
   bool m_bHasControlledBotThisRound; // 0x7C9 - 0x7CA
   bool m_bHasBeenControlledByPlayerThisRound; // 0x7CA - 0x7CB
   unsigned char pad_7CB[0x1] // 0x7CB - 0x7CC
   int32_t m_nBotsControlledThisRound; // 0x7CC - 0x7D0
   bool m_bCanControlObservedBot; // 0x7D0 - 0x7D1
   unsigned char pad_7D1[0x3] // 0x7D1 - 0x7D4
   CHandle< C_CSPlayerPawn > m_hPlayerPawn; // 0x7D4 - 0x7D8
   CHandle< C_CSObserverPawn > m_hObserverPawn; // 0x7D8 - 0x7DC
   bool m_bPawnIsAlive; // 0x7DC - 0x7DD
   unsigned char pad_7DD[0x3] // 0x7DD - 0x7E0
   uint32_t m_iPawnHealth; // 0x7E0 - 0x7E4
   int32_t m_iPawnArmor; // 0x7E4 - 0x7E8
   bool m_bPawnHasDefuser; // 0x7E8 - 0x7E9
   bool m_bPawnHasHelmet; // 0x7E9 - 0x7EA
   uint16_t m_nPawnCharacterDefIndex; // 0x7EA - 0x7EC
   int32_t m_iPawnLifetimeStart; // 0x7EC - 0x7F0
   int32_t m_iPawnLifetimeEnd; // 0x7F0 - 0x7F4
   int32_t m_iPawnGunGameLevel; // 0x7F4 - 0x7F8
   int32_t m_iPawnBotDifficulty; // 0x7F8 - 0x7FC
   CHandle< CCSPlayerController > m_hOriginalControllerOfCurrentPawn; // 0x7FC - 0x800
   int32_t m_iScore; // 0x800 - 0x804
   unsigned char pad_804[0x4] // 0x804 - 0x808
   C_NetworkUtlVectorBase< EKillTypes_t > m_vecKills; // 0x808 - 0x820
   int32_t m_iMVPs; // 0x820 - 0x824
   bool m_bIsPlayerNameDirty; // 0x824 - 0x825

}; // size - 0x828


class CCSPlayerController_ActionTrackingServices : public CPlayerControllerComponent
{
public:

   CUtlVectorEmbeddedNetworkVar< CSPerRoundStats_t > m_perRoundStats; // 0x40 - 0x90
   CSMatchStats_t m_matchStats; // 0x90 - 0x148
   int32_t m_iNumRoundKills; // 0x148 - 0x14C
   int32_t m_iNumRoundKillsHeadshots; // 0x14C - 0x150

}; // size - 0x200


class CCSPlayerController_ActionTrackingServices : public CPlayerControllerComponent
{
public:

   C_UtlVectorEmbeddedNetworkVar< CSPerRoundStats_t > m_perRoundStats; // 0x40 - 0x90
   CSMatchStats_t m_matchStats; // 0x90 - 0x108
   int32_t m_iNumRoundKills; // 0x108 - 0x10C
   int32_t m_iNumRoundKillsHeadshots; // 0x10C - 0x110

}; // size - 0x110


class CCSPlayerController_DamageServices : public CPlayerControllerComponent
{
public:

   int32_t m_nSendUpdate; // 0x40 - 0x44
   unsigned char pad_44[0x4] // 0x44 - 0x48
   CUtlVectorEmbeddedNetworkVar< CDamageRecord > m_DamageList; // 0x48 - 0x98

}; // size - 0x98


class CCSPlayerController_DamageServices : public CPlayerControllerComponent
{
public:

   int32_t m_nSendUpdate; // 0x40 - 0x44
   int32_t m_nCachedSendUpdate; // 0x44 - 0x48
   C_UtlVectorEmbeddedNetworkVar< CDamageRecord > m_DamageList; // 0x48 - 0x98

}; // size - 0x98


class CCSPlayerController_InGameMoneyServices : public CPlayerControllerComponent
{
public:

   int32_t m_iAccount; // 0x40 - 0x44
   int32_t m_iStartAccount; // 0x44 - 0x48
   int32_t m_iTotalCashSpent; // 0x48 - 0x4C
   int32_t m_iCashSpentThisRound; // 0x4C - 0x50
   int32_t m_nPreviousAccount; // 0x50 - 0x54

}; // size - 0x58


class CCSPlayerController_InGameMoneyServices : public CPlayerControllerComponent
{
public:

   bool m_bReceivesMoneyNextRound; // 0x40 - 0x41
   unsigned char pad_41[0x3] // 0x41 - 0x44
   int32_t m_iAccountMoneyEarnedForNextRound; // 0x44 - 0x48
   int32_t m_iAccount; // 0x48 - 0x4C
   int32_t m_iStartAccount; // 0x4C - 0x50
   int32_t m_iTotalCashSpent; // 0x50 - 0x54
   int32_t m_iCashSpentThisRound; // 0x54 - 0x58

}; // size - 0x58


class CCSPlayerController_InventoryServices : public CPlayerControllerComponent
{
public:

   uint16_t m_unMusicID; // 0x40 - 0x42
   unsigned char pad_42[0x2] // 0x42 - 0x44
   MedalRank_t m_rank[6]; // 0x44 - 0x5C
   int32_t m_nPersonaDataPublicLevel; // 0x5C - 0x60
   int32_t m_nPersonaDataPublicCommendsLeader; // 0x60 - 0x64
   int32_t m_nPersonaDataPublicCommendsTeacher; // 0x64 - 0x68
   int32_t m_nPersonaDataPublicCommendsFriendly; // 0x68 - 0x6C
   unsigned char pad_6C[0x4] // 0x6C - 0x70
   C_UtlVectorEmbeddedNetworkVar< C_EconItemView > m_vecTerroristLoadoutCache; // 0x70 - 0xC0
   C_UtlVectorEmbeddedNetworkVar< C_EconItemView > m_vecCounterTerroristLoadoutCache; // 0xC0 - 0x110

}; // size - 0x110


class CCSPlayerController_InventoryServices : public CPlayerControllerComponent
{
public:

   uint16_t m_unMusicID; // 0x40 - 0x42
   unsigned char pad_42[0x2] // 0x42 - 0x44
   MedalRank_t m_rank[6]; // 0x44 - 0x5C
   int32_t m_nPersonaDataPublicLevel; // 0x5C - 0x60
   int32_t m_nPersonaDataPublicCommendsLeader; // 0x60 - 0x64
   int32_t m_nPersonaDataPublicCommendsTeacher; // 0x64 - 0x68
   int32_t m_nPersonaDataPublicCommendsFriendly; // 0x68 - 0x6C
   unsigned char pad_6C[0x7FC] // 0x6C - 0x868
   uint32 m_unEquippedPlayerSprayIDs[1]; // 0x868 - 0x86C
   unsigned char pad_86C[0x4] // 0x86C - 0x870
   CUtlVectorEmbeddedNetworkVar< CEconItemView > m_vecTerroristLoadoutCache; // 0x870 - 0x8C0
   CUtlVectorEmbeddedNetworkVar< CEconItemView > m_vecCounterTerroristLoadoutCache; // 0x8C0 - 0x910

}; // size - 0x910


class CCSPlayerPawn : public CCSPlayerPawnBase
{
public:

   CCSPlayer_ParachuteServices* m_pParachuteServices; // 0x1570 - 0x1578
   CCSPlayer_BulletServices* m_pBulletServices; // 0x1578 - 0x1580
   CCSPlayer_HostageServices* m_pHostageServices; // 0x1580 - 0x1588
   CCSPlayer_BuyServices* m_pBuyServices; // 0x1588 - 0x1590
   CCSPlayer_PingServices* m_pPingServices; // 0x1590 - 0x1598
   CCSPlayer_RadioServices* m_pRadioServices; // 0x1598 - 0x15A0
   CCSPlayer_DamageReactServices* m_pDamageReactServices; // 0x15A0 - 0x15A8
   unsigned char pad_15A8[0xC8] // 0x15A8 - 0x1670
   int32_t m_iRetakesOffering; // 0x1670 - 0x1674
   int32_t m_iRetakesOfferingCard; // 0x1674 - 0x1678
   bool m_bRetakesHasDefuseKit; // 0x1678 - 0x1679
   bool m_bRetakesMVPLastRound; // 0x1679 - 0x167A
   unsigned char pad_167A[0x2] // 0x167A - 0x167C
   int32_t m_iRetakesMVPBoostItem; // 0x167C - 0x1680
   loadout_positions_t m_RetakesMVPBoostExtraUtility; // 0x1680 - 0x1684
   bool m_bIsBuyMenuOpen; // 0x1684 - 0x1685
   unsigned char pad_1685[0x15B] // 0x1685 - 0x17E0
   CTransform m_xLastHeadBoneTransform; // 0x17E0 - 0x1800
   bool m_bLastHeadBoneTransformIsValid; // 0x1800 - 0x1801
   unsigned char pad_1801[0x3] // 0x1801 - 0x1804
   int32_t m_iPlayerLocked; // 0x1804 - 0x1808
   unsigned char pad_1808[0x4] // 0x1808 - 0x180C
   float m_flNextSprayDecalTime; // 0x180C - 0x1810
   unsigned char pad_1810[0x4] // 0x1810 - 0x1814
   int32_t m_nRagdollDamageBone; // 0x1814 - 0x1818
   Vector m_vRagdollDamageForce; // 0x1818 - 0x1824
   Vector m_vRagdollDamagePosition; // 0x1824 - 0x1830
   char m_szRagdollDamageWeaponName[64]; // 0x1830 - 0x1870
   bool m_bRagdollDamageHeadshot; // 0x1870 - 0x1871
   unsigned char pad_1871[0x7] // 0x1871 - 0x1878
   CEconItemView m_EconGloves; // 0x1878 - 0x1AF0
   QAngle m_qDeathEyeAngles; // 0x1AF0 - 0x1AFC

}; // size - 0x1B00


class CCSPlayerResource : public CBaseEntity
{
public:

   bool m_bHostageAlive[12]; // 0x4A0 - 0x4AC
   bool m_isHostageFollowingSomeone[12]; // 0x4AC - 0x4B8
   CEntityIndex m_iHostageEntityIDs[12]; // 0x4B8 - 0x4E8
   Vector m_bombsiteCenterA; // 0x4E8 - 0x4F4
   Vector m_bombsiteCenterB; // 0x4F4 - 0x500
   int32 m_hostageRescueX[4]; // 0x500 - 0x510
   int32 m_hostageRescueY[4]; // 0x510 - 0x520
   int32 m_hostageRescueZ[4]; // 0x520 - 0x530
   bool m_bEndMatchNextMapAllVoted; // 0x530 - 0x531
   bool m_foundGoalPositions; // 0x531 - 0x532

}; // size - 0x538


class CCSPlayer_ActionTrackingServices : public CPlayerPawnComponent
{
public:

   bool m_bIsRescuing; // 0x40 - 0x41
   unsigned char pad_41[0x3] // 0x41 - 0x44
   int32 m_iWeaponPurchasesThisMatch[256]; // 0x44 - 0x444
   int32 m_iWeaponPurchasesThisRound[256]; // 0x444 - 0x844

}; // size - 0x848


class CCSPlayer_ActionTrackingServices : public CPlayerPawnComponent
{
public:

   CBasePlayerWeapon* m_lastWeaponBeforeC4AutoSwitch; // 0x230 - 0x238
   unsigned char pad_238[0x30] // 0x238 - 0x268
   bool m_bIsRescuing; // 0x268 - 0x269
   unsigned char pad_269[0x3] // 0x269 - 0x26C
   int32 m_iWeaponPurchasesThisMatch[256]; // 0x26C - 0x66C
   int32 m_iWeaponPurchasesThisRound[256]; // 0x66C - 0xA6C

}; // size - 0xA70


class CCSPlayer_BulletServices : public CPlayerPawnComponent
{
public:

   int32_t m_totalHitsOnServer; // 0x40 - 0x44

}; // size - 0x48


class CCSPlayer_BulletServices : public CPlayerPawnComponent
{
public:

   int32_t m_totalHitsOnServer; // 0x40 - 0x44

}; // size - 0x80


class CCSPlayer_BuyServices : public CPlayerPawnComponent
{
public:

   float m_flNextAutoBuyAmmoTime; // 0x40 - 0x44

}; // size - 0xC8


class CCSPlayer_CameraServices : public CPlayer_CameraServices
{
public:

   float m_flLastShotFOV; // 0x248 - 0x24C
   float m_flDeathCamTilt; // 0x24C - 0x250

}; // size - 0x250


class CCSPlayer_CameraServices : public CPlayer_CameraServices
{
public:

   CUtlVector< CHandle< CBaseEntity > > m_hTriggerFogList; // 0x188 - 0x1A0
   CHandle< CBaseEntity > m_hLastFogTrigger; // 0x1A0 - 0x1A4

}; // size - 0x1A8


class CCSPlayer_DamageReactServices : public CPlayerPawnComponent
{
public:


}; // size - 0x40


class CCSPlayer_GlowServices : public CPlayerPawnComponent
{
public:


}; // size - 0x70


class CCSPlayer_HostageServices : public CPlayerPawnComponent
{
public:

